{
  "FacilityID": 43688,
  "FacilityName": "Superior Fertilizer Company Inc.",
  "FacilityStr1": "202 2nd Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Crook",
  "FacilityState": "CO",
  "FacilityZipCode": "80726",
  "Facility4DigitZipExt": "0187",
  "FacilityCountyFIPS": "08075",
  "LEPC": "Logan County LEPC",
  "FacilityLatDecDegs": "40.435306",
  "FacilityLongDecDegs": "-103.581889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 98280894,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Robert J Kircher",
  "OperatorStr1": "202 2nd Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Crook",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80726",
  "OperatorZipCodeExt": "0187",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000129746",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-11-06 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-08-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-08-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-08-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-10-09 00:00:00",
  "DeRegistrationEffectiveDate": "2017-08-31 00:00:00",
  "AnniversaryDate": "2010-08-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 40.85779,
  "FRS_Long": -102.80083,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "1",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 62909,
      "AltID": null,
      "FacilityID": 43688,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 83210,
          "ProcessID": 62909,
          "ChemicalID": 56,
          "Quantity": 93600.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 64397,
          "ProcessID": 62909,
          "NAICSCode": "111998",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 23441,
              "Process_NAICS_ID": 64397,
              "SafetyReviewDate": "2004-04-20 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2004-03-01 00:00:00",
              "ChangeCompletionDate": "2004-06-01 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 1,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-04-20 00:00:00",
              "TrainingReviewDate": "2004-04-20 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Video, Speakers",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-04-20 00:00:00",
              "EquipmentInspectionDate": "2004-05-15 00:00:00",
              "EquipmentTested": "Nurse tanks, relief valves",
              "ComplianceAuditDate": "2004-04-20 00:00:00",
              "AuditCompletionDate": "2004-06-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2004-04-20 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 24534,
                  "PreventionProgram2ID": 23441,
                  "ProcessChemicalID": 83210
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 43688,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-03-01 00:00:00",
    "ERTrainingDate": "2004-04-20 00:00:00",
    "CoordinatingAgencyName": "Crook Fire Department",
    "CoordinatingAgencyPhone": "9708862100",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43688,
      "SummaryText": "Superior Fertilizer Company is a small independently owned company in NE Colorado.  Superior has been in business serving our area Farmers and Ranchers for the past 30 years.Anhydrous ammonia is one of the Agriculture fertilizers that we sell to our Agriculture customers ONLY.  With the increase of regulations and the rising cost of Anhydrous Superior has seen a 47% drop in sales in the last 5 years.  Even though we may not handle as many tons as we have in the past SAFETY is still our #1 issue with our employees and our community.  Superior is updating our Risk Management Plan as described in EPA's Chemical Accident Prevention regulations at 40 CFR Part 68.  Superior keeps at its location at 202 2nd Avenue, Crook, CO a 18,000 Gallon liquid cylinder tank for Anhydrous Ammonia.  The tank has a light reflective coating of paint.  The tank has the words \"Anhydrous Ammonia\" on both sides of the tank in lettering 4 inches high.  Also on the sides of the tank are \"Inhalation Hazard\" in 2 inch lettering.  All of the valves to this tank are fenced off and are also locked up at all times, unless it is in use.  Also there are signs on the fence that say \"Keep Out, Authorized Personnel Only\" and \"Dangerous, Eye Protection Must Be worn In The Area\".  Our Safety relief valve is covered at all times to protect it from the elements.  Superior installed Emergency Shut-Off valves on June 1, 2002.  The emergency Shut-Off valves are in compliance with the American National \"Standards Institute (ANSI), K61.1-1999, Safety Requirements for the Storage and Handling of Anhydrous Ammonia, Sections 5.10.8.1 and 5.10.8.2.  By installing the Emergency Shut-Off valve this addresses our biggest potential for human error or equipment malfunction that could cause an accidental release.  We are able to shut off the flow of Anhydrous from a remote location if we are unloading a railcar or loading a nurse tank.  Another safety precaution that Superior has is to not overfill nurse tanks.  We try to pu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43688,
      "SummaryText": "t an average of 80% per tank.  The State of Colorado Department of Agriculture passed Senate Bill 03-297 which amended the Anhydrous Ammonia Act that requires our plant to register and pay a fee for our large storage tank and our 31 nurse tanks that are due every July 1.  Our last Colorado State inspection was on March 3, 2004.  At this time the Colorado Department of Agriculture \"Division of Inspection and Consumer Services\" comes to our facility and the inspector checks the following: (1) Storage tank free of leaks (2) Bulk tank supports in good condition (no cracked or crumbled concrete) (3) Tank is painted white or light reflective paint and paint coating is in good condition (4) All valves and fittings are secure, free from leaks and in good conditions (5) Protective guards are in place and in good condition (6) Safety relief valves are free of debris with rain caps installed (7) All gauges-pressure and liquid level operative (8) Plant piping is the proper type (9) All pipe joints free of leaks (10) All piping is properly supported and guards in place where necessary (11) All pipes free of physical damage and rust and properly painted (12) All hoses (vapor-liquid) of ammonia type and free of damage or deteriration (13) Hoses suitable racked to prevent kinking (14) Hoses properly stored out of weather and sunlight in off-season (15) Yard free of weeds, trash and other unsafe conditions (16) Unused equipment stored out of the way (17) Facility protected against tampering (18) A minimum of 50 gal clean, fresh water or an emergency shower available (19) At least 2 sided of the storage tank has works \"Anhydrous Ammonia in 4\" letters (20) The bulk plant facility is equipped with the following emergency rescue and safety equipment (a) One pair of protective gloves (b) one pair of protective boots ? One full face mask with Anhydrous cartidges (d) one protective slicker and or protective pants and jacket (e) easily accessible shower and or at least 50 Gal of clean water"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43688,
      "SummaryText": " in an open top container (f) tight fitting goggles or a full face shield (21) Vapor valves properly painted or labled (a) vapor valves painted yellow (b) liquid valves painted red.  At any time you can get a hard copy of an Anhydrous Ammonia MSDS at our office from our most current supplier.  Also on file at the office is a detail procedure of unloading an Anhydrous Ammonia railcar and the loading of nurse tanks.  With safety our number 1 issue we keep these copies only in the office.  If at any times an employee or a First Responder needs the detail instructions they have to come to the office where they sign in to take a copy from our office and they are required to return the copy and sigh off.  Superior employees are not required to respond to an emergency.  They have been trained to call 911 immediately, notify the Emergency Coordinator go to the rendezvous point that Superior has asigned.  Crook's First Responder would be our local Volunteer Fire Department.  Our Crook Fire Department is a block away from our Anhydrous Ammonia Bulk Plant.  Many of our Volunteer Fireman are also our customers and have been to our facility many times and are very familiar with Anhydrous Ammonia and know the correct procedure with handling Anhydrous.  Respond time most likely would be less than 5 minutes.  The closest fire hydrant is 700 ft from our Anhydrous plant.  Superior Fertilizer holds annual rehearsals of our Emergency Action Plan to keep employees up on changes in our facility, policies and procedures.  We have one employee that is also on our Local Emergency Planning Commission which holds monthy meetings.  Superior takes the Risk Management plan very seriously.  On our yearly hazard review that the Gneral Manager does we have a Safety Meeting and we go over the Hazard review check list which involves but is not limited to the following: (1) The Anhydrous compressor (2) Housekeeping around the plant (3) Security locks and fence repairs if needed (4) Dates on the Anhydr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 43688,
      "SummaryText": "ous hoses (5) Hydrostatic (liquid) relief valve (6) Compressor safety (vapor) relief valve (7) Safety equipment (a) Anhyrdous gloves (b) Anhyrdous goggles ? Water Hydrant and shower in working order (d) Full face mask with Anhydrous cartridges (e) Protective boots (f) Protective slicker and protective pants and jacket.  With 31 Nurse Tanks they are on site at the Crook location during our off season.  When the Nurse Tanks leave our premises they are individually weighed at the Main office which at that time a scale ticket is made out with the Tank Number on the ticket, the date, time it is weighed out and the customers name that the tank is being taken to.  The exact location that the tank should be is found on our phone log that is kept when the customer calls in for a delivery.  A copy of the scale ticket goes with our driver with a Emergency Response Card that lists (1) Potential Hazards (2) Emergency Action (3) First aid (4) a 24-Hour emergency response number.  The hard copy of the tickets (which are in triplicate) never leaves the office.  Superior also does monthy inventories of our Anhydrous Large storage and of the 31 Nurse Tanks that are accounted for.  As a foot note when filling out our Risk Management Plan we went to the website to find Crook, CO latitude and longitude.  The Website is as follows: (http://mac.usgs.gov/maplists/indeshtml).  At that point we request Colorado and then Crook the following came up.  40 45' 00\" latitude 102 45' 00\" longitude.  The map type was topographic.  My report would not allow this it kept telling us it was outside the valid bounding box for Logan County, CO."
    }
  ]
}