{
  "FacilityID": 4381,
  "FacilityName": "Nucla Station",
  "FacilityStr1": "30739 DD 30 Road",
  "FacilityStr2": null,
  "FacilityCity": "Montrose County",
  "FacilityState": "CO",
  "FacilityZipCode": "81424",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08085",
  "LEPC": "Montrose County LEPC",
  "FacilityLatDecDegs": "38.238444",
  "FacilityLongDecDegs": "-108.507806",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.tristategt.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 42634378,
  "ParentCompanyName": "Tri-State Generation & Transmission Assoc., Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Tri-State G&T Association, Inc.",
  "OperatorStr1": "PO Box 33695",
  "OperatorStr2": null,
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80233",
  "OperatorZipCodeExt": null,
  "FTE": 55,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000054861",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "96OPM0168",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Chlorine Only",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": "1999-06-24 00:00:00",
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": "2014-09-29 00:00:00",
  "DeRegistrationEffectiveDate": "2014-09-19 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 38.238889,
  "FRS_Long": -108.508056,
  "FRS_Description": "AIR RELEASE STACK",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5110,
      "AltID": "Chlorination System",
      "FacilityID": 4381,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 5467,
          "ProcessID": 5110,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5219,
          "ProcessID": 5110,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1985,
              "Process_NAICS_ID": 5219,
              "SafetyReviewDate": "1999-06-08 00:00:00",
              "PHA_Date": "1999-03-23 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-10-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Human Factors",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "pending",
              "OpProceduresReviewDate": "1999-06-08 00:00:00",
              "TrainingReviewDate": "1999-06-08 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-08 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "Piping, tanks, valves, rate controllers",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-08 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-08 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-08 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-06-08 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2209,
                  "PreventionProgram3ID": 1985,
                  "ProcessChemicalID": 5467
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4381,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-08 00:00:00",
    "ERTrainingDate": "1999-06-08 00:00:00",
    "CoordinatingAgencyName": "Nucla-Naturita Fire Department",
    "CoordinatingAgencyPhone": "9708647333",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4381,
      "SummaryText": "INTRODUCTION\n\nThe Nucla Generating Station is a 100-megawatt steam electrical power generation facility. Coal is burned at the facility in a circulating atmospheric fluidized bed combustion boiler to generate steam used to turn four turbine generators. The power is generated through the newer 74-megawatt turbine generator as well as the three original 12.6-megawatt turbine generators. The primary raw materials used in the process include coal and limestone, which are crushed prior to being fed to the boiler.  Makeup water for plant processes and cooling is taken directly from the San Miguel River and process wastewater is treated and discharged back to the San Miguel River.  The system produces both fly ash and bottom ash, which is trucked off-site for disposal.\n\nOne process at Nucla Station is regulated by Risk Management Program regulations: the Circulating Water Chlorination System.\n\nTHE CIRCULATING WATER CHLORINATION SYSTEM\n\nWater used in the cooling towers at the Nucla Station must first be disinfected with chlorine to control the growth of algae, slime, and other organic life. The use of chlorine as a biocide increases the efficiency and lifetime of the condensers and the cooling towers. The Chlorination System provides gaseous chlorine under vacuum directly from one of two one-ton containers. Only one container is ever valved in at any time.\n\nBecause the maximum possible inventory of this process (4,000 lbs when two full chlorine ton containers are connected to the system) exceeds both the EPA RMP threshold quantity (2,500 lbs) and the OSHA Process Safety Management (PSM) threshold quantity (1,500 lbs), it is subject to the Program 3 requirements of the RMP regulations.  Program 3 requires an offsite consequence analysis of the worst-case and alternative release scenarios, a Prevention Program (also required by PSM), and an Emergency Response Program.\n\nCHLORINE WORST-CASE RELEASE SCENARIO\n\nThe worst-case scenario is based on the complete failure of the larges"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4381,
      "SummaryText": "t vessel of a chlorination system in a 10 minute period (a single ton container). The analysis requires the calculation of the area surrounding the release point that is subjected to chlorine concentrations greater than or equal to the toxic endpoint. The toxic endpoint (EP) has been set at the ERPG-2 (Emergency Response Planning Guideline) concentration, which is defined by the American Industrial Hygiene Association. This EP is equal to the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to 1 hour without experiencing or developing irreversible or other serious health effects or symptoms that could impair an individual's ability to take protective action. For chlorine, the EP is 3 parts per million (0.0087 mg/L).\n\nThe chlorination system holds two containers; however only one container per process is valved in at all times. Therefore, the worst-case scenario for Chlorination System involves the entire contents of a one-ton container being released over a 10 minute period. Because the facility is located within a river canyon, urban topography was selected to account for the barrier effect of the canyon walls. EPA's RMP*Comp program defines the distance to the toxic endpoint for this scenario as 1.3 miles. Some residences are also located in the radius, with an average population of 19 people (1990 Census data--Block Group Proration Method), but no non-residential public receptors or environmental receptors are located within this impact radius.\n\nAlthough the worst-case consequence analysis is required by the RMP rule, a worst-case occurrence is a highly unlikely event. Catastrophic failure of a chlorine ton container is extremely remote because the external surface of the each chlorine container is visually inspected regularly before hook-up and during operation for any departures from normal. Containers that do not meet the specifications listed in the Cylinder and Ton Container Procedure for Chlorine"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4381,
      "SummaryText": "Packaging (Chlorine Institute, Pamphlet 17, June; 1994) are returned to the supplier.  Additionally, safe work practices and Standard Operating Procedures are employed during the change-out of chlorine containers.\n\nCHLORINE ALTERNATIVE-RELEASE SCENARIO\n\nThe alternative-release scenario is considered \"more likely\" to occur than the worst-case scenario. A credible alternative-release scenario for chlorine was chosen after a review of previous hazard assessments and/or Process Hazard Analyses, facility or industry incident reports, maintenance work orders, incident recall, technical judgment and the \"Compliance Guidance and Model Risk Management Program for Water Treatment Plants\" scenarios (American Water Works Association).\n\nThe scenarios discussed in the \"Compliance Guidance and Model Risk Management Program for Water Treatment Plants\" were considered the most appropriate resource for use in defining the alternative release scenario. Each scenario was evaluated and ranked based on severity and likelihood of occurrence. The release scenario chosen for analysis is the following: tubing failure, bad connection, or container valve failure resulting in the release of gas through the 5/16-inch-diameter valve body opening (CLA-3). It is assumed that the release continues for 60 minutes before it is remediated. The total amount of chlorine released is specified as 317 pounds with a maximum average sustained release rate of 10.5 pounds/minute. This scenario was modeled as a release from a horizontal cylindrical tank with the release occurring through a short pipe or valve in the top of the tank, and the chlorine is assumed to escape only as a gas. Additional assumptions include urban surroundings to account for the barrier effect of the canyon walls, Atmospheric Stability Class D, wind speed of 6.7 miles per hour, relative humidity of 50%, and a temperature of 77 0F. Entering the release rate specified by this guidance into the RMP*Comp program, the distance to the EP was ca"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4381,
      "SummaryText": "lculated as 0.1 mile.  There are no recreational, institutional areas or environmental receptors located within this radius, but one residence (population = 1 according to Block Group Proration of 1990 Census Data) is probably within the boundary.\n\nAlthough an alternative-release consequence analysis is required by the RMP rule, a failure and release that is large enough to reach the EP beyond the fence line is not likely because (1) the facility has a preventive maintenance program in place to maintain the ongoing integrity of the system, (2) Standard Operating Procedures and training programs are developed, implemented and maintained to ensure that the operations and maintenance personnel will avoid activities which may cause releases, and can quickly respond to any releases that do occur, and (3) preventive maintenance schedules are developed to ensure that process equipment operates optimally and safely.\n\nCHLORINE FIVE-YEAR ACCIDENT HISTORY\n\nNucla Station has not had an accident involving the chlorination system during the past five years which resulted in any deaths, injuries, or responses or restoration activities for an exposure of an environmental receptor.  Nucla Station has not had any incidents with the chlorination system.\n\nPREVENTION PROGRAM\n\nTri-State has developed a combined Process Safety Management and Risk Management Program for the regulated process at the Nucla Station.  Because many requirements of the RMP and PSM rules are similar, an integrated approach is useful to ensure compliance with both rules, to eliminate redundancy, and to simplify documentation.  The Prevention Program includes:  a Management System, an Employee Participation Plan, Process Safety Information and Process Hazard Analysis/Hazard Review requirements, Standardized Operating Procedures, a Training Program, a Contractor Safety Program, a Pre-Startup Safety Review requirement, a Mechanical Integrity/Maintenance Program, a Hot Work Permit System, a Management of Change Proced"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4381,
      "SummaryText": "ure, an Incident Investigation Procedure, and an Audit Program.\n\nEMERGENCY PLANNING, PREVENTION AND RESPONSE PROGRAM\n\nBoth the EPA RMP and OSHA PSM rules rely mainly on previous requirements for emergency action plans and training (29 CFR 1910.138 [a] and 1910.120[a], [p], and [q]). The Nucla Station has consolidated these requirements into the Integrated Contingency Plan (ICP).  In the same way that the PSM and RMP rules are efficiently satisfied by one program, the ICP will allow Nucla Station to effectively manage its Emergency Planning, Prevention, and Response efforts while eliminating redundancy and excessive documentation.  The ICP covers all regulatory requirements for emergency response training, evacuation procedures, procedures for notifying the public, government agencies, and local emergency response agencies of a release, procedures for the maintenance of emergency response equipment, emergency management and organization structures, and guides for conducting drills and table-top planning exercises.\n\nNucla Station is committed to ensuring the safety of its workers, the surrounding community, and the environment.  The Station maintains its own hazardous materials emergency response (HAZMAT) team, and several employees at the facility are trained as Emergency Medical First Responders. \n\nTo learn more about Tri-State Generation & Transmission Association, Inc., Nucla Station, and other Tri-State facilities, please visit the web site at http://www/tristategat.org."
    }
  ]
}