{
  "FacilityID": 43881,
  "FacilityName": "Nucor Steel- Berkeley",
  "FacilityStr1": "1455 Hagan Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Huger",
  "FacilityState": "SC",
  "FacilityZipCode": "29450",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45015",
  "LEPC": "Berkeley County LEPC",
  "FacilityLatDecDegs": "33.005556",
  "FacilityLongDecDegs": "-079.880000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "OT",
  "FacilityURL": "www.nucorsteel.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 884959263,
  "ParentCompanyName": "Nucor Corporation",
  "Company2Name": null,
  "CompanyDUNS": 3446796,
  "Company2DUNS": 0,
  "OperatorName": "Nucor Steel-Berkeley",
  "OperatorStr1": "1455 Hagan Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Huger",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29450",
  "OperatorZipCodeExt": null,
  "RMPContact": "Denise Boerst",
  "RMPTitle": "Environmental Engineer",
  "FTE": 859,
  "OtherEPAFacilityID": "29450ncrst1455h",
  "EPAFacilityID": "100000193177",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "TV-0420-0060",
  "SafetyInspectionDate": "2004-06-24 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-10-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-09-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-09-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-05-01 00:00:00",
  "DeRegistrationEffectiveDate": "2009-04-27 00:00:00",
  "AnniversaryDate": "2010-09-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 63286,
      "AltID": "Ammonia Storage",
      "FacilityID": 43881,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 64782,
          "ProcessID": 63286,
          "NAICSCode": "331112",
          "_desc": {
            "NAICS_CODE": "331112",
            "NAICS_DESCRIPTION": "Electrometallurgical Ferroalloy Product Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 83728,
          "ProcessID": 63286,
          "ChemicalID": 56,
          "Quantity": 53800.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 583728,
          "ProcessID": 63286,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43881,
      "SummaryText": "Facility Description and Summary\nNucor Steel- Berkeley (Nucor), a division of Nucor Corporation, owns and operates a scrap steel recycling facility in Huger, South Carolina.  The facility owns approximately 8000 acres of property along the Cooper River, approximately 20 miles northwest of Charleston, South Carolina.  This facility produces steel coils and beams primarily from steel scrap using the electric arc furnace process.\n\nFollowing Hurricane Katrina, hydrogen supply has dropped since a major manufacturing facility was located in New Orleans.  In this emergency situation, Nucor has purchased and installed three ammonia dissociators to produce hydrogen for the cold mill operations.   It is normally more cost effective to purchase hydrogen; therefore, we do not expect to continue operation of the ammonia dissociators once the hydrogen supply returns to normal.  The processes will simply be available in the future as an alternate hydrogen source for emergencies.\n\nA Risk Management Program has been prepared and implemented for two anhydrous ammonia systems located on the south side of the Galvanizing Line.  The anhydrous ammonia is used to produce hydrogen for two separate operations through three ammonia dissociator generators.  One 10,000 gallon capacity aboveground storage tank and two dissociators will supply hydrogen for the Annealing Furnaces.  One 2,300 gallon capacity aboveground storage tank and dissociator will supply the Galvanizing Line.  These two systems operate independently of each other.  \n\n\nAccidental Release Prevention and Emergency Response Policies\nNucor?s safety policy is that every employee is entitled to a safe and healthful place in which to work.  In order to accomplish this, we will provide all reasonable safeguards necessary to ensure a safe and healthy work environment.  Every employee is expected to follow the safety standards and procedures that apply to our operations.  \n\nA Process Safety Management Program (PSM) has been developed a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43881,
      "SummaryText": "nd implemented for the anhydrous ammonia storage and associated piping.  Process hazard and offsite consequence analyses were conducted for anhydrous ammonia storage at the facility.   In addition, the PSM addresses each of the following elements:  employee participation, process safety information, risk reduction, operating procedures, employee training, contractor safety, pre-startup safety review, mechanical integrity, hot work permits, management of change, incident investigation, emergency planning and response, and compliance audits.  \n \n\nAccidental Release Prevention Program and Chemical-specific Prevention Steps\nThe ammonia storage tanks and associated piping are easily accessible for routine operations, maintenance, and emergency response situations.  Equipment is examined during routine shift inspections and periodic tests, which conform to recognized and accepted good engineering practices. Inspection and test results are recorded and maintained on file.  Any deficiencies are corrected in a safe and timely manner.  \n\nEach storage tank is bordered by two walls and protected by a six foot high chain link security fence with two locking gates.  Both tanks are equipped with automatic shut-off valves and will be continuously monitored by video surveillance and area monitors with alarms.  Access to the facility is controlled via a guarded entrance gate.  Safety showers, eye wash stations, and emergency response equipment are strategically located near each tank for emergencies.  Additional emergency response equipment is stored in a mobile HAZMAT vehicle.  A fire hydrant is located between the two anhydrous ammonia storage tanks.  Each tank is also equipped with overhead spray water nozzles.  \n\nThe Local Emergency Planning Commission, the State Emergency Response Commission, and local police and fire departments have been notified of the anhydrous ammonia storage on-site.  The Cainhoy Fire Department would be contacted for assistance in the unlikely event of a "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 43881,
      "SummaryText": "large ammonia release at the facility.  \n\n\nFive-Year Accident History\nNucor is implementing this Risk Management Program with the installation of the anhydrous ammonia storage.  Nucor has not had any releases of anhydrous ammonia.   \n\n\nEmergency Response Program\nThe existing Emergency Response Plan was modified to meet the requirements of 40 CFR Part 68 to include information for anhydrous ammonia emergencies.  All aspects of emergency planning and response are addressed in the ICP including implementation of response procedures, containment and control provisions, emergency equipment, casualty control, evacuation plan, post-emergency procedures, and arrangements with local authorities.  Responsibilities and contact information for the Emergency Coordinator and other key personnel are identified for implementation of emergency planning and response procedures.   \n\nEmployees are provided proper training on chemical safety, hazard communication principles, emergency rally points, evacuation routes, and appropriate personal protective equipment. In the event of an emergency, it is every employee?s responsibility to contact their supervisor, health and safety, or environmental personnel immediately.  Emergency response personnel are trained on proper personal protective equipment, ammonia properties, and emergency response tactics.  \n\n\nPlanned Changes to Improve Safety\nNucor will review procedures and inspect equipment regularly.  Follow-up actions to items found will be implemented in a safe and timely manner.  Based on the hazard analysis review, additional safety measures are planned such as concrete barriers, enhancement of area monitors, and additional training for operators, emergency response team, and employees."
    }
  ]
}