{
  "FacilityID": 43905,
  "FacilityName": "Fertizona Fennemore, LLC",
  "FacilityStr1": "17102 West Olive Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Waddell",
  "FacilityState": "AZ",
  "FacilityZipCode": "85355",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.533333",
  "FacilityLongDecDegs": "-112.383333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.fertizona.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 21650189,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Craig Allen",
  "OperatorStr1": "P.O. Box 807",
  "OperatorStr2": null,
  "OperatorCity": "Waddell",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85355",
  "OperatorZipCodeExt": "0807",
  "RMPContact": "James Compton",
  "RMPTitle": "President",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000150935",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Update 9-2005",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-10-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-10-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-09-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-06-29 00:00:00",
  "DeRegistrationEffectiveDate": "2007-06-30 00:00:00",
  "AnniversaryDate": "2010-09-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 33.56615,
  "FRS_Long": -112.42676,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 63314,
      "AltID": "Ammonia",
      "FacilityID": 43905,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 64810,
          "ProcessID": 63314,
          "NAICSCode": "453998",
          "_desc": {
            "NAICS_CODE": "453998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Store Retailers (except Tobacco Stores)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 83762,
          "ProcessID": 63314,
          "ChemicalID": 56,
          "Quantity": 145215.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 583762,
          "ProcessID": 63314,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 43905,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe Fertizona of Fennemore (Waddell, Arizona) accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices. All applicable procedures of the federal Program are adhered to. The Fertizona of Fennemore emergency response policy involves the preparation of response plans which are tailored to the facility and to the emergency response services available in the community.\n\nFertizona of Fennemore stores and blends liquid fertilizer for sale and application to farmland. This facility only brings in railcar tanks of anhydrous ammonia.  A contractor, Ag. Express, provides the labor and equipment to unload the ammonia from railcar and react the ammonia with phosphoric acid to produce a non-hazardous agricultural liquid fertilizer, ammonia polyphosphate, commonly known as ?10-34-0\".  This Risk Management Plan incorporates by reference the elements of the Risk Management Plan produced and maintained by the contractor. The facility stores the following quantities of regulated substances:\n?    Anhydrous Ammonia - 145,125 pounds\n\nAtmospheric dispersion modeling has to be performed to determine the distance traveled by the toxic substance released before its concentration decreases to the ?toxic endpoint? selected by the EPA (0.14 mg/L for anhydrous ammonia). This is defined by the American Industrial Hygiene Association (AIHA) as the ?maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without which could impair an individual?s ability to take protective action.?  The residential population within a radius corresponding to the toxic endpoint distance has to be defined, ?to estimate the population potentially affected.?\n\nThe offsite consequence analysis includes consideration of two release scenarios for the process, identified as ?worst case release? and ?alternative release scenario.?  \n\nThe worst case release scenario at Fe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 43905,
      "SummaryText": "rtizona of Fennemore involves the release of all anhydrous ammonia containing product. Because the anhydrous ammonia storage is in proximity of each other, the total amount of anhydrous ammonia that potentially could be released would amass to approximately 145,125 pounds (lbs). The offsite consequence analysis for this scenario was performed for the following set of conditions.\n\nWhen atmospheric dispersion modeling for the worst case scenarios were performed using the EPA assumptions, a distance to toxic endpoint of 5.6 miles and an estimate of population potentially affected of 19,073 persons were obtained for the release scenario. \n\nThe alternative release scenario involved the release of each toxic substance stored at the facility. The amount of anhydrous ammonia released was predicted to be 14,512 lbs/minute and the distance to toxic endpoint was 3.1 miles. The toxic concentration levels outside these endpoint distances are below the allowable standards for toxic substances established by AIHA. The typical meteorological conditions used for these scenarios was a Stability Class D, wind speed 3.0 m/s, average air temperature, and average humidity.\n\nThe general accidental release prevention program is based on the following key elements:\n?    High level of training of the operators.\n?    Preventative maintenance programs.\n?    Use of state-of-the-art process and safety equipment.\n?    Use of accurate and effective operating procedures, written with the participation of the operators.\n?    Performance of a process hazard analysis of equipment and procedures.\n?    Implementation of an auditing and inspection program.\n\nThere have been no reportable releases at Fertizona of Fennemore in the past five years.\n\nFertizona of Fennemore will fully implement the RMP and will initiate appropriate changes as needed to maintain a safe operation."
    }
  ]
}