{
  "FacilityID": 4396,
  "FacilityName": "StanTrans, Inc.",
  "FacilityStr1": "201 Dock Road",
  "FacilityStr2": null,
  "FacilityCity": "Texas City",
  "FacilityState": "TX",
  "FacilityZipCode": "77590",
  "Facility4DigitZipExt": "0000",
  "FacilityCountyFIPS": "48167",
  "LEPC": "Texas City LEPC",
  "FacilityLatDecDegs": "29.373694",
  "FacilityLongDecDegs": "-94.893278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "ST Services, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 97295687,
  "Company2DUNS": null,
  "OperatorName": "StanTrans, Inc.",
  "OperatorStr1": "P.O. Box 3608",
  "OperatorStr2": null,
  "OperatorCity": "Texas City",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77592",
  "OperatorZipCodeExt": "3608",
  "FTE": 68,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000049574",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "none yet",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-01-27 00:00:00",
  "DeRegistrationEffectiveDate": "2013-09-12 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 29.374389,
  "FRS_Long": -94.889361,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5126,
      "AltID": "Storage and Transfer",
      "FacilityID": 4396,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 5485,
          "ProcessID": 5126,
          "ChemicalID": 116,
          "Quantity": 11579378.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 5486,
          "ProcessID": 5126,
          "ChemicalID": 120,
          "Quantity": 11055829.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 5487,
          "ProcessID": 5126,
          "ChemicalID": 119,
          "Quantity": 10668160.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 5488,
          "ProcessID": 5126,
          "ChemicalID": 12,
          "Quantity": 10696677.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 5489,
          "ProcessID": 5126,
          "ChemicalID": 138,
          "Quantity": 4424501.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5235,
          "ProcessID": 5126,
          "NAICSCode": "49311",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1996,
              "Process_NAICS_ID": 5235,
              "SafetyReviewDate": "1999-03-01 00:00:00",
              "PHA_Date": "1999-04-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Used both What-If and HAZOP methods in combination",
              "PHACompletionDate": "1999-08-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "lightning strike",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "backup nitrogen cylinders for tank blanketing",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-13 00:00:00",
              "TrainingReviewDate": "1999-03-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Computer-based training",
              "MaintenanceReviewDate": "1999-04-20 00:00:00",
              "EquipmentInspectionDate": "1999-06-09 00:00:00",
              "EquipmentTested": "Refrigeration equipment, pumps, instruments, gauges, seals.  (These are inspected weekly.  Tank tops, hatches, and relief valves are inspected quarterly).",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-04-15 00:00:00",
              "PreStartupReviewDate": "1998-12-31 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-04-15 00:00:00",
              "HotWorkPermitReviewDate": "1996-08-14 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-13 00:00:00",
              "ContractorSafetyEvalDate": "1994-03-29 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2221,
                  "PreventionProgram3ID": 1996,
                  "ProcessChemicalID": 5485
                },
                {
                  "PrimaryKey": 2222,
                  "PreventionProgram3ID": 1996,
                  "ProcessChemicalID": 5486
                },
                {
                  "PrimaryKey": 2223,
                  "PreventionProgram3ID": 1996,
                  "ProcessChemicalID": 5487
                },
                {
                  "PrimaryKey": 2224,
                  "PreventionProgram3ID": 1996,
                  "ProcessChemicalID": 5488
                },
                {
                  "PrimaryKey": 2225,
                  "PreventionProgram3ID": 1996,
                  "ProcessChemicalID": 5489
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4396,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Texas City Mutual Assistance League",
    "CoordinatingAgencyPhone": "4099414567",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 4396,
      "SummaryText": "rence Tables or Equations.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 2 and 3 toxic substances as a class involves a catastrophic release from tank storage.  In this scenario 10696676.79 lbs of propylene oxide  [oxirane, methyl-] is released.  The toxic liquid released is assumed to form a 1.84 foot deep pool from which evaporation takes place.  The entire pool is estimated to evaporate over 563.52 minutes.  Passive mitigation systems (dikes) are taken into account to calculate the scenario.  This mitigation system has the effect of reducing the surface area of the resulting pool, thus reducing the overall rate of evaporation (emission rate) of the spilled material.  At Class F atmospheric stability and 1.5 m/s windspeed, the maximum distance of 7.4 miles is obtained corresponding to a toxic endpoint of 0.59 mg/L.\n\nThe alternative release scenario for propylene oxide  [oxirane, methyl-] involves a release during transfer.  The scenario involves the release of 18305 lbs of propylene oxide.  The toxic liquid is assumed to be released to form a 1 cm deep pool from which evaporation takes place.  The entire pool is estimated to have evaporated after 7.74 minutes.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.59 mg/L of propylene oxide  [oxirane, methyl-] is 0.68 miles.\n\nThe worst case release scenario submitted for Program 2 and 3 flammable substances as a class involves a catastrophic release from tank storage.  In this scenario 11579378.11 lb. of isoprene  [1,3-butadiene, 2-methyl-] is released.  It is assumed that the entire quantity is released as a vapor, which finds an ignition source, with 10 percent of the released quantity participating in a vapor cloud explosion.  Under worst case weather conditions, the calculated distance of 1.79 miles is obtained corresponding to an endpoint of 1 psi overpressure.\n\nThe alternative release scenario submitted fo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4396,
      "SummaryText": "r Program 2 and 3 flammable substances involves a release during transfer.  The release is assumed to result in a Vapor Cloud Explosion.  The scenario involves the release of 99405 lbs of isoprene  [1,3-butadiene, 2-methyl-] over a five-minute period.  Under neutral weather conditions, the maximum distance to the flammable endpoint of 1 psi overpressure is 0.25 miles.\n\n4.\tThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition.    The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nStanTrans, Inc. maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is a combination of what-if and HAZOP methodologies.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of five years.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA/update was performed on 4/15/1998.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, StanTrans, Inc. maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, and normal shutdown and startup.  The information is re"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4396,
      "SummaryText": "gularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nStanTrans, Inc. has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided annually and more frequently as needed.\n\nMechanical Integrity\nStanTrans, Inc. carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at StanTrans, Inc. to manage changes in process chemicals, technology, equipment and procedures.  The most recent review/revision of maintenance procedures was performed on 4/20/1999.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at StanTrans, Inc.  The most recent review was performed on 12/31/1998.  Operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nStanTrans, Inc. conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits will be carried out at least every 3 years and any corrective acti"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4396,
      "SummaryText": "ons required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nStanTrans, Inc. promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nStanTrans, Inc. truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  StanTrans, Inc. has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n5.\tFive-year Accident History\nStanTrans, Inc. has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there have been no accidental releases with off-site consequences during this period.\n\n6.\tEmergency Response Plan\nStanTrans, Inc. maintains a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of loc"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 4396,
      "SummaryText": "al emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nTexas City LEPC is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.  We are also members of the Texas City Industrial Mutual Aid System (IMAS) whereby members facilities assist each other in responding to fire and toxic release emergency.\n\n\n7.\tPlanned Changes to Improve Safety\nBecause of our excellent safety record, no major changes to improve safety are currently planned.  A number of minor items identified during the process hazard analyses are being evaluated.  These primarily consist of minor changes to existing written procedures, documentation, and recordkeeping.  The changes that result from this evaluation are expected to be implemented by 8/1/1999."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 4396,
      "SummaryText": "Executive Summary\n\n1.\tAccidental Release Prevention and Emergency Response Policies\nWe at StanTrans, Inc. are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n2.\tThe Stationary Source and the Regulated Substances Handled\nOur facility's primary activity is For-Hire Chemical and Petroleum Storage (Terminalling).  We currently have 5 regulated substances present at our facility.  These substances include:\n* Isoprene  [1,3-butadiene, 2-methyl-], \n* 1,3-Butadiene, \n* Propylene oxide  [oxirane, methyl-], \n* 1-Butene, and \n* 1,3-Pentadiene [piperylene]. \n\nStanTrans does not use or process these chemicals.  Rather, StanTrans provides storage services on a contract basis.  The only activities affecting the listed substances are tank storage and transfer of products to and from transport vessels (including rail cars, tank trucks, barges, and ships).\n\nThe maximum inventories of each listed substance are:\n* Isoprene  [1,3-butadiene, 2-methyl-] - 11,579,378 lb\n* 1,3-Butadiene - 11,055,829 lb\n* Propylene oxide  [oxirane, methyl-] - 10,696,677\n* 1-Butene - 10,668,160\n* 1,3-Pentadiene - 4,424,501 lb.\n\nThe quantities are based on the maximum storage capacity of the respective tanks in which these substances are being stored.  At any given time, the actual quantity in storage is likely to be less than the figures listed above.\n\n3.\tThe Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\nTo perform the required offsite consequence analysis for our facility, we have used the EPA's OCA Guidance Refe"
    }
  ]
}