{
  "FacilityID": 44092,
  "FacilityName": "Cold Regions Research and Engineering Lab",
  "FacilityStr1": "72 Lyme road",
  "FacilityStr2": null,
  "FacilityCity": "Hanover",
  "FacilityState": "NH",
  "FacilityZipCode": "03755",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "33009",
  "LEPC": "Hanover LEPC",
  "FacilityLatDecDegs": "43.724690",
  "FacilityLongDecDegs": "-072.272940",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G3",
  "LatLongDescription": "CE",
  "FacilityURL": "N/A",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 187155056,
  "ParentCompanyName": "US Government",
  "Company2Name": "USACE",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "US. Army CRREL",
  "OperatorStr1": "72 Lyme road",
  "OperatorStr2": null,
  "OperatorCity": "Hanover",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03755",
  "OperatorZipCodeExt": null,
  "FTE": 327,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000153184",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "GSP-EG-166",
  "SafetyInspectionDate": "2003-06-01 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-10-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-10-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-10-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-11-04 00:00:00",
  "DeRegistrationEffectiveDate": "2016-01-01 00:00:00",
  "AnniversaryDate": "2010-10-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 43.72469,
  "FRS_Long": -72.27294,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) PRECISE POSITION",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 63635,
      "AltID": "Ammomia Refrigeration",
      "FacilityID": 44092,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 84194,
          "ProcessID": 63635,
          "ChemicalID": 56,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 65138,
          "ProcessID": 63635,
          "NAICSCode": "92119",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 37226,
              "Process_NAICS_ID": 65138,
              "SafetyReviewDate": "2004-09-01 00:00:00",
              "PHA_Date": "2005-10-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2006-10-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2005-10-01 00:00:00",
              "TrainingReviewDate": "2005-10-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-10-01 00:00:00",
              "EquipmentInspectionDate": "2005-10-01 00:00:00",
              "EquipmentTested": "Machine room equipement including compressors and piping.",
              "ChangeMgmtDate": "1999-06-01 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-01 00:00:00",
              "PreStartupReviewDate": "2005-10-01 00:00:00",
              "ComplianceAuditDate": "2001-08-01 00:00:00",
              "AuditCompletionDate": "2002-08-01 00:00:00",
              "IncidentInvestigationDate": "1996-01-03 00:00:00",
              "InvestigationChangeDate": "1996-02-01 00:00:00",
              "ParticipationPlansReviewDate": "2005-10-01 00:00:00",
              "HotWorkPermitReviewDate": "2005-10-01 00:00:00",
              "ContractorSafetyReviewDate": "2005-10-01 00:00:00",
              "ContractorSafetyEvalDate": "2001-01-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Initiate Process management Compliance Committee and enlisted an outside consultant in 2001 to review process and procedures. After audit of facility recommendations were presented to the Process Management Compliance Committee.",
              "_chemicals": [
                {
                  "PrimaryKey": 54127,
                  "PreventionProgram3ID": 37226,
                  "ProcessChemicalID": 84194
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 44092,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-09-01 00:00:00",
    "ERTrainingDate": "2005-08-01 00:00:00",
    "CoordinatingAgencyName": "Hanover Fire and Police Dept.",
    "CoordinatingAgencyPhone": "6036433424",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 44092,
      "SummaryText": "Executive Summary\n\n\nThe accidental release prevention and emergency response policy \nat the ERDC-CRREL facility.\n\nIt is the policy of  ERDC-CRREL that we will maintain the capability, equipment and training to respond to and mitigate an accidental release of Anhydrous Ammonia.  This will be done in coordination with local emergency responders and is incorporated into the LEPC?s Emergency Response Plan.  This policy is supported by senior management at the Laboratory by supporting the membership on the LEPC and by providing the financial resources, time and training to obtain and maintain a response capability.\n\nOur facility and the regulated substances handled.\n\nThe US Army Cold Regions Research and Engineering Laboratory (CRREL) is located approximately two miles north of the center of Hanover, NH.  The laboratory conducts research in many aspects of basic cold regions properties and engineering structures and systems subjected to cold, snow, ice and permafrost.  The 30 acre site is bordered on the north and south by small housing areas, to the west by a narrow buffer of undeveloped land and the Connecticut River and on the east by a state highway and public school facility.  Within a half mile radius, there are additional housing complexes, office buildings, the Hanover Fire, Police and Emergency Medical Response complex, a nursing home, and a few small businesses.\nSeveral separate refrigeration systems are operated at CRREL, most of which use ethylene glycol as the refrigerant.  However, one system used in the Ice Engineering Facility (IEF) uses anhydrous ammonia as the primary refrigerant.  Ammonia is an EPCRA Extremely Hazardous Substance with a Threshold Planning Quantity of 10,000 pounds.  The IEF system has a capacity in excess of the TPQ (20,000 pounds) and as such is subject to EPCRA tier II reporting as well as the Risk Management Planning requirements.  No other EHS?s above the TPQ exist at CRREL.\n\nThe worst case release scenario and the alternative rele"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 44092,
      "SummaryText": "ase scenario.\n\nThe worst case release scenario was obtained by using the OCA guidance and the EPA OCA and ALOHA computer model.  With the anhydrous ammonia system, the analysis showed that an 1100 lb/ min release for 10 minutes would affect a 0.6 mile radius around the release, which would necessitate evacuation of the residences and businesses within that zone.  However, because of the nature of the system, it is considered extremely unlikely that a release of this magnitude could occur.  This is because the ammonia is not concentrated in a single tank or vessel, but is disbursed throughout a complicated system of pipes, valves, pressure vessels, and other machinery.  Failure of all this machinery at the same time is impossible other than under extreme catastrophic conditions.  An example of the release more likely to be experienced will be shown in the accident history portion of this summary.\nAn alternative scenario was based on an actual incident and used the release rate and duration of the incident.   This showed that the effects of the release would not go past the IEF building.  Passive measures in effect for either scenario include sensors and alarms.  In either case, it is expected that we will be dealing with vapor rather than liquid, so no liquid containment systems, dikes or tanks are in place or planned.\n\nThe general accidental release prevention program and chemical-specific prevention systems.\n\nCRREL is actively pursuing OSHA?s Process Safety Management program.  This has so far included Process Hazard Analysis, upgraded facility drawings, valve and equipment identification and tagging, upgraded detection and alarm equipment and improved control systems.  Regular meetings have been instituted between users/researchers and maintainers/responders of the building?s equipment to ensure coordination of both experimental efforts and scheduling of maintenance or replacement of equipment.\n\nThe five year accident history\n\nCRREL has not had a reportable releas"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 44092,
      "SummaryText": "e in the last five years.  The last reportable release occurred 7 Dec. 1996 when a small fitting broke due to vibration.  The Hanover Fire Department was notified and was on the scene and assumed incident command as per the Emergency Response Plan in less then five minutes.  CRREL personnel made a level ?A? entry and stopped the leak.  Mitigation in the form of fans and venting was performed.  Total quantity lost was between 300 to 500 pounds of ammonia, duration of the incident was approximately two hours and there were no injuries or property damage other than the equipment malfunction which caused the incident.\n\nA reportable incident occurred on 13 Jan 1996 when ammonia was reported leaking through storm drain manholes and HFD and the CRREL response team were summoned.  Based on concentration levels and locations, the incident commander decided to flush the drains.  After a period of time, the ammonia levels dropped and the incident Commander secured the scene.  Approximately an hour later, ammonia odors were again reported and the flushing was resumed with additional diagnosis and measurements.  The problem was finally isolated and contained and the operation secured.  The problem was traced to a malfunctioning alarm and its associated shut down device.  During the incident, two HFD and one CRREL person received medical attention for exposure to ammonia.  All returned to duty after treatment.  There was no evacuation and no property damage reported.  The incident lasted approximately nine hours and it is estimated that about 2000 pounds of ammonia were lost.\nAs a result of these incidents, EPA Region I conducted an accident prevention investigation on 2 July 1996.  They found CRREL?s preventative measures and response to the incidents adequate and recommended that the OSHA PSM which had already been initiated be continued.  Other than minor losses during maintenance and from occasional packing leaks, there have been no further accidents.\n\n\nThe Emergency Response"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 44092,
      "SummaryText": " Plan\n\nCRREL has been a member of the EPCRA Hanover/Lebanon Local Emergency Planning Committee since its inception. Early in the process, it was recognized that there were no local resources available to respond to a major ammonia release from CRREL, other than for isolation and evacuation.  At the time, CRREL made a commitment to develop an in-house response team. All necessary equipment and HAZWOPER training was obtained.  A key element of the response program was that the Hanover Fire Department would retain incident command for any release.  HFD is about 0.25 miles from CRREL, so a close working relationship has been developed in such areas as compatibility of radios and air tanks and frequent visits and familiarization with CRREL personnel and facilities. Annual refresher training is conducted and alert systems have been upgraded as previously described.\n\nPlanned changes to improve safety\n\nOSHA Process Safety Management activities remain ongoing.  Recent organizational and personnel changes have caused an in-depth review of response capabilities and renewed discussions with HFD regarding their role in response actions.  It is expected that decisions for changes, if any will be made during FY 2006."
    }
  ]
}