{
  "FacilityID": 44266,
  "FacilityName": "J. R. Simplot Company - Caldwell Operations",
  "FacilityStr1": "Highway 19, 2 Miles West of City",
  "FacilityStr2": null,
  "FacilityCity": "Caldwell",
  "FacilityState": "ID",
  "FacilityZipCode": "83606",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16027",
  "LEPC": "Canyon County LEPC",
  "FacilityLatDecDegs": "43.667222",
  "FacilityLongDecDegs": "-116.730556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.simplot.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9073503,
  "ParentCompanyName": "J. R. Simplot Company",
  "Company2Name": null,
  "CompanyDUNS": 9073503,
  "Company2DUNS": 0,
  "OperatorName": "J. R. Simplot Company",
  "OperatorStr1": "P.O. Box 1059",
  "OperatorStr2": null,
  "OperatorCity": "Caldwell",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83605",
  "OperatorZipCodeExt": "1059",
  "RMPContact": "Reggie Pederson",
  "RMPTitle": "Unit Director",
  "FTE": 600,
  "OtherEPAFacilityID": "IDD009124561",
  "EPAFacilityID": "100000079817",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "pending",
  "SafetyInspectionDate": "2004-05-17 00:00:00",
  "SafetyInspectionBy": "Ace Insurance",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Ammonia Refrigeration Systems (2)",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-11-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-11-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-11-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-11-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 43.71842,
  "FRS_Long": -116.74009,
  "FRS_Description": "OTHER",
  "FRS_Method": "ZIP CODE-CENTROID",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 63910,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 44266,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 65418,
          "ProcessID": 63910,
          "NAICSCode": "311411",
          "_desc": {
            "NAICS_CODE": "311411",
            "NAICS_DESCRIPTION": "Frozen Fruit, Juice, and Vegetable Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 84555,
          "ProcessID": 63910,
          "ChemicalID": 56,
          "Quantity": 80000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 584555,
          "ProcessID": 63910,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 63911,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 44266,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 65419,
          "ProcessID": 63911,
          "NAICSCode": "311411",
          "_desc": {
            "NAICS_CODE": "311411",
            "NAICS_DESCRIPTION": "Frozen Fruit, Juice, and Vegetable Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 84556,
          "ProcessID": 63911,
          "ChemicalID": 56,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 584556,
          "ProcessID": 63911,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 44266,
      "SummaryText": "This is to inform all interested persons, including employees that the J.R. Simplot Company Caldwell Idaho facility is complying with OSHA's Process Safety Management Standard (called Process Safety Management or PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA's Risk Management Program regulations (called RM Program), Title 40 CFR Part 68, to deal with the risks involved with the storage, handling, and processing of hazardous chemicals.  In this way we promote overall plant, worker, and public safety.\n\nThese programs enable our facility to prevent the occurrence, and minimize the consequences, of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.  Overall, these programs prevent accidental fatalities, injuries and illnesses and avoid physical property damage.\n\nOur safety programs are applied to any activity involving hazardous chemicals including any use, storage, manufacturing, handling, or the on-site movement of such chemicals, or combination of these activities.  Any group of vessels that are interconnected and separate vessels, which are located, such that a hazardous chemical could be involved in a potential release shall be considered a single process.\n\nOur safety programs prevent accidents because they focus on the rules, procedures, and practices which govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary.  They are also communicated to and accepted by all employees at the facility.\n\nJ.R. Simplot Company operates a potato products manufacturing facility in Caldwell, Idaho.  The only chemical that was found to be present above its respective RM program quantity threshold at this facility is anhydrous ammonia.  There are two separate regulated Program Level 3 processes, the Plant 2 ammonia refrigeration system and the Zero Storage ammonia refrigeration system.  The RM program for the Caldwell Facility, which is separ"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 44266,
      "SummaryText": "ately documented in detail, consists of the specific elements listed below.\n\nManagement Plan:\nThe facility has a system in place to manage the implementation of the RM program elements.  The Unit Director is the designated RM Program Manager.  The RM Program Manager has the overall RM Program responsibility, and has the authority to assign company resources to develop, implement, update, and integrate all applicable RM program elements at the Caldwell facility. The RMP/PSM Team Leader is assigned by the RM Program Manager to ensure that the RM Program is developed, implemented, and updated in compliance with the RM Program regulations.  The Manager of Occupational Health is the designated RMP/PSM Team Leader, and has the day-to-day responsibility for the RM Program. The RMP/PSM Team Leader is supported by the RMP/PSM Team, which includes the RMP/PSM Team Leader, Preventive Maintenance Supervisor, Plant Engineer, Boiler and Refrigeration Supervisor, and Refrigeration Technician.  The RMP/PSM team functions in a manner that no one person is assigned sole responsibility for any element of the RM program.  While primary RM program element or sub-element responsibility may be assigned to specific individuals, the RMP/PSM team shares the final responsibility for the development and implementation of the RM program.\n\nThe RMP/PSM Team Leader reports to both the RM Program Manager and receives direction and support from the Vice President of Environment and Regulatory Affairs and Division Safety Manager.  The Unit Director/RM Program Manager reports to division management.  The chain of management above the Unit Director is as follows: 1) the Director of Manufacturing; 2) the Senior Vice President of Operations; 3) the Food Group President; and lastly 4) the Chief Executive Officer.\n\nChemical Release Prevention Program:\nThe facility has a chemical release prevention program for the ammonia system.  This prevention program is required by both RM Program and Occupational Safet"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 44266,
      "SummaryText": "y and Health Administration (OSHA) Process Safety Management (PSM) regulations, which are quite similar with respect to release prevention.  The prevention program for the ammonia process was developed to comply with PSM regulations, and was most recently updated in the second quarter of 1999.  Key provisions of the facility release prevention program are as follows:\n\n? Employees who operate these systems must receive training initially and periodically on safe startup/shutdown, operations, and emergency shutdown of the processes.  \n? Release incidents are investigated, and the results are used to improve the safety of the process. \n? The ammonia refrigeration system is maintained through the mechanical integrity program, which minimizes the risk of accident and maximizes process safety. \n? Results of incident investigations are also shared with employees who could be affected by the process.  \n? Employees participate in a process hazard analysis (PHA) which identifies potential hazards and ways to improve the safety of the process every five years, or whenever significant changes are made to the process.\n? The facility has a management of change (MOC) program in place that mandates that changes to the ammonia system are reviewed prior to implementing the change to ensure that the change would not compromise safety.\n? A pre-startup review is also completed after a major change and prior to a new process coming on line.  \n? A hot work (spark producing) permit program is in place. \n? Contractors who are hired to work on or near the regulated processes must have adequate training on the hazards prior to starting work. \n? The Caldwell facility has an ammonia alarm system that notifies refrigeration system operators and security staff of a potential release, which allows for rapid response minimizing the duration of accidental releases. \n\nFive Year Accident History:\nOffsite consequence analyses need to consider the release history of each process.  In the past five years"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 44266,
      "SummaryText": ", the ammonia refrigeration system has not had releases that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage (i.e. no reportable accidents as defined in 40 CFR Part 68.42).  \n\n\n\nEmergency Response Program:\nThis facility's emergency response program is based on the OSHA requirements for Emergency Action Plans (29 CFR 1910.38 and 1910.119) and HAZWOPER (29 CFR 1910.120).  We have trained employees for emergency response and maintain a written emergency response plan.  This plan is coordinated with the Local Emergency Planning Committee (LEPC) and the local fire department.  We conduct annual drills for implementation of the emergency response plan at the facility.  \n\nRM Program Reporting:\nThe timely submittal of the RMP*Submit program meets the RM program reporting requirements.  The J.R. Simplot Caldwell facility will update this submittal every five years, or sooner if necessary, based on RM program regulation requirements or process modifications."
    }
  ]
}