{
  "FacilityID": 44367,
  "FacilityName": "Clifton C. Williams Wastewater Treatment Facility",
  "FacilityStr1": "1600 Yend St",
  "FacilityStr2": null,
  "FacilityCity": "Mobile",
  "FacilityState": "AL",
  "FacilityZipCode": "36603",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01097",
  "LEPC": "Mobile County LEPC",
  "FacilityLatDecDegs": "30.660200",
  "FacilityLongDecDegs": "-088.036900",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": "www.mawss.com",
  "FacilityEmailAddress": "msims@mawss.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Mobile Area Water and Sewer System",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Mobile Area Water and Sewer System",
  "OperatorStr1": "P.O. Box 2368",
  "OperatorStr2": null,
  "OperatorCity": "Mobile",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36652",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000107467",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-05-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-12-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-11-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-11-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 30.66269,
  "FRS_Long": -88.03767,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 64047,
      "AltID": "Sewage Treatment Facility",
      "FacilityID": 44367,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 84727,
          "ProcessID": 64047,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 84728,
          "ProcessID": 64047,
          "ChemicalID": 49,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 65566,
          "ProcessID": 64047,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 23739,
              "Process_NAICS_ID": 65566,
              "SafetyReviewDate": "2005-03-28 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2005-03-28 00:00:00",
              "ChangeCompletionDate": "2005-09-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2005-11-01 00:00:00",
              "TrainingReviewDate": "2005-11-01 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2005-11-01 00:00:00",
              "EquipmentInspectionDate": "2005-11-28 00:00:00",
              "EquipmentTested": "Chlorinators, Sulfonators, Cl2/SO2 Detectors, Emergency Shut-off Valves, Scrubber System, General System Visual Inspection",
              "ComplianceAuditDate": "2005-01-19 00:00:00",
              "AuditCompletionDate": "2005-09-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "Wastewater Treatment Facility",
              "_chemicals": [
                {
                  "PrimaryKey": 24849,
                  "PreventionProgram2ID": 23739,
                  "ProcessChemicalID": 84727
                },
                {
                  "PrimaryKey": 24850,
                  "PreventionProgram2ID": 23739,
                  "ProcessChemicalID": 84728
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 44367,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Mobile Emergency Management",
    "CoordinatingAgencyPhone": "2514608000",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 44367,
      "SummaryText": "    Introduction\n\nUSEPA?s RMP regulation (40 CFR 68), published in the Federal Register on June 20, 1996, was developed to assist facilities in preventing accidental releases of highly toxic or flammable chemicals.  The RMP regulation applies to an owner or operator of a stationary source that has more than a threshold quantity of a regulated substance in a process, as determined under ?68.115.\n\nThe USEPA has established three tiers of requirements to reduce the level of effort for facilities with a lower risk of offsite impacts.  These tiers are known as Programs 1, 2, and 3.  Program 1 applies to any process that has not had an accidental release with prescribed offsite consequences for five years and has no public receptors impacted by a worst-case release. Program 3 applies to processes in specified industries, and to all processes subject to the OSHA PSM standard, unless the process is eligible for Program 1.  Program 2 applies to processes not covered by Programs 1 or 3.  The Clifton C. Williams Wastewater Treatment Plant (Williams Plant) processes do not meet the Program 1 criteria, are not subject to the OSHA PSM standard, and are not classified in any of the Program 3 NAICS codes; therefore, the facility is subject to Program 2 requirements.\n\nThis document comprises the Risk Management Program (RMP) plan for the Mobile Area Water and Sewer?s Systems (MAWSS) Clifton C. Williams Wastewater Treatment Facility (Williams Facility) located at 1600 Yeend Street, Mobile, Alabama  36603.  The RMP contains a description of all programs, procedures, practices, and provisions implemented by the facility to reduce the likelihood and/or severity of an acutely hazardous material and/or flammable material release or accident.  In addition, the RMP may recommend the implementation of additional measures, which may help to reduce the likelihood and/or severity of an acutely hazardous material and/or flammable material release or accident.  The following sections summarize the p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 44367,
      "SummaryText": "urpose, scope, and elements of this RMP.  Since the Williams Plant utilizes more than the threshold quantity of chlorine (2,500 pounds) in their process, the facility is required to submit an RMP as defined in ?68.150.  The initial RMP was submitted as required by June 21, 1999.  To comply with the five-year update requirement, the offsite consequence analyses have been reviewed to determine whether the parameters and assumptions used are still valid and to make any necessary changes to update the RMP. \n\n    ?68.155(a) Accidental Release and Emergency Response Policies\n\nIn order to ensure the safety of the Williams Plant chlorination system, the facility depends on the commitment and team effort of its employees and suppliers. \n\nThe Williams Plant has established procedures to ensure the integrity of the chlorination systems and minimize the potential for releases.  Standard protocols have been established for items such as system operations, maintenance, training, and incident investigation. \n\nThe Williams facility has a minimum of two (2) and a maximum of thirty-eight (38) employees on duty at any given time.  Daily inspections of the areas storing and/or using chlorine and sulfur dioxide are conducted by the facility employees.  The area that stores the one-ton cylinders of chlorine and sulfur dioxide is actively connected to the process is fully enclosed and is equipped with chlorine and sulfur dioxide leak detection system that will automatically activate the scrubber system if a chlorine or sulfur dioxide concentration of three (3) ppm or greater is detected.  In addition, MAWSS has installed emergency valve actuators on the chlorine and sulfur dioxide cylinders, which will shut off flow from the cylinders within 1.5 seconds after detecting a leak.\n\nIn the event a significant release occurs, the Mobile County Emergency Management Agency (MCEMA) would be notified immediately to respond.  The MCEMA would dispatch experienced HAZMAT personnel trained to handle such "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 44367,
      "SummaryText": "situations.\n\n    ?68.155(b) Stationary Source and Substance Handled\n\n\n    ?68.155(c) Accidental Release Prevention \n\nAs required for Prevention Program 2 processes, one worst-case release analysis and one alternative release scenario, has been conducted.  In addition, emergency response activities have been coordinated with local responders, which is also required for Program 2 processes. Also as required, a program and document management system is in place.\n\nProgram 2 allows streamlined prevention program requirements; however implementation of the following elements are required: safety information, hazard review, operating procedures, training, maintenance, compliance audits and incident investigations. \n\nMalcolm Pirnie, Inc., with the assistance of Williams Plant management and staff familiar with the processes operation and maintenance, conducted a compliance audit as part of the RMP update in January 2005.  The results of this audit, in addition to recommendations made, are documented and are maintained as part of the RMP records.\n\nA hazard review of the chlorine system using the ?What-If? method was conducted by Malcolm Pirnie, Inc., with the assistance of Williams Plant management and staff familiar with the process? operation and maintenance, in March 2005.  The results of this review identified recommended changes in operating, maintenance, and other process safety management procedures that would improve the overall safety of the chlorine system.  The results of the hazard review, including recommendations for improvement in safety, are documented and are maintained as part of the RMP records.\n\n\n    ?68.155(d) Five-Year Accident History\n\nThe Williams Plant facility has had no accidental releases of chlorine in the last five years that have resulted in on-site injuries or off-site injuries or other off-site impacts.\n\n                \n    ?68.155(e) Emergency Response Program\n\nIf a release were to occur, Williams Plant employees would immediately contact the Mobile County Emergen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 44367,
      "SummaryText": "cy Management Agency (MCEMA), whose members are aware of the presence of chlorine at the facilities. The MCEMA would dispatch experienced HAZMAT personnel trained to respond to such emergencies. The emergency response procedures are outlined in the Mobile Area Water and Sewer System Emergency Action Plan. \n\nEmergency Shut-Off System\nEach cylinder in service is equipped with an automatic valve emergency shut-off system.  The emergency shut-off system is comprised of an electrically driven actuator that, in the event of a release, automatically closes the valve that allows the flow of chlorine and/or sulfur dioxide from the cylinder to its point-of-use.  The system also contains an emergency \"panic button\" located outside of the storage area to allow for operator-initiated emergency shut-off.\n\nShut-Off and Isolation Systems\nOther release prevention devices include equipment shutdown and isolation systems.  Flow control valves are placed at strategic locations to direct the flow of chlorine and/or sulfur dioxide depending upon plant operating conditions.  These flow control valves also serve to isolate portions of the system in the event of component malfunctions or line failure.\n\nRelease Containment Systems\nRelease Containment devices incorporated into the design of the plant are primarily for spill containment.  These containment provisions for the plant are described in the facility's Best Management Practices (BMP) Plan.  The containment system discussed below is primarily for mitigation of a chlorine release.\n\nContainment Systems\nThe chlorine and sulfur dioxide storage is located in an area that is not fully enclosed on all sides.  The chlorine and sulfur dioxide cylinders that are actively connected to the process is in an enclosed building to help mitigate the transport of any released chlorine by reducing the effects of wind.  \n\n    ?68.155(f) Safety Improvements\n\nRecommendations for safety improvements were identified in both the compliance audit and the Hazard R"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 44367,
      "SummaryText": "eview.  These recommendations, and target dates of implementation, are documented in the RMP."
    }
  ]
}