{
  "FacilityID": 44495,
  "FacilityName": "Yakima Fruit and Cold Storage",
  "FacilityStr1": "200 Frontage Road",
  "FacilityStr2": null,
  "FacilityCity": "Wapato",
  "FacilityState": "WA",
  "FacilityZipCode": "98951",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53077",
  "LEPC": "Yakima County LEPC",
  "FacilityLatDecDegs": "46.451667",
  "FacilityLongDecDegs": "-120.428889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3825932,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "John Raney",
  "OperatorStr1": "200 Frontage Road",
  "OperatorStr2": null,
  "OperatorCity": "Wapato",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98951",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Raney",
  "RMPTitle": "Plant Manager",
  "FTE": 165,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000171501",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2005-12-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-12-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-12-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-03-12 00:00:00",
  "DeRegistrationEffectiveDate": "2007-02-21 00:00:00",
  "AnniversaryDate": "2010-12-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 46.44268,
  "FRS_Long": -120.43028,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 64287,
      "AltID": "Refrigeration",
      "FacilityID": 44495,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 65819,
          "ProcessID": 64287,
          "NAICSCode": "115114",
          "_desc": {
            "NAICS_CODE": "115114",
            "NAICS_DESCRIPTION": "Postharvest Crop Activities (except Cotton Ginning)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 85072,
          "ProcessID": 64287,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 585072,
          "ProcessID": 64287,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 44495,
      "SummaryText": "Risk Management Plan for Yakima Fruit & Cold Storage Co.\n\nExecutive Summary\n\nThis is to inform all interested persons, including employees that Yakima Fruit & Cold Storage Co. is complying with OSHA?s Process Safety Management Standard (referred to as PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA?s Risk Management Program regulations (referred to as RMP) to deal with the risks involved with the storage, and handling of hazardous chemicals.  In this way we promote overall plant, worker, and public safety.  These programs enable our facility to prevent the occurrence, and minimize the consequences, of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.  Overall, these programs are intended to prevent accidental fatalities, injuries and illnesses, and avoid or at least greatly limit physical property damage.\n\nThe Yakima Fruit & Cold Storage Co. accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices.  Our safety programs prevent accidents because they focus on the rules, procedures, and practices, which govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary.  They are also communicated to, and accepted by all employees at the facility.\n\nOur emergency response policy involves the preparation of response plans, which are tailored to the individual situation encountered in our facility, and to the emergency response services available in the Wapato community.\n\nYakima Fruit & Cold Storage Co. operates a cold storage and fruit packing facility in Wapato, Washington.  The refrigeration for the facility is provided using ammonia as the refrigerant.  There are six (6) ammonia machine rooms that provide the refrigeration for the various portions of the facility.  The refrigerated areas consist of both Controlled Atmosphere, and Common Storage rooms.  The entire"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 44495,
      "SummaryText": " facility campus covers approximately 40 acres.  The facility is bordered on the north by Inland-Joseph Fruit Company; on the west by Highway 97; on the south by used car lot; and on the east by railroad tracks owned and operated by Burlington Northern.  The total ammonia inventory is approximately 35000 lbs.  The refrigeration system is both monitored and controlled by a computer system.  There is also ammonia detection monitoring of the refrigerated spaces and areas.  In case of an ammonia leak, an alarm is shown at the central computer, also via telephone to the refrigeration operator.  Supervisors, and the refrigeration operator visit the facility daily, and respond to any trouble alarms, which might occur.\n\nWorse case scenario.\nFailure of one of the system high pressure receivers, containing approximately 4140 lbs.of ammonia with the receiver quantity limited to this amount by facility procedures resulting in a ten minute release.  Using the ALOHA program, under the worse-case weather conditions, ammonia could travel approximately 553 yards before dispersing enough to no longer pose a hazard to the public.\n\nThis scenario is unlikely for the following reasons:\nThe vessel is enclosed in a building that would withstand and help to contain such a release.\nIndustry standards for the manufacture and quality control of pressure vessels.\nAmmonia is not corrosive in this service.\nPressure safety valves limit operating pressure in this vessel.\nThe pressure producing equipment in the system have high-pressure safety cutouts to stop the equipment if the pressure is above the desire level.\nThe computer control system would give an alarm if pressure were above a set limit.\nThe computer control system would unload or stop the pressure produce (compressors) in the system.\nThe accident prevention program in place at the facility including the mechanical integrity program for regular maintenance, inspection and testing, and replacement of equipment, if necessary.\nAlarms and auto"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 44495,
      "SummaryText": "-dialing system in place to warn operating personnel of process upsets.\nEmergency action plan in place at the facility.\n\nAlternate release scenario:\nFailure of an oil drain valve on the drop leg of a surge drum for one of the cold storage rooms resulting in a release of approximately 176 lbs. of ammonia over a time period of 4 minutes.  Under common weather conditions, ammonia could travel 312 yards before dispersing enough to no longer pose a hazard to the public.\n\nThis scenario is unlikely for the following reasons:\nThe vessel is enclosed in a building that would withstand and help to contain such a release.\nThe oil drain valves are in locations that would be extremely difficult to be hit by any type of moving equipment.\nThe facility accident prevention program in place at the facility including operating procedures on proper operation of an oil drain valve.\nMechanical integrity program for regular maintenance, inspection and testing, and replacement of equipment, if necessary.\nEmergency action plan in place at the facility.\n\nThere have been no accidental releases of ammonia in the past five years at the Yakima Fruit & Cold Storage Co. facility in Wapato, Washington.\n\nThis facility?s emergency action program is based on the OSHA requirements for Emergency Action Plans (29 CFR 1910.38 and 1910.119).  We have trained employees for carrying out all parts of the emergency action, and maintain a written emergency action plan.  This plan is coordinated with the local fire department.  We conduct annual drills for implementation of the emergency action plan at the facility with the participation of the local fire department."
    }
  ]
}