{
  "FacilityID": 44636,
  "FacilityName": "Eval Company of America",
  "FacilityStr1": "11500 Bay Area Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Pasadena",
  "FacilityState": "TX",
  "FacilityZipCode": "77507",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-La Porte",
  "FacilityLatDecDegs": "29.620700",
  "FacilityLongDecDegs": "-095.043500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 618545214,
  "ParentCompanyName": "Kuraray American Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Nobuya Tomita",
  "OperatorStr1": "11500 Bay Area Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Pasadena",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77507",
  "OperatorZipCodeExt": null,
  "RMPContact": "Nobuya Tomita",
  "RMPTitle": "President",
  "FTE": 72,
  "OtherEPAFacilityID": "TXD981148059",
  "EPAFacilityID": "100000051356",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-01561",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-01-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-01-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-01-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 29.61534,
  "FRS_Long": -95.04235,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 64499,
      "AltID": null,
      "FacilityID": 44636,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 66034,
          "ProcessID": 64499,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 85339,
          "ProcessID": 64499,
          "ChemicalID": 29,
          "Quantity": 830000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 585339,
          "ProcessID": 64499,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 64500,
      "AltID": null,
      "FacilityID": 44636,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 66035,
          "ProcessID": 64500,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 85340,
          "ProcessID": 64500,
          "ChemicalID": 95,
          "Quantity": 13486.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 95,
            "ChemicalName": "Ethylene  [Ethene]",
            "CASNumber": "74-85-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 585340,
          "ProcessID": 64500,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 44636,
      "SummaryText": "\nEXECUTIVE SUMMARY (40 CFR ? 68.155)\n\nEVALCA?s environmental health and safety program includes policies, procedures, standards and guidance materials designed to fulfill EVALCA?s commitment to the environment, safety and health of employees and the community. These materials include Risk Management Program (RMP) guidance to help the facility prevent and/or reduce the risk of accidents.\n\nThe Risk Management Plans summarizes the management, administrative, procedural, and technological controls that, when integrated; minimize public risk of hazardous chemical release exposure.  The plan summary is organized to correspond with specific EPA RMP definitions and requirements.\n\nOverall responsibility for all the facility activities, including Risk Management Program activities, lies with the Plant Manager.  The Plant Manager has delegated the following responsibilities:\n\n?RMP hazard assessment and document control to the Environmental Manager.\n?Implementation of the RMP prevention program to the Technology Manager.\n?Development & maintenance of the RMP emergency response program to the Human Resources Safety Manager.\n?Training and communication of RMP related matters to the Maintenance & Production Manager.\n\nMore specific responsibilities are delegated to other staff positions as detailed in the Plant Emergency Plan.\n\nAccidental Release Prevention and emergency response policies at the stationary source 40 CFR ? 68.155 (a):\n\nEVALCA is committed to conducting its operation in a safe, responsible manner and reducing risks to health and the environment. Compliance with all applicable legal requirements is mandatory and considered essential to upholding the company?s commitment. EVALCA?s Environmental, Health and Safety programs include policies, procedures, standards and guidance materials designed to minimize the potential for an accidental release. \n\nThe stationary source and regulated substances handled 40 CFR ? 68.155(b):\n\nEVALCA, located in Pasadena, Texas, manufactures"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 44636,
      "SummaryText": " ethylene vinyl alcohol copolymer in a continuous chemical reaction process.  Ethylene vinyl alcohol copolymer is used in the manufacture of consumer goods packaging such as: laundry detergent bottles, ketchup bottles, and plastic lined boxes like those used for drink boxes.\n\nAs part of this production process, two RMP regulated substances are utilized at EVALCA. Based on applicable volumes maintained at the facility, vinyl acetate monomer is a listed toxic material and ethylene is a listed flammable material. \n\nAccidental release prevention program and chemical-specific steps 40 CFR 68.155(d):\n\nIn general, EVALCA has implemented numerous steps to minimize the potential of a release of any chemical on site. All storage tanks are located within diked areas; truck-unloading facilities have been replaced by direct pipeline feeds, which are equipped with low-pressure alarms and automated shut-off valves.  Furthermore, all of the process areas at this facility regulated by the EPA Risk Management Program regulation are also subject to the OSHA Process Safety Management (PSM) standard.  Processes containing materials that are subject to the EPA RMP Rule have been incorporated into the existing OSHA PSM program, resulting in a program that is in compliance with both the OSHA and EPA regulations.  Specific elements of this program include the following:\n\n?    Employee Participation in process safety management and accident prevention,\n?    Process Safety Information,\n?    Process Hazards Analysis (PHA),\n?    Documented Operating Procedures,\n?    Training Programs for all Employees,\n?    Contractor Requirements and Training,\n?    Pre-startup Reviews,\n?    Mechanical Integrity and Quality Assurance Programs,\n?    Management of Change Process,\n?    Incident Investigation,\n?    Compliance Audits, and\n?    Safe Work Practices.\n\nFive-year accident history 40 CFR ? 68.155 (e):\n\nEVALCA has an excellent accident prevention record.  Over the past 5 years at this facility, there have been no incidents involving vinyl ac"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 44636,
      "SummaryText": "etate monomer or ethylene which have resulted in death, injuries, or property damage onsite or known offsite deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.  In fact there have been no incidents of this type in the life of the facility.\n\n40 CFR ? 68.155 (f)    Emergency response program:\n\nEVALCA?s emergency response program is compliant with the OSHA 29 CFR ? 1910.38 standards, as well as meeting the RMP requirements. The emergency response plan includes procedures for notifying the local fire authority and any potentially affected neighbors and has been coordinated with local agencies.\n\nEVALCA maintains a written emergency response program to protect workers and the general public as well as the environment. The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address all aspects of emergency response, including proper first aid, medical treatment for exposure, evacuation plans, accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post incident cleanup and decontamination requirements.  The emergency response program is updated when additional process units are brought on line or when modifications are made to an existing process unit. When the emergency response program is updated, employees are informed of the changes and trained appropriately through the management of change (MOC) process.\n\nPlanned changes to improve safety 40 CFR ? 68.155 (g):\n\nChemical Safety is an integral part of the working culture at EVALCA, as demonstrated through our outstanding safety record. Reducing the risk of potential chemical exposure to the employees and the community requires a continuous effort. EVALCA is committed to resolving any and all findings from Process Hazard Analyses or other auditing techniques. "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 44636,
      "SummaryText": "EVALCA is committed to its continued success in conducting future safety improvements and establishing the highest levels of safety and environmental compliance in the workplace."
    }
  ]
}