{
  "FacilityID": 44668,
  "FacilityName": "Innovene Polypropylene LLC",
  "FacilityStr1": "2384 East 223rd Street",
  "FacilityStr2": null,
  "FacilityCity": "Carson",
  "FacilityState": "CA",
  "FacilityZipCode": "97045",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.818528",
  "FacilityLongDecDegs": "-118.235500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "BP America",
  "Company2Name": "Innovene Polypropylene LLC",
  "CompanyDUNS": 39596507,
  "Company2DUNS": 81782583,
  "OperatorName": "Innovene Polypropylene LLC",
  "OperatorStr1": "2384 East 223rd Street",
  "OperatorStr2": null,
  "OperatorCity": "Carson",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90810",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert Cranmer",
  "RMPTitle": "HSSE Manager",
  "FTE": 40,
  "OtherEPAFacilityID": "CAR000071761",
  "EPAFacilityID": "100000194103",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "(Not Yet Issued",
  "SafetyInspectionDate": "2005-06-06 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-01-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-01-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-01-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-01-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 64537,
      "AltID": "Polypropylene",
      "FacilityID": 44668,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 66072,
          "ProcessID": 64537,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 85391,
          "ProcessID": 64537,
          "ChemicalID": 155,
          "Quantity": 153047.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 65817,
              "ProcessChemicalID": 85391,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 65818,
              "ProcessChemicalID": 85391,
              "ChemicalID": 129,
              "_chemical": {
                "ChemicalID": 129,
                "ChemicalName": "Propylene  [1-Propene]",
                "CASNumber": "115-07-1",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 585391,
          "ProcessID": 64537,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 44668,
      "SummaryText": "This executive summary provides an overview of Innovene Polypropylene LLC?s program to comply with the U.S. EPA?s Risk Management Plan (RMP) and the California Accidental Release Prevention Plan (CalARP).\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nProtecting our employees, neighbors, and the environment is the top priority for Innovene Polypropylene LLC.  Conducting business in a manner that wins public confidence and meets the environmental and economic needs of the communities we serve is critical to our long-term success. This commitment is demonstrated by the resources invested in accident prevention, including the design, construction, operation and maintenance of our facilities, as well as in the training or our employees. Our policy is to implement the necessary controls to prevent foreseeable releases of regulated substances. If a release does occur, trained personnel will respond to control and contain the release, thereby reducing potential impact on the surrounding community.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nInnovene Polypropylene, LLC is co-located with the BP Carson Refinery in the city of Carson, California. The Innovene site employs approximately 40 people.  The innovene plant processes propylene gas from the BP Carson Refinery to make polypropylene.  The site has been manufacturing polypropylene since 1999 and has capacity for storage in excess of 25 million pounds; the site produces more than 450 million pounds of product per year.  \n\nThe Innovene site has one covered process, a flammable mixture of propane and propylene.  \n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe following is a summary of the general accident prevention program in place at the Innovene Polypropylene LLC site.  This summary addresses each of the OSHA PSM elements and describes the management systems in place to implement the accident prevention program.\n\nEmployee Participation\n\nThe Innovene site provides for and encourages"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 44668,
      "SummaryText": " employees to participate in all facets of process safety management and accident prevention. Examples of employee participation range from updating and compiling technical documents and operating procedures to participating as a member of process hazard analysis (PHA) and incident investigation teams. Employees have access to all PSM-related information per an internal document control process.  Innovene has a number of programs underway that address employee safety issues.  Innovene employees have also received training to enable them to observe fellow employees in order to identify and correct behaviors that may lead to accident or injury.  Other means by which employees are involved in the accident prevention program are documented in written programs maintained at the facility.\n\nProcess Safety Information\n\nThe Innovene Polypropylene LLC site maintains extensive documentation that is used to help maintain safe operation of the production process. This documentation addresses chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design information. \n\nChemical specific information, including exposure hazards and emergency response information is provided in material safety data sheets (MSDS). This information is supplemented by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals. For specific process areas, safety-related limits for specific process parameters (e.g., temperature, level, composition) are documented. Innovene ensures that the process is maintained within these limits using process controls and monitoring instruments, highly trained personnel, and protective instrument systems (e.g. automated shutdown systems).\n\nInnovene also maintains documentation that provides information about the design and construction of process equipment. This information includes materials of construction, design pressure"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 44668,
      "SummaryText": " and temperature ratings, electrical rating of equipment, etc. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\nProcess Hazard Analysis\n\nInnovene Polypropylene LLC has a program to help ensure that hazards associated with the polypropylene process are identified and controlled. The polypropylene process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards. The site uses the HAZOP (hazard and operability) analysis method and other approved Process Hazard Analysis methods to perform these evaluations.\n\nThe analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise. The hazards of the process, identification of previous incidents involving accidental release or potential for such, engineering and administrative controls and failure of such, and human factors will be addressed by the team performing the hazard analysis. The findings and recommendations of the team are submitted to area management to assess the likelihood of the potential hazards, assess the severity of the consequences from potential releases, and assign priority for implementation of recommendations. The recommendations and progress towards implementation is followed using a computerized tracking system. The final resolution of findings are documented and retained.\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, Innovene periodically updates and revalidates the hazard analysis results. These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer in operation. The results and f"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 44668,
      "SummaryText": "indings from these updates are documented and retained.\n\nOperating Procedures\n\nThe site maintains written procedures that address various modes of process operations, such as 1) unit startup, 2) normal operations, 3) temporary operations, 4) unit emergencies and emergency shutdown, 5) normal shutdown, and 6) initial startup of a new process.  The operating procedures are available to employees working in or near the covered process area.  The operating procedures are reviewed by supervision before scheduled activities (e.g. scheduled start-ups and shutdowns, scheduled on-line maintenance) are completed and when supervision believes that the current procedure should be modified to better execute the planned activities.  Critical procedures such as unit emergency procedures are reviewed annually during annual training sessions.\n\nTraining\n\nInnovene Polypropylene LLC has implemented a comprehensive training program for all employees involved in operating or maintaining the covered process.  Initial training includes health and safety training, an overview of the covered process, and process fundamentals.  Job specific training is also given to operators assigned to an operating unit. This training includes specific safety and health hazards, emergency operations including shutdown, and safe work practices applicable to the operator?s job tasks.\n\nJob specific training includes on-the-job training, a written manual, written tests, observations, and written sign-off. The site also has ongoing refresher and supplemental training for all personnel. Testing is conducted for all job specific training. Once an operator is qualified in a position, they are required to recertify for the job every three years. Testing is conducted on all OSHA-required safety and health training. Employee training and certification records are documented.\n\nContractors\n\nInnovene Polypropylene LLC uses contractors to supplement its work force during periods of increased maintenance or construction ac"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 44668,
      "SummaryText": "tivities, or to perform tasks requiring skills that are needed on a non-routine basis. Because some contractors work on or near process equipment, the site has procedures in place to ensure that contractors 1) perform their work in a safe manner, 2) have the appropriate knowledge and skills, 3) are aware of the hazards in their workplace, 4) understand what they should do in the event of an emergency, 5) understand and follow site safety rules, and 6) inform personnel of any hazards that they find during their work. This is accomplished by providing contractors with a process overview, information about site safety and health hazards, emergency response plan requirements, and safe work practices prior to their beginning work. Additionally, all contractors that work on site must have completed an orientation training that provides a standardized baseline of safety and health training for all contractors.  Recertification to demonstrate knowledge of the required subject areas is required every two years. In addition, the site evaluates contractor safety programs and performance as one of the key criteria for selection of a contractor to perform work. Site personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\n\nPre-Startup Safety Reviews\n\nA pre-startup safety review is conducted at the site for any new/modified facilities where modification necessitates a change in the process safety information. The pre-startup review is used to confirm that prior to the introduction of hazardous materials to a process, the following take place: 1) construction and modification are in accordance with design specifications and applicable codes; 2) safety, operating, maintenance, and emergency procedures are in place and adequate; 3) training of each operating employee and maintenance worker has been completed; and 4) process hazard analysis recommendations have been resolved or actions necessary for startup have been co"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 44668,
      "SummaryText": "mpleted. The review uses checklists to verify all aspects of readiness, and involves field verification of construction where necessary.\n\nMechanical Integrity\n\nThe Innovene site has well-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include: 1) written procedures to maintain ongoing integrity of process equipment, including methods to allow employee identification and reporting of mechanical integrity problems; 2) inspection and testing, including correction of deficiencies; 3) employee training; and 4) quality assurance.\n\nThe site has an extensive inspection and testing program. The frequency of inspections is based on historical corrosion rate. The site uses a database program that analyzes corrosion data from equipment and determines their corrosion rates. These rates, together with industry standards or codes are used to determine frequency of inspections.  Inspectors have certification in the appropriate performance area, and written documentation is maintained for both the administrative and technical procedures.  Inspection deficiencies are documented, and the status of each inspection and repair completion is tracked until the issue is resolved, implemented, and closed.\n\nThe site incorporates quality assurance measures into equipment purchases and repairs as part of the mechanical integrity program.  Procedures are in place to ensure that new pressure vessels, piping systems, instrumentation and control equipment, including spare parts are: 1) modified, repaired or fabricated to meet applicable codes; 2) meet design specifications and applicable codes; and 3) are inspected and checked for proper installation and consistency with specifications and manufacturer? instructions.  \n\nSafe Work Permits\n\nThe site has long-standing safe work practices in place to help ensure work"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 44668,
      "SummaryText": "er and process safety. Examples include 1) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance; 2) a permit and procedure to control spark-producing activities (hot work permit); 3) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space; and 4) a procedure for safe removal of hazardous materials before process piping or equipment is opened. These and other safety procedures, along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\n\nManagement of Change\n\nThe site has a thorough system to manage changes to the covered process. This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to ensure that adequate controls are in place to manage any new hazards and to verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes. In addition, operating and maintenance personnel are provided any necessary training on the change.\n\nIncident Investigation\n\nInnovene Polypropylene LLC promptly investigates all incidents that resulted in, or reasonably could have resulted in personal injury, spills, fire/explosion, release of a toxic or flammable material, major property damage, or environmental damage. The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to management for resolution. Corrective actions taken in response to the in"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 44668,
      "SummaryText": "vestigation team?s findings and recommendations are documented and tracked to completion. The investigation results are reviewed with all employees (including contractors) who could be affected by the findings. Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHA?s and PHA revalidations.\n\nCompliance Audits\n\nTo help ensure that the accident prevention program is functioning properly, audits of the PSM and RMP program are conducted at least every three years to determine whether the procedures and practices required by the accident prevention program are being implemented.  The audit team develops findings that are forwarded to management for resolution.  Corrective actions taken in response to the audit team?s findings are tracked until they are complete.  The final resolution of each finding is documented, and audit reports are maintained for review in subsequent audits.\n\nCHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe accident prevention program is applied to the covered process at the Innovene Polypropylene site.  These prevention program activities help prevent potential accident scenarios that could be caused by equipment failures or human error. In addition to these prevention program activities, the site has safety features on many units to help 1) contain/control a release, 2) quickly detect a release, and 3) reduce the consequences of a release. The following types of safety features are used in various processes:\n\nRelease Detection\n?Hydrocarbon detectors with alarms\n\nRelease Containment/Control\n?Pressure relief valves \n?Valves to permit isolation of the process (manual and automatic)\n?Automated shutdown systems for specific process parameters (e.g., high level, high temperature\n?Redundant equipment and instrumentation\n\nRelease Mitigation\n?Fire suppression and extinguishing systems\n?Trained emergency response personnel\n?Personal protective equipment (protective clothing, self -contained breathing appa"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 44668,
      "SummaryText": "ratus)\n\nFIVE YEAR ACCIDENT HISTORY\n\nThe Innovene Polypropylene site has an excellent record of accident prevention over the past 5 years. Due to proactive efforts to prevent accidents and a strong safety program, there have been no incidents in the past 5 years with onsite or offsite effects involving a release of a regulated flammable material that meet the reporting criteria of the EPA RMP or Cal-ARP Rules. \n\nEMERGENCY RESPONSE PROGRAM\n\nInnovene Polypropylene LLC has an Emergency Response Plan in place to protect worker and public safety as well as the environment.  The Emergency Response Team for the Innovene site is comprised of Innovene and Carson Refinery employees, with Innovene members taking the lead roles for incidents pertaining to their own site.  Team members wear dual hats ? both operations and first response ? for emergencies that occur on site.  Innovene management staff also has responsibilities under the Emergency Operations Center activities.  Resonse team members receive training in the emergency response procedures as necessary to perform their specific duties. The plan is updated when necessary, based on modifications made to the process or site.  The overall emergency response plan for the site is coordinated with the Los Angeles County Fire Department. \n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nInnovene Polypropylene LLC is committed to operating excellence in the way we conduct our business and the way we relate to the environment. The company has implemented a system that provides a mechanism for self-assessment and a direction for continuous improvement within our operations."
    }
  ]
}