{
  "FacilityID": 44729,
  "FacilityName": "INEOS Phenol, a division on INEOS Americas LLC",
  "FacilityStr1": "2001 S. Gulfway Drive",
  "FacilityStr2": null,
  "FacilityCity": "Port Arthur",
  "FacilityState": "TX",
  "FacilityZipCode": "77640",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48245",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "29.997222",
  "FacilityLongDecDegs": "-093.973333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.ineosphenol.com",
  "FacilityEmailAddress": "jed.dowdy@ineosphenol.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "INEOS Americas LLC",
  "Company2Name": null,
  "CompanyDUNS": 8188117,
  "Company2DUNS": 0,
  "OperatorName": "INEOS Americas, LLC",
  "OperatorStr1": "7770 Rangeline Road",
  "OperatorStr2": null,
  "OperatorCity": "Theodore",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36582",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jed Dowdy",
  "RMPTitle": "ESH Engineer",
  "FTE": 21,
  "OtherEPAFacilityID": "TXR000065730",
  "EPAFacilityID": "100000194185",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "NA",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-01-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-01-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-01-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-01-04 00:00:00",
  "DeRegistrationEffectiveDate": "2010-12-30 00:00:00",
  "AnniversaryDate": "2011-01-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 64606,
      "AltID": "Cumene Manufacturing",
      "FacilityID": 44729,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 66147,
          "ProcessID": 64606,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 85483,
          "ProcessID": 64606,
          "ChemicalID": 98,
          "Quantity": 59000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 85484,
          "ProcessID": 64606,
          "ChemicalID": 129,
          "Quantity": 31000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 129,
            "ChemicalName": "Propylene  [1-Propene]",
            "CASNumber": "115-07-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 585483,
          "ProcessID": 64606,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 585484,
          "ProcessID": 64606,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 44729,
      "SummaryText": "INEOS Phenol, a division of INEOS Americas, LLC operates a Cumene manufacturing unit located at 2001 S. Gulfway Dr in Port Arthur, Texas within the existing Chevron Phillips Chemical Company site.  The INEOS Phenol commitment to the safety of its employees and contractors is unprecedented in the chemical industry.  This commitment is best described in the INEOS Phenol Safety Policy listed below:\n\n?The safety and health of INEOS Phenol employees and contractors will be given prime consideration in all INEOS Phenol operations and activities.  In order to protect employees and contractors from suffering and hardship caused by injuries, it is the policy of INEOS Phenol to promote safe working practices and maintain a safe working environment through effective accident prevention programs.  INEOS Phenol management commits to provide adequate training, equipment, planning, and supervision, along with safe and secure working conditions.  The company further recognizes that GOOD COMMUNICATIONS is necessary to reach our safety goals.\n\nINEOS Phenol commits itself to:\n\n1.    To providing a safe place of employment, institute controls against property loss, and reduce production interruptions caused by accidents.\n2.    To promote safe work practices through employee education, job training, establishment and enforcement of safety rules.\n3.    To plan safety as an integral part of each operation and manufacturing process.\n4.    To provide a secure work environment by providing security systems to protect the workplace from unauthorized persons or intrusions.\n5.    To comply with applicable federal, state, and local safety regulations, codes, and accepted industry practices.\n\nIn order to ensure a safe working environment, each employee and contractor must take a willing active interest in his or her personal safety, the safety of fellow employees, and the safety of equipment provided for use.  Each employee or contractor must commit to:\n\n1.    Participation in the proper use and care of company fa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 44729,
      "SummaryText": "cilities and personal protective equipment.\n2.    Observing and abiding by safety rules, procedures, and commonly recognized safety practices.\n3.    Promoting a clean and healthy work environment through good housekeeping and hygiene.\n4.    Reporting all unsafe conditions and practices immediately to your supervisor so the condition or practice can be corrected.\n\nThe ultimate success of our safety program depends on the sincere, constant, and cooperative efforts of every employee in our organization.?\n\nRobert Luiten\nChief Opeating Officer\nINEOS Phenol\n\nThe INEOS Phenol Port Arthur facility manufactures the synthetic organic chemical cumene.  The manufacturing activity involves a polypropylene/propane feed stream, two subject flammable materials in excess of reportable quantities,  to covert benzene to cumene.  During the manufacturing process, all of the propylene from the mixture is consumed during the conversion step.  The propane is then provided to an adjacent industry for use in their manufacturing operations. \n\nThe INEOS Phenol Port Arthur facility employs approximately twenty-one full-time employees, with a minimum of four employees present at all times .  Daily inspections of the areas containing subject chemicals are conducted by the facility employees.  In addition, the production area is equipped with a perimeter monitoring/detection system, which alarms if a flammable concentration of subject chemicals is detected. \n\nINEOS Phenol uses a layered approach to minimize the likelihood of an accidental release occurring at its Port Arthur facility.  The approach utilizes a combination of technology, skilled personnel, and compliance with federal, state, and local regulations, codes, and standards in the release prevention program.  This consists of installing a ?state of the art? distributive control system (DCS) and emergency shutdown system (ESD), complying with the Occupational Safety and Health Administration?s (OSHA) Process Safety Management (PSM) requirements, a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 44729,
      "SummaryText": "nd providing both an intense and thorough training program for all operations personnel.  \n\nIn preparation of the Risk Management Plan (RMP), both worse-case and alternative scenarios were considered.  Under worse-case scenario conditions, a catastrophic event would have to occur releasing the entire content, the flammable material propane, from a pressurized system resulting in a subsequent vapor cloud explosion.  The radius of the potentially impacted surrounding area from this scenario would not affect any off-site receptors or residential areas.  This scenario is highly improbable and did not consider any mitigation system present during the release.\n\nA more probable release event would occur if a process line containing a flammable mixture developed a leak, which resulted in a subsequent vapor cloud fire event.  This scenario was the alternative scenario considered in the development of the Risk Management Plan.  This release event would not have a potential impact to any off-site receptors or residential areas.  This scenario did not consider any mitigation system present during the release.\n\nThe INEOS Phenol Port Arthur facility has not had an accidental release of regulated chemicals in the last five (5) years.\n\nIn the event a significant release occurs, the site Emergency Response Team, comprised of employees of  INEOS Phenol and Chevron Phillips Chemical Company, would be notified immediately to respond.  In the event outside services are required, coordination with the Port Arthur fire department and Jefferson County Local Emergency Planning Committee will be made.\n\nINEOS Phenol is committed to continuous improvement of its safety program.  By conducting regular safety training classes, performing routing process hazard analysis (PHA), and implementing advanced safety programs, INEOS Phenol is focused on continual improvement of the overall safety culture for its employees and contractors."
    }
  ]
}