{
  "FacilityID": 44735,
  "FacilityName": "Archer Daniels Midland Company Loc-401",
  "FacilityStr1": "1 Edmund Street",
  "FacilityStr2": null,
  "FacilityCity": "Peoria",
  "FacilityState": "IL",
  "FacilityZipCode": "61602",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17143",
  "LEPC": "Peoria County LEPC",
  "FacilityLatDecDegs": "40.675583",
  "FacilityLongDecDegs": "-089.607194",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 38412078,
  "ParentCompanyName": "Archer Daniels Midland Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Archer Daniels Midland Company",
  "OperatorStr1": "4666 Faries Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Decatur",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62526",
  "OperatorZipCodeExt": null,
  "RMPContact": "Derek Badgerow",
  "RMPTitle": "Environmental Supervisor",
  "FTE": 190,
  "OtherEPAFacilityID": "ILD038412078",
  "EPAFacilityID": "100000194194",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "96030039",
  "SafetyInspectionDate": "1997-07-20 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-01-23 00:00:00",
  "ErrorReportDate": "2006-01-23 00:00:00",
  "ReceiptDate": "2006-01-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-01-20 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-01-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 64612,
      "AltID": "Fuel Alcohol Loadout",
      "FacilityID": 44735,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 66153,
          "ProcessID": 64612,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 85491,
          "ProcessID": 64612,
          "ChemicalID": 125,
          "Quantity": 116400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 585491,
          "ProcessID": 64612,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 44735,
      "SummaryText": "A.    It is the policy of Archer Daniels Midland Company (ADM) Corn Processing Facility, Peoria, Illinois to implement the requirements of the Risk Management Program (RMP) in accordance with the USEPA regulations under 40 CFR Part 68.  The objective is to prevent an explosion/fire or release to minimize the potential impact to ADM?s employees, the public, and the environment.  This objective will be accomplished by utilizing good operating procedures, maintaining a preventative maintenance program, providing appropriate training to employees, and coordinating response activities, as necessary with the Peoria Fire Department.\n\nB.    Stationary source and regulated substances handled.  This facility consists of a Corn Wet Milling plant that processes corn into value products such as fuel ethanol and dry specialty products along with a Cogeneration facility that supplies the facility?s energy requirements.\n\nIn this Risk Management Plan, ADM is included programs for its denaturant used in the production of fuel ethanol.  The denaturant (natural gasoline) used at the facility has a National Fire Protection Association (NFPA) flammability hazard rating of less that 4 and is exempt from the RMP according to 40 CFR 68.115(b)(2).  However, due to the potential variability in the makeup of this additive, it is possible that ADM could receive material that has a flammability rating of 4.  Therefore, ADM has included provisions in the Risk Management Plan for managing the denaturant as a precautionary measure.\n\nTherefore, the regulated substance used at this facility is pentane (n-pentane and 1-pentane).  n-pentane and 1-pentane are components of the natural gasoline used in the denaturant for fuel ethanol production.\n\nC.    Off-Site consequence analysis.  To perform the required offsite consequence analysis, ADM used RMP*Comp Version 1.07 and Aloha Version 5.3 provided by the EPA.  Aloha was used to model the liquid release rate in the alternate scenario, while RMP*Comp was used to es"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 44735,
      "SummaryText": "timate the distance to the endpoint.\n\nWorst-Case Scenario for flammable substances.  For multiple flammable substances subject to Program 2 requirements, the EPA requires that a worst-case scenario be evaluated for the flammable substance estimated to create the greatest distance in any direction to an endpoint.  The worst-case scenario for substances that are normally liquids at ambient temperature assumes that the single largest container fails catastrophically and the entire contents are released.  The worst-case scenario for this facility involves a catastrophic release from a denaturant (natural gasoline) storage tank, resulting in a vapor cloud explosion (endpoint is overpressure of 1 pound per square inch).  Safe handling procedures, control devices, and work practices make this scenario extremely unlikely.\n\nA more realistic release scenario involving n-pentane and 1-pentane would be a break in the line supplying liquid denaturant from the storage tank to the process, or a storage tank leak.\n\nD.    Accidental release prevention. The key concepts in this facility?s prevention program are the elements of the EPA?s Risk Management Program Level 2 requirements, which this facility is subject to.  These concepts include safety information, hazard review, operating procedures, training, maintenance, compliance audits, and incident investigation.\n\nE.    Five-Year accident history.  This facility has not had any accident involving pentane that requires reporting under EPA?s Risk Management Rule.\n\nF.    Emergency Response Program.  Emergency response at this facility is coordinated with ADM and the Peoria Fire Department, so that in the event of an accident, immediate response measures will be implemented.  This facility maintains a written Emergency Action Plan, which addresses response to accidental releases of hazardous materials.\n\nG.    Planned Changes to Improve Safety.  Based upon the Hazard Review and the PHA process, a new pump is planned on being added to eliminate the n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 44735,
      "SummaryText": "eed for denaturant trucks to be running in order to operate their pump.  ADM plans on installing a pump, suitable for the hazardous environment, to further remove any potential by eliminating a gasoline/diesel engine from running durning the tank filling process."
    }
  ]
}