{
  "FacilityID": 4489,
  "FacilityName": "CITY OF ALCOA, TENNESSEE WATER TREATMENT PLANT",
  "FacilityStr1": "301 SAM HOUSTON SCHOOL ROAD",
  "FacilityStr2": null,
  "FacilityCity": "MARYVILLE",
  "FacilityState": "TN",
  "FacilityZipCode": "37801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47009",
  "LEPC": "Blount County LEPC",
  "FacilityLatDecDegs": "35.808889",
  "FacilityLongDecDegs": "-83.926667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "P5",
  "LatLongDescription": "IP",
  "FacilityURL": "WWW.CI.ALCOA.TN.US",
  "FacilityEmailAddress": "FPLANT@CI.ALCOA.TN.US",
  "FacilityDUNS": 0,
  "ParentCompanyName": "CITY OF ALCOA, TENNESSEE",
  "Company2Name": null,
  "CompanyDUNS": 71531073,
  "Company2DUNS": 0,
  "OperatorName": "CITY OF ALCOA, TENNESSEE",
  "OperatorStr1": "441 NORTH HALL ROAD",
  "OperatorStr2": null,
  "OperatorCity": "ALCOA",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37701",
  "OperatorZipCodeExt": null,
  "RMPContact": "KEN REYNOLDS",
  "RMPTitle": "WATER TREATMENT PLANT SUPERVISOR",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000057822",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-28 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-03-30 00:00:00",
  "DeRegistrationEffectiveDate": "2007-03-07 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 35.80889,
  "FRS_Long": -83.92667,
  "FRS_Description": "INTAKE PIPE",
  "FRS_Method": "PUBLIC LAND SURVEY - FOOTING",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5229,
      "AltID": "CHLORINE INJECTION SYSTEM",
      "FacilityID": 4489,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5340,
          "ProcessID": 5229,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5602,
          "ProcessID": 5229,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505602,
          "ProcessID": 5229,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4489,
      "SummaryText": "EXECUTIVE SUMMARY FOR\nTHE CITY OF ALCOA'S\nWATER TREATMENT PLANT\n\nThe City of Alcoa water treatment plant is committed to operating its processes in a manner that is safe for its workers, the community, and the environment.  As part of this commitment, the City of Alcoa has established a system to help ensure safe operation of the processes at the water treatment plant.  One component of this system is a risk management program (RMP) that helps manage the risks involved with using hazardous substances at the plant and that complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40 CFR 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule).  One of the requirements of the RMP rule is to submit an executive summary in the risk management plan (RMPlan) describing the risk management program at the water treatment plant.  This document is intended to satisfy the executive summary requirement of the RMP rule and to provide the public with a description of the water treatment plant's risk management program.  Section 2 of this executive summary describes the one substance currently used at the water treatment plant in sufficient quantity to be regulated by the RMP rule.\nThe water treatment plant's risk management program consists of three elements:\n1. A hazard assessment designed to help the City of Alcoa understand (a) the potential offsite consequences of hypothetical accidental releases and (b) accidents that have occurred during the last 5 years associated with the substances regulated by the RMP rule - see Sections 3 and 5 of this executive summary\n2. A prevention program to help maintain and safely operate processes containing significant quantities of substances regulated by the RMP rule - see Section 4 of this executive summary\n3. An emergency response program to help respond to accidental releases of regulated substances from processes covered by the RMP rule - see Section 6 of this executive summ"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4489,
      "SummaryText": "ary\nAlthough the water treatment plant's risk management program helps ensure that the plant is maintained and operated in a safe manner, it is only one component of the safety program.  In fact, the water treatment plant has a comprehensive safety program that establishes many levels of safeguards against accidental releases and against the injuries and damage that could occur from accidental releases.\nLimiting the use of hazardous substances.  Before using a hazardous substance, the City of Alcoa always considers less hazardous alternatives.  When a hazardous substance must be used, the City of Alcoa considers the potential for this substance to adversely affect its workers, the public, and the environment and takes steps to prevent any such effects.\nPreventing releases of the hazardous substances used at the plant.  When a hazardous substance is used, the equipment used to contain it is carefully designed, built, and operated to reduce the likelihood of an accidental release.  Industry and government standards are closely adhered to in the design, construction, and operation of the equipment.\nLimiting damage from a release, if such a release occurs.  The water treatment plant works daily to prevent accidental releases from occurring.  However, the City of Alcoa also trains its workforce to recognize accidental releases, quickly assess the severity of a release, and respond to mitigate and stop the release, including contacting the local agencies responsible for responding to accidental releases (Blount County Local Emergency Planning Committee [LEPC] and the Alcoa Fire Department) if emergency response actions are necessary. The City of Alcoa works closely with the Blount County LEPC and the Alcoa Fire Department to ensure appropriate plans are in place to minimize the impact of the release on its workers and the community.\nThe water treatment plant's safety program consists of a number of elements, only some of which are required by the RMP rule.  This RMPlan is"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4489,
      "SummaryText": " primarily intended to describe those parts of the safety program required by the RMP rule.\n1.  ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nThe City of Alcoa is committed to the safety of workers and the public, and the preservation of the environment, through the prevention of accidental releases of hazardous substances.  We take reasonable steps to prevent foreseeable releases of hazardous substances.  These steps include (1) training programs for personnel, (2) programs to help ensure safety in the design, installation, operation, and maintenance of our process, and (3) programs to evaluate the hazards of our process.\nIn the event of an accidental release, the City of Alcoa will strive to control and contain the release in a manner that will be safe for workers and will help prevent injury to the public or damage to the environment.  We provide response training to our personnel so that they are well prepared to respond to emergency situations, including working with the Blount County LEPC and the Alcoa Fire Department when executing emergency response actions.\n2.  REGULATED SUBSTANCE USED AT THE WATER TREATMENT PLANT\nThe water treatment plant is designed to treat water for consumption by people within the service area, primarily within the City of Alcoa.  During treatment of the water, chlorine is used in sufficient quantities to be regulated or covered by the RMP rule.  The chlorine used at the plant is covered as a toxic material by the RMP rule.\n3.  OFFSITE CONSEQUENCE ANALYSIS\nAn offsite consequence analysis was performed to estimate the potential for accidental releases of the chlorine that could affect the public or the environment. One worst-case release scenario and a more reasonable (but still highly unlikely) alternative release scenario were also evaluated for the chlorine process.\nA worst-case release scenario is not expected to ever occur.  This scenario is designed to estimate the maximum possible area that could be affected by th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4489,
      "SummaryText": "e complete release of a chlorine cylinder at the plant, but it is not a realistic scenario.  An alternative release scenario was analyzed to help emergency preparedness and to improve the community emergency response plan.  The alternative release scenario was selected to represent a more realistic release that might occur at a water treatment plant.\nThe main objective for performing the offsite consequence analysis is to determine the distance at which certain effects might occur to the public because of an accidental release (called the endpoint distance).  For a release of a toxic material, the toxic endpoint is defined by EPA as the maximum airborne concentrations below which it is believed that nearly all individuals can be exposed for up to 1 hour without experiencing or developing irreversible or other serious health effects or symptoms, which could impair an individual's ability to take protective action.  For exposure to chlorine, most people at the endpoint distance would be able to walk away from the exposure without any long-term health consequences, although some short-term consequences (e.g., strong eye or throat irritation) are likely.  Some people who are particularly susceptible to chlorine could experience more serious effects.  At distances less than the endpoint distance, the effects would be more severe; at distances greater than the endpoint distance, the effects would be less severe.\nThe following information summarizes the offsite consequence analysis. \n3.1  Worst-case Release Scenario \nThe worst-case release scenario is a failure of a 1-ton chlorine cylinder that results in the release of the entire contents of the cylinder.  The inventory of 2,000 lb of chlorine is assumed to be released over a 10-minute time period.  The predicted distance to the toxic endpoint (3 ppm) reaches offsite public receptors. In evaluating this scenario, credit was taken for the building that houses the chlorine process as allowed by EPA.\n3.2  Alternative Release"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4489,
      "SummaryText": " Scenario\nThe alternative release scenario for the chlorine process is a rupture of a chlorine vapor line from the chlorine cylinder to the chlorinator.  If this scenario were to occur, operators could isolate the flow from the cylinder within a few minutes.   The predicted distance to the toxic endpoint for this scenario would reach nearby offsite public receptors.  In evaluating this scenario, credit was taken for the building that houses the chlorine process as allowed by EPA.  \n4.  ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\nThe City of Alcoa has always believed that safety is the highest priority.  We formalized this belief into a prevention program that complies with the Occupational Safety and Health Administration's (OSHA's) process safety management (PSM) regulation.  For the water treatment plant, the prevention program requirements of EPA's RMP rule are nearly identical to the PSM regulation.  The following sections briefly describe the elements of the water treatment plant's prevention program that address the RMP rule requirements. \n4.1  Prevention Program\nThe water treatment plant's accident prevention program for chlorine consists of the following 12 elements:\n1. Process safety information.  The water treatment plant maintains a variety of technical documents, including an emergency preparedness plan, to help ensure that its employees (and local emergency responders) know about the hazards associated with the plant.  These documents address (a) physical properties of the chlorine we handle, (b) operating parameters for our equipment, and (c) design basis and configuration for our equipment.  The water treatment plant ensures that this process safety information is available to all its employees.\n2. Process hazard analysis.  The water treatment plant performs and periodically updates a process hazard analysis of its chlorine process to help identify process hazards and make recommendations that might improve the safe op"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 4489,
      "SummaryText": "eration of the process.  A multidisciplinary team is assembled to analyze the hazards of the chlorine process.  This team includes personnel with engineering and process operating experience and a leader with process hazard analysis experience. The team systematically addresses the hazards associated with operation of the equipment in the chlorine process area. The team then prepares a written report describing the results of the analysis, including a list of recommendations. Responsibility for resolving the recommendations is assigned to area personnel, and, when appropriate, changes to enhance the safety of the process are implemented.  The analysis will be revisited at least every 5 years to ensure it is current.\n3. Operating procedures.  The water treatment plant's process engineers, operators, and managers work together to develop and maintain operating procedures to define how tasks related to process operations should be safely performed.  The operating procedures are used to train employees and serve as reference guides for appropriate actions to take during both normal operations and process upsets.  Operating procedures include:\n7 Steps for safely conducting activities\n7 Applicable process safety information, such as safe operating limits and consequences of process deviations\n7 Safety and health considerations, such as chemical hazards, personal protective equipment requirements, and actions to take if exposure to a hazardous substance occurs\n4. Training.  The water treatment plant trains workers to safely and effectively perform their assigned tasks.  Our training program includes both initial and refresher training that covers (a) a general overview of the process, (b) the properties and hazards of the chlorine in the process, and (c) a detailed review of the process operating procedures and safe work practices.  Hands-on training and demonstrations are used to help train employees, and oral reviews are used to verify that an employee understands the tr"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 4489,
      "SummaryText": "aining material before the employee can begin or resume work in the process.\n5. Mechanical integrity.  Process equipment is maintained to help prevent equipment failures that could endanger workers, the public, or the environment.  Our mechanical integrity (preventive maintenance) program includes (a) an inspection and testing program to help identify equipment deterioration and damage before the equipment fails and (b) a quality assurance function to help ensure that new and replacement equipment meet the strict design standards required for service in our process.\n6. Management of change.  Proposed changes to chemicals, equipment, technology, and procedures are evaluated to help ensure that the change does not negatively affect safe operations. All changes other than replacement-in-kind (e.g., replacing a valve with an identical valve) must be approved through the full management of change program.  This helps ensure that inadvertent consequences of process changes are prevented, safety consequences of changes are addressed, affected process safety information and procedures are updated, and affected employees are notified of the changes.\n7. Pre-startup safety review.  The water treatment plant recognizes that new or newly modified processes are historically more likely to be involved in accidental releases.  Therefore, we perform safety reviews of new or modified processes before placing them into service to help ensure their safe operation.  This review confirms that:\n7 Construction and equipment are in accordance with design specifications\n7 Adequate safety, operating, maintenance, and emergency procedures are in place\n7 Employee training has been completed\n7 For a covered process, a process hazard analysis has been performed if the process is new, or management of change requirements have been completed if an existing process has been modified\n8. Compliance audit.  One of the cornerstones of an effective prevention program is a regular, thorough assessment.  T"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 4489,
      "SummaryText": "he chlorination process will be audited every 3 years to be certain the water treatment plant's prevention program is effectively addressing the safety issues of its operations.  An audit team will be assembled that includes personnel knowledgeable in the PSM and RMP rules and in our process designs.  This team will evaluate whether the prevention program satisfies the requirements of these two rules and whether it is sufficient to help ensure safe operation of the process.  The results of the audit will be documented, recommendations resolved, and appropriate enhancements to the prevention program implemented.\n9. Incident investigation.  All incidents that could result in serious injury to personnel, the public, or the environment will be investigated so that similar accidents can be prevented in the future.  The water treatment plant trains its employees to identify and report any incident requiring investigation.  Should such an event occur, an investigation team will be assembled, and the investigation initiated within 48 hours of the incident. The results of the investigation will be documented, recommendations resolved, and appropriate process improvements implemented.\n10. Employee participation.  The water treatment plant has a written employee participation program for its covered process to help ensure that the safety concerns of our workers are addressed.  We encourage active participation of personnel in the prevention program activities of all processes at the plant.  Employees are consulted on and informed about all aspects of our accidental release prevention program.\n11. Hot work permits.  The water treatment plant has a hot work permit program to control spark- or flame-producing activities that could result in fires or explosions in our plant.  We reviewed OSHA's fire prevention and protection requirements and created a hot work permit form to comply with these requirements.  Personnel who are to perform hot work are required to fill out the form, a"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 4489,
      "SummaryText": "nd the appropriate supervisor reviews the completed form before work can begin.  Training on hot work activities and on the requirements of the hot work permit program are included in our safe work practices orientation.\n12. Contractors.  The water treatment plant has a program in place to help ensure that contractor activities at its plant are performed in a safe manner.  We explain to the contract supervisors the hazards of the processes on which they and their employees will work, our safe work practices, and our emergency response procedures.  Contractors are required to ensure that training has been performed for each of their employees who will work at the plant before that worker begins work at our plant. \n4.2  Chemical-specific Prevention Steps\nIn addition to the required prevention program elements, the City of Alcoa has implemented safety features specific to the regulated substance used at its water treatment plant.  The following paragraph describes some of these safety features.\nThe chlorine is delivered in cylinders that must be approved by the Department of Transportation.   The chlorine is used directly from the cylinders, and the transfer equipment and chlorinators are designed and maintained to standards established by the federal government and by industry.  A chlorine detection system has also been installed to alert operators to any release of chlorine inside the building where the chlorine system is located.   A vacuum feed system is used instead of a pressure feed for the chlorination process.  Supply valves only open when the water is flowing through the system, and manual shutoff valves are provided as process controls that can be used to help prevent or mitigate releases of chlorine from the system.\n5.  FIVE-YEAR ACCIDENT HISTORY\nThe water treatment plant's accident history demonstrates the continuous safe operation of its chlorine process over the last 5 years.  There have been no recorded accidental releases of chlorine from the system th"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 4489,
      "SummaryText": "at resulted in exposure to employees, the public, or the environment.\n6.  EMERGENCY RESPONSE PROGRAMS\nThe City of Alcoa has established a written emergency response program to help ensure the safety of personnel who respond to accidental releases of hazardous substances.  The emergency response plan includes procedures for:\n7 Informing the Blount County LEPC and the Alcoa Fire Department about accidental releases that could reasonably result in offsite consequences\n7 Providing proper first aid and emergency medical treatment for accidental human exposure to hazardous substances\n7 Obtaining outside assistance to control and contain accidental releases of hazardous substances, including the use of emergency response equipment\n7 Inspecting and maintaining emergency response equipment\n7 Reviewing and updating the emergency response plan\n We have trained our employees to recognize and report emergency situations.  All of our personnel are trained in evacuation procedures.  The Blount County LEPC and the Alcoa Fire Department are responsible for notifying the public of the emergency situation, if necessary.\n The written emergency response plan complies with other federal contingency plan regulations [e.g., the OSHA regulation 29 CFR 1910.38(a)], and a copy of the plan has been provided to the Alcoa Fire Department. Also, a hazardous material storage and location plan has been provided to the Blount County LEPC, and personnel from the water treatment plant maintain a regular dialogue with local emergency planners.\n 7.  PLANNED CHANGES TO IMPROVE SAFETY\n The water treatment plant constantly strives to improve the safety of its processes using recommendations developed through the prevention program and a program soliciting safety suggestions from its employees.  All recommendations received by plant management are evaluated and implemented if safety can be improved.  On an annual basis, we review our operating and safety procedures to ensure that they are correct, and we pr"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 4489,
      "SummaryText": "ovide training to our employees and contractors on a wide variety of safety and operations topics.  The chlorine system at the water treatment plant is not a complicated system, and it has been operating without problems for several years.  However, the water treatment plant has implemented OSHA PSM and EPA RMP required improvements for this system and has improved the operation and maintenance of the system to help maintain the high standard of safety that has been achieved in the past."
    }
  ]
}