{
  "FacilityID": 44946,
  "FacilityName": "Chicagoland Quad Cities Express, Inc. - Bridgeview",
  "FacilityStr1": "7715 South 78th Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Bridgeview",
  "FacilityState": "IL",
  "FacilityZipCode": "60455",
  "Facility4DigitZipExt": "1345",
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "41.450410",
  "FacilityLongDecDegs": "-087.485250",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.chicland.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 49819378,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Donna Strauser, Terri Wintermute",
  "OperatorStr1": "7715 South 78th Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Bridgeview",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60455",
  "OperatorZipCodeExt": "1345",
  "RMPContact": "James Koleff",
  "RMPTitle": "Safety and Compliance Manager",
  "FTE": 60,
  "OtherEPAFacilityID": "051899006017H",
  "EPAFacilityID": "100000164724",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-07-26 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Bridgeview",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-02-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-02-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-02-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-11-25 00:00:00",
  "DeRegistrationEffectiveDate": "2009-11-25 00:00:00",
  "AnniversaryDate": "2011-02-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 41.75115,
  "FRS_Long": -87.81473,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 64892,
      "AltID": "Formaldehyde Storage",
      "FacilityID": 44946,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 66438,
          "ProcessID": 64892,
          "NAICSCode": "49311",
          "_desc": {
            "NAICS_CODE": "49311",
            "NAICS_DESCRIPTION": "General Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 85967,
          "ProcessID": 64892,
          "ChemicalID": 1,
          "Quantity": 27860.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 585967,
          "ProcessID": 64892,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 44946,
      "SummaryText": "This Plan is being revised to reflect recent changes to the facility's Plan.  It was previously revised in accordance with the requisite 5-year update, as well as to address additional data elements required to be included in all RMPs by June 21, 2004 per USEPA rule changes.\n\n1.  Accidental Release Prevention and Emergency Response Policies\nWe at Chicagoland-Quad Cities Express, Inc. - Bridgeview are committed to employee, public, and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as hazardous materials segregation procedures, material handling equipment maintenance, and employee training associated with storage of hazardous materials at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n2.  The Stationary Source and the Regulated Substances Handled\nWe have one (1) regulated substance present at our facility:  formaldehyde.\n\nWe have varying inventories for this chemical.  Formaldehyde is a component of several customer-packaged materials that we store in our warehouse.\n\n3.  The Worst Case Release Scenario and the Alternative Release Scenario, including administrative controls and mitigation measures to limit the distances for reported scenario.\nInformation regarding this section of the RMP is withheld due to national security interests.\n\n4.  The General Accidental Release Prevention Program Level 3 and the Chemical-Specific Prevention Steps.\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nChicagoland-Quad Cities Express, Inc. maintains a detailed record of safety information that describes the chemical hazards (MSDS) for the regulated substance.\n\nProcess Hazard An"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 44946,
      "SummaryText": "alysis\nOur facility conducted a comprehensive study to ensure that hazards associated with our warehousing process were identified and controlled efficiently.  The methodology used to carry out this analysis was Hazard and Operability Analysis, guide word format.  Any findings related to the hazard analysis were addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Chicagoland-Quad Cities Express, Inc. maintains written operating procedures.  These procedures address various modes of operation such as segregation and storage procedures, use of forklifts, loading and unloading, examination of damaged containers, labeling of containers, and bracing, stacking and handling damaged containers.\n\nTraining\nChicagoland-Quad Cities Express, Inc. has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided on an yearly basis and more frequently as needed.\n\nMechanical Integrity\nChicagoland-Quad Cities Express, Inc. performs maintenance checks on forklift equipment to ensure proper operations.  Materials handling equipment examined by these checks include forklifts.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n5.  Five-year Accident History\nChicagoland-Quad Cities Express, Inc. has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n6.  Emergency Response Plan\nChicagoland-Quad Cities Express, Inc. carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response, including adequate first aid and medical treatment, evacuations, and notification of local emergency response agencie"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 44946,
      "SummaryText": "s and the public.\n\nTo ensure proper functioning, our emergency response plan is promptly updated to reflect any pertinent changes taking place within our warehousing process that would require a modified emergency response."
    }
  ]
}