{
  "FacilityID": 45066,
  "FacilityName": "MCSD Wastewater Management Facility",
  "FacilityStr1": "795 Hiller Road",
  "FacilityStr2": null,
  "FacilityCity": "McKinleyville",
  "FacilityState": "CA",
  "FacilityZipCode": "95519",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06023",
  "LEPC": "Coastal Region",
  "FacilityLatDecDegs": "40.563900",
  "FacilityLongDecDegs": "-124.072200",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "mcsd@mckinleyvillecsd.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "McKinleyville Community Services District",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "McKinleyville CSD",
  "OperatorStr1": "P.O. Box 2037",
  "OperatorStr2": null,
  "OperatorCity": "McKinleyville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95519",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": "N/A",
  "EPAFacilityID": "100000107458",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-06-11 00:00:00",
  "SafetyInspectionBy": "Safety Consultant",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-08-19 15:04:53",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-03-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2006-03-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-03-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.6",
  "FRS_Lat": 40.94171,
  "FRS_Long": -124.120329,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 65149,
      "AltID": "Wastewater Chlorination",
      "FacilityID": 45066,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 86294,
          "ProcessID": 65149,
          "ChemicalID": 62,
          "Quantity": 4200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 66705,
          "ProcessID": 65149,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 38166,
              "Process_NAICS_ID": 66705,
              "SafetyReviewDate": "2009-04-06 00:00:00",
              "PHA_Date": "2008-06-11 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-08-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "haz-mat response personnel",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "weight data monitoring",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "increased haz-mat response capability; installation of seismic safety engineering controls",
              "OpProceduresReviewDate": "2009-04-06 00:00:00",
              "TrainingReviewDate": "2009-06-04 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "site-specific haz-mat drills",
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-06-10 00:00:00",
              "EquipmentInspectionDate": "2009-07-30 00:00:00",
              "EquipmentTested": "All equipment inspected monthly and on annual maintenance schedule",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2009-06-10 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2009-06-11 00:00:00",
              "AuditCompletionDate": "2009-08-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-06-10 00:00:00",
              "HotWorkPermitReviewDate": "2009-07-10 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2009-07-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 55580,
                  "PreventionProgram3ID": 38166,
                  "ProcessChemicalID": 86294
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 45066,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-07-10 00:00:00",
    "ERTrainingDate": "2008-11-08 00:00:00",
    "CoordinatingAgencyName": "Humboldt County Environmental HD",
    "CoordinatingAgencyPhone": "7074456215",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "California Health and Safety Code Chapter 6.95",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 45066,
      "SummaryText": "EXECUTIVE SUMMARY\nA. Introduction\nThe McKinleyville Community Services District utilizes chlorine to provide disinfection of treated wastewater at their Waste Water Management Facility located off of Hiller Road in McKinleyville.\n\nIn conjunction with this facility and its functions, the District stores liquid chlorine and maintains piping and plumbing to facilitate the injection of chlorine to affect disinfection of pathogenic organisms.  Liquid chlorine is stored in one-ton containers at the Waste Water Management Facility. In order to facilitate ordering and delivery of the one-ton cylinders, the District never stores liquid chlorine in excess of 2,000 lbs at the Waste Water Management Facility.\n\nChlorine is listed by state and federal agencies as a regulated substance.  The federal Accidental Release Prevention program requires stationary sources with more than the threshold quantity of a regulated substance to be evaluated to determine the potential for and impacts of accidental releases from the covered process.  Under conditions specified by the state and federal agencies, the owner or operator of a stationary source which stores more than the threshold quantity is required to develop and submit a risk management plan (RMP).  The federal threshold quantity for chlorine is 2,500 lbs., which therefore requires the District to develop and submit a RMP to the federal Environmental Protection Agency (EPA) by June 21, 1999.  In addition, the District will be subject to the provisions of the California Accidental Release Prevention (CalARP) program.  The CalARP program includes the federal Accidental Release Prevention Program with certain additions specific to the state pursuant to the state Health and Safety Code.  The purpose of the state and federal accidental release programs is to prevent the accidental release of regulated substances.\n\nB. Accidental Release Prevention\nThe McKinleyville Community Services District recognizes the potential impact of handling chl"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 45066,
      "SummaryText": "orine in conjunction with their waste water treatment processes.  The District has implemented several safety programs to prevent accidental releases.  These plans have been updated, expanded, and integrated in conjunction with the Risk Management Plan program.\n\nC. Process Management Safety Plan\nThe California Division of Occupational Safety (Cal/OSHA) requires that owners/operators of facilities upon which any listed acutely hazardous material is stored/used in excess of specified quantities must develop a process safety management plan.  The goal of the regulation is to reduce the risk of occupationally related injuries of illnesses related to the accidental release of an acutely hazardous material.  The District's Process Safety Management Plan was originally developed in 1997.  This document identifies the physical and toxicological hazards of chlorine and sulfur dioxide, and analyzes the hazards inherent in the District's processes regarding these substances.  The process hazard analysis utilized a composite of several different methodologies, including what-if, failure mode effects analysis, and primary hazard assessment.  The objectives of the analysis were to identify possible hazard scenarios, identify what causes(s) could lead to each scenario, characterize the probable consequence of each cause, and suggest corresponding mitigation options.\n\nOnce the possible hazard scenarios were characterized, a qualitative estimation of the frequency with which causative factors might occur and a categorization of the consequences based upon degree of severity upon employee health and safety was developed.  Finally a risk ranking was derived from a matrix composed of axes representing frequency and consequence.\n\nThe District's Process Safety Management Plan forms the backbone of the Risk Management Plan.  Additional elements required by the Risk Management Plan Program were added, most notably the analysis and evaluation of potential off-site consequences.  The Process"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 45066,
      "SummaryText": "Safety Management Plan was re-evaluated with respect to new and additional information gathered during the Risk Management Plan process, and revised to reflect this new information.\n\nD. Hazardous Material Handling Training\nAll District field personnel have completed HAZWOPER initial-responder training for Hazardous Waste Operations and Emergency Response training.  In addition, District field crew members are completing the annual requirement of 8 hours of refresher training and participating in field training exercises under contract agreement with the Northern California Safety Consortium.\n\nE. Emergency Response Policies\nThe District's Emergency Response Policies are clearly outlined in the District's Process Safety Management Plan.  The critical component of this Plan (Exhibit C - Emergency Action Plan/Spill Response Procedures) has been excerpted to Appendix B of this Risk Management Plan.\n\n\nF. Administrative Controls and Mitigations\n\nIn conjunction with the Disinfection Alternatives Report prepared by Oscar Larson and Associates, the District considered adopting administrative controls to limit the inventory of chlorine and sulfur dioxide to avoid requirements for filing the Federal RMP.  District staff believes these controls offer little or no real potential to reduce the risk or potential off-site consequences of an accidental release.  Other administrative controls have already been implemented that minimize the on-site quantities of hazardous materials within reasonable parameters of materials delivery schedules and assurance that the District remains able to provide needed disinfection functions at their critical facilities.\n\nThe District has elected to implement several mitigations of risk and the potential off-site consequences of an accidental release.  As noted below, the District has committed to implementing over $44,000 in safety upgrades at their Waste Water Management Facility.  In addition, the District continues to invest in training, preparat"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 45066,
      "SummaryText": "ion, organization, and coordination with other responding agencies.  The training of staff to respect the inherent risk in handling hazardous material is likely the best investment to reduce the risk of accidental release, as the human factor is often a large contributing factor in accidents.  Likewise, the preparation, training, and organization necessary to provide efficient and effective response in the event of an accidental release assures the potential off-site consequences are minimized.\n\nG. Accidental Release - Accident History\n\nThe District has utilized chlorine since the Waste Water Management Facility was constructed in 1983.  In over 22 years of handling chlorine, the District has never experienced an accidental release.  The District remains committed to maintaining this excellent accident history, and never experiencing an accidental release in the future.  In recognition of this commitment, the District continues regular training of field personnel in the safe handling, and proper emergency response in the event of an accidental release.  Safety meetings are conducted on a regular basis, and topics discussed and staff members attending are documented in District files.  Various safety plans including the District's Hazardous Material Business Plan, the Process Safety Management Plan, and the District's Emergency Operations Plan are regularly reviewed and updated.  The District has contracted with the Northern California Safety Consortium to conduct training sessions and functional exercises in the implementation of these various plans.\n\nH. Emergency Response Program\n\nThe District has developed several documents which provide guidance for emergency response to emergencies, including accidental release of hazardous materials.  These documents are being reviewed, updated, and integrated to be internally consistent, and appropriately and consistently referenced in all of the District's safety/emergency response documents.  Emergency response to the accide"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 45066,
      "SummaryText": "ntal release of hazardous materials is included in the District's Process Safety Management Plan, Appendix C, entitled Emergency Action Plan/Spill Response Procedures.  This Appendix has been excerpted to Appendix B of this Risk Management Plan.\n\nI. Changes to Improve Safety\n\nThe District retained the engineering consulting firm of Oscar Larson and Associates to prepare a Disinfection Alternatives Study.  The purpose of the Oscar Larson and Associates study was to examine the existing practices and procedures as well as alternate disinfection methodologies to evaluate revisions to the District's current practices and procedures that might reduce the risk of accidental release and/or potential off-site consequences in the event of an accidental release.  Four alternatives, in addition to the existing conditions, were identified and evaluated in the final report.  Cost estimates were prepared for both capital costs and maintenance costs of each alternative.\n\nThe final report prepared by Oscar Larson and Associates recommended the District continue the current practices utilizing liquid chlorine and sulfur dioxide, or adopt administrative controls to limit the inventory of chlorine and sulfur dioxide to avoid requirements for filing the Federal RMP.  District staff feels the administrative controls to limit the inventory of chlorine and sulfur dioxide below the federal regulatory threshold limits to avoid the requirement to file the Federal RMP, offers little or no real potential to reduce the risk or potential off-site consequences of an accidental release.\n\nThe final report also recommended installation of a number of safety upgrades to further improve the safety of the existing facilities, and/or improve the District's ability to respond in the event of an accidental release.  In that these improvements offer real potential for reduction of risk, and/or improved response in the event of an accidental release, District staff supports these improvements, and recommend"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 45066,
      "SummaryText": "ed to the District Board that these improvements be implemented.\n\nThe MCSD Board approved upgrades to the District's Waste Water Management Facility, and directed staff to include funding for these improvements in the District's FY 1999-2000 budget.  The estimated cost of these improvements is approximately $44,000, and includes the following system improvements:\n\n* Emergency Exhaust Fan Ducts\n* Additional Leak Detectors\n* Piping Revisions\n* Alarm System Modifications\n* Electronic Ton Container Scales\n* Wind Monitor and Telemetry\n\nThese improvements were implemented during the FY 1999-2000 in order to further improve the safety and reduce the potential consequences of an accidental release of hazardous materials.\n\nThe District also had a Seismic Risk Assesment in 2003. The final report was prepared by Spencer Engineering and Construction Management, Inc. It was their opinonn that the structural buildings at the District's Waste Water Management Facility comply with current building codes and standards to meet predicted seismic events.   \n\nMcKinleyville Community Services District\t\tRisk Management Plan\n\n\n                           \t\tPage 1"
    }
  ]
}