{
  "FacilityID": 4515,
  "FacilityName": "City of Slidell - Robert Road Water Tower",
  "FacilityStr1": "Adjacent to 1051 Robert Rd",
  "FacilityStr2": null,
  "FacilityCity": "Slidell",
  "FacilityState": "LA",
  "FacilityZipCode": "70458",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22103",
  "LEPC": "St. Tammany Parish LEPC",
  "FacilityLatDecDegs": "30.289444",
  "FacilityLongDecDegs": "-89.770833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Slidell Public Utilities",
  "OperatorStr1": "P.O. Box 828",
  "OperatorStr2": null,
  "OperatorCity": "Slidell",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70459",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000055977",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Robert Road Water Tower WTP",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2018-01-16 00:00:00",
  "DeRegistrationEffectiveDate": "2018-01-09 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 30.289444,
  "FRS_Long": -89.770833,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5256,
      "AltID": "Robert Road Water Tower",
      "FacilityID": 4515,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 5632,
          "ProcessID": 5256,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5367,
          "ProcessID": 5256,
          "NAICSCode": "92411",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 2922,
              "Process_NAICS_ID": 5367,
              "SafetyReviewDate": "1999-03-03 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-03-03 00:00:00",
              "ChangeCompletionDate": "2000-03-03 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Alarms",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-03 00:00:00",
              "TrainingReviewDate": "1999-03-03 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-03 00:00:00",
              "EquipmentInspectionDate": "1999-06-20 00:00:00",
              "EquipmentTested": "All equipment inspected/tested daily",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1995-08-01 00:00:00",
              "InvestigationChangeDate": "1996-07-01 00:00:00",
              "MostRecentChangeDate": "1999-03-03 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2979,
                  "PreventionProgram2ID": 2922,
                  "ProcessChemicalID": 5632
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4515,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-03-03 00:00:00",
    "ERTrainingDate": "1999-05-26 00:00:00",
    "CoordinatingAgencyName": "St. Tammany Parish Fire Dist. #1",
    "CoordinatingAgencyPhone": "5046464387",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 4515,
      "SummaryText": "ifying the appropriate agencies and providing information to the public.\n\nAccidental release protection for the chlorine system also involves a prevention program that includes:\n\n7 Documenting process safety information\n7 Conducting a process hazard analysis\n7 Using operating procedures\n7 Implementing a maintenance program\n7 Conducting incident investigations\n7 Implementing training program about the hazards of chlorine\n7 Conducting compliance audits\n \n \n1.2  STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n \nChlorine is used for disinfection at the Robert Road Water Tower using three 1-ton containers.  Also stored at the site are 150-pound cylinders that are transferred to the other wells and pumping stations throughout the City.  Each of the other sites has a total quantity of chlorine below the 2,500-pound threshold established by the EPA under 40 CFR Part 68 and do not have any independent RMP requirements.  \n \n1.3  WORST-CASE RELEASE SCENARIO(S) AND ALTERNATIVE RELEASE SCENARIO(S), INCLUDING ADMINISTRATIVE CONTROLS AND MITIGATION MEASURES TO LIMIT THE DISTANCES FOR EACH REPORTED SCENARIO\n \n The EPA requires the City to conduct an off-site consequence analysis to provide information to the public and government agencies about the potential consequences of an accidental chlorine release.  The offsite consequence analysis (OCA) consists of two elements:\n \n7 Worst-case release scenario\n7 Alternative release scenario\n \n1.3.1  Worst-Case Release Scenario\nThe EPA requires the worst-case release scenario to be evaluated for a release from the largest vessel in the system.  This total release of chlorine is modeled over a ten minute period under conservative weather conditions.  This analysis was for release of the entire contents of an one-ton container at a rate of 200 pounds per minute under weather conditions prescribed by the EPA as Class F stability and wind speed of 1.5 meters/second (3.6 miles/hour).  The release conditions were evaluated to determine the dist"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4515,
      "SummaryText": "ance away from the system where a maximum airborne concentration of chlorine at 0.0087 mg/l (3 ppm) would exist.  This airborne concentration has been determined by the EPA as the toxic endpoint.  Below that concentration it is believed nearly all individuals can be exposed for up to one hour without experiencing or developing irreversible or other serious health effects.  Below the concentrations, the individual should not experience symptoms that could impair their ability to take protective action.  A separate analysis was also performed for the entire contents of a 150-pound cylinder being released at a rate of 15 pounds per minute.\n \nThe distance to the endpoint of 0.0087 mg/L (3 ppm) for the worst-case scenario is dependent on the topographic setting (i.e., urban or rural) for the site.  The City is considered an urban setting.  The endpoint distance for the one-ton container is 1.3 miles, while the endpoint distance for the 150-pound cylinder is 0.4 miles.  An evaluation of these distances determined that several public receptors and offsite impacts are likely to be affected during this worst-case release scenario.  The potential population size and public receptors that could be affected by a release are provided in Appendix B.\n \n \n1.3.2  Alternative Release Scenario\nThe worst-case release is less likely to occur than the following alternative scenario. A team of system operations, maintenance personnel, and the St. Tammany Parish Fire Department conducted a workshop to identify a release scenario that is more likely to occur.  The EPA document Risk Management Program Guidance for Wastewater Treatment Plants, dated October 1998, was also consulted to determine a possible release scenario.  The selected alternative involves the chlorinator unit.  Corrosion inside the unit could result in a chlorine gas leak that could vent through a 0.25-inch inside diameter (ID) tube.  The corrosion could be caused by liquid chlorine, water, or mechanical failure of intern"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4515,
      "SummaryText": "al components.  It is assumed that the ton container is positioned with the chlorinator in the 12-o'clock position so that only vapor would release.  The release rate would be 9 lbs/min.  More common weather conditions of Class D, temperature of 25 degrees Celsius (77 degrees Fahrenheit), and with a wind speed of 3.0 meters/second (6.7 miles/hour) was used during evaluation of the alternative release scenario.  The distance to the endpoint of 0.0087 mg/L (3 ppm) for the alternative release scenario is also dependent on the topographic setting (i.e., urban or rural) for the process and weather conditions.  The alternative release scenario endpoint distance at this site, for an urban setting is 0.1 miles.  An evaluation of this distance determined that the alternative release could potentially affect public receptors consisting of a nursing home, schools, commercial, and residential.  There are no environmental receptors within 0.1 miles.  This alternative scenario was selected because any other failures in the chlorine system, excluding failures of the container and valve, which are the same as the worst-case, would produce a smaller release rate.  The potential population size and public receptors that could be affected by a release are provided in Appendix C.\n \n \n1.4  GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC PREVENTION STEPS\n \nThe City has taken steps so that the chlorine systems comply with U.S. EPA's Accidental Release Prevention Rule and with applicable state codes and regulations.  The City will need to further evaluate both buildings against National Fire Protection Association (NFPA) 55 and the Uniform Building Code (UBC) requirements.  In the meantime, the City has developed a Prevention Program that includes: \n \n7 Documenting process safety information regarding the hazards of chlorine and components of the system.\n \n7 Conducting a process hazard analysis to evaluate potential mechanical failures or operational causes that could result"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 4515,
      "SummaryText": "The City of Slidell (City) - Robert Road Water Tower Site, (LDEQ Facility ID number 2694), is one of ten wells serving the City's drinking water supply to the community.  The site use of one-ton chlorine containers for disinfection and stores 150-pound cylinders for disinfection at other well locations in the City.  The City provides disinfected water to meet the requirements of the Safe Water Drinking Act.  The same properties that make chlorine valuable as a disinfectant also make it necessary to observe certain safety precautions to prevent unnecessary human exposure during handling and to protect the health of City employees and the public and environmental receptors.\n\n1.1  ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAccidental release prevention is dependent on chlorine handling procedures, safety devices inherent in the design of the facility, and staff training.  It is the City's intention to adhere to all applicable federal, state, and local laws in the storage, use and handling of compressed and liquefied gases in portable cylinders.  Access to the site and system is restricted to authorized employees.  The area is secured by a locked fence surrounding the system.  The one-ton containers are located in a steel structure, three-sided building equipped with a concrete foundation, alarms and sensors, and a hoist for moving the containers. The 150-pound cylinders are stored in a separate steel structure three-sided building equipped with alarms and sensors.  The cylinders are securely chained and divided into two areas Empty and Full cylinders.  Both buildings are clearly marked Danger Chlorine to reduce unauthorized entry.   An Emergency Response Program has been developed to respond to both worst-case and alternative release scenarios.  The emergency response actions are implemented by the City's HAZMAT team and the St Tammany Parish Fire Department, when necessary.  The Director of Public Operations serves as the focal point for not"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4515,
      "SummaryText": "in an accidental release\n \n7 Implementing standard operating procedures\n7 Implementing a mechanical integrity program\n7 Implementing a training program regarding the operations of the system.\n7 Conducting incident investigations\n7 Conducting compliance audits\n \n1.5  FIVE-YEAR ACCIDENT HISTORY\n \n According to information provided by the City, there have been no accidents or releases over the past five years that resulted in on-site or off-site impacts.\n \n1.6  EMERGENCY RESPONSE PROGRAM\n \nThe City has developed an Emergency Response Program based upon the existing management system for responding to emergencies, appropriate discovery and notification procedures, and coordination with the St. Tammany Parish Fire Department.  The superintendent, assistant superintendent, crew chiefs, operators, and technicians have been trained as First Responders in the event of a release.  The Fire Department subsequently acts as a supporting role to the City HAZMAT team.  The Director of Public Operations has an obligation and primary role in notifying the appropriate government agencies and communicating releases to the public. \n \n1.7  PLANNED UPGRADES TO IMPROVE SAFETY\n \nThe City conducted a Process Hazard Analysis (PHA) of the chlorine facility with the intent of generating recommendations for improving operations and reducing risk to the Public and City employees.  The continuous improvement process has methods for approving actions and implementing necessary changes in a timely fashion.  The improvement recommendations include:\n \n7 Assessing the chlorine building and loading capacity\n\n7 Evaluate both buildings against NFPA55 and UBC requirements"
    }
  ]
}