{
  "FacilityID": 45156,
  "FacilityName": "Arctic Cold Storage",
  "FacilityStr1": "4139 Roosevelt Road",
  "FacilityStr2": null,
  "FacilityCity": "St. Cloud",
  "FacilityState": "MN",
  "FacilityZipCode": "56301",
  "Facility4DigitZipExt": "9532",
  "FacilityCountyFIPS": "27145",
  "LEPC": "District 4 LEPC, Minnesota",
  "FacilityLatDecDegs": "45.497009",
  "FacilityLongDecDegs": "-094.146141",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Jeff Condon",
  "OperatorStr1": "4139 Roosevelt Road",
  "OperatorStr2": null,
  "OperatorCity": "St. Cloud",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56301",
  "OperatorZipCodeExt": "9532",
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000194737",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-03-05 00:00:00",
  "SafetyInspectionBy": "Minnesota State",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2006-03-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-03-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2006-03-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-03-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.6",
  "FRS_Lat": 45.499159,
  "FRS_Long": -94.151566,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 65310,
      "AltID": "Cold Storage Warehousing",
      "FacilityID": 45156,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 86497,
          "ProcessID": 65310,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 66871,
          "ProcessID": 65310,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 38273,
              "Process_NAICS_ID": 66871,
              "SafetyReviewDate": "2006-03-03 00:00:00",
              "PHA_Date": "2006-03-07 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2007-03-07 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2006-03-07 00:00:00",
              "TrainingReviewDate": "2006-03-07 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2006-03-07 00:00:00",
              "EquipmentInspectionDate": "2006-03-14 00:00:00",
              "EquipmentTested": "Vessels and Compressors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2006-03-07 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2006-03-07 00:00:00",
              "HotWorkPermitReviewDate": "2006-03-07 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2006-03-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 55719,
                  "PreventionProgram3ID": 38273,
                  "ProcessChemicalID": 86497
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 45156,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "St. Cloud Fire Department",
    "CoordinatingAgencyPhone": "3202557213",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 45156,
      "SummaryText": "s.  The ammonia systems were constructed in accordance with all applicable federal, state, and local regulations including the Uniform Fire and Mechanical Codes.\n\nThe ammonia refrigeration systems use approximately 7,500 pounds of ammonia each for loading dock operations, cold storage, and freezer storage.  \n\nOld System\n\nThe refrigeration cycle begins with the transfer of high pressure liquid ammonia from the Thermosyphon/High Pressure Receiver to the +15 F Economizer and -40 F Recirculator.  The liquid is subcooled in the +15 F Economizer as it flows through coils immersed in a bath of the liquid ammonia within the vessel.  The subcooled liquid ammonia is routed to evaporators in the Convertible Rooms, Dock, Staging Cooler, and Storage areas.  Liquid ammonia from the bath in the +15 F Economizer is fed to the -20 F Recirculator.  The -20 F and -40 F Recirculators pump liquid ammonia to evaporators located in the Storage Freezer and Blast Freezer, respectively.  \n\nFans in each evaporator are used to blow air across and through the coils which partially vaporizes the liquid ammonia as heat from the room is transferred to the ammonia.  The resulting two-phased (liquid/vapor) ammonia from each evaporator returns to the vessel which supplied it.  (The exception is the Convertible evaporators which return two-phased ammonia to the -20 F Recirculator or +15 F Economizer, depending on operating conditions.)  The liquid falls to the bottom of the vessel (to be reused in the evaporators) and the vapor is drawn from the top by the compressors.\n\nThere are three reciprocating compressors (HS-1 - HS-3) and two screw compressors (HS-4 & HS-5) in the refrigeration system.  Compressor HS-3 draws vapor from the -40 F Recirculator, Compressors HS-1 & HS-2 draw vapor from the +15 F Economizer, and HS-4 & HS-5 draw vapor from the -20 F Recirculator and economizer suction from the +15 F Economizer.  In addition, HS-4 has the capacity to draw vapor from the -40 F Recirculator and HS-3 ha"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 45156,
      "SummaryText": "s the capacity to draw vapor from the +15 F Economizer.  The pressure of the vapor is increased and then it is discharged through a common header to the Condensers, where the vapor is condensed to a high pressure liquid and drained back to the Thermosphon/High Pressure Receiver. Compressor discharge (hot-gas) is also used for defrost of the evaporators.  \n\nAn Auto Purger periodically purges the system of non-condensibles collected in the Condensers. Dual pressure relief valve assemblies are installed on each vessel (set at 250 psig on all vessels, except for Compressor HS-4 & HS-5 oil separator relief valves which are set at 300 psig) to relieve high pressure ammonia to the atmosphere in case of a high pressure event. \n\nNew System\n\nThe refrigeration cycle begins with the transfer of high pressure liquid ammonia from the High Pressure Receiver to the +15 F Recirculator.  The High Pressure Receiver also provides liquid ammonia to the compressors for liquid injection oil cooling.  As the ammonia enters the +15 F Recirculator, it is expanded through a hand expansion valve, reducing the pressure (and hence the temperature) in order to maintain a predetermined internal pressure.  The +15 F Recirculator vessel pumps liquid ammonia to the dock (5) and cold storage evaporators (2).  Fans in each evaporator are used to blow air across and through the coils which partially vaporizes the liquid ammonia as heat from the room is transferred to the ammonia.  The resulting two-phased (liquid/vapor) ammonia from each evaporator is returned to the +15 F Recirculator where constant pressures (temperatures) are maintained based on the suction pressure of the compressors. \n\nThe +15 F Recirculator also supplies liquid to the -20 F Recirculator.  At the -20 F Recirculator, the ammonia is further expanded through a hand expansion valve, reducing the pressure (and hence the temperature).  The -20 F Recirculator vessel pumps liquid ammonia to the freezers (2) and the resulting two-phased (li"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 45156,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Arctic Cold Storage facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document which is maintained at the facility.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nArctic Cold Storage  maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations.\n\nArctic Cold Storage has coordinated emergency response efforts with the local fire department and with the contracted refrigeration operation and maintenance firm.  In the case of an ammonia-related emergency, it is the policy of Arctic Cold Storage to evacuate and to allow the fire department/HazMat Team to respond to the emergency.  The refrigeration contractor will be available for guidance and assistance.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThere are two refrigeration systems in place at the Arctic Cold Facility.  The first system was constructed in 1980.  Construction of the second ammonia refrigeration system at Arctic Cold Storage was completed in early 2006.  The facility serves as a distribution point for chilled goods that are shipped to retail outlets.  The facility is located at 4139 Roosevelt Road in Saint Cloud, Minnesota 56301about 1 mile north of the junction of the Interstate 94.  The immediate area is primarily undeveloped with some light commercial area"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 45156,
      "SummaryText": "quid/vapor) ammonia is returned to the same vessel.  In addition to the above, there are two evaporators which can operate in either a cold or freezer storage mode.\n\nThe vapor from both the +15 F Recirculator and the -20 F Recirculator is then drawn to three high stage screw compressors where the pressure and temperature of the gas is increased.  All three of the compressors are screw-type compressors which pull vapor from the vessels and discharge through a common header to the Condenser where the vapor is condensed to a high pressure liquid and drained back to the High Pressure Receiver.  Compressor discharge (hot gas) is also used for defrost of the evaporators.  An Auto Purger periodically purges the system of non-condensibles collected in the Condenser and High Pressure Receiver.  Dual pressure relief valve assemblies are installed on each vessel (set at 250 psig on all vessels, except for the compressor oil separator relief valves which are set at 300 psig) to relieve high pressure ammonia to the atmosphere in case of a high pressure event.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe Arctic Cold Storage ammonia refrigeration systems have many safety features.  Much of the safety of the systems is inherent in the policies and procedures that govern the operation of the system.  For example, the Arctic Cold Storage facility operates in accordance with OSHA's Process Safety Management regulation.  Refrigeration contractors, experts in the ammonia refrigeration industry, are contracted at the facility to maintain the system and perform any repairs.\n\nThe Arctic Cold Storage facility including each ammonia system was designed and constructed in accordance with the Uniform Mechanical Code which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include ammonia sensors in the engine rooms as well as sensors in the cold storage areas, and automatic shut down system"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 45156,
      "SummaryText": "s that prevent equipment damage and ammonia releases.  In addition, the majority of the ammonia inventory is maintained inside the machine room and just outside of the machine room (condensers).  All pressure vessels are equipped with pressure relief valves that automatically engage in case of a high pressure situation and vent through a common header to the atmosphere.\n\nIn addition to the Uniform Mechanical Code, the facility will operate in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines.  In particular, the IIAR Bulletin 110, \"Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems.\"\n\nFIVE YEAR ACCIDENT HISTORY\n\nAn investigation into the accident history of the facility revealed that there had been no reportable releases of ammonia over the past five years (March 2001 ¿ March 2006)\n\n\nEMERGENCY RESPONSE PROGRAM\n\nArctic Cold Storage has an emergency action plan in effect at the facility.  If a release of ammonia were to occur, Arctic Cold Storage will determine the extent of the emergency.  The alarms are tied into the ammonia sensors and will automatically alarm.  Arctic Cold Storage management will determine if an evacuation is necessary.  They will call 911 in order to reach the appropriate HazMat team who will respond to the ammonia release.  \n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe initial Process Hazard Analysis (March 2006) provided mitigation measures to improve safety at the Arctic Cold Storage facility located at 4139 Roosevelt Road in Saint Cloud, Minnesota.  In addition, the facility is planning to complete several items over the next year as their continued effort to provide a safe work environment for Arctic Cold Storage employees.  These changes include the following:\n\n1.  Continue to train all employees in Process Safety Management and the faclilty's safety program.\n2.  Continue to have employee involvement in updating and refining Process Safety Management and the facility's safety programs.\n3."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 45156,
      "SummaryText": "Continue employee involvement through the Employee Participation Program.\n4.  Continue internal and external safety audits/inspections and implement changes as needed."
    }
  ]
}