{
  "FacilityID": 45244,
  "FacilityName": "COS Samoa Packing Company",
  "FacilityStr1": "Highway 1",
  "FacilityStr2": null,
  "FacilityCity": "Atu'u",
  "FacilityState": "AS",
  "FacilityZipCode": "96799",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "60020",
  "LEPC": null,
  "FacilityLatDecDegs": "-14.160708",
  "FacilityLongDecDegs": "-169.410000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.chickenofthesea.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 172022154,
  "ParentCompanyName": "Thai Union Frozen Products PCL",
  "Company2Name": "Chicken of the Sea International",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "COS Samoa Packing",
  "OperatorStr1": "P.O. Box 957",
  "OperatorStr2": null,
  "OperatorCity": "Pago Pago",
  "OperatorStateFIPS": "AS",
  "OperatorZipCode": "96799",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brett Ransby",
  "RMPTitle": "Plant Engineering Manager",
  "FTE": 2400,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000015805",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-01-13 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-03-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-03-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-03-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-05-02 00:00:00",
  "DeRegistrationEffectiveDate": "2010-10-15 00:00:00",
  "AnniversaryDate": "2011-03-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 14.27389,
  "FRS_Long": -170.68556,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "UNKNOWN",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 65424,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 45244,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 66985,
          "ProcessID": 65424,
          "NAICSCode": "311711",
          "_desc": {
            "NAICS_CODE": "311711",
            "NAICS_DESCRIPTION": "Seafood Canning"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 86652,
          "ProcessID": 65424,
          "ChemicalID": 56,
          "Quantity": 13300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 586652,
          "ProcessID": 65424,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 45244,
      "SummaryText": "The Samoa Packing company is a tuna cannery that contains refrigerated areas which are cooled by an anhydrous ammonia refrigerant system. Anhydrous ammonia, which is regulated by the EPA, is the most economical and efficient refrigerant available. However, the properties of ammonia make it necessary to observe certain safety precautions while operating the system, to prevent employee exposure and to reduce the threat of exposure to nearby members of our community.\n\nThe Samoa Packing Company chose to follow the EPA Chemical Accident Prevention Rule, Program Level 3, to prevent a release of ammonia from the refrigeration system. The amount of ammonia estimated to be contained within the refrigeration system is 13,300 pounds.\n\nThe Samoa Packing Company complies with the EPA?s Accidental Release Prevention Rule, and applicable territory codes and regulations, and the manufacturer?s and insurance underwriter?s requirements to prevent a catastrophic release of ammonia from the refrigeration system. The ammonia refrigeration system was designed and built to the International Institute of Ammonia Refrigeration (IIAR) guidelines. The operators of the system are required to complete a training and certification program to operate the ammonia refrigeration system.\n\nThe Accidental Release Prevention Program does not guarantee against an accidental release. An offsite consequences analysis was completed using the EPA Aloha computer model to simulate various releases of ammonia from the refrigeration system. The worst case scenario considered the loss of the total charge (13,300 lbs) of anhydrous ammonia in a one minute (60 second) period. The analysis showed that the released vapor could travel approximately 1.2 miles (2,112 yards). There are approximately 15,000 residents that could be potentially affected in the identified radius. There are also public receptors (hospitals, schools, recreational areas and industrial/commercial buildings) in the potentially affected area.\n\nThe "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 45244,
      "SummaryText": "alternative release scenario, which is the most likely release scenario, considered a release of ammonia from a broken pipe fitting at the tank base. A release of 13,300 pounds of ammonia over a three minute period was considered. The analysis showed that the released vapor could travel approximately 0.94 miles (1.666 yards). There are approximately 3,000 residents that could be potentially affected in the identified radius. There are also public receptors (schools and industrial/commercial buildings) in the potentially affected area.\n\nNo administrative controls or mitigation measures were used to limit the chemical release distances for either scenario\n\nThe Samoa Packing Company has an established Emergency Action Plan to respond to emergencies. The plan was developed in compliance with 29 CFR 1910.38. The plan requires employees to evacuate the facility, to a safe area, during a fire or ammonia release. The territorial emergency agencies will notify any potentially exposed neighbors. Maintenance personnel will be available as a resource during an ammonia release emergency. The plan also addresses natural hazard emergencies, fires, bomb threats, civil disturbances, and utility outages.\n\nThis location has not experienced an ammonia release in the last five years.\n\nThe Samoa Packing Company wanted to evaluate the potential failures of the refrigeration system and if their existing safeguards were sufficient to prevent a catastrophic release of ammonia. A Process Hazard Analysis update was completed on October 29, 2004. The planned changes to improve safety resulting from this analysis are documented in the Process Hazard Analysis report, in the Accidental Chemical Release Prevention Program. Also, the guidelines of the ammonia system manufacturer and the guidelines of the International Institute of Ammonia Refrigeration (IIAR) are followed, where applicable, to manage the refrigeration system."
    }
  ]
}