{
  "FacilityID": 45325,
  "FacilityName": "Grocers Supply Company",
  "FacilityStr1": "3100 E. Holcombe Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Houston",
  "FacilityState": "TX",
  "FacilityZipCode": "77021",
  "Facility4DigitZipExt": "2199",
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-City Of Houston",
  "FacilityLatDecDegs": "29.702778",
  "FacilityLongDecDegs": "-095.380000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7931439,
  "ParentCompanyName": "Grocers Supply Company",
  "Company2Name": null,
  "CompanyDUNS": 7931439,
  "Company2DUNS": 0,
  "OperatorName": "Grocers Supply Company",
  "OperatorStr1": "3100 E. Holcombe Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77021",
  "OperatorZipCodeExt": "2199",
  "RMPContact": "Kevin Kylberg",
  "RMPTitle": "Maintenance Manager",
  "FTE": 170,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000029337",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-03 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-04-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-04-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-03-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-03-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 29.7028,
  "FRS_Long": -95.3781,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ZIP+4 CENTROID",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "1",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 65536,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 45325,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 67097,
          "ProcessID": 65536,
          "NAICSCode": "311514",
          "_desc": {
            "NAICS_CODE": "311514",
            "NAICS_DESCRIPTION": "Dry, Condensed, and Evaporated Dairy Product Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 86816,
          "ProcessID": 65536,
          "ChemicalID": 56,
          "Quantity": 28110.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 586816,
          "ProcessID": 65536,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 45325,
      "SummaryText": "A.   Accidental Release Prevention and Emergency Response Policies\n\nGrocers Supply Company recognizes management?s responsibility in protecting its employees, the public, the environment, equipment, and property.  The safety and health of all personnel are very important.  The control of accidents has been and will continue to be a basic responsibility of all personnel in the Houston facility.\n\nTo accomplish the company?s goal in preventing accidents, the facility has established a Plant Safety Program.  The objectives of the Plant Safety Program are to: maximize safety performance, eliminate human suffering resulting from injuries and accidents and reduce losses associated with damage of property.\n\nOne of the activities associated with the Plant Safety Program has been the development and implementation of accidental release prevention and emergency response programs which are designed to comply with OSHA?s Process Safety Management (PSM) standard (Process Safety Management of Highly Hazardous Chemicals, 29 CFR 1910.119), and EPA?s Risk Management Program (RM program) regulation (Risk Management Programs for Chemical Accidental Release Prevention, 40 CFR Part 68).\n\nThe purpose of the accidental release prevention and emergency response programs is to prevent the occurrence, and minimize the consequences of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.  Overall, these programs help prevent accidental fatalities, injuries and illnesses, environmental impacts and physical property damage.\n\nThe accidental release prevention and emergency response programs help prevent accidents because they focus on the rules, procedures, and practices which govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary.  They are also communicated to and accepted by all employees at the facility.\n\n\nB.   Description of the Accidental Release Prevention Program\n\nThe "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 45325,
      "SummaryText": "prevention program consists of the following elements:\n\n    ?    Employee Participation: This program involves the employees in establishing and implementing the program.  Employees are also to be involved when a process hazard analysis is conducted.  The program also ensures that all employees have complete access to the program.\n\n    ?    Process Safety Information: Written information has been collected which enables the employees to identify and understand the potential hazards in the system. The written information includes the ammonia MSDS and a description of the design of the ammonia refrigeration system.\n\n    ?    Process Hazard Analysis: Formal studies using the What-If/Checklist  Technique have been conducted to examine the system and identify potential hazards. Any recommendations are resolved to improve facility safety. \n\n    ?    Operating Procedures:  Written, detailed procedures have been developed which describe the steps which should be followed to safely operate the ammonia refrigeration system.\n\n    ?    Training: A training program has been developed which ensures that employees are trained on all aspects of the system and on the duties which they should perform to ensure the safe operation of the ammonia refrigeration system.\n\n    ?    Contractors: All contractors are screened and evaluated before they perform work on or near the ammonia refrigeration system.  The contractors are also periodically evaluated to ensure that they perform work by following safe work practices.\n\n    ?    Pre-Startup Safety Review: A pre-startup safety review is required  for all new ammonia projects to verify that all safety programs are in place, training has been performed, and construction has been completed according to design standards before the project is put into use. They are also performed when there is a change in the  process safety information\n    \n    ?    Mechanical Integrity:  This program ensures that the ammonia refrigeration systems are built and maintained using preventive maintenance procedures "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 45325,
      "SummaryText": "to minimize unexpected breakdowns or failures.\n\n    ?    Hot Work Permit: These procedures ensure that a signed permit is obtained prior to any cutting, welding, or burning.\n\n    ?    Management of Change: Procedures are designed to ensure that all changes made to the ammonia refrigeration system are properly reviewed.\n\n    ?    Incident Investigation: Procedures ensure that any incidents (and near misses) are investigated, reviewed, and documented using an investigation team. Any recommendations are resolved to improve the safety of the facility. \n\n    ?    Compliance Audits: There are procedures to conduct regular audits of the RM prevention program to ensure that the program is in place and working properly.  Any recommendations from audits are resolved to improve the RM program. \n\nC.   Five-Year Accident History\n\nThere have been no ammonia-related incidents at the Grocers Supply Company within the last five years that have resulted in any onsite or offsite impacts.\n\n\nD.   Description of the Emergency Response Program\n\nAn emergency response program has been implemented at the Grocers Supply Company facility.  This program contains procedures describing how the facility will respond to ammonia spills and other emergencies, including evacuation procedures.  The program has been coordinated with the Houston Fire Department.\n\nThe emergency response program consists of the following elements:\n\n    ?    Organization Plan and Responsibilities\n    ?    Communications Procedures\n    ?    Detailed Action Plans\n    ?    First Aid Procedures\n    ?    Emergency Medical Treatment Procedures\n    ?    Evacuation Plans\n    ?    Description of Outside Assistance Available\n    ?    Site Re-Entry Procedures\n    ?    Training Programs and Drills\n\n\nE.   Planned Changes to Improve Safety\n\nThe following changes are planned to improve safety conditions and  further strengthen the ongoing safety efforts at the Grocers Supply Company facility:\n?    installation of safety shower and eye wash station on the roof;\n?    continued on-going training for the maintenance/operatio"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 45325,
      "SummaryText": "ns personnel."
    }
  ]
}