{
  "FacilityID": 45622,
  "FacilityName": "La Paloma Generating Plant",
  "FacilityStr1": "1760 W. Skyline Road",
  "FacilityStr2": null,
  "FacilityCity": "McKittrick",
  "FacilityState": "CA",
  "FacilityZipCode": "93251",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Kern County",
  "FacilityLatDecDegs": "35.295167",
  "FacilityLongDecDegs": "-119.593611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "La Paloma Generating Company, LLC",
  "Company2Name": null,
  "CompanyDUNS": 24601283,
  "Company2DUNS": 0,
  "OperatorName": "La Paloma Generating Company, LLC",
  "OperatorStr1": "P.O. Box 175",
  "OperatorStr2": "1760 W. Skyline Road",
  "OperatorCity": "McKittrick",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93251",
  "OperatorZipCodeExt": null,
  "RMPContact": "Zenis Walley",
  "RMPTitle": "Environmental Manager",
  "FTE": 38,
  "OtherEPAFacilityID": "CAR000065128",
  "EPAFacilityID": "100000190651",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "S-3412-0-1",
  "SafetyInspectionDate": "2005-03-09 00:00:00",
  "SafetyInspectionBy": "CUPA - Kern County",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-05-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-05-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-05-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-05-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 66010,
      "AltID": "SCR",
      "FacilityID": 45622,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 67578,
          "ProcessID": 66010,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 87375,
          "ProcessID": 66010,
          "ChemicalID": 57,
          "Quantity": 350400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 587375,
          "ProcessID": 66010,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 45622,
      "SummaryText": "La Paloma Generating Company (LPGC), LLC has installed Selective Catalytic Reduction (SCR) technology to reduce emissions of nitrogen oxides (NOx).   SCR is a post-combustion flue gas NOx emission control technology that removes NOx from the flue gas downstream from the combustion process.  A reducing agent is used to reduce NOx emissions, primarily nitric oxide (NO) and nitrogen dioxide (NO2), by oxidation-reduction reactions in the presence of a catalyst.  The most common reducing agent (reagent) used with SCR is ammonia.  Injection of ammonia into the combustion exhaust stream before the catalyst initiates the reactions and achieves the desired removal of NOx emissions upstream from the emission stack.  In order to minimize the handling of hazardous materials, the La Paloma Generating Plant utilizes ammonia in the form of an industrial grade aqueous ammonia solution in water (29% ammonia by weight) as the reagent for the SCR reactions.\n\nIn addition to the SCR, other equipment required for the NOx control includes an aqueous ammonia unloading and storage facility, and an aqueous ammonia piping and injection system to deliver the ammonia from the storage tanks to the exhaust ducting from the boiler.  Three carbon steel storage tanks with a maximum capacity of approximately 14,000 gallons each support the SCR.  These tanks are constructed in accordance with Uniform Building Code Seismic Zone 4, Uniform Fire Code Article 80, and American Society of Mechanical Engineers Pressure Vessel Code Section VIII, Division 1 rules for construction of pressure vessels.  Transport of aqueous ammonia to the La Paloma facility is by means of bulk tanker trucks with individual deliveries of about 8,000 gallons.\n\nThe combined footprint of the unloading and storage facility is approximately 40 feet by 80 feet.  The concrete floor of this area is sloped to contain and drain accidental spills to a large capacity sub-grade concrete containment area (secondary containment).  Even the wors"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 45622,
      "SummaryText": "t-case accidental release, a tank failure resulting in the instantaneous release of its entire contents, will flow into this sump in just over one minute.  In addition, the ammonia-handling facility is equipped with extensive ammonia detection and alarm systems to protect workers and equipment in the event of a malfunction anywhere in the system.\n\nThe installation and use of equipment for the storage and handling of aqueous ammonia in support of the SCR requires compliance with numerous environmental and safety regulatory requirements, including preparation of this Risk Management Plan (RMP) pursuant to the EPA Risk Management Program under Section 112(r) of the Clean Air Act, and the California Accidental Release Program (CalARP).  In Kern County, the local administering agency (AA) is the Kern County Environmental Health Services Department (KCEHSD), which determined that an RMP is required in connection with the aqueous ammonia facilities.  The KCEHSD is also the local Certified Unified Program Agency (CUPA).  This document is the RMP prepared for submittal to the EPA and KCEHSD/CUPA to address the unloading, storage and handling of aqueous ammonia at the La Paloma Generating Plant.\n\nA.  Accidental Release Prevention and Emergency Policies in Place at Facility\n\n      -LPGC complies with the EPA Risk Management Program and the California Accidental Release Prevention Program (CalARP).\n      -A copy of LPGC's emergency response procedures is included in the Plant Manual, Volume 3, Procedure 3.01. \n\nB.  Description of Regulated Processes and Regulated Substances Handled\n\n     -The primary activity of the La Paloma Generating Plant is generation of electric power.\n     -The only regulated substance used in an amount triggering the EPA and CalARP programs Threshold Planning Quantity is aqueous ammonia (29% by weight in water solution), which is used as the reagent for Selective Catalytic Reduction (SCR) emission control technology installed on the La Paloma Power Gene"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 45622,
      "SummaryText": "rating Plant.\n     -The maximum quantity of aqueous ammonia stored on-site is approximately 42,000 gallons, i.e. three 14,000-gallon capacity tanks.  \n\nC.  Worst-Case Ammonia Release Scenario and Alternative Release Scenario for Aqueous Ammonia\n\n     -The worst-case scenario is complete failure of one 14,000-gallon tank of aqueous ammonia with complete loss of product under worst-case atmospheric dispersion conditions.  The aqueous ammonia will drain rapidly into a concrete secondary containment area within the storage building; this will limit the volatilization of the ammonia to the atmosphere.  No alternative release scenario is required for a Program 1 RMP.\n\nD.  General Accidental Release Prevention Program\n\nThe principal features of the design and operating procedures for the aqueous ammonia handling and storage facility implemented to minimize the occurrence of an accidental release of aqueous ammonia and the consequences if a release occurs are listed below.  Other important safety features are discussed throughout this RMP.\n\n     -Secondary containment structures are sized to capture an aqueous ammonia spill from the unloading or storage facility.\n     -Design of the tanker truck unloading and storage tank facility to achieve rapid containment of any spilled ammonia to a secondary containment sump.\n     -Safety and pressure relief valves on each storage tank.\n     -Shut-off valves located on the tank fill and vapor return lines that can be activated by the delivery truck operator.\n     -Ambient ammonia detectors with safety alarms in the ammonia unloading area and in the storage building.\n     -Hardwired trip switches in the storage area and the plant's control room to shut down the ammonia pumps and generate safety alarms regardless of PLC functional status.\n     -A ventilation system that automatically shuts the ammonia building vents in the event of a release.\n\nE.  Five Year Accident History\n\n     -The La Paloma Generating Plant first took delivery of amm"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 45622,
      "SummaryText": "onia at the site in April 2002.  There have been no reportable accidents at the facility to date.\n \nF.  Planned Changes To Improve Safety\n\n     -The procedures and equipment that are described in this RMP for detecting unplanned releases of aqueous ammonia and for responding in the event of such a release have been implemented for the aqueous ammonia handling and storage facilities."
    }
  ]
}