{
  "FacilityID": 45633,
  "FacilityName": "High Desert Power Project",
  "FacilityStr1": "19000 Perimeter Road",
  "FacilityStr2": null,
  "FacilityCity": "Victorville",
  "FacilityState": "CA",
  "FacilityZipCode": "92394",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06071",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "34.593611",
  "FacilityLongDecDegs": "-117.362778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 50511463,
  "ParentCompanyName": "High Desert Power Project, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "High Desert Power Project, LLC",
  "OperatorStr1": "19000 Perimeter Road",
  "OperatorStr2": null,
  "OperatorCity": "Victorville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92394",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dave Boward",
  "RMPTitle": "General Manager",
  "FTE": 31,
  "OtherEPAFacilityID": "CAR000144493",
  "EPAFacilityID": "100000181288",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1047",
  "SafetyInspectionDate": "2003-02-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-05-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-05-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-05-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-01-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 34.59556,
  "FRS_Long": -117.40006,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 66034,
      "AltID": null,
      "FacilityID": 45633,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 67602,
          "ProcessID": 66034,
          "NAICSCode": "22111",
          "_desc": {
            "NAICS_CODE": "22111",
            "NAICS_DESCRIPTION": "Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 87402,
          "ProcessID": 66034,
          "ChemicalID": 57,
          "Quantity": 310000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 587402,
          "ProcessID": 66034,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 45633,
      "SummaryText": "NOTE:  An original RMP submission was previously provided to all the relevant agencies.  In accordance with the revised requirements of the Chemical Accident Prevention Rule under Clean Air Act section 112(r), this RMP for the High Desert Power Project (HDPP) has been revised to include the following :\n\n? Included requirement to add information on reportable chemical accidents to the RMP within six months of the date of the accident;\n? Incorporated requirement to report changes to emergency contact information within one month;\n? Removal of the offsite consequence analysis (OCA) description from the RMP executive summary;\n? Added e-mail address for the emergency contact;\n? Included the purpose and type of any submission that revises or otherwise affects previously filed RMPs; and\n? Included the name, address, and telephone number of the contractor who prepared the RMP.\n\n\nA.ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE\nPOLICIES\n\nThe High Desert Power Plant employees conduct ongoing inspections, testing, and replacement of the critical items in the aqueous ammonia systems.  The aqueous ammonia systems are monitored during (at least) daily rounds by a High Desert Power Plant employee.  Typically, the High Desert Power Plant operators perform cursory facility inspections twice per shift, or six times per day.  Once identified, the High Desert Power Plant will fix or outsource any system deviation that is noted.  In any case, a record of the maintenance or work performed on the system is maintained by the Plant Supervisor.\n\nThe High Desert Power Plant has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Response Program section of the CalARP document, which is maintained at the facility and updated as necessary.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nThe Plan provi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 45633,
      "SummaryText": "des the response organization and notification procedures, evacuation routes, aqueous ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year in conjunction with the Emergency Business Plan for the Victorville Fire Department.  This Plan was reviewed and updated to ensure compliance with the CalARP and RMP regulations, as well as to incorporate facility changes.\n\nThe High Desert Power Plant has coordinated emergency response efforts with the local fire department, Victorville Fire Department.  In the case of an aqueous ammonia-related emergency, it is the policy of the High Desert Power Plant to evacuate the employees and to allow the fire department to respond to the emergency (potentially with the assistance of trained facility personnel).  The High Desert Power Plant also plans to contract with a private company to respond to any hazardous materials spills.\n\nB.STATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe High Desert Power Plant is located at 19000 Perimeter Road in Victorville, California.  The facility is situated northwest of Interstate 15 off the D Street exit.  The immediate area is primarily industrial and rural.  The location for storing aqueous ammonia is in the southerly side of the property.  Ammonia sensors provide an alarm status to the control room which is manned 24 hours per day.  The High Desert Power Plant is a 750 MW unit that will be placed in commercial operation in May 2003.  The Selective Catalytic Reduction (SCR) system scheduled completion date is in January 2003.  The facility uses 25% aqueous ammonia to catalytically reduce boiler flue gas nitrogen oxide (NOx) emissions to elemental nitrogen and uses 19% aqueous ammonia to control the pH level of the condensate.\n\n25% aqueous ammonia is used as a catalyst in the SCR system to assist in controlling the NOx emissions from the stack.  I"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 45633,
      "SummaryText": "t is the only CalARP regulated substance on site.\n\nThe maximum inventory of 25% aqueous ammonia at the High Desert Power Plant is 39,300 gallons (308,702 pounds).\n\nC.HAZARD ASSESSMENT SUMMARY\n\nThe off-site consequence analysis (OCA) summary has been deleted due to security concerns, per EPA request.\n\nD.ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe storage of aqueous ammonia at the High Desert Power Plant is governed by many safety features.  Much of the safety of the process is inherent in the policies and procedures that govern the operation of the process.  For example, the High Desert Power Plant operates in accordance with the California Accidental Release Prevention (CalARP) Program.  The CalARP Program included detailed hazard review to identify potential release scenarios, an analysis of the potential consequences associated with select release scenarios and a detailed seismic inspection of the aqueous ammonia process equipment.  In addition to the technical studies, the CalARP Program incorporated preventive programs such as detailed operating and maintenance procedures, incident investigation, training, auditing, and emergency response activities.  Finally, the aqueous ammonia processes are inspected by operators every two hours.\n25% Aqueous Ammonia\n\nThe High Desert Power Plant maintains tight control of its aqueous ammonia system through various process controls and monitors.  In the event that the primary engineering or administration controls at the facility fail and result in a release of aqueous ammonia, there are three mechanisms at the facility to minimize the impact:  1) a containment berm surrounding the aqueous ammonia tank sized to hold the entire contents of the tank, 2) an underground storage tank to contain any spills during the unloading process, and 3) both the storage tank and the underground containment tank are double-walled.  There are level controls on the storage tank to alert the operator to extreme"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 45633,
      "SummaryText": " level conditions. \n\nE.FIVE YEAR ACCIDENT HISTORY\n\nAny release of a chemical process covered in this RMP (aqueous ammonia) that results in deaths, injuries, significant property damage onsite, or known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place, must be included in the Five Year Accident History.  There have been no such accidents to report since the aqueous ammonia treatment systems were installed at new plant site in January 2003.  Should an accident occur, this RMP must be updated within 6 months of the incident. \n\nF.EMERGENCY RESPONSE PROGRAM\n\nThe following summarizes the emergency response and notification procedures at the facility:\n\n1. First call 911 on an internal/land line phone for the Victorville Fire Department and police department.  The Victorville Fire Department can also be reached at (760) 955-5227 and the Victorville Police Department at (760) 241-2911. \n\n2. Immediately contact either the Plant Engineer (Tony Penna), Operations Manager (Andy Stephens), Maintenance Manager (Ed Lesh), or General Manager (Dave Boward).\n\n3. Call the Governor's Office of Emergency Services (OES) Warning Center 1-800-852-7550.\n\n4. If additional help is required for an aqueous ammonia spill or leak, the facility can call Asbury Environmental Services (800) 590-4229.\n\n5. If an aqueous ammonia release exceeds 1000 pounds or 135 gallons, call the National Response Center 1-800-424-8802 [24 hours, 7 days].\n\n6. If serious injuries or harmful exposures to workers occur, call the nearest Cal-OSHA Office at (909) 383-4321.\n\n7. If an employee ingests aqueous ammonia, the Poison Control Center can be reached 24 hours per day at 1-800-342-9293.\n\n8. Notify the local CalARP regulatory agency: Victorville Fire Department, Hazardous Materials Division at (760) 955-5229.\n\n9. Call for assistance with chemical cleanup.  Do NOT use a regular vacuum truck, as they are not equipped to handle chemicals of this type.\n\n10. Notify the Vict"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 45633,
      "SummaryText": "or Valley Wastewater Reclamation Authority at (760) 246-8638.\n\n11*.If any amount of aqueous ammonia is released into the storm drain, contact the Department of Fish and Game at their 24-hour hotline:  (888) DFG-CALTIP.\n\n*The Department of Fish and Game receives a copy of the OES report; however if a significant amount is spilled into the storm drain, they would appreciate being contacted directly.\n\nNOTE: There is an aqueous ammonia tote adjacent to the North Western side of the High Desert Power Plant belonging to the Victor Valley Wastewater Reclamation Authority.  In the event of an aqueous ammonia leak, be aware of the presence of another source and do not evacuate towards such source.\n\nEmergency Procedures:\n\n1. The Control Room Operator will determine the extent of the release and proper notifications to make.\n\n2. The Control Room Operator will sound alarm to evacuate area.  Evacuation area must be upwind from ammonia vapors.\n\n3. Evaluate hazards.  Barricade area with banner tape or cones to prevent access by other employees.\n\n4. Ensure proper PPE; \n\n5. Ensure that staff responding to emergency has proper training.\n\nInjured persons will be taken to the Designated Reporting Areas until professional medical assistance is available.  It is essential that any contaminated person is decontaminated as they leave the contamination zone, prior to entering the Designated Reporting Areas / Staging Areas.  Injured victims must be thoroughly decontaminated prior to receiving medical assistance.\n\nThe first aid kit will be taken to the Staging Areas or first aid/triage location established by High Desert Power Plant - Plant Engineer.  All trained first aid personnel will report to first aid area to assist the injured.\n\nNo rescue attempt will be made unless safe for the rescuer(s).  Any employee attempting a rescue may only do so if hazards are identified, employee has proper PPE & training, it has been confirmed by head count that an employee is unaccounted for and may still "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 45633,
      "SummaryText": "be in the facility and there is back up for the rescuer with equivalent training & PPE to assist.  \n\n6. Contain spill or leak, if safe to do so, by closing valve, putting down absorbent, etc.\n\nThe emergency response plan is summarized in this section.  The plan is distributed to new hires who are required to read and sign a certification page.\n\nG.PLANNED CHANGES TO IMPROVE SAFETY\n\nThe Hazard Review provided mitigation measures to improve safety at the High Desert Power Plant located at 19000 Perimeter Road, Victorville, California 92394.  All recommendations are completed or are being implemented at the site.  A Seismic Assessment was conducted upon completion of construction of the storage tank and associated piping, in November 2002.\n\nPhase I - HAZOP Study - Session 1 (Storage Tank)\n\n\nR01:  Incorporate response procedures for evacuation notification in the emergency response program (i.e. using the radios to evacuate or isolate the area).\n\nStatus:  Complete.\n\nR02: Incorporate a written procedure/checklist for both the truck driver and the employee to follow at the time of delivery and prior to the filling the tank.\n\nStatus:  Complete.\n\nR03: Within the maintenance program, include an annual inspection of all pressure relief valves.\n\nStatus:  Complete.\n\nR04: Within the delivery procedures, include an inspection of the paper work, checking to match the bill-of-loading with the invoice.\n\nStatus:  Complete.\n\nR05: Check manufacturer?s recommendations regarding relief valve maintenance/replacement. (Some industry groups recommend replacement or recertification every five years).  Incorporate the finding in the maintenance program.\n\nStatus:  Complete.\n\nR06: Determine the shut off mechanism for the pumps.  Check if they can be remotely shut down from the control room or by a switch outside the containment berm.\n\nStatus:  Complete.\n\nR07: In the event that the system is not running, consider closing the discharge valve.\n\nStatus:  Complete.\n\nR08: If an odor of ammonia is dete"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 45633,
      "SummaryText": "cted during the walk through, take note of it.  Keep a record of where it was detected; the odor may only last a few seconds and the location needs to be accurate.\n\nStatus:  On going.\n\nR09: Consider installing insulation on the above ground piping.  Due to extreme temperatures, the insulation will help to prevent scolding. \n\nStatus:  Complete.\n\nR10: Obtain safety equipment that employees should use (i.e. rubber gloves, hard hats, eye and skin protection).\n\nStatus:  Complete.\n\nR11: Determine disposal procedures for the aqueous ammonia in the event it spills into the containment tank and document this procedure.\n\nStatus:  Complete.\n\nR12: Conduct a final inspection with the Hazard Review Team once construction is complete.\n\nStatus:  Complete.\n\nR13: Conduct a seismic inspection of the system once construction is complete.\n\nStatus:  Complete. \nPhase I - HAZOP Study - Session 2 (Tote)\n\nR14: With any release or threatened release, notify the Victorville Fire Department.\n\nStatus:  Complete.\n\nR15: Train employees to run up wind of an aqueous ammonia spill.\n\nStatus: Implemented and On going.\n\nR16: Alert employees of the aqueous ammonia source that is maintained offsite.  In case of a release, they will not run towards the direction of the offsite source in the process of running upwind.\n\nStatus:   Implemented and On going.\n\nR17: Consider notifying the Victor Valley Wastewater Reclamation Authority of a leak.  Their operators or maintenance employees need to determine if the leak is from their tote.\n\nStatus:  Complete.\n\nR18: Determine if there will be any Emergency Responders for the High Desert Power Plant.  The Responders need 40 hours of training to respond to any leak or spill.\n\nStatus:  Complete.\n\nR19: Consider installing an ammonia sensor inside the Chemical Feed Building to warn employees of a leak prior to entering the building.  The sensor should have a visual alarm seen outside the building door alerting employees of a leak.\n\nStatus:  Complete.  \n\nR20: Investigate an"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 45633,
      "SummaryText": "d document whether the containment within the building is sufficient to hold 400 gallons of aqueous ammonia.\n\nStatus:  Complete.\n\nR21: Investigate whether there are two doors into the building.  If there are, open one to blow out the ammonia vapor while repairing a maintenance leak.\n\nStatus:  Complete.\n\n \nR22: Include in the delivery procedures a process of checking for leaks during connection.\n\nStatus:  Complete.\n\nR23: Consider blocking off the area while a chemical delivery is taking place.\n\nStatus:  Complete.\n\nR24: During connecting and disconnecting for the delivery process, a High Desert Power Plant employee should wear safety goggles.\n\nStatus:  Complete.\n\nR25: Determine a way to contain the aqueous ammonia from uncontrolled spilling from the tote.  Consider sloping the concrete slab or adding gravel around the perimeter of the slab that the tote sits on.\n\nStatus:  Complete.\n\nR26: Document a procedure for the delivery of the aqueous ammonia tote.  The employee must check the tote and determine if it is adequate (i.e. no holes, valving is correct, the right concentration of ammonia is delivered). \n\nStatus:  Complete.\n\nPhase II - HAZOP Study\n\nR27: Conduct an ammonia awareness training program that includes informing all employees of the following: 1) the presence of and the hazards associated with ammonia at the facility, 2) how to recognize the odor, 3) what to do if they observe a leak, 4) where to go if they are told to evacuate.\n\nStatus:   Implemented and On going.\n\nR28: Consider including emergency situations such as, fire, earthquakes, and ammonia release in the Emergency Response Plan.\n\nStatus:  In Progress.  Specific verbage to be added by December 2004.\n\nR29: Consider labeling the ammonia piping throughout the power plant including the suction and vent lines for delivery.\n\nStatus:  Complete.  \n\nR30: Consider adding a pump shut off switch or valve outside the containment berm.\n\nStatus:  Complete.  \n\nR31: Include the start up procedure for the 19% aqueous "
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 45633,
      "SummaryText": "ammonia pH control system in the operating procedures.\n\nStatus:  In Progress.\n\nR32: Consider installing a permanent ladder to get in and out of the containment tank for maintenance on the tank or the pumps.\n\nStatus:  Complete.  \n\nR33: Consider using a plug or cover to the underground containment tank whenever a delivery is not taking place.\nNote:  Using a post indicator valve.\n\nStatus:  Complete.\n\nR34: Determine a means of containing or controlling a 19% aqueous ammonia leak during an aqueous ammonia delivery.  Coordinate with Victorville Fire Department.\n\nStatus:  Complete.  Shut off valves and secondary containment fill/vent have been installed.\n\nSeismic Recommendations\n\nS01: Provide anchorage of the feed pump skid to the containment slab.\n\nStatus:   Complete.\n\nS02: Provide lateral bracing for elevated portion of the 60-psi ammonia pressure relief line.\n\nStatus:  Complete.\n\nS03: Provide adequate lateral bracing of the ammonia outlet line for run from skid to the structural pipeway.  This may be provided by proper support of the pipe at the inside surface of the containment wall.\n\nStatus:   Complete."
    }
  ]
}