{
  "FacilityID": 4569,
  "FacilityName": "Tahoe Truckee Sanitation Agency",
  "FacilityStr1": "13720 Joerger Drive",
  "FacilityStr2": null,
  "FacilityCity": "Truckee",
  "FacilityState": "CA",
  "FacilityZipCode": "96161",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06057",
  "LEPC": "Nevada County DEH",
  "FacilityLatDecDegs": "39.333333",
  "FacilityLongDecDegs": "-120.129583",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 86122249,
  "ParentCompanyName": "N/A",
  "Company2Name": "N/A",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Craig Woods, Plant Manager",
  "OperatorStr1": "13720 Joerger Drive",
  "OperatorStr2": null,
  "OperatorCity": "Truckee",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "96161",
  "OperatorZipCodeExt": null,
  "FTE": 56,
  "OtherEPAFacilityID": "cal000003215",
  "EPAFacilityID": "100000055682",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-07-08 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "chlorine",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2023-02-17 00:00:00",
  "DeRegistrationEffectiveDate": "2023-02-16 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.337778,
  "FRS_Long": -120.128611,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5317,
      "AltID": "Chlorine above threshold",
      "FacilityID": 4569,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 5701,
          "ProcessID": 5317,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5430,
          "ProcessID": 5317,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2117,
              "Process_NAICS_ID": 5430,
              "SafetyReviewDate": "1999-05-17 00:00:00",
              "PHA_Date": "1995-12-22 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1997-09-05 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Airplane Crash, Vehicle Accident, lightning, train Wreck, Digester Gas Explosion, Propane Tank rupture, Oxygen tank rupture, Power Failure, Excessive Snow, High Winds, Sabotage, Disgruntled Employees,",
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "enclosed building, fusible plugs, vacuum regulator, PSM Program.",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "chlorination process enclosed in building equipped with auto initiated neutralizing scrubber.",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "physical inspections, Standard Operating Procedures",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "PHA was conducted to take into consideration current chlorination process, facility and inventory",
              "OpProceduresReviewDate": "1999-06-09 00:00:00",
              "TrainingReviewDate": "1999-06-10 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Hazwopper to technician, Incident Commander, Chlorine repair kit B, Emergency response program.",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-10 00:00:00",
              "EquipmentInspectionDate": "1999-05-19 00:00:00",
              "EquipmentTested": "scrubber/chlor-alert chlorine sensor-alarm-scrubber system.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-10 00:00:00",
              "PreStartupReviewDate": "1997-01-01 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-02-20 00:00:00",
              "HotWorkPermitReviewDate": "1998-02-20 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1998-02-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2354,
                  "PreventionProgram3ID": 2117,
                  "ProcessChemicalID": 5701
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4569,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-14 00:00:00",
    "ERTrainingDate": "1998-06-09 00:00:00",
    "CoordinatingAgencyName": "Truckee Fire Dist & Nev. Co. E.H.",
    "CoordinatingAgencyPhone": "5305827850",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Nevada County Land Use and Development Code (LUDC) Chapter 11, Rules and Regulations of the Northern Sierra Air Quality Management District, AB 2588 Air Toxic Hot Spots Information and Assessment Act",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 4569,
      "SummaryText": "was assumed to occur outside the chlorine building, or when the one-ton chlorine container is being off-loaded from the truck into the chlorine building and the doors are open, rendering the scrubber system in-effective.  It was assumed that the entire contents of a single overfill container would spill as a liquid and vaporize in ten minutes.  Using the model RMPRO, with a wind speed of 1.5 meters/sec (3.4 miles per hour), atmospheric stability class F, and rural topographical conditions, the distance to the toxic endpoint for chlorine (3 ppm) is 7.2 miles.  The estimated residential population within the distance to the toxic endpoint for the worst-case release scenario was 4,500 persons.  \n\nPlease note that the chlorine leak prevention system employed at T-TSA (and described above) ensures a minimal risk of offsite consequences from a chlorine leak at the facility.\n\nAlternative Scenario\nThe one-ton chlorine container storage room and the chlorinator room of the chlorine building have chlorine leak detectors which automatically initiate the chlorine scrubber upon detection of chlorine at 1 ppm or greater.  All of the pressurized chlorine gas lines are in the one-ton container storage room.  An ejector creates a vacuum in the chlorine lines in the chlorinator room and gaseous chlorine is drawn into a three-inch diameter water line.  This chlorine solution leaves the chlorine building underground, conveyed 300 yards where it is injected into the plant effluent.  The concentration of dissolved chlorine in this water is about 417 ppm.  If this pipe were to rupture, it would cause a loss of vacuum, and this would automatically shut off the chlorine feed in the chlorine building.  The chlorine solution line is underground, and there is no exposure to the atmosphere.  The dissolved chlorine has little or no chance of getting into the atmosphere directly.  \n\nHowever, for the purposes of this RMP, the alternative release scenario assumes that the entire 300 yards of 3-inc"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 4569,
      "SummaryText": "Executive Summary\nBackground\nThe Tahoe-Truckee Sanitation Agency's water reclamation facility is located in Martis Valley, approximately three miles east of downtown Truckee, California.  The Agency's physical address is 13720 Joerger Drive, Truckee, California.  T-TSA is bordered by the Truckee River to the north, Teichert Construction to the east, the Truckee-Tahoe Airport to the south, and the Truckee Sanitary District to the west.\n\nT-TSA was formed in 1972 to provide wastewater treatment and disposal services for the Tahoe City Public Utility District, the North Tahoe Public Utility District, the Squaw Valley County Water District, the Alpine Springs County Water District, and the Truckee Sanitary District.  The regional water reclamation plant became operational in 1978 and was expanded in 1982.  The plant operates continuously and is attended 24 hours per day.\n\nThe plant wastewater treatment process includes grit removal, primary clarification, oxygenation, secondary clarification, lime flocculation, chemical clarification, filtration, carbon absorption, ammonia recovery, and disinfection.  Solids collected from primary and secondary clarification processes are thickened, digested, dewatered, and disposed of at the Lockwood landfill east of Reno.  The plant capacity is approximately 7.4 million gallons per day of raw sewage.\nAccidental Release Prevention and Emergency Response Policies at the Tahoe-Truckee Sanitation Agency (T-TSA) Facility\nT-TSA's managers and employees are committed to operation of a safe water reclamation facility, and are dedicated to effective management of chemical hazards and potential risks to employees, the public, and the environment.\n\nProcess Safety Management and Risk Management Planning at T-TSA\nThe existing facility stores an extremely hazardous material, chlorine, at levels that exceed the regulatory threshold requiring Occupational Safety and Health Administration (OSHA) process safety management.   T-TSA has implemented an ext"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4569,
      "SummaryText": "ensive PSM program, including periodic compliance audits to evaluate compliance with the following elements of a PSM program:\n* Process Safety Information\n* Process Hazard Analysis (PHA)\n* Operating Procedures\n* Training\n* Contractors\n* Pre-Startup Safety Review\n* Mechanical Integrity\n* Hot Work Permit\n* Management of Change\n* Incident Investigation\n* Emergency Planning and Response\n* Injury & Illness Prevention Program\n* Employee Participation\n\nStorage of chlorine also triggers requirements of California's Accidental Release Program (CalARP), including this submittal of a Risk Management Plan (RMP) in June 1999.   This RMP will replace the T-TSA Risk Management and Prevention Plan (RMPP) approved in 1996.\n\nIn addition to the PSM and RMPP/RMP programs in place at T-TSA, the facility operates according to a Business Plan, a Certificate of Operation for Hazardous Waste Generator Permit, and a Certificate of Operation and Standard Provisional Permit for Hazardous Materials Storage.  The Business Plan and permits are administered by the Certified Unified Permitting Authority (CUPA) for Nevada County, the Nevada County Department of Environmental Health (DEH).   The Business Plan is continuously updated, and provides T-TSA's facility maps, Hazardous Materials Inventory Statement, Emergency Response Plan, Mitigation Measures, Evacuation Plan, Training Plans and Procedures, and Material Safety Data Sheets (MSDS) for the materials handled and stored at the facility.  In addition to chlorine, these materials include ammonium sulfate, carbon monoxide, carbon dioxide, diesel fuel, ferric chloride, hydrochloric acid (5%), gasoline, oxygen, propane, sodium carbonate, sodium chloride, sodium hydroxide, sulfuric acid, ethylene glycol, and small volumes of other hazardous materials, such as petroleum distillates and laboratory chemicals.  \n\nT-TSA has undertaken numerous process changes in the past five years to minimize chemical hazards and potential risks.  Examples include a faci"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4569,
      "SummaryText": "lity-wide goal to minimize inventories of hazardous materials, while cost-effectively maintaining effluent quality.  One specific example is the retrofit of the biological phosphorus removal process, whereby the use of process lime was significantly reduced.  This goal is also accomplished by implementing use of non-hazardous or less hazardous chemical substitutes.  For example, by reducing the concentration of the hydrochloric acid solution in use at the facility from a 35% solution to a 5% solution, the respiratory hazard associated with the bulk hydrochloric acid stored at T-TSA was significantly reduced.  A Process Hazard Assessment was conducted for the sulfuric acid handling systems following an accidental release in 1995, and mitigation measures were implemented to ensure no further accidents would occur.\n\nT-TSA also demonstrates its commitment to safety by designing, building, and operating  safe chemical handling facilities.  For example, prior to the design of the new Chlorine Building at T-TSA, a Process Hazard Analysis was conducted with design engineers, operations staff, management personnel, and maintenance staff responsible for the chlorine process.  Release prevention measures were included at the design stage, ensuring their safe implementation prior to and during start-up and operation of the facility.\n\n\n\n\n\nThe Regulated Substances Handled at T-TSA\n\nChlorine is the only regulated substance present at the plant above the threshold quantity pursuant to section 112 (r) (5) of the Clean Air Act, as amended, and listed in 40 CFR 68130.  T-TSA stores up to sixteen one-ton containers (32,000 pounds) of compressed liquid chlorine in the Chlorine Building; up to eight containers may be on line at any one time.  Typically, four one-ton containers are on line, with four one-ton containers hooked up, ready to go on line, and four one-ton containers in storage.  On-line cylinders are manifolded by two parallel lines.  \n\nPressurized chlorine is reduced to vacuu"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4569,
      "SummaryText": "m pressure by vacuum regulators in the chlorine storage area.  Four chlorinators are available for use in metering the chlorine, which is drawn into a chlorine solution line.  The primary use of the chlorine solution is injection into the plant's effluent flow for disinfection.  The chlorine solution can secondarily be used to chlorinate filters, to breakpoint chlorinate for ammonia removal, and to chlorinate the biological treatment process.  The maximum capacity to inject is 3,200 pounds of chlorine per day.  Normally, only 500 to 1,000 pounds per day are used.  Chlorine solution is injected into the plant effluent, 24 hours per day, 7 days per week.\n\nThe chlorine handling facility at Tahoe-Truckee Sanitation Agency is a fully contained facility.  All storage and use of the one-ton chlorine containers is done within the container storage room.  The chlorine building is equipped with two chlorine leak detectors that sense chlorine at concentrations as low as one part per million (ppm) in air.  Upon detection of chlorine, the detectors activate two visual beacons located on the west and north sides of the chlorine building, one annunciator light and an audible alarm in the AWT building control room, and a plant wide audible chlorine leak alarm.  Simultaneously the leak detector will initiate the shut down of all ventilation fans, shut down the chlorine solution pump, and, most importantly, initiate the scrubber system.  This chlorine leak prevention system ensures a minimal risk of offsite consequences from a chlorine leak at the facility.  As required for the purposes of the California Accidental Release Prevention Program, a worst-case release scenario and an alternative release scenario that could have offsite consequences were evaluated.\nThe Worst-Case Release Scenario and the Alternative Release Scenario\nWorst-Case Scenario\nThe worst-case scenario considered for the purposes of this CalARP was the rupture of a single one-ton container fusible plug.  The rupture"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 4569,
      "SummaryText": "h pipeline experiences a leak of chlorine solution containing 417 ppm of chlorine. Further, all of this chlorine is assumed to enter the atmosphere.  Again, using the model RMPRO, with a wind speed of 1.5 meters/sec (3.4 miles per hour), atmospheric stability class F, and rural topographical conditions, the distance to the toxic endpoint for chlorine (3 ppm) is 0.15 miles.  The estimated residential population within the distance to the toxic endpoint for the alternative release scenario was zero persons.\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\nAs described previously, T-TSA is subject to OSHA's Process Safety Management (PSM) program; EPA's Risk Management Program, and the California equivalent, the California Accidental Release Prevention Program (CalARP).  These regulations help ensure that T-TSA management and staff (including contractors) maintain reliable process safety and risk prevention programs.  Elements of these regulations require that T-TSA have a written emergency response program and a chlorine spill prevention program.  These programs also include the following requirements:\n1. Collection and dissemination of process safety information on the regulated substances and the equipment handling the regulated substances, through staff and contractor training.\n2. Conduct a Process Hazard Analyses for regulated substances to identify potential process hazards and mitigation measures to minimize risk.\n3. Implementation of safe, written standard operating procedures for start-ups, normal operations, temporary operations, and emergency operations.\n4. Implementation of written maintenance procedures for vessels, pumps, piping, and control equipment, including inspections and tests to ensure their maintenance.\n5. Management and staff commitment to review all elements of the process safety and risk management programs when process changes are made.\n6. Management and staff commitment that all elements of the PSM and RMP"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 4569,
      "SummaryText": "programs are in place and personnel are trained prior to starting up the chlorine process after a process change.\n7. Conduct of periodic audits to ensure on-going compliance with all elements of the safety and risk prevention programs.\n8. Management and staff commitment to conduct thorough investigation of incidents that could reasonably result in catastrophic releases.\nFive-Year Accident History\nT-TSA has had no accidental releases of regulated substances (i.e. chlorine) in the last five years.\nEmergency Response Program\nT-TSA is committed to continued implementation, review and revision of all elements of the Accidental Release Prevention Program, including emergency response.  One of T-TSA's goals is to provide the highest level of safety with regard to chlorine handling.  In addition to emergency response training, T-TSA's employees have received specialized training in mitigating and containing chlorine releases. \n\nAs indicated previously, the T-TSA Business Plan outlines the Emergency Response Program in place at the facility.  It is continuously updated, and provides T-TSA's facility maps, Hazardous Materials Inventory Statement, Emergency Response Plan, Mitigation Measures, Evacuation Plan, Training Plans and Procedures, and Material Safety Data Sheets (MSDS) for the materials handled and stored at the facility.  T-TSA implements its Emergency Response Program, evacuation procedures, and public notification programs in conjunction with the Truckee Fire Protection Agency, the Nevada County DEH, and the Northern Sierra Air Quality Management District.\nPlanned Changes to Improve Safety\nEnvironmental studies are currently underway to evaluate potential environmental and safety impacts associated with the proposed expansion of the T-TSA water reclamation facility.  If approved, the expansion project will take place over the next 3 to 5 years.  Appropriate resolution of our common safety issues and concerns are an essential part of the integration of the proposed"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 4569,
      "SummaryText": "project design, construction, start-up, and operation, with continued operation of the existing facility.  T-TSA management and staff are committed to their process safety management and risk management programs and will ensure that safety issues and concerns are effectively identified, mitigated, and managed, in light of proposed changes."
    }
  ]
}