{
  "FacilityID": 45789,
  "FacilityName": "Horseshoe Canyon Compressor Station",
  "FacilityStr1": "1921 45 1/2 Road",
  "FacilityStr2": "P.O. Box 126",
  "FacilityCity": "De Beque",
  "FacilityState": "CO",
  "FacilityZipCode": "81630",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08077",
  "LEPC": "Mesa County LEPC",
  "FacilityLatDecDegs": "39.281111",
  "FacilityLongDecDegs": "-108.206111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Black Hills Midstream, LLC",
  "Company2Name": null,
  "CompanyDUNS": 20915307,
  "Company2DUNS": null,
  "OperatorName": "Black Hills Midstream, LLC",
  "OperatorStr1": "350 Indiana Street, Suite 400",
  "OperatorStr2": null,
  "OperatorCity": "Golden",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80401",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000178611",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2006-06-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-06-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2006-06-06 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2017-10-25 00:00:00",
  "DeRegistrationEffectiveDate": "2017-10-18 00:00:00",
  "AnniversaryDate": "2011-06-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.6",
  "FRS_Lat": 39.281111,
  "FRS_Long": -108.206111,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 66300,
      "AltID": "NGL and Proc. Natural Gas",
      "FacilityID": 45789,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 87876,
          "ProcessID": 66300,
          "ChemicalID": 155,
          "Quantity": 57000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 69188,
              "ProcessChemicalID": 87876,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 69189,
              "ProcessChemicalID": 87876,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 69190,
              "ProcessChemicalID": 87876,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 69191,
              "ProcessChemicalID": 87876,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 69192,
              "ProcessChemicalID": 87876,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 69193,
              "ProcessChemicalID": 87876,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 69194,
              "ProcessChemicalID": 87876,
              "ChemicalID": 115
            }
          ]
        },
        {
          "ProcessChemicalID": 87877,
          "ProcessID": 66300,
          "ChemicalID": 155,
          "Quantity": 330.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 69195,
              "ProcessChemicalID": 87877,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 69196,
              "ProcessChemicalID": 87877,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 69197,
              "ProcessChemicalID": 87877,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 69198,
              "ProcessChemicalID": 87877,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 69199,
              "ProcessChemicalID": 87877,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 69200,
              "ProcessChemicalID": 87877,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 69201,
              "ProcessChemicalID": 87877,
              "ChemicalID": 93
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 67884,
          "ProcessID": 66300,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 24428,
              "Process_NAICS_ID": 67884,
              "SafetyReviewDate": "2006-01-31 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "American Petroleum Institute",
              "FR_Comments": null,
              "HazardReviewDate": "2004-01-29 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Vehicular accident and vandalism",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Routine visual observations (undocumented)",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2006-01-31 00:00:00",
              "TrainingReviewDate": "2006-01-31 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2006-01-31 00:00:00",
              "EquipmentInspectionDate": "2006-01-31 00:00:00",
              "EquipmentTested": "NGL system inspection",
              "ComplianceAuditDate": "2004-01-29 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 25561,
                  "PreventionProgram2ID": 24428,
                  "ProcessChemicalID": 87876
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 45789,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Mesa County Emergency Management",
    "CoordinatingAgencyPhone": "9702441763",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Colorado Oil & Gas Conservation Commission Rules and Regulations",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 45789,
      "SummaryText": "Black Hills Midstream, LLC\nHorseshoe Canyon Compressor Station\nEnvironmental Engineer:  Randy Fox\nTelephone:  (720) 210-1334\n\nAccidental Release Prevention and Emergency Response Protocols:  The owners, management and employees of the Horseshoe Canyon Compressor Station are committed to providing a safe workplace free of accidental releases of regulated substances.  Health, safety and environmental compliance are a fundamental part of every employee's job.  It is facility protocol to adhere to applicable Federal, State and local laws and to implement appropriate controls to prevent accidental releases.  If an accidental release were to occur, the facility would respond in accordance with its Emergency Action Plan and is prepared to work with the local fire department, the Local Emergency Planning Committee and other authorities to control and mitigate the release and minimize the impact of the release to employees, the environment and the general public.\n\nStationary Source and Regulated Substance Handled:  The primary activity at this facility (the stationary source) is the handling and compression of natural gas.  As part of the facility operation, natural gas liquid (NGL) is separated from the natural gas stream by the Jewel T Gas Processing Unit, stored under pressure on site in a 12,000 gallon storage tank, and sold to a petroleum refiner.  Both the NGL and the processed natural gas (i.e., the gas within the Jewel T and the gas between the Jewel T and the sales meter located on the outgoing gas pipeline) have been determined to be regulated flammable mixtures at the facility and are being considered a single process because both substances could be involved in a potential release.  The NGL contains methane, ethane, propane, isobutane, butane, pentane and isopentane.  These regulated flammable chemicals have a threshold quantity of 10,000 pounds each.  The maximum stored quantity of NGL at the facility is approximately 56,464 pounds (consisting of approximately 5"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 45789,
      "SummaryText": "6,272 pounds in the storage tank and 192 lbs in connected pipelines); however, quantities were rounded up and 57,000 pounds was used in the NGL worst-case release scenario.  The maximum fill level of the tank is 90% of the total tank capacity, which is controlled by two automatic pressure relief devices, a back pressure regulator and a high-level shutdown system.  The processed natural gas contains methane, ethane, propane, isobutane, butane, pentane and isopentane.  These regulated flammable chemicals have a threshold quantity of 10,000 pounds each.  The maximum quantity of processed natural gas contained in facility pipelines and equipment is approximately 330 pounds.  The pressure in the pipelines and equipment is controlled by automatic pressure relief devices.  The facility is normally unoccupied and is located in a relatively remote area.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps:  This facility complies with EPA's accidental release prevention requirements and applicable State and local codes and regulations.  The NGL system and the processed natural gas pipelines and equipment were designed and installed and is maintained in accordance with applicable State and Federal requirements.  The following sections briefly describe the elements of the facility¿s release prevention program.\n\n1) Safety Information:  The facility was designed and constructed in accordance with applicable Federal and State regulations.  All plans and procedures maintained at the facility are periodically reviewed by facility management for safety updates and changes.  Material Safety Data Sheets, equipment specifications and the codes and standards used to build and operate the NGL storage and process equipment, and the processed natural gas pipelines and equipment, are maintained at the facility. \n\n2) Hazard Review:  Facility management conducts reviews of the hazards associated with the handling and storage of NGL and processed natural gas."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 45789,
      "SummaryText": "The reviews identify the opportunity for equipment malfunctions or human errors that could cause an accidental release, the safeguards used to control hazards and prevent releases, and the steps used to detect or monitor releases.  The results of the reviews are documented and problems identified are addressed in a timely manner.  \n\n3) Operating Procedures:  The facility maintains written operating procedures for the handling and storage of NGL and processed natural gas.  The procedures generally follow standard industry practice.  The written procedures are reviewed by facility management on a regular basis and revised as necessary. \n\n4) Training:  All employees that work at the facility and handle NGL and processed natural gas participate in a training program.  Initial training for new employees consists of classroom type instruction (e.g., reading safety information, operating procedures and response measures) and on-the-job supervision.  Refresher training for all employees is conducted at least once every three years.  The training program is reviewed by facility management on a regular basis and revised as necessary. \n\n5) Maintenance:  The facility maintains written equipment inspection and maintenance procedures.  Storage and transfer/process equipment inspections are performed by qualified personnel on an approximate annual basis and are documented.  Equipment maintenance procedures follow either instructions furnished by the equipment vendors, Federal or State regulations or industry standards.  The written procedures are reviewed by facility management on a regular basis and revised as necessary.\n\n6) Compliance Audits:  As required by the RMP rule, compliance audits will be performed at least once every three years.  The audit will be documented and conducted by a person knowledgeable in the safe handling and storage of NGL and processed natural gas.  Corrective actions required as a result of each compliance audit will be performed promptly and documente"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 45789,
      "SummaryText": "d.    \n\n7) Incident Investigation:  Facility management will investigate each incident that results in, or could have reasonably resulted in a catastrophic release of NGL or processed natural gas.  The investigation will be performed to identify the situation leading to the incident as well as corrective actions to prevent the release from reoccurring.  Investigation reports will be retained for five years.\n\nFive-Year Accident History:  There have been no accidental releases of NGL or processed natural gas in the past five years  that caused deaths, injuries, or significant property damage at the facility; nor, to our knowledge, resulted in offsite deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\n\nEmergency Response Program:  In the event of an emergency, it is facility protocol to notify the local fire department and other emergency responders and request that they respond to the emergency.  Facility employees will not respond to accidental releases of NGL or processed natural gas except for those that are small or incidental, can be controlled at the time of the release by employees in the immediate release area (e.g., shutting a valve) and do not appear to pose an immediate safety or health hazard.  This protocol has been discussed with the local fire department and the other emergency responders and the facility has appropriate mechanisms in place to notify the emergency responders when there is a need for a response.  The facility has provided a copy of the facility's Risk Management Plan and the Emergency Action Plan to the local fire department for inclusion in the written community emergency response plan developed under the Emergency Planning and Community Right-to-Know Act (EPCRA).  The facility Emergency Action Plan was developed following the requirements found in OSHA standard 29 CFR 1910.38, and is reviewed periodically and updated as necessary.  The plan has been coordinated with the local fire department."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 45789,
      "SummaryText": "The plan contains procedures for informing the public and emergency responders about a release.\n \nPlanned Changes to Improve Safety:  There are no specific safety changes planned at this time.  However, safety improvement is an on-going process at this facility.  Periodic evaluations are performed to assess the safety of equipment and procedures."
    }
  ]
}