{
  "FacilityID": 45799,
  "FacilityName": "TCLP Ocean State Power",
  "FacilityStr1": "1575 Sherman Farm Road",
  "FacilityStr2": null,
  "FacilityCity": "Harrisville",
  "FacilityState": "RI",
  "FacilityZipCode": "02830",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "44007",
  "LEPC": "District 1 LEPC",
  "FacilityLatDecDegs": "42.010000",
  "FacilityLongDecDegs": "-071.669444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.transcanada.com/power/usne.html",
  "FacilityEmailAddress": "anthony_schonfarber@transcanada.com",
  "FacilityDUNS": 931391239,
  "ParentCompanyName": "TransCanada",
  "Company2Name": null,
  "CompanyDUNS": 249609447,
  "Company2DUNS": 0,
  "OperatorName": "Ocean State Power",
  "OperatorStr1": "1575 Sherman Farm Road",
  "OperatorStr2": null,
  "OperatorCity": "Harrisville",
  "OperatorStateFIPS": "RI",
  "OperatorZipCode": "02830",
  "OperatorZipCodeExt": null,
  "FTE": 27,
  "OtherEPAFacilityID": "RID987479003",
  "EPAFacilityID": "100000121637",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "RI-15-01",
  "SafetyInspectionDate": "2005-10-04 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-06-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-06-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-06-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-06-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.4",
  "FRS_Lat": 42.00833,
  "FRS_Long": -71.67083,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R06",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 66311,
      "AltID": "Aqueous Ammonia Delivery",
      "FacilityID": 45799,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 87894,
          "ProcessID": 66311,
          "ChemicalID": 57,
          "Quantity": 897600.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 67895,
          "ProcessID": 66311,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 24434,
              "Process_NAICS_ID": 67895,
              "SafetyReviewDate": "2006-05-01 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": "API 620",
              "FR_Comments": "Equipment was designed per applicable standards and is operated in accordance with such standards",
              "HazardReviewDate": "2006-05-01 00:00:00",
              "ChangeCompletionDate": "2006-06-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "enclosure consists of a double walled tank",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Process operating parameters",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2006-05-01 00:00:00",
              "TrainingReviewDate": "2005-10-19 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2006-05-01 00:00:00",
              "EquipmentInspectionDate": "2006-02-09 00:00:00",
              "EquipmentTested": "Annual inspection of ammonia system pump",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2005-12-01 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 25567,
                  "PreventionProgram2ID": 24434,
                  "ProcessChemicalID": 87894
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 45799,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2005-10-19 00:00:00",
    "ERTrainingDate": "2006-06-25 00:00:00",
    "CoordinatingAgencyName": "Harrisville Fire Department",
    "CoordinatingAgencyPhone": "2224686295",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "Clean Air Act Regulations (and subsequent state-issued regulations)"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 45799,
      "SummaryText": "1.0  EXECUTIVE SUMMARY\nThis document has been prepared to demonstrate how Ocean State Power?s (OSP?s), Harrisville facility complies with the requirements set forth under EPA?s Chemical Accidental Prevention Provisions (40 CFR 68).  This plan has been developed specifically to address the requirements applicable to the use of aqueous ammonia at the OSP facility.  Each of the following sections provides a general overview of the requirements and defines OSP?s design attributes, documentation, and actions that are established to comply with those requirements.  In most instances, OSP has already developed measures and systems that provide compliance with the Part 68 rules.  This document does not replicate that information but rather provides cross- references to the appropriate existing documentation.  In those instances where information was developed specifically to comply with the Part 68 requirements, that information is contained in this document.\n1.1  Corporate Commitment to Safety\nOcean State Power is committed in providing to all employees a work environment that is free from recognized health and safety hazards.  Accordingly, OSP?s goal is achieving and sustaining zero accident tolerance through communication, information, and training.  To this end, OSP is dedicated to the concept that all employees receive the proper orientation and are provided with the means necessary to ensure the environment remains as safe and healthful as possible.\nIt is the policy of OSP to:\n?    Provide safe working conditions, proper tools, and personal protective equipment\n?    Comply with all federal, state, and local occupational health and safety laws and regulations\n?    Provide and sustain a high level of commitment to insuring that all employees have a safe and healthful work environment in which to work\n?    Ensure, through training and when necessary disciplinary action, that all employees work in a safe manner\n?    Educate and/or train all employees in safe work practices, and ensure t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 45799,
      "SummaryText": "hat each employee fully understands his or her job and the tools, techniques, and methods to reduce the risk to himself or herself and their co-workers\n?    Encourage all employees to ?Think Safety?, so that safety habits developed and practiced at work carry through to non-work related activities\nThe facility aims to produce electricity as efficiently as possible while minimizing the use of toxic materials wherever and whenever prudent.  In this effort, OSP?s highest priority will be the proactive pursuit of cost-effective process changes that reduce or eliminate the use and/or generation of toxics at the endpoint of production.  Where toxics cannot be eliminated, improving controls to handle these substances will be explored and implemented wherever possible.\nOcean State Power has an active emergency prevention and response program specifically tailored for the facility.  In addition, an Integrated Contingency Plan incorporates applicable safety and environmental regulations.  It is the responsibility of plant management to carry out these programs.\nThe first duty of OSP employees is to exercise care in the performance of work tasks to prevent an accident to self, co-workers, the public, or equipment.  Safety-consciousness must take precedence over expedience, and is required as a condition of continued employment of all employees at all levels of the organization.\n1.2  Facility Description\nOSP is a 560 megawatt (MW) combined cycle gas turbine electric generating facility that operates on a continuous basis.  Figure 1 provides an orthographic photo for the site and Figure 2 provides an equipment layout.  The area surrounding the plant is gated and public access is restricted.  Natural gas, the primary fuel, is delivered by either Tenneco or Algonquin pipelines to metering stations located at the northeast property boundary.  No.2 oil is no longer used and stored at the site, but OSP retains the permits to allow for use of No.2 oil in the future.  \nThe power plant con"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 45799,
      "SummaryText": "sists of two identical phases.  Each phase includes two GE Frame 7 combustion turbine generators, two heat recovery steam generators/boilers with supplemental firing using duct burners, and one steam turbine generator.  Auxiliary equipment includes an electrical switchyard, wet mechanical cooling towers, and a zero discharge water treatment system.  Other facility components include selective catalytic reduction (SCR) systems; two 150-foot concrete stacks equipped with continuous emissions monitoring systems; two emergency diesel generators; and oil and chemical storage.  The plant is operated from the control room.  Operators have access to plant operating data from the computerized distributed control system (DCS) and a central data acquisition and handling system (DAHS).\nAqueous ammonia (29%) is the only regulated substance used in a process that is above the RMP threshold quantity.  Ammonia is used as a reducing agent for the SCR NOx emissions control system for the combustion turbines.  Aqueous ammonia is evaporated in hot air and injected into the flue gases upstream of a catalyst located in the heat recovery boilers to convert NOx emissions into nitrogen and water.  The amount of ammonia injected and the NOx/NH3 emissions in the exhaust stack gases are continuously measured and recorded.  The SCR system is comprised of subsystems - aqueous ammonia unloading area, a storage tank to provide four weeks capacity, two ammonia transfer pumps (one back-up) to transfer solution to the four ammonia flow control/evaporator units, and four ammonia injection systems (one per HRSG).  The unloading area includes an unloading pump rated for eighty gpm with vapor recovery, and concrete berm to collect an accidental spill from truck delivery.  There are several interlock functions within the ammonia supply line that could activate an emergency shutoff valve.  Isolation valves and a bypass valve are provided as a contingency, should the ammonia flow control valve have to be ta"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 45799,
      "SummaryText": "ken out of service.  Ammonia leak detection devices are also provided. \nAll other substances utilized at the facility are below 112(r) reporting thresholds and are addressed in other reporting statutes such as SARA Title III (EPCRA Tier II reporting), OSHA, etc.\n1.3  Worst Case and Alternative Release Scenarios\nOSP used EPA?s Risk Management Program Offsite Consequence Analysis Guidance document and EPA?s RMPComp Program to determine the distance to toxic endpoint for both the worst-case and alternative release scenarios.  The release scenario analyses accounted for EPA?s recent determination that the outer wall of the ammonia tank may not be considered passive mitigation.  \nThe worst-case release scenario assumes failure of the aqueous ammonia storage tank that results in the total 60,000 gallons of aqueous ammonia being released in a 10-minute period.  The alternative release scenario assumes a leak or break in the tubing connecting the tank and bulk truck during a delivery.  Because the tank loading operation is constantly monitored by both OSP personnel and the truck driver, the leak is assumed to result in less than 10 gallons of liquid spilled.  The estimated distance to the toxic endpoints are:\n?    1.6 miles for worst-case release scenario\n?    0.1 miles for alternative release scenario\nPotential receptor impacts are discussed in Section 3.0 of the document.\n1.4  Emergency Response Program\nOSP maintains an active emergency prevention and response program in accordance with applicable regulations.  This program consists of two primary elements:  Emergency Prevention and Response Plan and an Emergency Response Procedures Handbook.  OSP is prepared to respond to emergencies quickly and effectively.  The primary goal is to protect the health and safety of plant personnel and the public, and to minimize damage to the environment and plant equipment in the unlikely event of an accident.  An Emergency Coordinator/Qualified Individual (EC/QI) is responsible for implementi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 45799,
      "SummaryText": "ng and overseeing emergency response activities onsite.  If the primary EC is not available, alternate EC have received adequate training and have been delegated authority.  The facility?s Procedures Handbook provides actions for proper notifications within OSP?s emergency response organization to activate necessary resources.  OSP has an ongoing employee health and safety training program conducted by qualified instructors.  Facility personnel are trained in functional areas that correspond to their emergency response duties and responsibilities.  Drills are conducted for site emergency managers on a periodic basis to exercise procedures and maintain readiness.  Integrated drills are conducted in conjunction with the Harrisville Fire Department to coordinate offsite emergency response procedures.\nThe OSP facility is equipped with locally annunciating alarms and a facility-wide public address system to alert personnel in the event of an emergency.  A full description of the emergency equipment available at the site is provided in Section 5.0 of the facility?s Integrated Contingency Plan.  Specific procedures that all employees must follow in the event of release can be found in Section 2.0 of the Integrated Contingency Plan.  These procedures include immediate notification to authorities, establishing a command and control center, evacuation of personnel, and actions to be taken to stop or mitigate the emergency if it is safe to do so"
    }
  ]
}