{
  "FacilityID": 46008,
  "FacilityName": "Demopolis Terminal",
  "FacilityStr1": "15270 U. S. Highway 80",
  "FacilityStr2": null,
  "FacilityCity": "Gallion",
  "FacilityState": "AL",
  "FacilityZipCode": "36742",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01091",
  "LEPC": "Marengo County LEPC",
  "FacilityLatDecDegs": "32.508167",
  "FacilityLongDecDegs": "-087.768056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Enterprise Products Operating L.P.",
  "Company2Name": null,
  "CompanyDUNS": 62457304,
  "Company2DUNS": 0,
  "OperatorName": "Dixie Pipeline Company",
  "OperatorStr1": "1117 Perimeter Center West",
  "OperatorStr2": "Suite w-301",
  "OperatorCity": "Atlanta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30338",
  "OperatorZipCodeExt": null,
  "RMPContact": "William N. Rook",
  "RMPTitle": "Regional PSM Coordinator",
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000165634",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-01-20 00:00:00",
  "SafetyInspectionBy": "AL LP Gas Board",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-07-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-06-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-06-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.4",
  "FRS_Lat": 32.50984,
  "FRS_Long": -87.71718,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 66573,
      "AltID": "Demopolis Terminal",
      "FacilityID": 46008,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 68162,
          "ProcessID": 66573,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 88226,
          "ProcessID": 66573,
          "ChemicalID": 98,
          "Quantity": 761418.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 588226,
          "ProcessID": 66573,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46008,
      "SummaryText": "\n\n\nEnvironmental Protection Agency Risk Management Plan\nDixie Pipeline Demopolis Terminal \nRMP Executive Summary\n\nEPA ID:  1000 0016 5634\n\nAt the Dixie Pipeline Demopolis Terminal  we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as protection of the environment.\n\nThe Dixie Pipeline Demopolis Terminal is owned by Enterprise Products L. P. and operated by Dixie Pipeline Company. The Demopolis Terminal is a LPG pipeline terminal connected to Dixie?s interstate LPG pipeline system.    The process is regulated by the OSHA Process Safety Management of highly hazardous chemicals.\n\nWe use a combination of accidental release prevention programs and emergency response planning programs to help provide for the safety of our employees and the public, as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n?    A description of our facility and use of substances required by EPA's RMP regulation and the processes involved\n?    A summary of results from our assessment of the potential offsite consequences from accidental chemical releases\n?    Emergency Response Programs\n?    General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n?    A five-year accident history for accidental releases of chemicals at the Albertville Terminal that are regulated by EPA?s RMP rule.  \n\nFacility Description\n\nThe Demopolis Terminal engages in the pipeline receipt and storage of liquefied propane under pressure, and the loading of propane tank trucks.    The process is regulated by Federal OSHA 29 CFR 1910.119 and 40 CFR Part 68.  We have entered the facility as an RMP Program Level 3 facility.\n\nTh"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46008,
      "SummaryText": "e facility receives, stores and distributes LPG.  There are two tanks with a capacity of approximately 90,000 gallons each.  The tanks are administratively controlled to hold and not exceed 80% of their capacity.  The facility consists of pressure storage tanks, a truck loading doci, associated piping, valves and other miscellaneous equipment.  The process and storage serves a function that is incident to transportation.  \n\nIn our process we use the following chemicals that the EPA has identified as having the potential to cause significant offsite consequence in the event of a substantial accidental release:\n\nToxics\n\nThere are not toxic materials contained on site above the threshold limits.\n\nFlammables\n\nPropane is a finished product which is received into two storage tanks.  This material is routed from these tanks to the loading docks for  distribution.\n\nKey Offsite Consequence Analysis Scenarios\n\nThe EPA's RMP rule requires that we provide information about the worst-case scenarios(s) and alternative release scenario(s) for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario.\n\nWorst Case Release Scenario ? Regulated Toxic Chemical\n\nNo toxic material above the threshold quantity on site.\n\nAlternate Release Scenario(s) ? Regulated Toxic Chemical\n\nNo toxic material above the threshold quantity on site.\n\nWorse Case Scenario ? Regulated Flammable Chemicals\n\nThis simulation involves the rupture or failure of a propane storage tank resulting in a simulated vapor cloud explosion that affects both storage tanks.  The entire inventory of the tanks is simulated due to the proximity of the tanks relative to mitigation of the simulation.  This scenario assumes there would be no mitigation.  All emergency response and early warning procedures to inform employees and the community would be exercised immediately if this were to o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46008,
      "SummaryText": "ccur.  The quantity and endpoint of the simulation and the specifics of the simulation are available in the specified reporting of the Risk Management Plan\n\nAlternate Case Scenario ? Regulated Flammable Chemicals\n\nThe alternate release scenario is a simulated rupture of the supply hose at the loading docks resulting in a ten minute release and simulated vapor cloud explosion.  This scenario assumed the pump continued to operate at a rate of approximately 500 gallons per minutes (gpm) for 10 minutes after the hose break.  The simulation calculated that 21,150 pounds of material were released in the assumed time frame.  Mitigation measures were taken into account when selecting the alternative release scenario.  These measures consisted of reviewing the use of relief valves, check valves, manual shutoff valves, automatic shutoffs, startup and operating procedures, grounding equipment, and excess flow devices.  Activation of the Emergency Shutdown Devices would isolate the source of the material and secure the facility.  All emergency response and early warning procedures to inform employees and the community would be exercised immediately if this were to occur.  The quantity and endpoint of the simulation is contained in the data elements.\n\nWe are using this information to help us ensure that our emergency response plan and the community emergency response plan address all reasonable contingency cases.\n\nEmergency Response Program\n\nEnterprise maintains an integrated contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning and reporting.  The program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, the plan is coordinated with the Marengo County Sheriff?s Department Emergency Management District, which includes the local Demopolis Police department, Marengo County Sheriff?s Department,"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 46008,
      "SummaryText": " Demopolis Fire Department, and Emergency Medical Service.\n\nIn the event of an accidental release, local Enterprise personnel are trained to sound the alarm, shut off the source from a safe location and contact 9-1-1 and secure the area.  The 9-1-1 system is used to notify the local Police and Fire Departments.  \n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nEnterprise takes a systematic, protective approach to preventing accidental release of hazardous chemicals.  Our Process Safety Management systems address each of the key features of successful prevention program, including:\n\n?    Process safety information\n?    Process hazard analysis\n?    Operating procedures\n?    Training\n?    Mechanical integrity\n?    Management of change\n?    Pre-Startup Safety Review - \"PSSR\"\n?    Compliance audits\n?    Incident investigation\n?    Employee participation\n?    Hot work permit\n?    Contractors\n\nOperations personnel make regular inspections of the equipment and processes they operate.  If something out of the ordinary is found, it is reported to management in order to expediently resolve any problems.\n\nThe engineering and administrative controls in place have been established to reduce the risk of an accidental release of identified hazards.  Enterprise is committed to operations that are safe for employees and the surrounding community.\n\nAccident History\n\nRecords are kept for all significant accidental chemical releases that occur at our facility.  The following is a brief summary of accidental chemical releases involving materials covered under EPA's RMP rule during the past five years:\n\nBased on the criteria set forth in 40 CFR 68.10, this facility has not had an accidental release.\n\nPlanned Changes to Improve Safety\n\nThe following is a list of improvements that are planned for implementation at the facility to help prevent and/or better respond to accidental chemical releases:\n\n?    The PSM system is constantly being subjected to critical reviews with an objective of imp"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 46008,
      "SummaryText": "roving the programs.\n?    The written PSM management system is presently undergoing a review, with specific emphasis being placed on the written mechanical integrity program.\n?    The Emergency Preparedness Plan is presently being reviewed and updated and will be coordinated with local officials when complete.\n?    The Safety Procedures and Policies Manual is presently being reviewed and updated and should be completed in the fall of 2006.\n\n"
    }
  ]
}