{
  "FacilityID": 46052,
  "FacilityName": "Albertsons Distribution Center #8290",
  "FacilityStr1": "7550 Oak Grove Road",
  "FacilityStr2": null,
  "FacilityCity": "Fort Worth",
  "FacilityState": "TX",
  "FacilityZipCode": "76140",
  "Facility4DigitZipExt": "6000",
  "FacilityCountyFIPS": "48439",
  "LEPC": "Tarrant County LEPC",
  "FacilityLatDecDegs": "32.639447",
  "FacilityLongDecDegs": "-097.310280",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Albertsons LLC",
  "Company2Name": null,
  "CompanyDUNS": 6927180,
  "Company2DUNS": 0,
  "OperatorName": "Albertsons LLC",
  "OperatorStr1": "7550 Oak Grove Road",
  "OperatorStr2": null,
  "OperatorCity": "Fort Worth",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76140",
  "OperatorZipCodeExt": "6000",
  "RMPContact": "Don Oper",
  "RMPTitle": "General Manager",
  "FTE": 525,
  "OtherEPAFacilityID": "TXD988049631",
  "EPAFacilityID": "100000119418",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-01-15 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-07-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-07-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-07-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 32.64319,
  "FRS_Long": -97.30449,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 66635,
      "AltID": "Ammonia for Refrigeration",
      "FacilityID": 46052,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 68224,
          "ProcessID": 66635,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 88292,
          "ProcessID": 66635,
          "ChemicalID": 56,
          "Quantity": 43300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 588292,
          "ProcessID": 66635,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46052,
      "SummaryText": "\n\n\n\n\nAlbertsons LLC is a national retailer of grocery products, having stores across the United States. Albertsons LLC?s retail grocery stores throughout Texas and the southwest are supplied by Distribution Center #890 located at 7550 oak Grove Road, Fort Worth TX, 76140.  The Ft. Worth Distribution Center employs approximately 600. The facility operates 24hours per day, 7days per week, 52 weeks per year. The highest occupancy occurs Monday-Friday from 7:00AM to 5:00 PM. \n\n\n\nThe system described in this submittal is the anhydrous ammonia refrigeration system utilized in the warehousing of frozen and perishable food products at the Ft. Worth, Texas location.  The purpose of this submittal is to update the facility?s Risk Management Program dated 5/10/04 as required by 40 CFR 68 Accidental Release Risk Management of Highly Hazardous Chemicals (anhydrous ammonia, 10,000lbs threshold).\n\n\n\nThe nominal refrigeration system charge is approximately 43,980 lbs of anhydrous ammonia. Ammonia is recirculated in the system as a liquid and gas depending on system operating pressures and temperatures.  The design and construction of the system is in accordance with the applicable guidelines and recommendations of the American Society of Mechanical Engineers (ASME), the American National Standards Institute (ANSI), the American Society of Heating, Refrigerating, and Air-conditioning Engineers (ASHRAE), and the Occupational Safety and Health Administration (OSHA).\n\n\n\nAnhydrous ammonia has been safely used in the United States and worldwide as an efficient refrigerant for decades. Design, maintenance, repair and operation of the system are conducted in accordance with OSHA regulation 29 CFR 1910.119 (Process Safety Management of Highly Hazardous Chemicals). The system is continuously monitored and inspected by technicians who are qualified and trained in accordance with the requirements of the facility?s PSM program. These operators monitor the system for any indication of leaks or e"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46052,
      "SummaryText": "quipments problems by daily visual inspections, a process control system and permanent, continuous ammonia detectors capable of distinguishing the presence of ammonia in the atmosphere at levels protective of employee health and safety. Any indication of deviation from process set points or leaks would result in the immediate isolation of the problem area from the remainder of the system and prompt repair. In the event that a leak should occur in the system in spite of precautions taken, the ammonia detectors will sound an alarm to alert the operators. The system is equipped with redundant controls to assure that the system operates safely.\n\n\n\nThe facility?s PSM program includes employee information and training, process hazard analyses, management of change, pre-startup safety reviews fro system changes or additions, and safe work practices. Contractors working on the system are pre-qualified based on safety performance.\n\n\n\nAlbertsons LLC is continually reviewing and updating the companies PSM Program. \n\n\n\nMajor modifications designed to improve the safety and integrity of the FT. Worth refrigeration system were completed in March 2004. Ammonia detection systems, upgraded equipment and controls, and system operating parameter-monitoring provisions are among the changes made.\n\n\n\nAlbertsons LLC has implemented an Emergency Response Plan to be followed in the unlikely event of an accident or release. This Emergency Response Plan describes the notification protocol to be used in the even of an ammonia release.  The notifications in the event of a sudden release of over 100lbs of ammonia would include the local fire department, the Tarrant County Local Emergency Planning Committee (LEPC), the State Emergency Response Commission, and the National Response Center. The Ft. Worth Fire Department and the Tarrant County LEPC are provided with copies of the Emergency Response Plan. Facility personnel have been trained to respond to incidental releases that may occur in the sys"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46052,
      "SummaryText": "tem and to provide technical support to the Ft. Worth Fire Department in the event of an emergency release of ammonia from the system.\n\n\n\nThe facility has made arrangements with the local Fire Department to respond to emergencies involving ammonia. The facility conducts periodic incident response drills. To date the facility has never experienced an ammonia release that resulted in employee, contractor, or offsite injuries, or offsite evacuation and/or sheltering.\n\n\n\nAlbertsons LLC has complied with the requirements of Section 302 and 303 of the Emergency Planning and Community Right to Know Act (EPCRA) by notifying the State Emergency Response Commission (SERC), the Local Emergency Planning Commission (LEPC), and the Fire Department of the presence of ammonia at the site above threshold planning quantities (TPQ).  The facility files a tier 2 Chemical Inventory each year with the SERC, LEPC and Fire department as required by sections 311 and 312 of EPCRA.\n\n\n\n"
    }
  ]
}