{
  "FacilityID": 4618,
  "FacilityName": "GR/RS/Sw Co. J.P.W.B. Water Treatment Facility",
  "FacilityStr1": "#3 Telephone Canyon Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Green River",
  "FacilityState": "WY",
  "FacilityZipCode": "82935",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "56037",
  "LEPC": "Sweetwater County LEPC",
  "FacilityLatDecDegs": "41.525972",
  "FacilityLongDecDegs": "-109.479917",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "GR/RS/Sw Co. Joint Powers Water Board",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "GR/RS/Sw Co. JPWB",
  "OperatorStr1": "P.O. Box 1299",
  "OperatorStr2": null,
  "OperatorCity": "Green River",
  "OperatorStateFIPS": "WY",
  "OperatorZipCode": "82935",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ben Bracken",
  "RMPTitle": "General Manager",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000057261",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Green River Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 41.52597,
  "FRS_Long": -109.47992,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5376,
      "AltID": "Chlorine",
      "FacilityID": 4618,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5489,
          "ProcessID": 5376,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5768,
          "ProcessID": 5376,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505768,
          "ProcessID": 5376,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4618,
      "SummaryText": "     The Green River-Rock Springs-Sweetwater County Joint Powers Water Board (JPWB) owns the water treatment plant and distribution systems that provide water for the communities of Green River, Wyoming and Rock Springs, Wyoming.  The JPWB leases the distribution systems to the cities.  The Board operates the water treatment plant and wholesales water to the cities.\n     On March 6, 1997, the Board commenced construction of a thirty-two (32) MGD water treatment plant.  The new plant is being built on the opposite bank of the Green River (west bank) from the existing water treatment plant.  Upon completion of the new water treatment facility (July 1999), the existing plant will be decomissioned.  The existing plant uses chlorine as a primary disinfectant but does not exceed threashold limits listed on page 11 of the EPA manual \"Guide to the Accidental Release Prevention Requirements[Section 112(r)] of the Clean Air Act\".\n     The new facility, which is  subject to RMP Program 3,  is situated in Section 22, T18N, R107W, Sweetwater County, Wyoming.  This facility is located adjacent to the Green River in the City of Green River at No. 3 Telephone Canyon Road.  The City of Green River occupies a narrow valley that rises abruptly from the river (elevation 6080' at water treatment facility) to developments at an approximate elevaton of 6450'.\n     The new water treatment facility will use liquid chlorine as a secondary disinfectant.  The chlorine process area is constructed of concrete and is configured into three (3) distinct rooms.  This design allows separation of process components and addresses the containment issues in th event of a chlorine equipment failure.  The chlorine area houses ton cylinders of chlorine, vacuum feed chlorinators, and a caustic soda scrubber.  An exterior accessible-only room is provided for the storage of safety and emergency repair equipment.  The chlorine process area is typically unstaffed but will be visited daily by water treatment oper"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4618,
      "SummaryText": "ators.  Each room is connected to the plant SCADA system which monitors the area on a continuous basis by way of chlorine leak detectors.\n     The EPA RMP \"Offsite Consequence Analysis Guidance-Chlorine\" manual was utilized to determine \"worst case release\" (Table 1) and \"alternate scenario\" (Table 3).  At-Risk Population (receptors) estimates were obtained from the Sweetwater County Engineering office.  Using the Map Info Program (1990 Census data), receptors were identified within the planning radius for worst case and alternate release scenarios.  The water treatment plant's proximity to the river and the extreme variability of the surrounding topography, combined with the physical properties of chlorine, influenced our selection of worst case and alternate release scenarios.\n     The JPWB accidental release prevention program is predicated on the following elements:\n          1)  Operator training and education\n          2)  Preventive maintenance programs\n          3)  State-of-the-art equipment monitoring and alarm systems\n          4)  Implementation of safety, auditing and inspection procedures\n     Chemical specific prevention equipment available on site are two (2) self-contained breathing apparatus, emergency Kit B repair kits (2), and chlorine detectors tied to the facility's SCADA system for alarming and scrubber operation.\n     The JPWB has never experienced an accidental release of chlorine during their tenure as Owner/Operator of the water treatment plant.\n     Because the JPWB will be moving their operations to the new water treatment facility in July/August, 1999, an emergency response program specfic to this new facility is presently being developed.  This program is being coordinated with the engineering design team, equipment/material suppliers, the Green River Fire Department, Castle Rock Medical Center, Sweetwater County Emergency Management, and the Local Emergency Response Planning Committee (LEPC).  Key components of the plan will include a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4618,
      "SummaryText": " response decision flow chart, notification plan, and future evaluation and training protocol."
    }
  ]
}