{
  "FacilityID": 46258,
  "FacilityName": "Franzia Winery Ripon (2006 Revision)",
  "FacilityStr1": "17000 E. Highway 120",
  "FacilityStr2": null,
  "FacilityCity": "Ripon",
  "FacilityState": "CA",
  "FacilityZipCode": "95366",
  "Facility4DigitZipExt": "0897",
  "FacilityCountyFIPS": "06077",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.797864",
  "FacilityLongDecDegs": "-121.101177",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 680112005,
  "ParentCompanyName": "The Wine Group, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "The Wine Group, Inc.",
  "OperatorStr1": "17000 E. Highway 120",
  "OperatorStr2": null,
  "OperatorCity": "Ripon",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95366",
  "OperatorZipCodeExt": "0897",
  "RMPContact": "Glenn Spyksma",
  "RMPTitle": "Ripon Winery Manager",
  "FTE": 333,
  "OtherEPAFacilityID": "CAD982515900",
  "EPAFacilityID": "100000059731",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-10 00:00:00",
  "SafetyInspectionBy": "City of Ripon Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-08-11 00:00:00",
  "ErrorReportDate": "2006-08-11 00:00:00",
  "ReceiptDate": "2006-08-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-08-09 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2007-08-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 37.7981,
  "FRS_Long": -121.10227,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 66910,
      "AltID": "Chiller Groups A, B, & C",
      "FacilityID": 46258,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 68509,
          "ProcessID": 66910,
          "NAICSCode": "31213",
          "_desc": {
            "NAICS_CODE": "31213",
            "NAICS_DESCRIPTION": "Wineries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 88650,
          "ProcessID": 66910,
          "ChemicalID": 56,
          "Quantity": 106000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 588650,
          "ProcessID": 66910,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 66911,
      "AltID": "Sulfur dioxide processes",
      "FacilityID": 46258,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 68510,
          "ProcessID": 66911,
          "NAICSCode": "31213",
          "_desc": {
            "NAICS_CODE": "31213",
            "NAICS_DESCRIPTION": "Wineries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 88651,
          "ProcessID": 66911,
          "ChemicalID": 49,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 588651,
          "ProcessID": 66911,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46258,
      "SummaryText": "1.0 Introduction\n\nA Risk Management Program (RMP) has been implemented at Franzia Ripon for the reduction of accidental releases of hazardous materials. The RMP summarizes the management, administrative, procedural, and technological controls that work together to minimize the risk to the community of hazardous chemical releases. The Risk Management Plan is organized to correspond with specific U.S. Environmental Protection Agency (EPA) RMP definitions and requirements, including:\n\n? Introduction;\n? Franzia Ripon policies to protect health, environment, and safety;\n? Facility identification and regulated substances covered processes;\n? Hazard Assessment;\n? Prevention Program;\n? Five-Year Accident History;\n? Emergency Response Plan; and\n? Planned changes to improve safety.\n\n2.0 Franzia Ripon Policies to Protect Health, Environment, and Safety\n\nRisk management and safety are important concerns at Franzia Ripon; this RMP formalizes and documents these activities. Franzia Ripon is committed to conducting its operations in a safe and responsible manner and to reducing risks to human health and to the environment.\n\nThis commitment to health, the environment, and safety starts with upper management. All Managers and Supervisors are members of the Safety and Health Committee and routinely dedicate time each month to review health and safety matters. The employees at Franzia Ripon attend health and safety meetings led by their supervisor or manager. Each manager and supervisor reports their discussions with their employees each month at the Safety and Health Committee meetings. The Committee reviews safety performance, takes corrective action when appropriate, and strives for continuous improvement. Franzia's commitment to safety is demonstrated in the training programs for all employees, including seasonal employees. The training programs provide information on preventing accidents through knowledge of hazards and safe work practices. \n\n3.0 Facility Identification\n\nThe Fran"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46258,
      "SummaryText": "zia Ripon facility is located at 17000 East Highway 120 , Ripon, California. The facility produces grape juice, wine, and distilled spirits. The facility uses anhydrous ammonia for refrigeration and sulfur dioxide for bacterial control and is regulated under 40 CFR Part 68, the EPA RMP Rule. The major refrigeration system components are the compressors, evaporative condensers, pressure receiver, chillers, and suction accumulator, and Glycol Circulation System and Tank Jacket Heat Exchangers/Coolers.  Three ammonia refrigeration systems, not interconnected, are regulated under the RMP rule; chiller group A, chiller group B, and chiller group C, containing 28,000 pounds, 38,600 pounds, and 40,000 pounds, respectively.   The three ammonia refrigeration systems are considered a single process for a total of 106,000 pounds.  \n\nThe sulfur dioxide is located at three different filling stations throughout the winery containing 2,000 pounds at two of the stations and 14,000 pounds of sulfur dioxide at the third station.  The three filling stations are considered a single a process totaling 18,000 pounds.\n\n4.0 Hazard Assessment - Worst Case Scenario (WCS)\n\nThe worst-case accidental release scenario is a catastrophic failure of the ammonia High Pressure Receiver Tank, located in chiller group C. The ammonia is maintained as a liquid via pressurization and is limited by an 85% engineering control, resulting in 40,000 pounds of ammonia.\n\nHazard assessment modeling shows that, under the worst-case weather conditions and a 10-minute release period, the worst-case release could travel downwind 3.6 miles until the toxic endpoint of 200 parts per million (ppm) is reached and affect public receptors. It should be noted that the worst-case scenario is an extremely unlikely event.  \n\n5.0 Hazard Assessment - Alternative Release Scenario (ARS)\n\nAn ARS was modeled for the ammonia and sulfur dioxide substances in the hazard assessment. The ARS for ammonia assumes a release of ammonia from a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46258,
      "SummaryText": "n oil drain valve. The oil drain valve is assumed to be opened and a plug in the line causes a rapid release of ammonia and oil out of the drain valve. The release is estimated until the toxic endpoint of 200 parts per million (ppm) is reached but it does not go offsite. A credible ARS for ammonia does not exist that goes offsite. No public receptors are impacted in this scenario, which is more likely than the worst-case scenario.\n\nThe ARS for sulfur dioxide assumes a 1/4-inch hole developed in a hose line.  The release is assumed to occur when an employee is transferring the sulfur dioxide into a smaller cylinder.  The release is estimated to go offsite until the toxic endpoint of 3 ppm is reached.  Small numbers of public receptors may be impacted in this scenario.\n\n6.0 General Accidental Release Prevention Program\n\nA prevention program is in place to minimize the risk of hazardous chemical releases in accordance with the California Occupational Safety and Health Administration (CalOSHA) Process Safety Management (PSM) standard (Section 5189 of Title 8, CCR) and the EPA Risk Management Program. This prevention program covers those processes that handle sulfur dioxide and ammonia above the threshold quantity of either PSM or RMP rules.\n\nThe prevention program provides a structured approach to preventing accidents. Some of the specific activities in the prevention program include:\n\n? Process safety information is provided to all employees upon hire and is accessible at all times.\n\n? In-depth process hazard analyses are completed every five years by qualified personnel using \n  techniques approved under the PSM standard.\n\n? Written operating procedures (kept up to date) are used for training and guiding the work of operators.\n\n? Training is provided to all employees upon hire, and refresher training is given at least every three years \n  or upon request.\n\n? Operators, mechanics, and contractor personnel are qualified, trained in the general hazards in the\n  facility,"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 46258,
      "SummaryText": " and informed of any temporary situations affecting safety.\n\n? Pre-startup safety reviews are conducted to insure that conditions for safe operation have been\n  satisfied prior to starting new or modified equipment.\n\n? A program is in place to maintain the mechanical integrity of the process, which includes written\n  procedures, training requirements, equipment deficiency requests for employees, work orders,\n  scheduled maintenance, and documentation.\n\n? A hot work permit system assures that work is done safely and properly.\n\n? A management of change system is in place to ensure that changes are managed safely.\n\n? Incidents are investigated and actions are taken as part of a continuous improvement effort.\n\n? Routine audits are conducted to assure that safe practices are being followed.\n\nThis systematic approach to process safety involves employees and strives for continuing improvements in overall safety. The training, qualifications, and safety awareness of our operations, maintenance, and management personnel are a key element in reducing and mitigating accidents.\n\n7.0 Five-Year Accident History\n\nSince January 1994 to the present, there have been no accidents or releases of regulated substances from covered processes that meet specific EPA criteria for the Five-Year Accident History. Such \"RMP accidents\" would involve serious accidents with either on-site deaths, injuries, or significant damage; or known, off-site deaths, injuries, property damage, or environmental damage. Franzia Ripon realizes that the community may also be interested in smaller releases of regulated chemicals that do not meet such criteria. We have been diligent in reporting releases of hazardous materials and in internally investigating and correcting the causes of such releases.\n\n8.0 Emergency Response Plan\n\nThe federal RMP and CalARP regulations grant exemptions for the emergency response plan for facilities that do not conduct their own emergency response. The exemption is valid provided th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 46258,
      "SummaryText": "at the facility is included in the community emergency response plan and that there is an appropriate mechanism in place to notify emergency responders when there is a need for a response. Franzia Ripon satisfies these requirements. A Business Plan has been submitted to San Joaquin County, which contains the required elements discussed above and emergency response has been coordinated with the local Fire Department.\n\n9.0 Planned Changes to Improve Safety\n\nChemical safety is an important part of Franzia Ripon operations. The Health and Safety Committee as well as regulatory requirements have minimized chemical exposure risks to employees and the public through ongoing internal risk reduction efforts. For example, as a result of the Process Hazard Analysis (PHA), vehicle barriers were installed around the ammonia processes and detailed procedures were documented.\n\nSubsequent to the submital of the RMP Update drafted in 2004, an automatic notification system was added to the plant?s programmable computer system, which automatically pages the Maintenance Supervisor (Or His Designate) when there is a significant system parameter deviation at the facility. This system modification provides the quickest response to operating deviations, providing better on-time system performance. \n\nOther improvements will be made when identified and approved by Management."
    }
  ]
}