{
  "FacilityID": 46256,
  "FacilityName": "KEMIRON GREAT LAKES, LLC",
  "FacilityStr1": "3761 CANAL STREET",
  "FacilityStr2": null,
  "FacilityCity": "East Chicago",
  "FacilityState": "IN",
  "FacilityZipCode": "46312",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18089",
  "LEPC": "Lake County LEPC",
  "FacilityLatDecDegs": "41.646278",
  "FacilityLongDecDegs": "-087.460278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "S1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.kemira.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 627945702,
  "ParentCompanyName": "KEMIRA OYJ",
  "Company2Name": null,
  "CompanyDUNS": 368448882,
  "Company2DUNS": null,
  "OperatorName": "BRIAN WODETZKI",
  "OperatorStr1": "3761 CANAL STREET",
  "OperatorStr2": null,
  "OperatorCity": "East Chicago",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46312",
  "OperatorZipCodeExt": null,
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000190928",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2006-08-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-08-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2006-08-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-02-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.6",
  "FRS_Lat": 41.64532,
  "FRS_Long": -87.463444,
  "FRS_Description": null,
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C02",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 66908,
      "AltID": "FeCl3 manufacturing",
      "FacilityID": 46256,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 88648,
          "ProcessID": 66908,
          "ChemicalID": 62,
          "Quantity": 1800000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 68507,
          "ProcessID": 66908,
          "NAICSCode": "325188",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 39284,
              "Process_NAICS_ID": 68507,
              "SafetyReviewDate": "2006-07-26 00:00:00",
              "PHA_Date": null,
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-06-08 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "EDUCTOR/RUPTURE DISK",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2006-06-28 00:00:00",
              "TrainingReviewDate": "2006-07-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2006-07-26 00:00:00",
              "EquipmentInspectionDate": "2006-06-30 00:00:00",
              "EquipmentTested": "pipe and sensors",
              "ChangeMgmtDate": "2005-09-12 00:00:00",
              "ChangeMgmtReviewDate": "2005-09-08 00:00:00",
              "PreStartupReviewDate": "2006-07-28 00:00:00",
              "ComplianceAuditDate": "2006-07-26 00:00:00",
              "AuditCompletionDate": "2006-09-19 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2006-07-26 00:00:00",
              "HotWorkPermitReviewDate": "2006-07-26 00:00:00",
              "ContractorSafetyReviewDate": "2006-07-26 00:00:00",
              "ContractorSafetyEvalDate": "2005-09-08 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 57099,
                  "PreventionProgram3ID": 39284,
                  "ProcessChemicalID": 88648
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 46256,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2006-07-25 00:00:00",
    "ERTrainingDate": "2006-03-10 00:00:00",
    "CoordinatingAgencyName": "LEPC-CROWN POINT",
    "CoordinatingAgencyPhone": "2197568302",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46256,
      "SummaryText": "Kemiron Great Lakes, LLC (Kemiron) facility is located 3761 Canal Street, East Chicago, Indiana. This new\nfacility manufactures ferric chloride (FeCl3), ferrous chloride (FeCl2) and other chemicals for the water\ntreatment industry using chlorine gas as one of the raw materials. Chlorine has been identified by the\nEnvironmental Protection Agency as a regulated substance subject to section 112 ® of the Clean Air Act\n(CAA), which required the preparation of this Risk Management Plan (RMP). Chlorine is the only chemical on\nthe EPA list present at the Kemiron facility in amount and concentration exceeding the applicability threshold. In\naddition, due to the Chlorine presence Kemiron is subject to the OSHA Process Safety Management standard\nand is submitting a program level 3 Risk Management Plan.\nChlorine is a listed toxic substance under the Risk Management Plan regulations found at 40 CFR 68 and is\nsubject to those regulations since it is stored in quantities in excess of 2,500 pounds.\nKemiron utilizes Chlorine as a raw material to produce FeCl3. Kemiron Great Lakes receives railcars with\nChlorine, SPL (Spent Pickle Liquor), and Hydrochloric Acid (HCl) at the East Chicago Facility. Chlorine gas is\nreceived in 90-ton (180,000 lb) rail tank cars. Normally, only two rail tank cars are present on-site at a time,\nbut occasionally up to 10 rail tank cars can be present. Ony one rail car is connected to the process at any one\ntime. The maximum amount of chlorine that can be stored at this plant is 1,800,000 lb. They are stored under\nambient temperatures, which can exceed 100 degrees F in the summer. Normal internal pressure is 60 to 70\npsi, but on a hot day pressures may reach 180 psi in the process.\nChlorine gas is piped from the railcars to the reaction vessels (chlorinators), where it reacts with ferrous chloride\nto form ferric chloride. There are three reaction vessels, which involve the use of chlorine. Each reaction\nvessel is fitted with two, independent, pressure safet"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46256,
      "SummaryText": "y devices. In case of reaction vessel over pressurization,\nspring-loaded pressure relief valves would discharge the chlorine into a process tank of ferric chloride. In the\nunlikely case of continued over pressurization, a rupture disk is utilized as an additional safety feature. Access\nto the site is restricted to authorized facility employees, authorized management personnel and authorized\ncontractors.\nAll design has been based on what will result in the safest and most environmentally sound operation. The\nprocess is a proprietary closed system. A small amount of water is introduced to the process for pump sealing,\ndilution, and make-up for cooling tower evaporation. The process produces hydrogen gas (H2), which is\nevacuated and scrubbed. The portion of scrap iron and carbon not digested ends up in a filter press, which is\nshipped off site to a landfill.\nRMP regulations require offsite consequence analysis for a potential release of chlorine to the atmosphere.\nKemiron Great Lakes is required to consider two release scenarios, identified as ¿worst case¿ and ¿ alternative\nscenario¿. The first scenario is defined by the EPA, which states that ¿ the owner or operator shall assume that\nthe ¿ maximum quantity in the largest vessel ¿ is released as a gas over 10 minutes,¿ due to unspecified\nfailure. The alternative scenario is defined as ¿more likely to occur than the worst-case release scenario¿. To\ndetermine the area of impact, Kemiron Great Lakes used an air dispersion modeling program called\nRMP*COMP which was provided by the EPA.\nWorst -case release scenario\nThe Clean Air Act risk management planning regulations require Kemiron to prepare a worst-case scenario\nconsisting of the release of the entire contents of the largest vessel containing a regulated chemical in 10\nminutes. The largest chlorine-containing vessel is a rail car, whose content totals 90 tons (or 180,000 pounds).\nHence, the rate of release would be 9 tons/minute (18,000 pounds/minute.) The USEPA provid"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46256,
      "SummaryText": "ed software\ndesignated RMP*Comp (version 1.07) to assist in estimating the distance to a toxic endpoint, in the event of a\nrelease as describe herein. The USEPA¿s RMP Off-site Consequence Analysis (OCA) Guidance provides\ntables for obtaining toxic endpoints and exhibit B-1 of this guidance document provides 0.0087 mg/L as the\ntoxic endpoint for Chlorine.\n3.2 Alternative scenarios\nALTERNATIVE SCENARIO ONE. On a hot day, a one inch diameter flexible line connecting the railcar to the\nrest of the process has a slow leak (not a complete break) from a 0.125 ¿ diameter hole. The line pressure is\nassumed to be 180 psig. The chlorine sensor is located about 5 feet horizontally from the rail car and about 15\nfeet below the hose, and should be activated almost immediately (less than 1 minute). An operator goes to the\ncontrol room and puts a respirator on within 9 minutes and has the leak isolated in another 10 minutes. Total\ntime for the chlorine leak is 20 minutes\nRMP*Comp yields a distance of less than 0.1 mile. In order to obtain a more conservative value, the tables from the OCA Guidance were utilized. Table 16 of the OCA Guidance, using a release rate of 5 lb./min and\ntoxic endpoint of 0.01 yields an estimated distance to toxic endpoint for this scenario of 0.19 miles.\n4. General accidental release prevention program and the specific prevention steps.\nIt is the policy of Kemiron to adhere to all applicable federal and state rules and regulations. Safety depends\nupon the manner in which Kemiron handles chlorine combined with the safety devices inherent in the design of\nthe facility, the safe handling procedures that are used, and the training of Kemiron personnel. The owners and\nmanagement of this facility regard employee and public safety as a very serious matter and have taken many\nprecautions to maintain a safe working and public environment. Some of these steps include:\n·Installing chlorine sensors and alarms;\n·Installing an automatic shutoff valve on the railcar unlo"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 46256,
      "SummaryText": "ading system;\n·Instituting safe operating procedures;\n·Training employees in safety programs and procedures;\n·Writing a comprehensive Emergency Response Plan;\n·Coordinating with the Local Emergency Planning Committee (LEPC).\nKemiron facility complies with EPA's Accidental Release Prevention Rule and with all applicable state codes\nand regulations. All of the employees handling chlorine have been thoroughly trained. This facility has a strong\ncommitment to the safe handling of chlorine and to minimizing the probability of an accidental release. This is\nachieved through a combination of personnel training, process safety equipment and operating procedures.\n5. Five-year accident history.\nThe Kemiron Great Lakes East Chicago facility is a new plant, and Chlorine handling is scheduled to start in\nMay 2005. In the past 5 years there have not been any accidental releases of chlorine that led to deaths or\ninjuries of people on- or off-site or response or restoration activities at environmental receptors in the last five\nyears. None of the employees or contractors has been involved in any accidents related to the hazardous\nsubstances defined in section 112(r) that is stored or handled at this facility. However, Kemiron has developed\nand implemented an extensive program for investigating and follow-up of all accidents/incidents, which may\noccur in the future at the East Chicago facility.\n6. Emergency response program.\nThe facility has a comprehensive emergency response program. The Emergency Response Plan contains\nspecific actions to be taken in response to an accidental release of chlorine, procedures to inform the public\nand health care information. All employees working with chlorine are given 40 hour Hazardous Waste Operator\n(hazwoper) training with annual 8 hour refreshers. This plan will be coordinated with the Lake County LEPC.\nKemiron¿s personnel are trained to respond to accidental releases of regulated substances. In the event of a\nrelease at the facility, the Lake"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 46256,
      "SummaryText": "County LEPC and East Chicago Fire Department would be notified\nimmediately. The purpose of the emergency response program at this facility is to comply with the Risk\nManagement and Release Prevention planning requirements as expressed in 40 CFR Part 68. The emergency\nresponse plan includes procedures for notification of the local emergency authority and notification of any\npotentially affected neighbors."
    }
  ]
}