{
  "FacilityID": 46383,
  "FacilityName": "Mid-Iowa Cooperative - Green Mountain NH3",
  "FacilityStr1": "502 Green Mountain Road",
  "FacilityStr2": null,
  "FacilityCity": "Green Mountain",
  "FacilityState": "IA",
  "FacilityZipCode": "50637",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19127",
  "LEPC": "Marshall County LEPC",
  "FacilityLatDecDegs": "42.100806",
  "FacilityLongDecDegs": "-092.817278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 22021315,
  "Company2DUNS": 22021315,
  "OperatorName": "Mid-Iowa Cooperative",
  "OperatorStr1": "101 Main",
  "OperatorStr2": "P. O. Box 40",
  "OperatorCity": "Beaman",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50609",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mark Kistenmacher",
  "RMPTitle": "General Manager",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000096576",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-07-18 00:00:00",
  "SafetyInspectionBy": "IDALS NH3 Plant Inspection",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-01-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-08-31 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-08-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-08-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 42.1016,
  "FRS_Long": -92.8219,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ZIP+2 CENTROID",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 67125,
      "AltID": "Product Storage Only",
      "FacilityID": 46383,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 68725,
          "ProcessID": 67125,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 88896,
          "ProcessID": 67125,
          "ChemicalID": 56,
          "Quantity": 546875.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 588896,
          "ProcessID": 67125,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46383,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION/EMERGENCY RESPONSE AT MID-IOWA COOPERATIVE, GREEN MOUNTAIN, IOWA.\n\nThis facility complies with ANSI Standard K-61.1-1989 requirements with amendments for Anhydrous Ammonia storage. It is our policy to adhere to all applicable Federal, State, and local regulations. If an emergency were to occur, it is our policy to immediately notify the Green Mountain Volunteer Fire Department (via a 911 call) and request that it respond to the emergency. Incidental to the notification to the fire department, a call to the Marshall County, Iowa LEPC will be made.\n\nWhile we have planned for an emergency, it is acknowledged that a real emergency will be unexpected and may very well be much different and cannot be ensured to duplicate what may have be planned. In reality, the situation that develops may not happen in the manner in which it has been planned. In that event, what may have been planned will serve only as a guideline to follow.\n\nThe Emergency Action Plan for this facility describes certain procedures that are intended to minimize the hazards associated with human health and the environment from fires, explosions, the sudden and unexpected release of chemicals (i.e., Anhydrous Ammonia), tornadoes, bomb threats or other accidents or acts of God which might occur on our premises.\n\nThe primary emergency coordinator for the Green Mountain, Iowa location is Tim Harem. His work and 24-hour emergency response telephone numbers are provided in the Registration Section of this document. In addition, the following individuals (with associated work and 24-hour emergency response telephone numbers) are to be contacted in order:\n\n                      Tim Harem\n                                WORK:    (641) 474-2293\n                               Cellular:   (641) 751-9423 \n                                                     \n                      Denny Heines\n                                WORK:    800-458-9753\n                                Cellular:   "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46383,
      "SummaryText": " (641) 485-4728\n                                \n                      Mark Kistenmacher, General Manager\n                              WORK:  (641) 366-2740\n                              Cellular: (641) 485-4702\n\nDESCRIPTION OF THE ANHYDROUS AMMONIA STORAGE/DISTRIBUTION PLANT AND THE REGULATED SUBSTANCE HANDLED AT MID-IOWA COOPERATIVE, GREEN MOUNTAIN, IOWA:\n\nThis facility is a bulk anhydrous ammonia storage and distribution plant. The anhydrous ammonia that is stored at  this facility is distributed to agricultural crop producers in the surrounding area who utilize the anhydrous ammonia for crop nutrient purposes. \n\nThe system consists of two (2)  30,000-gallon storage tanks with associated piping, valves, liquid pump(s), and other miscellaneous equipment. From time-to-time throughout the year as many as (50) 1,000-gallon and (10) 1,500-gallon portable nurse tanks may also be present at this site.  The anhydrous ammonia plant is only operated on a seasonal basis (Spring and Fall). Full-time equivalent employee numbers were computed on that basis. At a maximum, the plant operates a total of three months (1/4 of the year). The FTEs for this company location is one (1).\n\nTHE WORST-CASE AND ALTERNATIVE RELEASE SCENARIOS:\n\nThe worst-case scenario is the failure of one of the two (2) 30,000-gallon storage tank when filled to the greatest amount allowed (85% of capacity), resulting in the release of the total volume in a gaseous (hazardous ammonia vapor cloud) form. According to EPA's RMP*Comp Program (Version 1.06), the distance to the endpoint is 4.4 miles.\n\nThe alternative release scenario involves the transport delivery vehicle pulling away from the intake lines into the storage plant without disconnecting the transfer hoses. The resulting release, according to EPA's RMP*Comp Program has a distance to endpoint of 0.1 miles.\n\nThe system is protected from major releases by internal excess flow valves, check valves, relief valves, manual shut-off valves, and emergency sh"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46383,
      "SummaryText": "ut-off valves. The loadout risers used in filling nurse tanks are protected by breakaway couplers designed to immediately stop the flow of ammonia if the line or a hose breaks. All of the main storage tank valves are locked when not in use.\n\nSince this facility is located in relatively close proximity to the Town of Green Mountain and the unincorporated communities of Rockton and Predonia, provisions have been designed to notify all affected persons. An evacuation plan is in place.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS:\n\nThis facility complies with EPA's accident prevention rule and all applicable State and local codes and regulations. The anhydrous ammonia system is designed, installed, and maintained in accordance with ANSI Standard K-61.1-1989 with amendments and State law. \n\nIn addition the company has specific operating procedures in place intended to minimize the potential for an accidental (and potentially catastrophic) release of anhydrous ammonia. Finally, Mid-Iowa Cooperative has extended to the Green Mountain Volunteer Fire Department the opportunity to visit our anhydrous ammonia plant, to participate in mock emergency simulation training, and to avail themselves of specific anhydrous ammonia health hazard information and training provided by the company.\n\nFIVE-YEAR ACCIDENT HISTORY:\n\nMid-Iowa Cooperative, Green Mountain, Iowa has never had an accident involving anhydrous ammonia that caused death, injuries, property or environmental damage, evacuations or shelterings in place.\n\nTHE EMERGENCY RESPONSE PROGRAM:\n\nIn the event of an emergency involving our anhydrous ammonia system, it is the policy of Mid-Iowa Cooperative  to immediately notify the Green Mountain Volunteer Fire Department and the Marshall County, Iowa LEPC to request that they respond to the emergency. In the unlikely event that the Green Mountain Fire Department is unable to adequately respond to an emergency at our Green Mountain location, t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 46383,
      "SummaryText": "he Volunteer Fire Department with whom Green Mountain has a reciprocal agreement will be summoned.  We have discussed this policy with the fire department and Marshall County LEPC. Members of the fire department and the LEPC have inspected our anhydrous ammonia plant. In addition, copies of photographs taken of our plant have been provided (for reference) to both entities.\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\nThe plan is to minimize those hazards to human health and to the environment that are associated with accidental releases of anhydrous ammonia. Employees working at the bulk storage plant make routine observations prior to and during transfer operations of the anhydrous ammonia from the storage vessel(s) to nurse tanks. In so doing, they are able to detect problems before they arise. This routine inspection identifies any portion of the system which may be under stress or about to fail. Repairs can be made before they become problematic. Employees are annually trained to recognize the hazards associated with storage and handling of anhydrous ammonia. In addition to annual training for employees who have been on the job for a number of years, the company conducts training for new hires. This training includes classroom instruction, on-site training at the plant, and follow-up observation to determine their individual comprehension and understanding of the new hire. Finally, the company routinely invites  local fire department personnel to visit the site. In the event that the local fire department requests assistance in training its employees on anhydrous ammonia, the company cooperates fully in their endeavors.\n"
    }
  ]
}