{
  "FacilityID": 46674,
  "FacilityName": "Tri-State Plant Food, Inc.",
  "FacilityStr1": "1615 East Burdeshaw Street",
  "FacilityStr2": null,
  "FacilityCity": "Dolthan",
  "FacilityState": "AL",
  "FacilityZipCode": "36303",
  "Facility4DigitZipExt": "1745",
  "FacilityCountyFIPS": "01069",
  "LEPC": "Dothan/Houston County LEPC",
  "FacilityLatDecDegs": "31.228917",
  "FacilityLongDecDegs": "-085.372750",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 150579910,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Tri-State Plant Food, Inc.",
  "OperatorStr1": "PO BOX 1745",
  "OperatorStr2": "1615 East Burdeshaw Street",
  "OperatorCity": "Dolthan",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36302",
  "OperatorZipCodeExt": "1745",
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000052435",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "607-007-z003",
  "SafetyInspectionDate": "2005-08-11 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2006-09-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-09-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2006-09-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-07-03 00:00:00",
  "DeRegistrationEffectiveDate": "2014-07-02 00:00:00",
  "AnniversaryDate": "2011-09-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 31.227417,
  "FRS_Long": -85.373556,
  "FRS_Description": null,
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility as 'Closed'.",
  "_processes": [
    {
      "ProcessID": 67498,
      "AltID": "13",
      "FacilityID": 46674,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 89298,
          "ProcessID": 67498,
          "ChemicalID": 56,
          "Quantity": 300000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 69101,
          "ProcessID": 67498,
          "NAICSCode": "325311",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 39577,
              "Process_NAICS_ID": 69101,
              "SafetyReviewDate": "2006-01-31 00:00:00",
              "PHA_Date": "2006-09-19 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2006-01-31 00:00:00",
              "TrainingReviewDate": "2005-12-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-05-21 00:00:00",
              "EquipmentInspectionDate": "2006-08-24 00:00:00",
              "EquipmentTested": "Ammonia Tanks #1 and #2",
              "ChangeMgmtDate": "2006-01-31 00:00:00",
              "ChangeMgmtReviewDate": "2006-01-31 00:00:00",
              "PreStartupReviewDate": "2006-01-31 00:00:00",
              "ComplianceAuditDate": "2006-08-24 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2006-03-08 00:00:00",
              "InvestigationChangeDate": "2006-03-24 00:00:00",
              "ParticipationPlansReviewDate": "2006-03-21 00:00:00",
              "HotWorkPermitReviewDate": "2006-01-31 00:00:00",
              "ContractorSafetyReviewDate": "2006-01-31 00:00:00",
              "ContractorSafetyEvalDate": "2006-01-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 57434,
                  "PreventionProgram3ID": 39577,
                  "ProcessChemicalID": 89298
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 46674,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2006-01-31 00:00:00",
    "ERTrainingDate": "2006-01-31 00:00:00",
    "CoordinatingAgencyName": "AL - Dolthan/Houston County EMA",
    "CoordinatingAgencyPhone": "3347949720",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46674,
      "SummaryText": "Executive Summary\n\nRisk Management Program Executive Summary\n\nThis executive summary for the Risk Management Program submitted by Tri-State Plant Food, Inc. conforms to the requirements of 40 CFR 68.155 for the covered process using anhydrous ammonia in the production of ammoniated fertilizers. Referenced documentation such as the facility Emergency Action Plan, Process Safety Management Plan, and Risk Management Plan are maintained at the facility and are available for inspection. \n\nA. Accidental Release Prevention and Emergency Response Policies\n\nTri-State Plant Food, Inc. is committed to providing a safe environment for all employees, contractors, visitors, and neighbors. This commitment is carried out through the implementation of our Process Safety Management and Risk Management plans. The purpose of these plans is to prevent the accidental release and resulting consequences of anhydrous ammonia. These policies include release prevention measures that include process operations and equipment that meet recognized design standards, preventive maintenance programs, inspections, replacement of equipment as needed, and employee training.\n\nThe goal of Tri-State Plant Food, Inc. is to prevent any accidents from occurring. However should such an event occur the primary goal is to ensure the safety of the plant personnel and the neighboring general public. The Emergency Action Plan has procedures for the most likely emergency situations such as a chemical spill, a major fire, and weather emergencies. All procedures included in the Emergency Action Plan maintained by the facility are designed to minimize the risk to employees and emergency response personnel. Rescue and medical activities have priority over all other actions. It is company policy to immediately notify the Dothan Fire Department, the Alabama Emergency Management Agency, and the National Response Center in the event of an ammonia release that exceeds the spill reporting threshold quantity of 100 pounds. Tr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46674,
      "SummaryText": "i-State Plant Food, Inc. will employ mitigation measures and provide assistance to outside emergency response agencies.\n\nB. Facility Description\n\nTri State Plant Food, Inc. employees about 50 full time employees at its fertilizer manufacturing and distribution facility located at 1615 East Burdeshaw Street, Dothan, Alabama. The plant uses anhydrous ammonia in the production of granulated fertilizers. The ammonia is delivered by rail in 80 ton capacity tanker car and unloaded into two, 18,000 gallon above ground storage tanks that are filled to an administratively limited level of 75% capacity. The total amount of ammonia ever present at the facility is approximately 300,000 pounds. The ammonia is then reacted with sulfuric acid, phosphoric acid, phosphate rock, and other various raw materials in a TVA type Pipe Cross Reactor or a rotary Ammoniator to produce many different grades of fertilizer.\n\nC. Worst-Case Release Scenario and Alternative-Case Release Scenario\n\nThe Worst Case Release Scenario was developed using output tables from the DEGADIS model. The DEGADIS model is listed in 40 CFR Part 51, Appendix W as an EPA Guideline Model. These tables can be found in the Retail Guidance Document for EPA¿s Risk Management Program published by The Fertilizer Institute and Mississippi Chemical Corporation. The worst-case release scenario is the release of 160,000 pounds of ammonia from a railcar tank over a 10 minute time span. The distance to toxic endpoint radius would extend off site for a distance of 1.3 miles. The estimated residential population within this area is approximately 5,600 people. The storage vessels are all equipped with excess flow valves that will shut in the event of a catastrophic pipe failure. They are also equipped with pressure relief valves to prevent a container rupture. Pressure gauges, and liquid level indicators are installed to alert personnel of an overfill/pressure situation.\n\nThe Alternative-Case Release Scenario is based on an actual re"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46674,
      "SummaryText": "lease event that occurred on April 11, 2000. RMP*Comp was used to calculate this scenario¿s toxic endpoint due to its ability handle time and release rate inputs beyond the range of the DEGADIS output tables mentioned in the Worst-Case Release Scenario. The actual release parameters were then inputted into the RMP*Comp modeling program. The resulting endpoint output data matches the reports from the actual release. The scenario assumes that there will be an 18.3 pounds per minute release rate over a 300 minute time span from a fractured pipe fitting. The distance to toxic endpoint radius is less than 1/10th of a mile. The estimated residential population within this area is approximately 54 people. The effects of such a release would be mitigated by a water sprinkler system in the ammonia storage area that when activated, will absorb some of the released ammonia. The storage vessels are all equipped with excess flow valves that will shut in the event of a catastrophic pipe failure. They are also equipped with pressure relief valves to prevent a container rupture, pressure gauges, and liquid level indicators to alert personnel of an overfill/pressure situation.\n\nD. Accidental Release Prevention Program\n\nThe ammonia storage vessels and process equipment are all designed and constructed to meet accepted design specifications. The equipment is inspected visually on a daily basis and during an intensive, documented annual inspection period. It is maintained and operated only by trained personnel. The process has many built in mechanical safeguards such as mechanical shutoff valves, excess flow valves, hydrostatic relief valves, and pressure operated bypass valves. These would be activated to prevent a catastrophic release. There is a Management of Change policy in place to ensure that any changes to the process are implemented only after such issues as hazard analysis, design standards, maintenance and operational characteristics have been thoroughly evaluated. The chang"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 46674,
      "SummaryText": "es are then subjected to a Pre-Startup Safety Review to ensure that the new equipment and/or procedures have been implemented correctly.\n\nE. Five Year Accident History\n\nNo reportable accidents involving anhydrous ammonia at Tri-State Plant Food, Inc. within the last 5 years.\n\nF. Emergency Response Program\n\nThe Emergency Action Plan maintained by Tri-State Plant Food, Inc. has contingencies for most likely emergency scenarios that could occur such as fire, chemical release, and, severe weather. This plan is reviewed annually and updated as needed. The primary goal of the plan is to protect the safety and health of the employees and the general public. Employees are trained to recognize an emergency situation and to respond according to Tri-State Plant Food¿s Employee Alarm System Policy. Emergency response agencies will be notified as soon as possible in the event of an emergency. After the emergency is over the management team at the plant will launch an incident investigation to determine the cause of the accident and decide how to prevent the accident from recurring.\n\nG. Changes \n\nSeveral safety upgrades to the anhydrous ammonia process were completed are have been fully operational since August of 2001. An ammonia detection/alarm system was installed that will automatically detect a fugitive release of ammonia and trigger an alarm. Several sensors are placed at strategic locations around the facility. The two above ground ammonia storage tanks are equipped with electrically controlled valves. These valves will shutoff the flow of ammonia at the storage tanks. They are activated by push buttons located at remote locations around the plant and by the ammonia detection/alarm system. In the event of a power failure the valves will automatically fail-safe in the closed position, stopping the flow of ammonia to the rest of the process. \n\nH. Submittal Note\n\nThe purpose of this submission is to comply with the five year update reporting requirements.  Tri-State Plant Foo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 46674,
      "SummaryText": "ds was inspected by the EPA on August 31, 2006.  Tri-State is waiting on the final results of the audit.  All recommendations will be addressed in a timely manner."
    }
  ]
}