{
  "FacilityID": 46692,
  "FacilityName": "Grace Davison",
  "FacilityStr1": "340 Meadow Road",
  "FacilityStr2": null,
  "FacilityCity": "Edsion",
  "FacilityState": "NJ",
  "FacilityZipCode": "08817",
  "Facility4DigitZipExt": "5571",
  "FacilityCountyFIPS": "34023",
  "LEPC": "Edison Township OEM",
  "FacilityLatDecDegs": "40.484722",
  "FacilityLongDecDegs": "-074.385833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1367846,
  "ParentCompanyName": "W.R. Grace & Co.-Conn.",
  "Company2Name": null,
  "CompanyDUNS": 1367846,
  "Company2DUNS": 0,
  "OperatorName": "W.R. Grace & Co.-Conn.",
  "OperatorStr1": "7500 Grace Drive",
  "OperatorStr2": null,
  "OperatorCity": "Columbia",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21044",
  "OperatorZipCodeExt": null,
  "RMPContact": "Chad Seitz",
  "RMPTitle": "Site Manger",
  "FTE": 80,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000197048",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "15009",
  "SafetyInspectionDate": "2003-05-27 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-10-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-06-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-05-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-12-04 00:00:00",
  "DeRegistrationEffectiveDate": "2018-11-19 00:00:00",
  "AnniversaryDate": "2011-05-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1.6",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 67528,
      "AltID": "Custom Cat./Components",
      "FacilityID": 46692,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 69131,
          "ProcessID": 67528,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 89377,
          "ProcessID": 67528,
          "ChemicalID": 51,
          "Quantity": 1000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 51,
            "ChemicalName": "Titanium tetrachloride  [Titanium chloride (TiCl4) (T-4)-]",
            "CASNumber": "7550-45-0",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 89378,
          "ProcessID": 67528,
          "ChemicalID": 107,
          "Quantity": 60000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 107,
            "ChemicalName": "Isobutane  [Propane, 2-methyl]",
            "CASNumber": "75-28-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 589377,
          "ProcessID": 67528,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 589378,
          "ProcessID": 67528,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46692,
      "SummaryText": "Edison site, has a Risk Management Program which meets the requirements of OSHA-PSM, EPA-RMP,\nNew Jersey-TCPA and the ACC-Responsible Care guidelines. The site is a OSHA VPP Star site and it's Quality\nand Environmental management systems are certified for ISO 9001 and ISO 14001 standards.\n\nThe Process Safety Information documentation and updating functions are assigned to different department\nmanagers and are detailed in the \"Site Employee Participation Plan\"document.\n\nProcess Hazard Analysis are conducted on a five year schedule by suitable process hazard analysis teams. The\nteams are composed of a team leader, various personnel having knowledge of production and maintenance procedures,\nand a prodcution operator. Normally the HAZOP and What If / Checklist methods are used. The completion of\nrecommendations are tracted by an electronic data base. The Process and Quality (PQC) Manager is responsible\nfor implementation of this RMP element.\n\nThe Standard Operating Procedures (SOP's) are written and updated by the process and production engineers / \nsupervisors. The Production Manager is responsible for keeping SOP's current. The SOP's are verified and certified for\ncorrectness once a year. The SOP's are available to relevant personnel via a LAN system and a \"hard copy\" of each\nSOP is available in the applicable production area.\n\nThe training is planned and tracted by the Safety and Training Manager according to the annual training plan.\nThe training materials include manuals, lesson plans, video tapes, overheads and field equipment. The understanding\nof the training is verrified by written tests, oral exams and demonstrations. Any one or all of these may be employed.\nThe training activities are tracked by a training database.\n\nThe Engineering Manager is responsible for implementation of the Mechanical Integrity Program. The program\nconsists of program manual, equipment lists and specifications, equipment history files, preventive maintenance\nprocedures and an automated"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46692,
      "SummaryText": " work order system. Work permits, entry permits, and hot work permits have been \nincorporated in the Safety Procedures Manual. Yearly reports are issed to verify that all regulated equipment is \ntestedand inspected as per the documented program.\n\nThe Safety and Training Manager is responsible for implementation of the Management Of Change (MOC) Program.\nThe detailed MOC procedure and the Pre-Startup Procedure have been incorporated in the Safety Procedures \nmanual. A committee consisting of various technical personnel reviews and approves all MOC requests. The \ncompletion of all action items is tracked and documented via an electronic database system.\n\nAnnual and tri-annual compliance audits are coordinated by the PQC Manager. Normally they are led by corporate\nexpert personnel. Deficiencies are noted and scheduled for system improvements by the responsible managers.\nThe completion of recommendationsis tracked and documented via electronic database.\n\nThe Incident Investigation Program consists of a detailed procedure incorporated in the Safety Procedures Manual.\nAll regulated chemical releases are investigated by the area supervisor by forming an incident investigation team \nand issued as preliminary reports to a review committee. The committee reviews the reports to ensure that root causes have been identified and suitable corrective actions have been proposed. The Safety and Training Manager then issues a final \nincident investigation report by incorporating information and feedback from all sources and reviews. The final report is \ndistributed to all supervisory personnel, who in turn discusses it with all employees in their periodic safety contacts meeting. \nAll action items are tracked and the completion is documented via an electronic database system.\n\nThere is a written Emplyee Participation Plan document, which describes the major requirements of various RMP \nelements and how the employees participate in their implementation. The program is implemented by th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46692,
      "SummaryText": "e PQC\nManager.\n\nThe Contractor Program follows the OSHA-PSM and NJ-TCPA requirements. The program is implemented by the \nSafety and Training Manger.\n\nSite release prevention and chemical specific prevention used include relief valves, rupture disks, vents, check valves, scrubbers,\nquench systems, automatic shutoffs, interlocks, keyed bypasses, grounding, and purge systems.  Mitigation systems used are dikes, sprinkler systems, deluge systems, water curtains, hazmat foam system, fire fighting foam system, mineral oil dump systems, and nuetralization. Most of the process areas are monitored by leak detection and alarm systems for toxic and flammable gas leaks.  Operator refresher tranining is conducted on prescribed basis of the operator tranining program. The preventitive maintenance program conducts inspections and tests to assure operation of preventive devices.  Manangement of change procedures assures that all changes are reviwed for theior hazards before implementation. All incidents are investigated to determine root cause and corrective actions are implemented to prevent future incidents.\n\nThe site had no reportable accident during the last five years.\n\nThe site emergency response program meets the requirments of the EPA Integrated Contingency Plan Guidance. The plan defines the response organization, coordination with local emergency response committee, equipment, response procedures, training, notification procedures, and drills. The plan is updated acording to the recommendations from system deficiencies uncovered by the perioidic drills and he incident reports. \n"
    }
  ]
}