{
  "FacilityID": 46727,
  "FacilityName": "Elm Grove Gas Plant",
  "FacilityStr1": "Old Highway 71",
  "FacilityStr2": null,
  "FacilityCity": "Elm Grove",
  "FacilityState": "LA",
  "FacilityZipCode": "71051",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22015",
  "LEPC": "Bossier-Caddo Parish LEPC",
  "FacilityLatDecDegs": "32.361110",
  "FacilityLongDecDegs": "-093.564443",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.CenterPointEnergy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 835687930,
  "ParentCompanyName": "CenterPoint Energy Field Services, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "CenterPoint Energy Field Services",
  "OperatorStr1": "525 Milam Street",
  "OperatorStr2": "Suite 1205",
  "OperatorCity": "Shreveport",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "71101",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000165714",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-12-03 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-10-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-10-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-10-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-06-01 00:00:00",
  "DeRegistrationEffectiveDate": "2016-05-12 00:00:00",
  "AnniversaryDate": "2009-09-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 32.3546,
  "FRS_Long": -93.4883,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS BLOCK/TRACT-1990-CENTROID",
  "HorizontalAccMeasure": "12.2",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "C03",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 67576,
      "AltID": null,
      "FacilityID": 46727,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 89459,
          "ProcessID": 67576,
          "ChemicalID": 155,
          "Quantity": 71026.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 70438,
              "ProcessChemicalID": 89459,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 70439,
              "ProcessChemicalID": 89459,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 70440,
              "ProcessChemicalID": 89459,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 70441,
              "ProcessChemicalID": 89459,
              "ChemicalID": 107
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 69181,
          "ProcessID": 67576,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 24918,
              "Process_NAICS_ID": 69181,
              "SafetyReviewDate": "2004-09-08 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "UL ratings for atmospheric tanks",
              "FR_Comments": null,
              "HazardReviewDate": "2004-09-08 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-09-09 00:00:00",
              "TrainingReviewDate": "2004-09-09 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-09-09 00:00:00",
              "EquipmentInspectionDate": "2002-01-25 00:00:00",
              "EquipmentTested": "piping, vessels",
              "ComplianceAuditDate": "2004-09-08 00:00:00",
              "AuditCompletionDate": "2005-03-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2002-01-25 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 26068,
                  "PreventionProgram2ID": 24918,
                  "ProcessChemicalID": 89459
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 46727,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Caddo-Bossier Parish LEPC",
    "CoordinatingAgencyPhone": "3184255351",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46727,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe Elm Grove Gas Plant has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of the facility's processes.  The CenterPoint Energy Field Services, Inc. (CenterPoint) policy is to implement reasonable controls to prevent foreseeable releases of substances.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nCenterPoint operates the Elm Grove Gas Plant located in Bossier Parish, Louisiana.    The Elm Grove Plant is a natural gas processing plant that produces liquified petroleum gas (LPG), a mixture of pentanes, hexanes, C5+ compounds, using the Joule-Thompson separartion technique.  The LPG and condensate is transported from the site via tanker trucks.  As evidenced in the ensuing text and based on criteria outlined in the Accidental Release Prevention Program (ARP), the Elm Grove Gas Plant is a Program 2 process. \n\nThe Elm Grove Gas Plant was evaluated to determine if any regulated flammable or toxic substances were present in the process and if they exceeded the threshold quantity.  All equipment and vessels are considered to be connected and/or co-located; consequently, for the purposes of the ARP Program, all equipment and vessels are part of a single process.  The identification of even a single vessel exceeding threshold quantities of a regulated flammable or toxic substance would subject a process to threshold determination for offsite consequence analysis.\n \nFIVE YEAR ACCIDENT HISTORY\n\nThe Elm Grove Gas Plant has not had any accidental releases during the past five years that meet the criteria for an accidental release as discussed in 40 CFR 68.42.\n\nLOCAL EMERGENCY RESPONSE COORDINATION\n\nThe Elm Grove Gas Plant has coordinated its emergency response activities with the local emergency planning and respon"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46727,
      "SummaryText": "se agencies as required in 40 CFR 68.12(b)(3).\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe following is a summary of the accident prevention program in place at the Elm Grove Gas Plant.  The Elm Grove Gas Plant processes are subject to EPA's RMP regulations but not OSHA's PSM standards because the plant is unmanned.  This summary describes the management system in place to implement the accident prevention program implemented by CenterPoint.\n\nProcess Safety Information \n\nThe Elm Grove Gas Plant maintains written information intended to provide a foundation for identifying and understanding the process hazards.  This information addresses chemical properties, inventories, and associated hazards, as well as key process parameter limits and equipment design basis/configuration information.\n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in the material safety data sheets (MSDSs).  In addition, the plant has documented safety-related limits for specific process parameters and ensures limit maintenance by using highly trained personnel, process controls, and monitoring and protective instrument systems.\n\nThe company also maintains documentation that provides information about the design and construction of process equipment.  Equipment information includes construction materials, design pressure, and temperature and electrical ratings.  CenterPoint utilizes standard operating manuals for pumps, controls and relief valves, as well as ANSI, ASME and UL Ratings.  This information also provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\nHazard Review\n\nThe Elm Grove Gas Plant has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled.  Within this program, each process is sy"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46727,
      "SummaryText": "stematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\nThe Hazard Review findings are promptly and systematically addressed.  The Elm Grove Gas Plant assures that the recommendations are documented and resolved in a timely manner. This documentation includes the actions to be taken and a written schedule of completion dates.   The plant also provides proof of communication with operating, maintenance, and other employees whose work assignments are in the process and who may be affected by the recommendations. \n\nTo help ensure that the process controls and/or process hazards do not eventually deviate from the original design safety features, the plant periodically updates and revalidates the hazard review results.  These periodic reviews are conducted at least every five years by the Hazard Review team.  \n\nOperating Procedures\n\nThe Elm Grove Gas Plant maintains written procedures that address various modes of process operations, such as (1) initial startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) emergency operations, (6) normal shutdown, and (7) startup following a turnaround or after an emergency shutdown.  These procedures can be used as a reference by experienced operators and provide a consistent training basis for new operators. Operating procedures are periodically reviewed and certified as current.  When a process change occurs, operating procedures will be revised as necessary through the management of change process. \n\nTraining\n\nTo complement the written process operation procedures, the Elm Grove Gas Plant has implemented a comprehensive training program for all employees. New employees receive job specific basic training in plant operations. Employee training includes emphasis on safety and health hazards, emergency shutdown operations, and safe work practices. Operators demonstrating adequate knowledge to safely perform duties and tasks are allowed to work in"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 46727,
      "SummaryText": "dependently.\n\nIncident Investigation\n\nThe Elm Grove Gas Plant has a plan in place to promptly investigate all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  An incident investigation is initiated as promptly as possible to thoroughly investigate and analyze the incident.  This investigation is lead by an incident investigation team consisting of those with appropriate knowledge and experience in the process.  The findings and recommendations made by the incident investigation team are promptly addressed and resolved in a timely manner.  The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings.\n\nEmergency Planning and Response\n\nThe Elm Grove Gas Plant is an unmanned site.  All emergency response actions are coordinated with the Caddo-Bossier Parish LEPC.\n\nCompliance Audits\n\nTo help ensure that the accident prevention program is properly functioning, the Elm Grove Gas Plant periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are to be conducted at least every 3 years.  The audit team includes those knowledgeable in the process, operations personnel, and at least one person trained in audit techniques and practices.  The audit team develops findings and corrective actions are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained."
    }
  ]
}