{
  "FacilityID": 46730,
  "FacilityName": "Albany Wastewater Plant",
  "FacilityStr1": "310 Waverly Street",
  "FacilityStr2": null,
  "FacilityCity": "Albany",
  "FacilityState": "OR",
  "FacilityZipCode": "97321",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41043",
  "LEPC": "Mid-Valley CAER Group",
  "FacilityLatDecDegs": "44.643333",
  "FacilityLongDecDegs": "-123.075278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Albany",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Albany, Oregon",
  "OperatorStr1": "333 Broadalbin SW",
  "OperatorStr2": null,
  "OperatorCity": "Albany",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97321",
  "OperatorZipCodeExt": null,
  "FTE": 60,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000118865",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-08-03 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Wastewater Plant Chlorinator",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-10-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-10-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-10-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-10-31 00:00:00",
  "DeRegistrationEffectiveDate": "2007-10-23 00:00:00",
  "AnniversaryDate": "2011-10-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 44.64205,
  "FRS_Long": -123.07416,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 67579,
      "AltID": "Wastewater Plant Chlorine",
      "FacilityID": 46730,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 89462,
          "ProcessID": 67579,
          "ChemicalID": 62,
          "Quantity": 22000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 69184,
          "ProcessID": 67579,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 39632,
              "Process_NAICS_ID": 69184,
              "SafetyReviewDate": "2006-08-03 00:00:00",
              "PHA_Date": "2004-06-04 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-11-05 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Modified emergency notification & evacuation alarms & procedures.",
              "OpProceduresReviewDate": "2006-08-03 00:00:00",
              "TrainingReviewDate": "2006-08-03 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2006-08-03 00:00:00",
              "EquipmentInspectionDate": "2006-09-15 00:00:00",
              "EquipmentTested": "Serviced and tested the chlorine & evacuation alarm system",
              "ChangeMgmtDate": "1999-04-15 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-28 00:00:00",
              "PreStartupReviewDate": "1999-05-28 00:00:00",
              "ComplianceAuditDate": "2004-06-04 00:00:00",
              "AuditCompletionDate": "2004-11-05 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2006-08-02 00:00:00",
              "HotWorkPermitReviewDate": "2006-08-02 00:00:00",
              "ContractorSafetyReviewDate": "2006-08-02 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Albany Wastewater Plant",
              "_chemicals": [
                {
                  "PrimaryKey": 57553,
                  "PreventionProgram3ID": 39632,
                  "ProcessChemicalID": 89462
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 46730,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2006-08-02 00:00:00",
    "ERTrainingDate": "2006-06-22 00:00:00",
    "CoordinatingAgencyName": "Albany Fire Department",
    "CoordinatingAgencyPhone": "5419177700",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46730,
      "SummaryText": "Risk Management Plan Executive Summary:\n\n1.  Accidental Release Prevention and Emergency Response Policies:\n\nWe at the the City of Albany Wastewater Plant are committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, our highly trained personnel are on hand to control and mitigate the effects of the release.  We are also completely coordinated with the Albany Fire Department and Region 5 Hazmat Team who provide additional emergency response expertise.\n\n2.  The Stationary Source and the Regulated Substances Handled:\n\nThe maximum inventory of chlorine that is expected to be present in this facility is 22,000 lbs.\n\n3.  The General Accidental Release Prevention Program and the Chemical Specific Prevention Steps:\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68 of the EPA.  One process at our facility is subject to the OSHA and OR-OSHA PSM standard under 29 CFR 1910.119.  Our facility is also subject to EPCRA Section 302 notification requirements.  The following sections briefly describe the elements of the accidental release prevention program that is in place at our facility.\n\nProcess Safety Information:\n\nThe Wastewater Treatment Plant maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis:\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46730,
      "SummaryText": "ese analyses is the Checklist.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of every five years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures:\n\nFor the purpose of safely conducting activities within our covered processes, the Wastewater Treatment Plant maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators and maintenance personnel involved in the Wastewater Plant chlorination process.\n\nTraining:\n\nThe Wastewater Treatment Plant has a comprehensive training program in place to ensure that persons who are operating and maintaining processes are properly trained in the procedures associated with those processes.  New employees receive basic classroom training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided at least every three years and more frequently as needed.\n\nMechanical Integrity:\n\nThe Wastewater Treatment Plant carries out highly documented maintenance checks on process equipment to ensure proper operation.  Process equipment examined by these checks includes: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change:\n\nWritten procedures are in place at the Wastewat"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46730,
      "SummaryText": "er Treatment Plant to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel, or any other employee whose job tasks are affected by a modification of process conditions, are promptly made aware of, and given, training to deal with the modification.\n\nPre-Startup Reviews:\n\nPre-Startup Safety Reviews related to new processes and to modifications of established processes are conducted as a regular practice at the Wastewater Treatment Plant.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing new or modified equipment into operation.\n\nCompliance Audits:\n\nThe Wastewater Treatment Plant conducts audits on a regular basis to determine whether the provisions required by the RMP Rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation:\n\nThe Wastewater Treatment Plant promptly investigates any incident that has resulted in, or courld reasonably result in, a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation:\n\nThe Wastewater Treatment Plant truly believes that process safety management and accident prevention require a team effort to be successful.  Employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of our implementation of the RMP Rule, including information resulting from process hazard analysis in particular.\n\nContractors:\n\nOn occasion, the Wastewater Treatment Plant hires contractors t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 46730,
      "SummaryText": "o conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  The Wastewater Treatment Plant has a strict policy of informing the contractors of any known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency notification and evacuation, should an accidental release of chlorine occur.\n\n4.  Five-Year Accident History:\n\nThe Wastewater Treatment Plant has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent accidental release prevention policies, there has not been an accidental release during the past 5 years.\n\nEmergency Response Plan:\n\nOur facility is included in the City of Albany's written emergency response plan.  The Wastewater Treatment Plant has it's own written emergency response plan.  The site emergency response plan includes specific procedures for informing the public and local agencies regarding responding to an accidental chlorine release.  The emergency response plan includes information on emergency health care as well.\n\nThe date of the most recent review/update of the site emergency response plan was:  August 2, 2006\nThe date of the most recent emergency response plan training for employees was:     June 22, 2006 \n\nThe local agency coordinating the emergency response planning for the City of Albany is the Albany Fire Department.  Their phone number is: 541-917-7700.\n\n5.  Planned Changes to Improve Safety:\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  We have upgraded our chlorine alarm and emergency notification and evacuation system and provided training for all Public Works employees, visitors, vendors and contractors since April of 1999.  We also have a system that requires all employees, visitors, vendors, an"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 46730,
      "SummaryText": "d contractors who visit our facility to check or sign in and out of the facility at all times."
    }
  ]
}