{
  "FacilityID": 46771,
  "FacilityName": "Agrium U.S., Inc Marseilles, IL",
  "FacilityStr1": "2100 Broadway St.",
  "FacilityStr2": null,
  "FacilityCity": "Marseilles",
  "FacilityState": "IL",
  "FacilityZipCode": "61341",
  "Facility4DigitZipExt": "0118",
  "FacilityCountyFIPS": "17099",
  "LEPC": "Lasalle County LEPC",
  "FacilityLatDecDegs": "41.316944",
  "FacilityLongDecDegs": "-088.675278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "P3",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Agrium U.S., Inc",
  "Company2Name": null,
  "CompanyDUNS": 808957229,
  "Company2DUNS": 0,
  "OperatorName": "Agrium U.S., Inc",
  "OperatorStr1": "2100 Broadway St.",
  "OperatorStr2": null,
  "OperatorCity": "Marseilles",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "61341",
  "OperatorZipCodeExt": "0118",
  "RMPContact": "Joe Moyer",
  "RMPTitle": "Terminal Manager",
  "FTE": 4,
  "OtherEPAFacilityID": "IL0001708001",
  "EPAFacilityID": "100000096914",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "099050AAN",
  "SafetyInspectionDate": "2004-05-27 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-10-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-10-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-10-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2022-01-26 00:00:00",
  "DeRegistrationEffectiveDate": "2021-12-13 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 41.31694,
  "FRS_Long": -88.67528,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "60",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 67640,
      "AltID": "Ammonia (Anhydrous)",
      "FacilityID": 46771,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 69245,
          "ProcessID": 67640,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 89537,
          "ProcessID": 67640,
          "ChemicalID": 56,
          "Quantity": 40000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 589537,
          "ProcessID": 67640,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46771,
      "SummaryText": "\nA.  Introduction:\nThe  terminal in Marseilles receives fertilizers from barges, stores the fertilizer in tanks, and loads trucks.  The facility has two anhydrous ammonia tanks and four urea ammonium nitrate (UAN) liquid fertilizer storage tanks.  In addition there are two dry warehouses and a dry barge unloading facility.\n. \nB.  Accidental Release Record:\n\nThe terminal, has an excellent safety record with no deaths or serious injuries to facility personnel since it was constructed in 1964. \n \nThe facility safety record is the direct result of continued emphasis on safety by management, employees, contractors, and truck drivers.  There have not been any releases from the terminal that meet the description of an RMP accidental release. \n\nC. General Accidental Release Prevention  Policies And Activities:\n\n\n\nThe entire Nitrogen team works together to ensure the facility is in compliance with OSHA?s Process Safety Management standards and the accident prevention programs are continuously improved.  A networked computer management system is utilized to provide our employees with the necessary tools and records to maintain the safety of the process.  This teamwork is an integral part in the safety efforts of this facility.\n\nAccident release prevention steps include the fourteen-element program for Process Safety Management, a management system, corporate oversight of the facility, and a focus on continuous improvement. \n\nAll employees are encouraged to participate in the facility?s safety program.  Examples of employee participation include participation in Process Hazard Analyses, cooperative training, updating of operating procedures, and emergency response activities. \n\n\nThe facility has well established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps, compressors, and emergency shutdown systems in a safe operating condition.  This program includes:\n\n1. training\n2. written operating procedures\n3. inspectio"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46771,
      "SummaryText": "ns and tests in accordance with recognized standards,\n4. correction of deficiencies, and \n5. quality assurance \n\nIn combination, these activities form a system that maintains the mechanical integrity of the process equipment.\n\nMaintenance personnel receive training on  (1) an overview of the process, (2) safety and health hazards, (3) emergency response plans, and (4) applicable safe work practices to help ensure that they can perform their job in a safe manner.  Written procedures help ensure that work is performed in a consistent manner, conforms to generally accepted standards, and provides a basis for training. Inspections and tests are performed to help ensure that equipment functions as intended and to verify that equipment is within acceptable limits\n\nThe facility has a comprehensive system to manage changes to processes.  This system requires that changes to items such as process equipment, chemicals, technology, procedures, and other facility changes be properly reviewed and authorized before being implemented. \n\n\nF.  Five Year Accident History:\n\nThe Terminal has an excellent safety record with no deaths or serious injuries to any of its personnel.  In addition, the terminal has operated without a lost time accident for over thirteen years. \n\nThere have not been any incidents that meet the definition of a RMP recordable release. \n\nG.  Emergency Response:\n\nThe facility Emergency Action Plan covers accidental releases of plant chemicals, natural disasters, emergency response practices and procedures, and process safety topics.  The plan is reviewed at least annually with all employees.\n\nAll permanent employees have the required Hazmat training, including an eight-hour refresher course annually. Each employee and permanent contractor is trained on the facility?s Emergency Response policies and procedures at regularly scheduled plant safety meetings.\n\nThe terminal manager and his assistant attend monthly Community Advisory Panel meetings. This panel includes ot"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46771,
      "SummaryText": "her area industries, Marseilles Village board members, local emergency response agencies, community leaders, and citizens.\n\nThe Emergency Response Plan is followed in the event of an emergency. The emergency alarm system is tested once each month and an emergency drill is held at lease annually. \n\n\nH.  Planned Changes to Improve Safety:\n\nThe Terminal will utilize employee input and industry best management practices to continuously improve safety, environmental, and all operations.  \n\nI.  Summary:\n\nThe Terminal and its employees are extremely proud of its safety record and the vast improvements in both safety and environmental.  We believe that with the programs and policies in place in our terminal and the continued efforts of 100% of our personnel, we will be able to maintain our safety record and a safe plant environment for all concerned in the years ahead."
    }
  ]
}