{
  "FacilityID": 46808,
  "FacilityName": "MaMa Rosa's LLC",
  "FacilityStr1": "1910 Fair Rd",
  "FacilityStr2": null,
  "FacilityCity": "Sidney",
  "FacilityState": "OH",
  "FacilityZipCode": "45365",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39149",
  "LEPC": "Shelby County EMA",
  "FacilityLatDecDegs": "40.269430",
  "FacilityLongDecDegs": "-084.178660",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G3",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 18310144,
  "ParentCompanyName": "Plaza Belmont",
  "Company2Name": null,
  "CompanyDUNS": 7258908,
  "Company2DUNS": 0,
  "OperatorName": "MaMa Rosa's LLC",
  "OperatorStr1": "1910 Fair Rd",
  "OperatorStr2": null,
  "OperatorCity": "Sidney",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45365",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kevin Regan",
  "RMPTitle": "Facilities Maint.Superintendent",
  "FTE": 300,
  "OtherEPAFacilityID": "OHD987002292",
  "EPAFacilityID": "100000092464",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-10-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-10-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-10-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 40.26823,
  "FRS_Long": -84.18198,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "7.1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 67741,
      "AltID": "System #1",
      "FacilityID": 46808,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 69346,
          "ProcessID": 67741,
          "NAICSCode": "311412",
          "_desc": {
            "NAICS_CODE": "311412",
            "NAICS_DESCRIPTION": "Frozen Specialty Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 89663,
          "ProcessID": 67741,
          "ChemicalID": 56,
          "Quantity": 7375.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 589663,
          "ProcessID": 67741,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 67742,
      "AltID": "System #2",
      "FacilityID": 46808,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 69347,
          "ProcessID": 67742,
          "NAICSCode": "311412",
          "_desc": {
            "NAICS_CODE": "311412",
            "NAICS_DESCRIPTION": "Frozen Specialty Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 89664,
          "ProcessID": 67742,
          "ChemicalID": 56,
          "Quantity": 16601.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 589664,
          "ProcessID": 67742,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46808,
      "SummaryText": "EXECUTIVE SUMMARY\n1.0     RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe MaMa Rosa's facility in Sidney, Ohiohas a good record in preventing releases of anhydrous* ammonia.  MaMa Rosa's has a thorough emergency training program for on -site emergency responders.  The facility has implemented MaMa Rosa's HAZWOPER plan (emergency response program) which is a plan designed for the safety  of it's employees', the community and the environment.  This detailed emergency response program includes procedures for handling an emergency - the established action plan and appropriate personnel involved in containing a hazardous release (HAZMAT Team).  As part of this emergency response program, MaMa Rosa's emphasizes a thorough training program and medical surveillance of the HAZMAT team prior to and after an incident.  With the potential dangers associated with a hazardous chemical release,  MaMa Rosa's has researched and developed safe containment and disposal procedures as well as an evaluation procedure following an emergency response.  All of these components make the MaMa Rosa's HAZWOPER plan a thorough and comprehensive plan for release prevention and emergency response.\n\nThe emergency response policies at the MaMa Rosa's facility ensure that there is emergency response coverage 24 hours - 7 days per week.  There are also provisions for coordination with outside agencies such as the Sidney Fire Department in the event of an emergency.\n\n*From this point in the Executive Summary, anhydros ammonia will be synonymous with ammonia.\n\n2.0     PROCESS DESCRIPTION AND REGULATED SUBSTANCES\n\nMaMa Rosa's is a producer of prepared frozen pizzas.  The NAICS code for this process at this facility is 311412.  Many areas of the plant are refrigerated to preserve the food products.  MaMa Rosa's has one regulated substance under 40 CFR 68: ammonia.  Ammonia is used as a refrigerant in the refrigeraton of the foods in the various areas of the plant.\n\nThe ammonia threshold for trigge"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46808,
      "SummaryText": "ring applicability to 40 CFR 68 is 10,000 pounds.The MaMa Rosa's Plant has two ammonia refrigeration processes for the preservation of the food products.  Ammonia System # 1 has Appoximately 7,375 pounds of ammonia in the process.  Ammonia system # 1 does not exceed the threashold quanity of 10,000 pounds as set by  40 CFR 68.\n\nAmmonia System # 2 has approximately 16,601 pounds of ammonia in the process. Since the quanity of the combined systems exceeds the the threashold quanity of 10,000 pounds it is regulated under 40 CFR 68.\n\n3.0 WORST CASE AND ALTERNATIVE RELEASE SCENARIOS\n\nThe ammonia refrigeration systems have associated hazards that can potentially affect on-site employees and general public off-site if there is a release from the system.  Described below are the associated hazardss for the regulated chemical.  Though there are other scenarios possible, EPA only requires that one worst-case and one alternative scenario be reported for each process.  Since the MaMa Rosa's Facility only hasa one process about the threashold, one worst-case and only one alternative scenario were developed.\n\nAmmonia\n\nAmmonia is classified as a group 2 Refrigerant per ASHREA Standard 34-1989.  The dominant characteristics of this chemical is its toxicity.  It is a self-alarming chemical by its distinctive pungent odor.  Due to this odor, persons exposed to ammonia vapor will not voluntarily stay in areas of even small concentrations.  Ammonia will burn at a very narrow and high range of concentrations accompanied with a high ignition temperature.  Allthough ammonia is not poisonous, it is corrosive to human tissue.  Ammonia is readily absorbed into the moisture of the skin and, at high concentrations, can cause severe burns.\n\nThe risk to persons in an accidental release of ammonia include:\n1.    Corrosive attack of the skin and other tissue (including lungs tissue)\n2.    Freezing of skin and other body tissue when contacted by liquid ammonia.\n\n4.0   GENERAL ACCIDENTAL PREVENTION "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46808,
      "SummaryText": "PROGRAM AND CHEMICAL - SPECIFIC PREVENTION STEPS\nMaMa Rosa's has developed an OSHA PSM program for their ammonia refrigeration systems.  At MaMa Rosa's , ammonia falls under the RMP Program 3 prevention program which is identical to the OSHA PSM Program.  EPA said that if the process is in compliance with OSHA PSM , then it is in compliance with RMP Program 3.  Thus MaMa Rosa's ammonia PSM has been reviewed and determined to be complete for the RPM document.   \n\nThere are several aspects of the ammonia prevention program that are key:\n\n1.    The ammonia PSM program at MaMa Rosa's includes provisions for employee involvement, procedures for working with contractors, pre-start up safety reviews and managing change within the system.  The different of the PSM document detail employee participation (hazard analysis team), process safety information, process hazard analysis (PHA -what-if/checklist), operating procedures, training, mechanical integrity, hot work permits,Management of change, incident investigation, compliance audits, and emergency planning and response (HAZWOPER Plan).  The plant, therefore, maintains good training certification, and employee awareness of operating procedures.\n\n2.    MaMa Rosa's has researched information pertaining to the properties and hazards of ammonia, sought professional assistance from experts in the ammonia refrigeration industry, IIAR Ammonia Refrigeration Library, and used many internal resourses to develop our PSM program, P&IDS, and Block Flow Diagrams.  They are developed and updated as the ammonia refrigeration system audits are completed.\n\n3.    MaMa Rosa's has established a hazard analysis team (compromising of plant employees) responsaible for updating existing operating procedures for the refrigeration systemand also verifing and documenting the mechanical integrity of the system.\n\n4.    In the event of a catastrophic release or an incident which could have resulted in a catastrophe, investigations will be undertaken (th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 46808,
      "SummaryText": "is is a policy of the PSM document).  Necessary preventive measures will be taken to reduce the risk of incident reoccurance.\n\n5.    FIVE-YEAR ACCIDENT HISTORY\n\nThe review of MaMa Rosa's accident history includes the following range of dates: June 22, 1999 - October 2, 2006.  According to 40 CFR68.42(a), there have been no accedental releases at this facility.\n\n6.    EMERGENCY RESPOSE PROGRAM\n\nAs mentioned previously, MaMa Rosa's has developed an OSHA hazardous substance emergency response program called HAZWOPER.  The HAZWOPER document contains detailed procedures for: 1) pre-emergency planning and coordination; 2) personel rolea and lines of authority; 3) training; 4) communication; 5) emergency recognitionand prevention; 6) safe distance and places of refuge; 7) site security and control; 8) emergency alerting and response; 9) ammonia decontamination; 10) emergency medical treatment and first aid; 11) critique of response and follow -up; 12) personal protective and emergency equipment; and 13)medical surveillance.\n\nMaMa Rosa's emergency response plan (HAZWOPER) is a detailed document which discusses the role of employees and management in an emergency situation.  All emergency response personnel undergo training and records of this training are maintained and updated on site.  The plan outlines specific procedures for evacuations, incident alarms and alerting.  Depending upon a givin situation, the fire department will be called for all fire related emergencies.  The incident commander has ultimate control of implementation of the emergency response plan.\n\n7.    PLANNED CHANGES TO IMPROVE SAFETY\n\nBased on the completed Process Hazard Analysis (PHA) for ammonia, a list of action items were developed and their status is being monitored that implementation is being accomplished."
    }
  ]
}