{
  "FacilityID": 46869,
  "FacilityName": "Surface Water Treatment Plant",
  "FacilityStr1": "4727 State Highway 322 N",
  "FacilityStr2": null,
  "FacilityCity": "Henderson",
  "FacilityState": "TX",
  "FacilityZipCode": "75652",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48401",
  "LEPC": "Rusk County LEPC",
  "FacilityLatDecDegs": "32.196833",
  "FacilityLongDecDegs": "-094.803194",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "C2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Henderson",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Henderson",
  "OperatorStr1": "1203 Highland Drive",
  "OperatorStr2": null,
  "OperatorCity": "Henderson",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75652",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Barrow",
  "RMPTitle": "Utilities Director",
  "FTE": 4,
  "OtherEPAFacilityID": "000009683418",
  "EPAFacilityID": "100000174241",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-07-06 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-10-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-10-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-10-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-10-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 32.19683,
  "FRS_Long": -94.80319,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "CENSUS BLOCK/GROUP-1990-CENTROID",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 67831,
      "AltID": "Surface Water Treatment",
      "FacilityID": 46869,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 69436,
          "ProcessID": 67831,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 89769,
          "ProcessID": 67831,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 589769,
          "ProcessID": 67831,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46869,
      "SummaryText": "RELEASE PREVENTION AND EMERGENCY REPONSE POLICIES\n\nThe City of Henderson utilizes liquefied chlorine gas in offering municipal surface water treatment services to its customers. This highly regulated municipal activity includes strict adherence to the following requirements:\n\n1.  The use of equipment and components designed and installed for chlorine gas service.\n2.  Training and certification by a state agency of operating personnel in the operation of a surface water treatment plant.\n3.  The coordination of City of Henderson personnel with local emergency response personnel in the event of an accidental release of chlorine from the SWTP.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe chlorine is stored at the SWTP in pressurized ton containers secured to an engineered storage cradle mounted onto a covered concrete pad.  The City of Henderson utilizes a vacuum-regulated system to deliver the chlorine from the ton containers to the water injection system.\n\n\nWORST CASE/ALTERNATIVE CASE SCENARIO ANALYSES INCLUDING ADMINISTRATIVE CONTROLS AND MITIGATION MEASURES TO LIMIT THE DISTANCES FOR EACH REPORTED SCENARIO\n\nThe worst-case release scenario involves the failure of one ton container, resulting in the release of 2,000 pounds of chlorine gas. The distance to the toxic endpoint is 3.0 miles. The alternative-release scenario involves the release of 4,000 pounds of chlorine gas resulting from a leak in a vacuum regulator mounted onto one of two ton containers connected in parallel service. The distance to the endpoint is 0.3 miles. The City of Henderson limits its inventory of chlorine at the SWTP to three ton containers. The vacuum-regulated system allows two ton containers to be in service and one ton container to be in standby.\n\n\nPREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\nThe City of Henderson SWTP was designed, installed, and is operated in accordance with applicable codes, standards, and guidelines which include:\n\n1.  The use of ton containers auth"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46869,
      "SummaryText": "orized by the Department of Transportation (DOT) for liquefied chlorine gas service.\n2.  The use of container shut-off valves and pressure relief devices meeting the requirements of the Chlorine Institute (CI) for liquefied chlorine gas service.\n3.  The inspection, testing, repair, or replacement of the ton containers, valves, and relief devices in accordance with DOT and CI requirements.\n\nThe vacuum-regulated system utilized at the City of Henderson SWTP is extremely safe since it is designed to eliminate the release of chlorine gas downstream of the vacuum regulator, which is mounted directly onto the ton container.\n\nThe City of Henderson uses operating procedures developed to ensure that the ton containers are not dropped, improperly installed, or otherwise damaged, during unloading and loading, handling, storage, and use at the SWTP. These procedures are reviewed and revised as needed to reflect the system configuration, as well as to incorporate improvements or changes in industry and safety codes and standards.\n\nTrained personnel are used in the maintenance of the chlorine system components such as the vacuum regulators.  Maintenance procedures are reviewed and revised as needed to comply with industry and safety codes and standards.\n\nThe SWTP is equipped with chlorine gas detectors and audible alarms within the vicinity of the chlorine system components.  This alarm system will assist in alerting facility personnel in identifying and responding to a release of chlorine.\n\nThe City of Henderson conducts periodic hazard reviews and compliance audits in accordance with the RMP Rule.\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nThe City of Henderson SWTP has had no accidents or releases in the past five years.\n\n\nEMERGENCY RESPONSE PROGRAM \n\nThe City of Henderson SWTP is included in the community emergency response plan developed under 42 U.S.C. 11003. Appropriate mechanisms are in place to notify emergency responders when there is a need for response.\n\n\nPLANNED CHANGES TO IMPROV"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46869,
      "SummaryText": "E SAFETY\n\nThere are no changes planned at this facility at this time."
    }
  ]
}