{
  "FacilityID": 46947,
  "FacilityName": "Recycling Plant",
  "FacilityStr1": "5650 York Street",
  "FacilityStr2": null,
  "FacilityCity": "Commerce City",
  "FacilityState": "CO",
  "FacilityZipCode": "80022",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08001",
  "LEPC": "Adams County",
  "FacilityLatDecDegs": "39.799250",
  "FacilityLongDecDegs": "-104.959222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.denverwater.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Denver Water",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Denver Water",
  "OperatorStr1": "1600 West 12th Ave",
  "OperatorStr2": null,
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80204",
  "OperatorZipCodeExt": null,
  "FTE": 21,
  "OtherEPAFacilityID": "COD982581191",
  "EPAFacilityID": "100000183552",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2006-11-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-02-08 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2006-01-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2008-08-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 39.799952,
  "FRS_Long": -104.957244,
  "FRS_Description": "LOADING FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C06",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 67940,
      "AltID": "Water Disinfection",
      "FacilityID": 46947,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 89923,
          "ProcessID": 67940,
          "ChemicalID": 62,
          "Quantity": 48000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 69545,
          "ProcessID": 67940,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 25034,
              "Process_NAICS_ID": 69545,
              "SafetyReviewDate": "2003-07-18 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "Chlorine Institute",
              "FR_Comments": null,
              "HazardReviewDate": "2002-11-06 00:00:00",
              "ChangeCompletionDate": "2003-07-18 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Flow meter, Vacuum regulating check unit, video survellance",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-07-18 00:00:00",
              "TrainingReviewDate": "2003-07-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Classroom",
              "MaintenanceReviewDate": "2003-07-18 00:00:00",
              "EquipmentInspectionDate": "2004-02-18 00:00:00",
              "EquipmentTested": "The entire chlorine system will be inspected during start up of the plant which is scheduled for 2/18/2004",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 26186,
                  "PreventionProgram2ID": 25034,
                  "ProcessChemicalID": 89923
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 46947,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-07-18 00:00:00",
    "ERTrainingDate": "2003-07-18 00:00:00",
    "CoordinatingAgencyName": "South Adams County Fire Department",
    "CoordinatingAgencyPhone": "3032880835",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46947,
      "SummaryText": "This executive summary provides a brief overview of the Risk Management Program (RMP) and the associated policies at the Recycling Plant, one of several facilities owned and operated by Denver Water.\n\nPrevention and Response Policies\n\nDenver Water believes that it is important to provide a safe workplace to its employees and minimize the impact of its operations on the surrounding community and the environment.  Accordingly, Denver Water has developed proactive safety and environmental programs, which are reliant upon active employee participation and management leadership and support.  This same proactive philosophy was employed in the development and implementation of the Recycling Plant RMP for the chlorine system.  Correspondingly, Denver Water has determined to comply with the RMP Program 3 requirements as a conservative approach to mitigate any potential off-site consequences from the operation of the Recycling Plant, although it is eligible for the less comprehensive requirements of Program 2.  By doing so, Denver Water affirms its proactive safety and environmental philosophy and acknowledges the inherent value of full RMP compliance.\n\nThe facility also uses aqueous ammonia in its operations, but the maximum inventory is less than the threshold quantity for ammonia.  Therefore, the aqueous ammonia process is not directly regulated under the EPA RMP rule, but is covered under the EPA General Duty Clause.  In consistency with the Denver Water philosophy, the Recycling Plant has covered this system under its RMP.\n\nThe RMP prevention program is arguably the most important element of the rule.  Its program elements require the active participation of facility employees and management in conducting activities aimed at preventing accidental releases of regulated chemicals.  If prevention activities could be completely successful, there would be no need for emergency response activities, since no releases would occur.  Accordingly, a well-developed and properly-impl"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46947,
      "SummaryText": "emented prevention program will lower the possibility of an accidental release and minimize the consequences of a release should one occur.\n\nDenver Water takes an active role in preventing accidental releases at all of its facilities by ensuring that its employees are well-informed regarding the hazards associated with the regulated processes (e.g., chlorine at the Recycling Plant) and actively participated in comprehensive process hazard analyses.  The system employees are properly trained in the safe operation of the covered process and the safe handling of treatment chemicals.  They are aided in this work by complete, understandable system operating procedures.\n\nDenver Water management understands its duty to provide a safe working environment and to take measures to prevent accidents that may have an effect on the surrounding community.  This understanding is reflected in procedures described and referenced in the Recycling Plant RMP procedures and policies.\n\nAs for emergency response, Denver Water has established procedures for emergency response and notification when necessary.  Recycling Plant employees are responsible for providing initial response to a release of chlorine or aqueous ammonia.  Releases contained within the plant facilities will be remedied by Recycling Plant personnel and equipment, in accordance with OSHA¿s Hazardous Waste Operations and Emergency Response (HAZWOPER) Standard (29 CFR 1910.120).  Releases affecting (or with the potential to affect) areas outside the facility will require outside assistance, and local emergency response entities will be solicited for emergency response support.\n\nStationary Source and Regulated Substances\n\nThe Recycling Plant is located at 5650 York Street in Commerce City, Colorado.  This is a new facility, and the chlorine system was originally installed in 2003 with operations to commence in February 2004.\n\nThe facility provides recycled water for non-potable use.  Facility influent consists of flows from e"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46947,
      "SummaryText": "ither, or both, of the treatment trains at the Metro Wastewater Plant. The recycling plant effluent is for industrial customers and irrigation, and will meet all Colorado standards for reclaimed domestic wastewater.  The facility has a dedicated pumping system to Xcel Energy and a main line to all other customers.\n\nBiological nitrification, followed by conventional water treatment technologies to remove phosphorus, solids, and pathogens (chemical treatment, flocculation, sedimentation, and filtration) are used at this location.  The water is further treated by the addition of chlorine, aqueous ammonia, and sodium hydroxide.  The chlorine (Cl2) and aqueous ammonia (NH4OH) are stored in the east side of Chemical Building.\n\nThe maximum intended inventory of chlorine at the Recycling Plant will be 48,000 pounds (24 one-ton containers).  Therefore, the Recycling Plant is regulated under the RMP rule due to the volume of chlorine stored and used at the facility.\n\nRelease Scenarios\n\nWorst-case and alternative release scenarios have been determined after careful review of the regulation and consideration of the storage vessel configuration at the facility.  For the worst-case release scenario, the regulation is clear.  The assumption is that a full one-ton container of chlorine is released over a ten-minute period.  No active mitigation may be considered.  Therefore, the scrubber is assumed not to work in this scenario.  Worst-case meteorological conditions as specified in the RMP regulation are also assumed to be present.  The release is also to occur outdoors.\n\nFor the alternative release scenario, the facility reviewed the consequences of a break at the 5/8 inch tank valve, causing a leak inside the chlorine storage area.  The vapor in the chlorine storage area will be vented through the scrubber, which is an active mitigation system.  The scrubber is expected to remove 99% of the chlorine vapor that is released.  Based on this scenario, the alternative release scenario"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 46947,
      "SummaryText": "will be a maximum of 2 pounds per minute, and will last for ten minutes.\n\nResults of the off-site consequence analyses are described in Sections 2 and 3 of the RMP*Submit plan for the Recycling Plant.\n\nPrevention Steps for Chlorine\n\nThe prevention program and chemical-specific prevention steps are described in detail in the Recycling Plant RMP manual.  The prevention program includes the following elements:\n¿\tProcess safety information, which includes information pertaining to the hazards of chlorine in the process, process technology, and process equipment\n¿\tProcess hazard analysis (PHA), which includes a systematic evaluation (by an employee team) of the hazards of the chlorine process, identification of previous process incidents at other water treatment plants, engineering and administrative controls, consequences of failure of the engineering and administrative controls, facility siting, human factors, and possible safety and health effects of failure of controls\n¿\tOperating procedures, which include steps for each operating phase, operating limits, safety and health considerations, and safety systems and their functions\n¿\tTraining for each Recycling Plant employee involved in operating the chlorine system\n¿\tMechanical integrity procedures to maintain the on-going integrity of the chlorine process equipment.  The Recycle Plants chlorine system is a new system and new treatment plant.  The installed equipment was not inspected during the development of the RMP program however, Denver water plans to inspect all equipment related to the chlorine system during start up which is scheduled for January 2004.\n¿\tManagement of change procedures to manage changes (other than ¿replacements in kind¿) to the chlorine system\n¿\tPre-startup safety review for initial system start-up, additions, or significant modifications to the chlorine process, or any new regulated chemical process\n¿\tCompliance audits at least every three years from 2004 to evaluate Recycling Plant RMP compli"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 46947,
      "SummaryText": "ance\n¿\tIncident investigation, to be conducted and documented for each incident that results in, or could reasonably result in, a catastrophic release of chlorine from the Recycling Plant\n¿\tEmployee participation in the development and implementation of the Recycling Plant RMP, and employee access to RMP information\n¿\tHot work prohibition policy on or near the chlorine system when chlorine is present in the affected sections of the process\n¿\tContractor safety management program, to ensure appropriate evaluation and selection of qualified contractors for work on or near the chlorine system, proper notification of contractors regarding known chlorine system hazards and the Recycling Plant emergency response plan, limited access to the chlorine process, and evaluation of contractor performance\n\nIn addition to these elements, the chlorine storage room at the Recycling Plant is equipped with a chlorine scrubber, which will evacuate chlorine-laden air from the chlorine storage and feed areas, reducing the concentration of chlorine gas to safe levels prior to discharge to the atmosphere.  The four-stage scrubber will pull vapors out of both the chlorine storage and feed rooms.  An exhaust fan pulls air into the scrubber and into a multistage chamber, exposing it to caustic spray and a mist eliminator prior to discharge to the exhaust stack.  The scrubber has an exhaust detector to monitor the chlorine concentration in the discharge stack. Dampers allow for makeup air to enter the chlorine storage and feed rooms, replacing air that is pulled through the scrubber.  The scrubber¿s discharge stack is curved downward at its exhaust point to prevent water from getting in.  The end of this vent stack is 6 feet above the roofline.   Overall scrubber removal efficiency is 99+%, with an estimated chlorine concentration < 5 ppm going out the stack.  The scrubber will pull 3000 cfm from the chlorine storage room, and 500 cfm from the chlorine feed room.\n\nThe chlorine storage room has"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 46947,
      "SummaryText": "two leak detectors.  There are also two leak detectors in the chlorine injector/feed room. An alarm of 4 ppm or greater at any of these four leak detectors will activate the scrubber.  They will also trigger red, flashing alarm beacons, audible alarms (local and over the plant intercom system), and control room alarms to warn other personnel.  Leak detectors will be calibrated for a range of 0-30 ppm, with digital chlorine level readout locally, outside of the room, and in the control room.  The system also closes seven of the eight emergency shutoff valves on the on-line group of ton containers, and closes all emergency shutoff valves on the remaining two off-line groups of ton containers.\nIn addition to the four chlorine leak detectors in the Chemical Building, there are also two chlorine leak detectors in the Distribution Pump Station.  These two detectors will alert plant staff of a break in the chlorine solution lines in that building only, and are not tied to scrubber controls.\n\nThe chlorine scrubber will be maintained and tested on a regular basis to ensure proper operation during a chlorine release event.\n\nThese same prevention program elements are also implemented for the aqueous ammonia system.  The aqueous ammonia storage tanks at the Recycling Plant are also equipped with an ammonia scrubber, and will scrub out ammonia-laden air from the truck delivery vent line/tank vents.  (The scrubber is isolated from the truck delivery vent line/tank vent during delivery to extend its life; vapors go back to the delivery truck during the off-loading process.)  The scrubbing system is a passive desiccant ammonia scrubber containing disposable activated carbon for the capture of ammonia vapors.  The ammonia scrubber will be maintained and tested on a regular basis to ensure proper operation during an ammonia release event.\n\nAccident History\n\nSince this is a new facility, there have been no releases of hazardous air pollutants from the Recycling Plant with off-site con"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 46947,
      "SummaryText": "sequences during the past five years.  Both the chlorine and aqueous ammonia systems were installed in 2003, with construction completed in February 2004.  These new systems incorporate up-to-date safety measures to help prevent releases.\n\nEmergency Response Program\n\nDenver Water has established procedures for emergency response and notification when necessary.  Recycling Plant employees are responsible for providing initial response to a release of chlorine or aqueous ammonia.  Releases contained within the plant facilities will be remedied by Recycling Plant personnel and equipment, in accordance with OSHA¿s Hazardous Waste Operations and Emergency Response (HAZWOPER) Standard (29 CFR 1910.120).  Releases affecting (or with the potential to affect) areas outside the facility will require outside assistance, and local emergency response entities (West Adams Fire Department and Hazardous Materials Response Team) will be solicited for emergency response support.\n\nPlanned Changes for Improved Safety\n\nIdeas for changes to improve will be actively sought from employees.  Employee meetings that focus on safety issues will be held regularly at the Recycling Plant.  Employees will be encouraged and trained to recognize hazards and to present ides to eliminate them or to minimize the potential consequences of those hazards.\n\nAs part of the development of the Recycling Plant RMP program, process hazard analyses were conducted with key employees to meet the prevention program requirements.  During these sessions, recommendations were made for the purpose of improving safety and preventing accidental chemical releases.  Each recommendation has been considered for implementation.  Though not all recommendations may be implemented, all have been considered.  The exercise and HAZWOPER training have provided affected employees with a heightened awareness of safety issues related to the covered processes."
    }
  ]
}