{
  "FacilityID": 46965,
  "FacilityName": "Green Valley Packers, LLC",
  "FacilityStr1": "14332 Di Giorgio Road",
  "FacilityStr2": null,
  "FacilityCity": "Arvin",
  "FacilityState": "CA",
  "FacilityZipCode": "93203",
  "Facility4DigitZipExt": "9519",
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.254230",
  "FacilityLongDecDegs": "-118.845570",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "OT",
  "FacilityURL": "www.greenvalleypackers.com",
  "FacilityEmailAddress": "support@greenvalleypackers.com",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Green Valley Packers, LLC",
  "OperatorStr1": "14332 Di Giorgio Road",
  "OperatorStr2": null,
  "OperatorCity": "Arvin",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93203",
  "OperatorZipCodeExt": "9519",
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000196913",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-01-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": "Cold Storage",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2006-11-06 00:00:00",
  "ErrorReportDate": "2006-11-06 00:00:00",
  "ReceiptDate": "2006-11-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2006-11-06 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": "2011-10-20 00:00:00",
  "DeRegistrationEffectiveDate": "2008-09-05 00:00:00",
  "AnniversaryDate": "2011-09-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 35.25268,
  "FRS_Long": -118.844638,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C03",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 67960,
      "AltID": "cold storage",
      "FacilityID": 46965,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 89943,
          "ProcessID": 67960,
          "ChemicalID": 56,
          "Quantity": 5310.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 69565,
          "ProcessID": 67960,
          "NAICSCode": "11511",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 25042,
              "Process_NAICS_ID": 69565,
              "SafetyReviewDate": "2006-08-30 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "Yes",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2006-08-30 00:00:00",
              "ChangeCompletionDate": "2006-12-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Computer control system sends a page to operators upon activation",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Expand scope of written operating procedures",
              "OpProceduresReviewDate": "2006-08-30 00:00:00",
              "TrainingReviewDate": "2006-08-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2006-08-30 00:00:00",
              "EquipmentInspectionDate": "2006-02-28 00:00:00",
              "EquipmentTested": "Annual safety inspection of entire system performed by Hal Crumley Refrigeration",
              "ComplianceAuditDate": "2006-08-30 00:00:00",
              "AuditCompletionDate": "2006-12-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2006-08-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 26194,
                  "PreventionProgram2ID": 25042,
                  "ProcessChemicalID": 89943
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 46965,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2006-08-30 00:00:00",
    "ERTrainingDate": "2006-06-27 00:00:00",
    "CoordinatingAgencyName": "Kern County Environmental Health",
    "CoordinatingAgencyPhone": "6618628700",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 46965,
      "SummaryText": "1.    Executive Summary\r\nGreen Valley Packers, LLC is committed to employee, public and environmental safety.  This commitment is demonstrated by its accidental release prevention program that includes management practices in areas such as operating procedures, equipment maintenance, hazard analysis and employee training associated with the processes at our facility. \r\nIt is the policy of Green Valley Packers, LLC to implement appropriate controls to prevent to the greatest extent possible releases of regulated substances.\r\n\r\n2.    Regulated Substances\r\nThe only regulated substance held at this facility is anhydrous ammonia.\r\n \r\n3.    Worst-Case and Alternative Scenarios\r\nTo perform the required offsite consequence analysis, the EPA's RMP *Comp¿ and 2000 US Census data per LandView 5 were used.  The following paragraphs provide details of the chosen scenarios.\r\n\r\nWorst-Case Scenario\r\nOur worst-case scenario involves the catastrophic rupture of our primary receiver tank, losing 5310 pounds of anhydrous ammonia at 292 pounds-per-minute over a ten-minute span.  The toxic endpoint of 0.14mg/l encompasses 1.0 miles, which contains a total population of 442 persons.\r\n--------Assumptions About This Scenario---------\r\nWind Speed: 3 meters/second (6.7 miles/hour)\r\nStability Class: D\r\nAir Temperature: 77 degrees F (25 degrees C)\r\n\r\nAlternative On-Site Scenario #1\r\nIn this scenario, a valve restricting gaseous ammonia is presumed to have broken at a release rate of 50 pounds-per-minute over a 30 minute period for a total release of 1500 pounds of anhydrous ammonia.  The toxic endpoint of 0.14 mg/l is less than one-tenth of a mile, creating no off-site consequences.\r\n--------Assumptions About This Scenario---------\r\nWind Speed: 3 meters/second (6.7 miles/hour)\r\nStability Class: D\r\nAir Temperature: 77 degrees F (25 degrees C)\r\n\r\nAlternative On-Site Scenario #2\r\nIn this scenario, a pipe containing gaseous ammonia is presumed to have broken at a release rate of 100 pounds-per-min"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 46965,
      "SummaryText": "ute over a 30 minute period for a total release of 3000 pounds of anhydrous ammonia.  The toxic endpoint of 0.14 mg/l is two-tenths of a mile, creating no off-site consequences.\r\n--------Assumptions About This Scenario---------\r\nWind Speed: 3 meters/second (6.7 miles/hour)\r\nStability Class: D\r\nAir Temperature: 77 degrees F (25 degrees C)\r\n\r\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps:\r\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\r\n\r\nProcess Safety Information:\r\nGreen Valley Packers, LLC maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\r\n\r\nProcess Hazard Analysis:\r\nOur facility has conducted a comprehensive study to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out this analysis is ¿What If¿ scenarios.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of every three years.  Any findings related to the hazard analysis are addressed in a timely manner.\r\n\r\nOperating Procedures:\r\nFor the purposes of safely conducting activities within our covered processes, Green Valley Packers, LLC maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 46965,
      "SummaryText": "he processes.\r\n\r\nTraining:\r\nGreen Valley Packers, LLC has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every year and more frequently as needed.  Documentation of this training is kept in our main business office.\r\n\r\nMechanical Integrity:\r\nGreen Valley Packers, LLC carries out maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\r\n\r\nManagement of Change:\r\nWritten procedures are in place at Green Valley Packers, LLC to manage changes in process chemicals, technology, equipment and procedures.  The most recent review/revision of maintenance procedures was performed on August 30, 2006.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\r\n\r\nPre-startup Reviews:\r\nThis facility was online long before regulations requiring PSSRs were established. However, the most recent safety review was performed on August 30, 2006.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\r\n\r\nCompliance Audits:\r\nGreen Valley Packers, LLC conduct audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 46965,
      "SummaryText": "most recent compliance audit was conducted on August 30, 2006.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\r\n\r\nIncident Investigation:\r\nGreen Valley Packers, LLC will promptly investigate any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\r\n\r\nEmployee Participation:\r\nGreen Valley Packers, LLC truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\r\n\r\nContractors:\r\nOur company hires contractors to conduct specialized maintenance at our facility.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Green Valley Packers, LLC has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\r\n\r\n\r\n5.    Five-year Accident History:\r\nGreen Valley Packers, LLC has an excellent record of preventing accidental releases.  Due to our stringent release prevention policies, we have never had an accidental release.\r\n\r\n\r\n6.    Emergency Response Plan:\r\nGreen Valley Packers, LLC carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan in"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 46965,
      "SummaryText": "cludes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\r\n\r\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\r\n\r\n7.    Planned Changes to Improve Safety:\r\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Periodic safety inspections and ongoing employee training are some of the major steps we want to take to continue to operate a safe facility.  These changes are expected to be implemented by December First, 2006."
    }
  ]
}