{
  "FacilityID": 4703,
  "FacilityName": "Cool Valley Facility",
  "FacilityStr1": "30597 Miller Road",
  "FacilityStr2": null,
  "FacilityCity": "Valley Center",
  "FacilityState": "CA",
  "FacilityZipCode": "92082",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06073",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.255278",
  "FacilityLongDecDegs": "-117.009722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "vcmwd.org",
  "FacilityEmailAddress": "vcmwd.org",
  "FacilityDUNS": 43656594,
  "ParentCompanyName": "Valley Center Municipal Water District",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Valley Center Municipal Water Dist.",
  "OperatorStr1": "P.O. Box 67",
  "OperatorStr2": null,
  "OperatorCity": "Valley Center",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92082",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000059198",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-01 00:00:00",
  "SafetyInspectionBy": "Insurance Agency (JPIA)",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2001-02-09 00:00:00",
  "DeRegistrationEffectiveDate": "2001-02-01 00:00:00",
  "AnniversaryDate": "2004-06-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.256066,
  "FRS_Long": -117.008255,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5472,
      "AltID": "Water Treatment Facility",
      "FacilityID": 4703,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 5878,
          "ProcessID": 5472,
          "ChemicalID": 62,
          "Quantity": 17000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5585,
          "ProcessID": 5472,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2218,
              "Process_NAICS_ID": 5585,
              "SafetyReviewDate": "1999-04-20 00:00:00",
              "PHA_Date": "1999-03-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-06-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Addition of operation procedures",
              "OpProceduresReviewDate": "1999-04-20 00:00:00",
              "TrainingReviewDate": "1999-05-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-20 00:00:00",
              "EquipmentInspectionDate": "1999-06-07 00:00:00",
              "EquipmentTested": "ton containers, check piping for leaks",
              "ChangeMgmtDate": "1999-03-30 00:00:00",
              "ChangeMgmtReviewDate": "1999-02-18 00:00:00",
              "PreStartupReviewDate": "1999-03-30 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-01-29 00:00:00",
              "HotWorkPermitReviewDate": "1999-01-29 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-01-29 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2474,
                  "PreventionProgram3ID": 2218,
                  "ProcessChemicalID": 5878
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4703,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-14 00:00:00",
    "ERTrainingDate": "1998-11-12 00:00:00",
    "CoordinatingAgencyName": "San Diego County DEH, HMMD",
    "CoordinatingAgencyPhone": "6193382372",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 4703,
      "SummaryText": "acility is an unmanned site.  Operators visit the site to perform maintenance, chlorine delivery, and routine checks of the system.  No employees are present at the site other than an operator.  Operators are trained to go upwind of the facility if a release were to occur.\n\n\nHAZARD ASSESSMENT SUMMARY\n\nWorst Case Release Result Summary\nScenario Description: Release of the maximum quantity of chlorine that can be on-line in the chlorine storage area - 4,000 pounds in 10 minutes.  Because the ton containers are stored within a building, passive mitigation measures were taken into account.  The total release rate is 400 pounds per minute.  However, with passive mitigation measures, the release rate to the atmosphere is 220 pounds per minute.  This release rate was used to determine the endpoint distance.  The most pessimistic meteorological conditions were used: 1.5 meters/second wind speed, and F stability for a rural topography.  The distance to the toxic endpoint of 3 ppm was based on the EPA's RMP Guidance for Wastewater Treatment Plants, Exhibit 4-4.  This scenario reaches offsite and may affect population receptors.  No environmental receptors were affected by this potential release.\n\nAlternative Release Result Summary\nScenario Description: A release of chlorine gas from a 1/4 inch diameter leak.  The release rate of chlorine due to the pressure of the tank is 3.4 pounds per minute.  Passive mitigation measures were incorporated because the process is inside the building and the release rate to the atmosphere was calculated as 2 pounds per minute.  The meteorological conditions used were 3 meters per second wind speed, and D stability for a rural topography.  The distance to the toxic endpoint of 3 ppm was based on the EPA's RMP Guidance for Wastewater Treatment Plants, Exhibit 4-12.  This scenario reaches offsite and may affect population receptors.  No environmental receptors were affected by this potential release.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CH"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4703,
      "SummaryText": "EMICAL-SPECIFIC PREVENTION STEPS\n\nThe chorine system at the Cool Valley facility was designed and constructed in accordance with all applicable federal, state, and local regulations including the Uniform Mechanical Code, Uniform Building Code, and the Uniform Fire Code.  All of these codes serve to reduce the risk within the facility by specifying acceptable design criteria for the chorine system.  In addition, the facility was designed in accordance with industry standards and with generally accepted engineering practices.\n\nValley Center MWD has established a mechanical integrity program for maintaining and operating the chlorine equipment and uses the Chlorine Manual from the Chlorine Institute as a basis. \n\nA chlorine detector located in the storage area activates an audible/visual alarm outside of the building if the concentration of 1 ppm is detected.  An alarm is also sent to the main control room at the Valley Center Municipal Water District's administration building.  Operators at the district are also the trained responders in case a release were to occur in order to mitigate the release.\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nThe five year accident history investigation for the last five years (June 1994) reveled that there were no releases of chlorine or near misses.     \n\n\nEMERGENCY RESPONSE PROGRAM\n\nThe Valley Center MWD has an extensive emergency response plan detailed in Volume I of the Risk Management Program and the Valley Center Municipal Water District Emergency Plan document which is kept on file at the administration building.  This document includes a description of the Incident Command System (ICS), the Incident Commander and list of alternates, organizations that must be immediately notified, employee procedures, forms, and list of safety equipment.\n\nThe Director of Operations or his designated replacement will establish the ICS to serve as a centralized point for communication and to execute responsibilities.  Its focus is to bring together in on"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 4703,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Valley Center MWD has an emergency response plan in effect.  The emergency response plan (Plan) is detailed in the Emergency Response Program section of the RMP document.  This plan was designed to meet the following objectives:\n\n1.)To save lives.\n2.)To minimize and avoid injuries.\n3.)To protect the environment.\n4.)To minimize property damage.\n\nValley Center MWD maintains a safety committee.  Members are the designated emergency coordinators/responders for the facility.  Operators who are the responders to the facility receive hazardous materials training (HAZWOPER First Responder - Technician & Operation Levels).  The Plan provides the response organization and notification procedures, chlorine health hazards, and mitigation procedures which was implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year to ensure compliance with the PSM and RMP regulations, and to ensure that the plan is kept current.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe chlorine system at Valley Center MWD is used for the treatment of water from the Cool Valley Reservoir as potable water.  Chlorine is stored in one ton containers (6) and 150 pound cylinders (30) in the chlorine storage room.  Two ton containers are maintained on-line.  Chlorine gas leaves the one ton containers to a pressure regulator and to one of two chlorinators (2).  From the internal vacuum regulator in each chlorinator, it is drawn to injectors (2) and mixed with water from the reservoir.  Although the containers are kept on-line, they are isolated at the container valve and no chlorine gas is being utilized.  Chlorine is stored at the site, in case chlorination is needed to disinfect reservoir water.  Typically, this facility is operational during summer months.\n\nThe maximum quantity of chlorine that can be stored on site is 16,500 pounds.\n\nThe Cool Valley f"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4703,
      "SummaryText": "e location those people and resources necessary to safely and systematically evaluate, communicate, and direct all emergency operations.\n\nThe Cool Valley facility is an unmanned location.  Operators visit the site daily when the chlorine system is in use.  Otherwise, the site is secured and left vacant.  In the case of a chlorine release, a chlorine sensor will activate audible and visual alarms at a set concentration level of 1 ppm.  The alarm has telemetry to the main control room at Valley Center MWD and will alert the on-duty operator.  The operators at Valley Center MWD are the emergency responders for the chlorine sites.  No employee other than an operator (responder) from Valley Center MWD would be present at the facility.  Therefore, no evacuation procedures are necessary.  Operators are trained to evacuate the building if there is a major chlorine release and proceed upwind from the hazard in order to call for backup.  Contractors, if used, are notified to evacuate in the same manner.  Outside assistance (San Diego HazMat) will be called if Valley Center MWD does not have four responders present.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazard Analysis provided the mitigation measures outlined below to improve safety at the Valley Center MWD Cool Valley facility located at 30597 Miller Road in the city of Valley Center, California. The following recommendations were made as a result of this Program and plan to be addressed by June 2000:\n\nConsider notifying neighbors that chlorine is present at the Cool Valley site and the action to take if there is a release.\n\nInvestigate the amount of chlorine that would be released if there was a break in the line from the one ton container to the vacuum regulator.  Valley Center MWD would like to note that this recommendation has been complete due the Hazard Assessment within the RMP document.\n\nInclude a procedure to close the container valves if a grass fire was spotted in the area.\n\nInclude in the Mechanical In"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4703,
      "SummaryText": "tegrity program that an operator visually checks for corrosion annually and that this inspection is documented.  Valley Center MWD would like to note that this recommendation has been complete.\n\nConsider adding a battery backup to the chlorine detector in case of a power failure.\n\nInclude in the operating procedures that operators periodically check the site in case the chlorine detector is not working.\n\nInclude in the Mechanical Integrity program to include that chlorinators are rebuilt annually.  Valley Center MWD would like to note that this recommendation has been complete.\n\nConsider purchasing 10 minute escape masks for operators to have readily available on site in case of a leak during change-outs.\n\nInclude a training program so that all district employees that might be present at the chlorine site understand the correct action to take if there was a chlorine release.\n\nConsider installing another sensor in the chlorinator room that will activate an alarm that is separate from the tank room.\n\nMaintain a copy of the manifest or purchase order from each chlorine delivery.\n\nTrain operators in properly using the hoist for moving ton containers and document that the operator has been trained in the procedure.\n\nInclude in the Operating Procedures that protective gear must be worn for starting a system that has been shut down for a prolonged period of time.  Valley Center MWD would like to note that this recommendation has been complete.\n\nEnsure that procedures for startup and shut down are written in the operating procedure section.  Provide necessary precautions.  Valley Center MWD would like to note that this recommendation has been complete.\n\nProvide annual training for operators if there was a prolonged shutdown of the chlorine system and document that this training was given.\n\nInclude in the mechanical integrity program to annually check dates of the ton containers.  Valley Center MWD would like to note that this recommendation has been complete.\n\nConsider disc"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 4703,
      "SummaryText": "onnecting one ton containers from the manifold if they are planned to be out of service for a long period of time.\n\nInclude in the Mechanical Integrity program to rebuild diaphragm on the chlorinator if the equipment is out of service for a prolonged period of time.  Valley Center MWD would like to note that this recommendation has been complete.\n\nConsider installing appropriate signage (chlorine diamonds) on the gate entrance and on the entry door.\n\nConsider installing a wind sock that is visible from all angles of the building to alert responders/operators of the direction a  chlorine release will be moving.\n\nDevelop initial training for new operators certification forms to Grandfather supervisors and existing operators.\n\nInclude in the operating procedures for an operator to place cones around the supplier's truck during deliveries.  Valley Center MWD would like to note that this recommendation has been complete."
    }
  ]
}