{
  "FacilityID": 47042,
  "FacilityName": "East Rio Hondo Water Supply Corporation",
  "FacilityStr1": "26108 Nelson Road",
  "FacilityStr2": null,
  "FacilityCity": "San Benito",
  "FacilityState": "TX",
  "FacilityZipCode": "78586",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48061",
  "LEPC": "Cameron County LEPC",
  "FacilityLatDecDegs": "26.180000",
  "FacilityLongDecDegs": "-097.565833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "NA",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 96386610,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "East Rio Hondo Water Supply Corp.",
  "OperatorStr1": "P.O Box 621",
  "OperatorStr2": "206 Industrial Parkway",
  "OperatorCity": "Rio Hondo",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78583",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brian Macmanus",
  "RMPTitle": "Director of Water & Wastewater",
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000185195",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-01-23 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-11-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-11-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-11-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-03-01 00:00:00",
  "DeRegistrationEffectiveDate": "2011-02-21 00:00:00",
  "AnniversaryDate": "2011-11-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 68092,
      "AltID": "Chlorine",
      "FacilityID": 47042,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 69702,
          "ProcessID": 68092,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 90119,
          "ProcessID": 68092,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 590119,
          "ProcessID": 68092,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 47042,
      "SummaryText": " A.  The East Rio Hondo Water Supply Corporation (ERHWSC) Accidental release prevention policy involves a unified approach that intergrates technologies, procedures, and management practices.  All applicable procedures of the U.S. Environmental Protection Agency (EPA) Prevention Program are adhered to.  The ERHWSC emergency response policy involves the preparation of response plans that are tailored to the facility and to emergency response services available to the rural community, and is in compliance with the EPA Emergency Response Program  requirements.\n\n B.  The ERHWSC plant was installed to coagulate,settle,filter,and chlorinate water for use by its customers.  The facility is located at 26108 Nelson Road, San Benito, Texas. The Plant utilizes a chlorinating station, various safety equipment, an instrument room containing flow recorders, various electrical panels and additional safety equipment. The amount of chlorine on site is five one-ton containers with three on-line and two standbys.  Water treatment operators are at the facility 24 hours per day and 7 days a week and respond to any trouble alarms that may occur.\n\n C. The off-site consequence analysis includes consideration of two release scenarios, identified as\" worst- case release\" and \"alternative release scenario\".  The first scenario follows EPA guidelines which states, \"The owner or operator shall assume that the maximum quantity in the largest vessel is released as a gas over 10 minutes\" due to unspecified failure.  The alternative release scenario is defined as \"more likely to occur\" than the worst-case release scenario.\n\nAtmospheric dispersion modeling has to be performed to determine the distance traveled by the chlorine release before its concentration decreases to the \"toxic endpoint\" selected by EPA at .0087mg/L, which is the Emergency Response Planning Guideline Level 2 (ERPG-2).  This defined by the American Industrial Hygiene Association (AIHA) as \"the maximum airborne concentration below"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 47042,
      "SummaryText": " which it is believed that all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\"  The residential population within a circle with a radius corresponding to the endpoint distance has to be defined as \"to estimate the population potentially affected\".\n\nThe worst-case release scenario at the East Rio Hondo Water Supply Corporation facility involves a failed valve or actual body of the one ton container.  The off-site consequence analysis for these scenarios was performed.  The pre-defined conditions set by EPA , namely the release of the entire amount as a gas in 10 minutes, use of the one-hour average ERPG-2 as the toxic endpoint, and consideration of the population residing within a full circle with radius corresponding to the toxic endpoint distance.\n\nEPA - mandated meteorological conditions, namely Stability F, wind speed 1.5 m/sec, air temperature (77F), and average humidity (50%) were used.\n\nWhen atmospheric dispersion modeling for the worst-case scenario as performed using the EPA RMP*Comp, a distance to toxic endpoint of 3.0 miles and an estimate of residential population of 3287 was obtained.\n\nThe alternative release scenario involves the rupture of the regulator connected to the one-ton container due to clogged vent holes or separation of vaccum regulator from the chlorine ton container valve stem.  The atmospheric dispersion modeling for the alternative release scenerio, as performed using the EPA RMP*Comp, yields a dispersion radius of 0.6 miles.   The amount of chlorine released is 2000 lbs.  At an average rate over 12.9 minutes (the duration of the release) at 155 lbs/min to the toxic endpoint distance of the ERPG-2 Level.\n\nD.  The general ERHWSC accidental release prevention program is based on the following key elements:\n         - High level of training of the operators\n         - Preventive ma"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 47042,
      "SummaryText": "intenance program\n         - Use of state-of-the-art process and safety equipment\n         - Use accurate and effective operating procedures\n         - Performance of hazard review of equipment and procedures\n         - Implementation of an chemical audit and inspection program\n\nChemical - specific prevention steps include availability of combined breathing apparatus (CBA), worn by the operators during connection/disconnection of chlorine supply, awareness of the hazardous and toxic properties of chlorine, and the presence of chlorine detectors.\n\nE.  No accidental releases of chlorine have occurred at this facility in the past five years.\n\nF.  The facility has emergency Response Plan that has been reviewed by the Rio Hondo Vol. Fire Department. This program includes an emergency response decision tree and notification plan.  Emergency response drills and drill evaluation will be conducted every two years; emergency operation and response procedures will be reviewed at that time.\n\nG. Changes to improve safety (recommended actions) will be reviewed upon completion of a facility Hazard Assessment and Compliance Audit on an annual basis."
    }
  ]
}