{
  "FacilityID": 47273,
  "FacilityName": "Highway 14 Wastewater Treatment Plant",
  "FacilityStr1": "800 Sucrose Drive",
  "FacilityStr2": null,
  "FacilityCity": "New Iberia",
  "FacilityState": "LA",
  "FacilityZipCode": "70560",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22045",
  "LEPC": "Iberia Parish LEPC",
  "FacilityLatDecDegs": "29.991639",
  "FacilityLongDecDegs": "-091.846972",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of New Iberia",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of New Iberia",
  "OperatorStr1": "800 Sucrose Drive",
  "OperatorStr2": null,
  "OperatorCity": "New Iberia",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70560",
  "OperatorZipCodeExt": null,
  "RMPContact": "Vincent S.Palumbo II, PE",
  "RMPTitle": "Director - Wastewater Department",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000197752",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2006-12-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-12-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2006-12-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-12-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 68420,
      "AltID": "Chlorine Storage & Usage",
      "FacilityID": 47273,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 70039,
          "ProcessID": 68420,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 90540,
          "ProcessID": 68420,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 590540,
          "ProcessID": 68420,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 68421,
      "AltID": "SO2 Storage & Usage",
      "FacilityID": 47273,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 70040,
          "ProcessID": 68421,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 90541,
          "ProcessID": 68421,
          "ChemicalID": 49,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 590541,
          "ProcessID": 68421,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 47273,
      "SummaryText": "EPA ID Number             .  The Risk Management Plan has been developed for The City of New Iberia's Highway 14 Wastewater Treatment Plant in accordance with 40 CFR part 68.  This facility is subject to the requirements of this program due to the usage and storage of chlorine in an amount greater than 2,500 lbs. and sulfur dioxide in an amount greater than 5,000 lbs.\n\nThe facility is located within the city limits of New Iberia, LA at the end of Sucrose Drive, off of LA Highway 14.  The area surrounding the facility consists of agricultural fields, residents, and commercial buildings.  The latitude and longitude of the facility was obtained from USGS Topographic map entitiled \"New Iberia South, LA\".\n\nThe facility treats wastewater from the surrounding residential and commercial entities.  This treatment includes the chlorination and de-chorination, with sulfur dioxide, of the water supply prior to being disposed of into the adjacent Rodere Canal.  A continuous rate of chlorine is mixed with water in the injection room.  Once the chlorine is injected into the water it is diluted to an amount, which is less than 1% chlorine by weight.  The chlorine-water mixture is then routed to the contact chamber where the wastewater is treated.  The part of this process that is subject to the RMP requirements begins with the chlorine supply (6-1 ton cylinders) and ends at the point where it is mixed with the water.  The facility uses approximately one cylinder of chlorine every two weeks.  The wastewater plant stores a maximum of six-one ton cylinders (12,000 lbs.) of chlorine at any one time.\n\nFor the de-chlorination process a continuous rate of sulfur dioxide is mixed with water in the injection room and the mixed stream is sent to the effluent of the chlorination contact chamber.  Once the sulfur dioxide is mixed with water it is diluted to an amount that is less than 1% by weight.  The part of the de-chlorination process that is subject to the RMP requirements begins with the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 47273,
      "SummaryText": " sulfur dioxide supply (4-1 ton cylinders) and ends at the point where it is mixed with the water.  The facility uses approximately one cylinder of sulfur dioxide every two weeks.  The plant stores a maximum of four-one ton cylinders (8,000 lbs.) of sulfur dioxide at any one time.\n\nThe worst-case release scenario for both chlorine and sulfur dioxide involves the release of the greatest amount from a single vessel as required by 40 CFR part 68.25 (b) - Determination of worst-case release quantity.  This type of release may occur as a result of catastrophic natural or other unforeseen disaster.  A release of 2,000 lbs. for a duration of 10 minutes results in a 1.3 mile distance to the toxic endpoint for both chorine and sulfur dioxide.  This endpoint, developed by the American Industrial Hygene Association, is the location where minimal effects of exposure to the toxic substance are likely ot occur.  This distance encompasses approximately one half of the City of New Iberia from LA Highway 14 at US Highway 90 to Center St. at Dale st. and from Admiral Doyle Drive at Hopkins St. to Lewis St. between Admiral Doyle Drive and US Highway 90.  According to a July 2005 publication of April 1, 2000 population estimates, the population of New Iberia is approximately 32,955.  It is estimated  that the worst-case circle encompasses 50% of the population (16,478).\n\nAn alternative case or a more likely release of sulfur dioxide or chlorine could occur as a result of a valve regulator seal, or gasket leak.  The plant is equipped with both chlorine and sulfur dioxide leak detection systems that have sensors located near the cylinders.  If a 1ppm leak of chlorine or sulfur dioxide is detected, an alarm will sound and according to facility personnel, it would take less than 1 minute for on-site personnel to respond by closing the flow valve and thus stopping the leak.  Assuming the substance (either chlorine or sulfur dioxide) flashes to the atmosphere at a rate of 0.5 ft3/min. for a "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 47273,
      "SummaryText": "max. of five minutes (0.5 lbs. of chlorine, 0.4 lbs. of sulfur dioxide) the distance to the toxic endpoint is less than 0.1 mile.  The area within 0.1 mile of the facility is currently agricultural fields and recreation fields owned by the City of New Iberia.  In the event the land is developed, and based on a maximum population density of 551 p/mi2, the population within 0.1 mile of the facility is approximately 17.  This type of release is only expected to impact those persons in the immediate vicinity of the chlorine or sulfur dioxide cylinders.\n\nThe facility has not experienced a release which caused on or off site injury, death or property damage within the past five years.\n\nFacility employees are properly trained in the operating and maintenance procedures.  These procedures are kept on-site within the O & M Manuals.  Records of inspection, testing, and maintenance are also kept on file at the facility.\n\nWritten emergency response procedures are kept on file at the facility.  The emergency response procedures describe actions for incidental response for the facility peronnel in the event of a relatively small leak or release that does not pose an immediate safety or health hazard.  If incidental response activities do not halt the release or the release poses an immediate safety or health hazard, specially trained response personnel are contacted to take over response activities.  In the event of a toxic leak or release, employees are instructed to assess the situation and to determine if it is safe to discontinue the leak without the help of emergency responders.  If there are any doubts as to the safety of the release, the employees are to initiate the written notification procedures.\n\nCurrent safety features installed at the facility include the leak detection system, 24 hr/day on-site personnel, and a covered building to protect the cylinders from the heating effects of direct sunlight.  Inspections of the process and associated equiment are conducted on a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 47273,
      "SummaryText": " regular basis to avoid failure and detect normal wear and tear of equipment parts."
    }
  ]
}