{
  "FacilityID": 47407,
  "FacilityName": "Harcros Chemicals Inc. - West Point",
  "FacilityStr1": "942 Industrial Access Road",
  "FacilityStr2": null,
  "FacilityCity": "West Point",
  "FacilityState": "MS",
  "FacilityZipCode": "39773",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28025",
  "LEPC": "Clay County LEPC",
  "FacilityLatDecDegs": "33.625833",
  "FacilityLongDecDegs": "-088.637778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "harcroschem.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 883528408,
  "ParentCompanyName": "Harcros Chemicals Inc.",
  "Company2Name": null,
  "CompanyDUNS": 194128765,
  "Company2DUNS": 0,
  "OperatorName": "Harcros Chemicals Inc.",
  "OperatorStr1": "P.O. Box 2930",
  "OperatorStr2": null,
  "OperatorCity": "Kansas City",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66110",
  "OperatorZipCodeExt": "2930",
  "RMPContact": "Rick Hesketh",
  "RMPTitle": "Engineering & Environmental Manager",
  "FTE": 3,
  "OtherEPAFacilityID": "MSN000407367",
  "EPAFacilityID": "100000183133",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-05-10 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-01-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-01-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-01-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-05-30 00:00:00",
  "DeRegistrationEffectiveDate": "2017-05-24 00:00:00",
  "AnniversaryDate": "2012-01-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 33.62583,
  "FRS_Long": -88.63667,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 68675,
      "AltID": null,
      "FacilityID": 47407,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 70295,
          "ProcessID": 68675,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 90953,
          "ProcessID": 68675,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 590953,
          "ProcessID": 68675,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 47407,
      "SummaryText": "HARCROS CHEMICALS INC. - WEST POINT: EXECUTIVE SUMMARY\n\n\n1.    Accident release prevention and emergency response policies.\n\nThis distribution facility plans to store chlorine and sulfur dioxide cylinders occasionally.  Chlorine and Sulfur Dioxide are considered hazardous.  The same properties that make chlorine and sulfur dioxide valuable as commodity chemicals also make it necessary to observe certain safety precautions to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as that of our co-workers, and to reduce the threat to nearby members of the community.  It is our policy to adhere to all applicable Federal and State rules and regulations.  Safety depends upon the manner in which we handle chlorine and sulfur dioxide, the safe handling procedures that we use, and the training of our personnel.  Note: although we plan to store sulfur dioxide and will take the necessary precautions with this hazardous material, the amount stored will be below the threshold amount.  Therefore, only chlorine is being registered.\n\n\n2.    The stationary source and regulated substances handled.\n\nOne of the primary purposes of this facility will be to store chlorine and sulfur dioxide for distribution to our customers which include water treatment facilities and general industry.  Chlorine and sulfur dioxide will be received in 150 pound cylinders and will be shipped in the same packages.  Access to the site is restricted to facility employees, management personnel, and authorized contractors and visitors.  The maximum total inventory of chlorine to be stored at this facility is 10,000 pounds.  The maximum total inventory of sulfur dioxide will be well below the threshold amount of 5,000 pounds.  Average inventories will be much less.\n\n\n3.    The general accidental release prevention program and the specific prevention steps.\n\nThis distribution facility complies with EPA?s Accidental Release Prevention Rule and with all applicable state codes and regul"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 47407,
      "SummaryText": "ations.  This facility is operated in accordance with recommendations from the Chlorine Institute and with the Responsible Distribution Process of the National Association of Chemical Distributors.\n\n\n4.    Five-year accident history.\n\nWithin the past 5 years, this facility has had no accidental releases involving regulated chemicals that have resulted in deaths, injuries or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\n\n\n5.    The emergency response program.\n\nThis facility does not have its own emergency response team.  The number of employees available for a response team is below the required minimum.  Emergency response will be by public responders, by trained response teams from other, nearby Harcros Chemical facilities, and by other responders trained according to the Chlorine Institute?s Pamphlet 64 (Emergency Response Plans for Chlorine Facilities).  We plan to send one West Point employee to annual chlorine emergency response training so he will be better equipped to assist public and other emergency responders.  We have discussed our Risk Management Program with the West Point Fire Department and have coordinated emergency response with them.\n\n\n6.    Planned changes to improve safety.\n\nThis facility was previously registered to store chlorine and sulfur dioxide.  We de-registered the facility in 2006 because we didn?t see a continued need to service customers from this facility.  However, since that time, another Harcros facility re-located a further distance from the West Point branch and its customers.  Therefore, we now feel it is more economical and safer to keep a limited inventory at West Point to better service customers and minimize the travel time from the warehouse to some customers.  The amount of chlorine and suflur dioxide to be stored is much less than we planned the first time we registered this facility.  Harcros Chemicals will continue to participat"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 47407,
      "SummaryText": "e in the Chlorine Institute and National Association of Chemicals Distributors programs, and continue to improve our operations in accordance with Responsible Distribution Guidelines.\n\nIn 2003, we developed new security plans to help guard against intentional misuse of hazardous chemicals.  We are continuing to evaluate and implement new security measures by sharing knowledge with other Harcros facilities and general industry."
    }
  ]
}