{
  "FacilityID": 4745,
  "FacilityName": "Clymers Farm Center",
  "FacilityStr1": "3665 S. St. Rd. 25",
  "FacilityStr2": null,
  "FacilityCity": "Logansport",
  "FacilityState": "IN",
  "FacilityZipCode": "46947",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18017",
  "LEPC": "Cass County LEPC",
  "FacilityLatDecDegs": "40.710056",
  "FacilityLongDecDegs": "-86.444333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.andersonsinc.com",
  "FacilityEmailAddress": "firstname_lastname@andersonsinc.com",
  "FacilityDUNS": 7903628,
  "ParentCompanyName": "The Andersons, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 7903628,
  "Company2DUNS": null,
  "OperatorName": "The Andersons, Inc.",
  "OperatorStr1": "3665 S. St. Rd. 25",
  "OperatorStr2": null,
  "OperatorCity": "Logansport",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46947",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000059358",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-01 00:00:00",
  "SafetyInspectionBy": "Indiana State Chemist",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2003-05-06 00:00:00",
  "DeRegistrationEffectiveDate": "2000-09-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 40.710056,
  "FRS_Long": -86.444333,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5516,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 4745,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 5929,
          "ProcessID": 5516,
          "ChemicalID": 56,
          "Quantity": 54228.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5632,
          "ProcessID": 5516,
          "NAICSCode": "42291",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 3010,
              "Process_NAICS_ID": 5632,
              "SafetyReviewDate": "1997-04-01 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": "All Anhydrous Ammonia storage vessel are built to ASME standards.",
              "HazardReviewDate": "1997-04-01 00:00:00",
              "ChangeCompletionDate": "1997-04-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1997-04-01 00:00:00",
              "TrainingReviewDate": "1998-11-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-02-01 00:00:00",
              "EquipmentInspectionDate": "1998-02-01 00:00:00",
              "EquipmentTested": "All anhydrous ammonia storage tanks and appurtenances were inspected in February 1998 by Paul Akers, Inc..  All recommended upgrades were completed by fall 1998.",
              "ComplianceAuditDate": "1998-02-01 00:00:00",
              "AuditCompletionDate": "1998-09-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3072,
                  "PreventionProgram2ID": 3010,
                  "ProcessChemicalID": 5929
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "ProcessID": 5517,
      "AltID": "Aqua Ammonia",
      "FacilityID": 4745,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 5930,
          "ProcessID": 5517,
          "ChemicalID": 57,
          "Quantity": 370000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5633,
          "ProcessID": 5517,
          "NAICSCode": "42291",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4745,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-12-01 00:00:00",
    "ERTrainingDate": "1998-12-01 00:00:00",
    "CoordinatingAgencyName": "Cass County EMA",
    "CoordinatingAgencyPhone": "2197222484",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4745,
      "SummaryText": "The Andersons Clymers Farm Center RMP Executive Summary\n\nSource and Product Description\nThe Andersons Clymers Farm Center is engaged in the handling, storage, application, shipping and receiving of agricultural fertilizers (liquid and granular), pesticides and miscellaneous farm supplies.  This facility has been operated by The Andersons, Inc. since the end of 1989. The facility manager is Joe Johnson.\n\nThe facility occupies approximately 8.5 acres and is located east of the town of Clymers, in Clinton Township, Cass County, Indiana.  The facility is situated south of Highway 25.  There is an agricultural field across the street to the north, one residence to the east, one neighbor to the south on the other side of the railroad line and four residences to the west.\n\nThere are two RMP-regulated materials at this facility: anhydrous ammonia and aqua ammonia.  Two 12,500 gallon tanks are used for bulk storage of the anhydrous ammonia. These tanks are on the east side of the facility, away from any buildings.  When filled to the maximum 85% capacity, the anhydrous ammonia tanks can hold 108,456 total pounds of material.  This material is a gas at ambient temperature and pressure.  It is a liquid when stored under pressure inside the tanks. The aqua ammonia is a liquid solution and is stored in two 50,000 gallon and five 30,000 gallon storage tanks.  There is 250,000 total gallons of aqua ammonia at this facility.\n\nAnhydrous and aqua ammonia are not poisons, but they are inhalation / respiratory hazards.  Ammonia is a toxic material but it has no cumulative toxic effects on the human body.  However, it is acutely corrosive when it comes in contact with mucous membranes, in particular.  Anhydrous and aqua ammonia are non-flammable gases.\n\nSummary of Major Hazards\nThe principal causes of ammonia emergencies are ruptured hoses and defective valves. The most probable time for an exposure or release to occur will be during a transfer from a delivery truck to the bulk storage"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4745,
      "SummaryText": "tanks or a transfer from the loading station to the small application tanks (aka nurse wagons).  Flexible hoses and fixed piping must be connected properly.  Hoses are date-stamped and replaced in advance of the expiration date or when defects are observed.  All transfers of ammonia are observed by Anderson personnel.\n\nTransfers from the bulk storage tanks to the nurse wagon loading station occur inside fixed steel pipes and are manually controlled.  Flexible hoses are used to connect from the loading station to the nurse wagons. \n\nWith elevated temperatures that occur during mid-to-late summer, the ammonia gas inside the anhydrous ammonia bulk storage tanks can expand, and possibly cause one or more relief valves to open in order to equalize the pressure inside the tank(s).  The relief valve will reseal itself when pressure is relieved.  These events are very short in duration - a few seconds at the most.\n\nA complete failure or burst tank is highly unlikely.  The bulk storage tanks are built under strict guidelines established in the ASME pressure vessel code.  The tanks are protected by concrete traffic barriers.  Most major welding and structural work done on the tanks is performed by certified welders.  \n     \n\nConsequences of Failure to Control the Hazards for Anhydrous  Ammonia\nThe worst case scenario for this facility was created using EPA's RMP Comp software.  A complete release of the largest tank's contents (approximately 54,228 pounds -- creating a gas / vapor cloud) in a 10 minute period, using worst case atmospheric conditions, results in a distance to endpoint of 4.0 miles.  The estimated exposed population is 2,000 people.  This distance would encompass the town of Clymers, it's residences and schools.  The State Juvenile Corrections Center would also fall inside the 4 mile radius. No sensitive environmental receptors would be affected.  There are no passive mitigation systems available for this type of scenario.\n\nIt is our belief that the risk of"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4745,
      "SummaryText": "a complete release of the tank contents is infinitesimally small.  Active mitigation systems in place at this facility were designed to prevent or mitigate any attempts to empty the tank.  The tank is in a protected location, and all transfer appendages are protected by concrete barriers.\n\nA more probable release situation is expressed by the alternative release scenario.  We believe that a more likely release could occur from a transfer hose failure.  Prior to the excess flow valve being activated, we estimate that the maximum amount of ammonia that could escape to the atmosphere is approximately 2575 pounds. A release of this nature would likely last for about five minutes.  Utilizing an average wind speed of 3.0 m/sec and atmospheric stability class D,  the resulting distance to endpoint would be  0.40 miles.   In this more realistic scenario, the only potential exposed receptors would be the residences east of the facility - no more than 50 people.\n\nActive mitigation systems were included in the alternative case scenario.  They are listed in the next section.\n\nConsequences of Failure to Control the Hazards for Aqua  Ammonia\n\nThe worst case scenario for this facility was created using EPA's RMP Comp software.  A complete release of the largest tank's contents (approximately 370,000 pounds -- creating a liquid spill with ammonia vapors) in a 10 minute period, using worst case atmospheric conditions, results in a distance to endpoint of 6.10 miles.  The estimated exposed population is 3,000 people.  This distance would encompass the town of Clymers, it's residences and schools.  The State Juvenile Corrections Center would also fall inside the 4 mile radius. No sensitive environmental receptors would be affected.  There are passive mitigation systems available for this type of scenario.\n\nIt is our belief that the risk of a complete release of the tank contents is very small. The tank is located inside a secondary containment dike in a protected location, and all tr"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 4745,
      "SummaryText": "be evacuated to an upwind location. Once the response team has arrived, we will work in concert with them to close the valves between the tank and the leak.  In the meantime, a steady spray of water will deluge the ammonia gas plume and knock it to the ground, while chemically binding any free ammonia.\n\nThe employees are instructed to make emergency phone calls in this order: 911, the facility manager, the corporate Safety Department emergency phone number, the Indiana Emergency Response hotline and the Indiana Department of Environmental Management emergency phone number.  All applicable contact names and numbers are found in the facility spill and emergency response plan.\n\n\nCommunication procedures with responders \nThe local fire department is invited to tour the Clymers Farm Center annually.  Facility management, employees and fire department personnel jointly discuss the location of the anhydrous ammonia and response procedures on a regular basis.  Responders know the location of all emergency shutoff valves and on-site response equipment.  We believe that a strong relationship with first responders will be our best defense.\n\nThe LEPC and state regulatory agencies receive a copy of our hazardous materials storage information, every February, in accordance with our community right to know obligations.  A copy of the Clymers Farm Center Emergency Action Plan is on file with the local fire department."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4745,
      "SummaryText": "ansfer appendages are protected by concrete barriers.\n\nA more probable release situation is expressed by the alternative release scenario.  We believe that a more likely release could occur from a leaking pipe.  We estimate that the maximum amount of ammonia that could escape to the atmosphere is approximately 37,000 pounds. A release of this nature would likely last for about ten minutes.  Utilizing an average wind speed of 3.0 m/sec and atmospheric stability class D,  the resulting distance to endpoint would be  0.60 miles.   In this more realistic scenario, the only potential exposed receptors would be the residences east of the facility - no more than 75 people.\n\nActive and passive mitigation systems were included in this alternative case scenario.  They are listed in the next section.\n\n\nExplanation of How Hazard Releases are Prevented.\nPassive mitigation refers to equipment, devices, or technologies that function without human, mechanical or other energy input.  Passive mitigation systems in place at the Clymers Farm Center are:\n \n7 Secondary containment dike around the aqua ammonia storage tanks will prevent an aqua ammonia spill from leaving the property.\n \n Active mitigation refers to equipment, devices or technologies that require human, mechanical or other energy input to function.  Active mitigation systems in place at the Clymers Farm Center are:\n7 Excess flow valves are located on all outgoing liquid and vapor valves on the anhydrous ammonia storage tanks.  They close automatically if the volume of gas or liquid flowing through the line exceeds the normal flow rate.  They won't reopen until the downstream shutoff valve is closed and the pressure equalizes on both sides of the valve seat.  Two principal causes of the excess valve closing are a ruptured hose or a broken pipe or shutoff valve downstream that is opened too quickly.\n7 Back check valves are located on the truck unloading riser and are designed to ensure that the flow goes in one direction onl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4745,
      "SummaryText": "y.  This prevents anhydrous ammonia from flowing to the truck from the storage tank.\n7 Pressure-relief valves are located on the top of the bulk storage tank and fixed steel piping to relieve pressure that is too great.  This can be caused by elevated temperatures in the summer or overfilling.  They open directly to the atmosphere at 250 psig and close when the pressure inside the tank drops below this pressure.\n7 An ample supply of water is available near the bulk storage tanks.  A water well (20' to the west) could be utilized to provide water to knock down a vapor cloud.  \n7 Spill control kits are located at the facility and include sorbent material, shovels, PPE and disposal containers.\n7 Anderson personnel and truck drivers supervise all anhydrous transfers to and from the bulk storage tank\n\n\nPrevention Program\nPreventive maintenance is an integral piece of this facility's hazard management program.  All hoses, tanks, valves and storage units are inspected at least monthly, and usually daily during the spring and fall season.  A good PM program is our strongest defense against a release of anhydrous ammonia.  All hose replacements are documented in the maintenance files.  Records of all maintenance tasks performed on the tank or related equipment are also on file.\n\nThis facility uses Paul Akars, Inc., an Indianapolis, Indiana firm, for welding and major maintenance performed on the tank.  The last complete inspection of the tank and piping was the fall of 1997.  A full-scale anhydrous ammonia audit was also performed at this time.  Copies of all reports are on file. \n\nSee Steps Taken to Address Hazards for more information on prevention measures and identification.\n\n\nManagement System\n(see Steps Taken to Address Hazards)\n\n\nEquipment maintenance\nAll equipment maintenance is formally documented. See the Prevention Program section for further explanation.\n\n\nTraining\nAll employees receive annual training on anhydrous ammonia, emergency action plan and spill p"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 4745,
      "SummaryText": "rocedures, and hazard communication.  Documentation and attendance rosters are on file at the facility.  \n\n\nContractors\nAll contractors receive a contractor safety review prior to performing work at the facility.  During this review, they are informed of any potential hazards at the facility, emergency procedures, site-specific safety rules and the ability to request an MSDS for any product at any time.\n\n\nSteps Taken to Address Hazards\nThe Andersons Clymers Farm Center has a number of systems in place for hazard assessment and mitigation.  \n\nThe corporate Safety Department performs annual hazard management audits at the facility.  The audits include a physical walk through of the entire facility and a review of all EPA, OSHA and DOT paperwork and training documentation.  Action items are noted and recommendations are made. The audits consist of five major topical areas:  Safety & Health, Environmental, Fire Protection & Security, Administrative and Housekeeping & Storage.  Issues are documented in a report and sent to the facility manager and upper management.  Updates on action item status must be made within 30 days and 6 months of receiving the report.\n\nFormal investigations are performed for all environmental or safety incidents.  Documentation is kept on file at the facility and the corporate Safety Department.\n\nGroup safety training / meetings allow employees to discuss any concerns they may have with the operation of the facility.  Issues are documented and assigned to employees for follow-up. Records of all meetings are kept at the facility.\n\nResponse Action in the Event of a Release\nIn the event of a burst hose or defective valve, employees are instructed to shut down the transfer process and, if possible, approach the shutoff valve from upwind and attempt to turn it off. \n\nFor an uncontainable release, employees will immediately call the police and fire department or other first responders, as appropriate.  All employees, customers and contractors are to"
    }
  ]
}