{
  "FacilityID": 4749,
  "FacilityName": "CHARLES HAMMAN WATER TREATMENT PLANT",
  "FacilityStr1": "1500 MANVILLE ROAD",
  "FacilityStr2": null,
  "FacilityCity": "WOONSOCKET",
  "FacilityState": "RI",
  "FacilityZipCode": "02895",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "44007",
  "LEPC": "District 1 LEPC",
  "FacilityLatDecDegs": "41.984722",
  "FacilityLongDecDegs": "-71.491111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ci.woonsocket.ri.us",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "CITY OF WOONSOCKET, RI",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "EMERSON JAMES MARVEL",
  "OperatorStr1": "169 MAIN STREET",
  "OperatorStr2": null,
  "OperatorCity": "WOONSOCKET",
  "OperatorStateFIPS": "RI",
  "OperatorZipCode": "02895",
  "OperatorZipCodeExt": null,
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000059526",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-04-27 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": "1999-06-24 00:00:00",
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": "2021-11-12 00:00:00",
  "DeRegistrationEffectiveDate": "2021-10-08 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 41.984278,
  "FRS_Long": -71.489917,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5521,
      "AltID": "Potable H2O Disinfection",
      "FacilityID": 4749,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 5934,
          "ProcessID": 5521,
          "ChemicalID": 62,
          "Quantity": 5250.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5637,
          "ProcessID": 5521,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 3014,
              "Process_NAICS_ID": 5637,
              "SafetyReviewDate": "1999-06-01 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "Yes",
              "FR_OtherType": null,
              "FR_Comments": "System consists almost entirely of Wallace and Tiernan parts, upgraded recently to suction system",
              "HazardReviewDate": "1999-06-01 00:00:00",
              "ChangeCompletionDate": "1999-09-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "low pressure alarm",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-01 00:00:00",
              "TrainingReviewDate": "1999-06-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-01 00:00:00",
              "EquipmentInspectionDate": "1998-10-13 00:00:00",
              "EquipmentTested": "Leak detector and chlorinators",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3076,
                  "PreventionProgram2ID": 3014,
                  "ProcessChemicalID": 5934
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4749,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1995-05-01 00:00:00",
    "ERTrainingDate": "1999-05-30 00:00:00",
    "CoordinatingAgencyName": "Woonsocket Fire Department",
    "CoordinatingAgencyPhone": "4017663900",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4749,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\nFacility Description\n\nThe Woonsocket Water Division (WWD) of the Woonsocket Department of Public Works is a Rhode Island Public Utilities Commission regulated public utility registered with the Department of Health as Public Water System number 1559518 and holding RIPDES permit number RI0001627 for waste discharge into the Blackstone River.  WWD serves a population of 46,000 and local industry.  Average demand is about 5.5 million gallons per day (mgd).  The service area includes the entire City of Woonsocket, Rhode Island as well as parts of the towns of North Smithfield, Rhode Island; Cumberland, Rhode Island; Blackstone, Massachusetts; and Bellingham, Massachusetts.\n\nThe Water Division owns and maintains three surface water sources of supply: Reservoir Number 1, Reservoir Number 3, and Harris Pond.  All water is treated at the Charles G. Hamman Water Treatment Plant.  The plant, providing conventional surface water treatment including flocculation, sedimentation, filtration, chlorine disinfection, fluoridation, and pH adjustment, was built in 1962 and can treat up to 12 mgd.\n\nThe Water Division's distribution system consists of five pressure zones.  The Low Service Area is fed directly from the treatment plant and utilizes four steel reservoir tanks: Mount Saint Charles Tanks One, Three, and Four and the Cobble Hill storage tank.  The Mount Saint Charles, Diamond Hill, Rhodes Avenue, and Highland Industrial Park High Service Areas draw from the Low Service Area through booster pumping stations to provide acceptable supply pressure at higher elevations.  Each high service area includes a single standpipe or elevated storage tank.  The distribution system includes over 125 miles of transmission and distribution mains.\n\n\nRegulated Substances and Associated Hazards\n\nThis risk management program document has been prepared to meet the requirements of the EPA Risk Management Program regulations as stated in 40 CFR Part 68 (\"RMP regulations\").\n\nChlori"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4749,
      "SummaryText": "ne is the only chemical in use by WWD in sufficient amounts to be covered by the Risk Management Program regulations.  Chlorine is a heavier than air gas that may be fatal if inhaled.  In lesser quantities it causes respiratory distress and may burn skin and eyes.  The substance is highly reactive and will readily mix with other substances causing further hazards.  In the presence of moisture, chlorine becomes highly corrosive.  A concentration of 30 parts per million causes coughing, 40 to 60 parts per million is dangerous within thirty minutes of exposure, and at one thousand parts per million is apt to be fatal in a few breaths.\n\n\nPrevention and Emergency Response Policies\n\nThe Woonsocket Water Division (WWD) is committed to being a responsible member of the community by giving top priority to operating in a safe and environmentally sound manner.  The WWD intends to continuously identify methods to reduce the use of hazardous materials and to reduce the risk to the community and environment through implementation of inherently safer technology and procedures.  WWD safety and environmental programs include training and licensing for all treatment plant operators and active relationships with the Woonsocket Fire Department hazardous materials team and the local LEPC.  WWD maintains an emergency response plan that covers toxic releases as well as water supply concerns.  WWD management takes a hands on role in day to day operations and monitors compliance with safety procedures. \n\n\nWorst Case Release and Alternative Release Scenarios\n\nRMP regulations dictate that covered facilities model a ten minute release of the facility's largest container of each regulated substance under extremely difficult environmental conditions and document the results as the worst case release scenario.  WWD has modeled the release of a 150 lb. cylinder in this manner and has based emergency response procedures on the predicted off-site consequences as well as the alternative release conse"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4749,
      "SummaryText": "quences.\n\nWWD modeled a ten minute release of its largest possible stock of chlorine to satisfy the alternative release requirements of the RMP regulations.  Under the more realistic environmental conditions modeled, the affected area was equal to that of the required worst case scenario.  WWD, in cooperation with the Woonsocket Fire Department and the Rhode Island DEM, chose this scenario to be certain that realistic parameters were used in planning for a major release so that the surrounding population would be properly protected. \n\nEach scenario was modeled assuming that the release occurred within an enclosed space (the chlorine room) so that release to the surrounding air was slowed and the affected area minimized.  WWD utilized RMP*Comp 1.05, a publicly available software, to compute the affected areas.\n\n\nAccidental Release Prevention Program\n\nWWD has taken this opportunity to review operation and maintenance procedures to ensure that proper steps are being taken to prevent accidental releases.\n\nChlorine is brought on site in 150 lb. cylinders by a licensed hazardous materials transporter.  Up to thirty-five cylinders (5200 lbs. total) may be on site at once.  All cylinders are delivered with protective caps in place to avoid damage to the cylinder's valve.  Prior to filling, the supplier replaces this valve with a new or rebuilt valve.  The supplier pneumatically tests each cylinder every 5 years.\n\nUpon arrival at the Hamman Treatment Plant, cylinders are chained in place in the locked chlorine room; only exhausted cylinders are stored outside.\n\nActive cylinders are chained in place at the connection point to the chlorination equipment to avoid possibly damaging falls.  Protective caps are removed only after the cylinders are secured.  Cylinders are attached to the process via connection yokes and whip lines.  These connections are checked each time a cylinder is changed by the use of dilute ammonia solution spray.  Yokes are replaced yearly and whip lines ar"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4749,
      "SummaryText": "e replaced every six months.  The cylinders are moved only on weekday first shifts, when supervision and emergency response capabilities are greatest.  Cylinder changes are performed approximately once every two weeks only.                                                                                                                                              \n\nMaintenance personnel perform monthly inspections of chlorine related equipment.  These inspections consist of checking the general condition of piping, valves, injectors, and safety equipment.  A contractor specializing in chlorine systems provides annual preventive maintenance as well as on-call service of the equipment.\n\n\nFive Year Accident History\n\nWWD has not had any chemical release accidents in the last five years with any on site or off site consequences.\n\n\nEmergency Response Program\n\nThe WWD has developed an emergency response program (ERP) to minimize the effects of various emergency situations on employees, the public, and the environment.  The manual includes a list of telephone numbers of agencies and individuals to contact in the event of one of several pre-identified situations (e.g., fire, dam failure, storage tank failure, or chlorine release).  The agencies and individuals represent local emergency responders (e.g., fire department), public notification and regulatory reporting requirements (e.g., DEM, DOH, LEPC1), and internal notification (e.g., Public Works / Administration). \n\nWWD works closely with the Woonsocket Fire Department hazardous materials personnel to ensure that an appropriate response can be made in the improbable event of a major release.\n\nWWD is equipped with four air packs, detection alarms, a chlorine cylinder repair kit, and emergency suction venting to ensure that in the case of an equipment failure, employees, the public, and the water system can be protected.  Class III licensed drinking water operators employed by WWD are trained to initiate emergency response to"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4749,
      "SummaryText": "chlorine releases.  There is at least one such person on site 24 hours a day, 365 days a year.\n\n\nPlanned Changes to Improve Safety  \n\nWWD is currently reviewing, and plans to install, a nitrogen powered automatic shutdown system that will help to ensure that a failure at one chlorine cylinder will not affect others.  This system, which is designed to operate even during power outages and which can respond to releases much more quickly than human intervention, is currently installed at the City's wastewater treatment plant.\n\nA consultant for WWD has completed a planning study regarding the future of the Charles Hamman Water Treatment plant and has determined that its replacement will be necessary within the near future.  Therefore, design of a new treatment plant including possible changes in disinfection chemistry and safety procedures will be undertaken within the next five years.  The WWD will insist upon stringent safety standards to most effectively protect the surrounding community."
    }
  ]
}