{
  "FacilityID": 47508,
  "FacilityName": "Praxair Distribution - Bethlehem, PA",
  "FacilityStr1": "145 Shimersville Road",
  "FacilityStr2": null,
  "FacilityCity": "Bethlehem",
  "FacilityState": "PA",
  "FacilityZipCode": "18015",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42095",
  "LEPC": "Northampton County LEPC",
  "FacilityLatDecDegs": "40.616944",
  "FacilityLongDecDegs": "-075.335833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.praxair.com",
  "FacilityEmailAddress": "info@praxair.com",
  "FacilityDUNS": 138083241,
  "ParentCompanyName": "Praxair, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 197154586,
  "Company2DUNS": 0,
  "OperatorName": "Praxair Distribution",
  "OperatorStr1": "145 Shimersville Road",
  "OperatorStr2": null,
  "OperatorCity": "Bethlehem",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "18015",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kevin J. Brady",
  "RMPTitle": "Facility Manager",
  "FTE": 32,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000125054",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-05-31 00:00:00",
  "SafetyInspectionBy": "PA Dept. of Environ. Protection",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "\"Corrected\" 06/28/2004 -   Anniv. Date 2/11/2007",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-02-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-01-31 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-01-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-01-30 00:00:00",
  "DeRegistrationEffectiveDate": "2014-12-11 00:00:00",
  "AnniversaryDate": "2012-01-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 40.61573,
  "FRS_Long": -75.33501,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 68848,
      "AltID": "Trichlorosilane Transfill",
      "FacilityID": 47508,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 70472,
          "ProcessID": 68848,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 91210,
          "ProcessID": 68848,
          "ChemicalID": 153,
          "Quantity": 41000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 153,
            "ChemicalName": "Trichlorosilane  [Silane, trichloro-]",
            "CASNumber": "10025-78-2",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 591210,
          "ProcessID": 68848,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 47508,
      "SummaryText": "Facility Description\n\nThe Praxair Distribution facility in Bethlehem, PA is an industrial and specialty gas plant that handles and stores trichlorosilane. The Bethlehem facility receives the trichlorosilane in bulk form, stores it in a storage tank, and then transfills it into smaller containers (cylinders) for distribution to customers. Cylinders are transported by truck for this distribution.\n\nRegulated Substances\n\nThis facility uses, manufactures, or stores a chemical listed in part 68 of Title 40 of the Code of Federal Regulations, beyond a threshold quantity, as established by the EPA; \nTrichlorosilane ? which is received in bulk form and transfilled into smaller containers (cylinders) for distribution to customers.\n\nAccidental Release Prevention Policy\n\nPraxair is dedicated to being the best performing industrial gas company in all aspects of our business, including safety, health, and environmental affairs. Our safety, health, and environmental policy call for a commitment to protecting the health and safety of our employees, neighbors, and the surrounding environment. This policy is the basis for engineering and construction programs that produce equipment and process systems that minimize the possibility of accidental chemical releases and operational safety programs that ensure safe operation of our facilities. Praxair is committed to the continuous improvement of these programs.\n\nPraxair is an active member of the American Chemistry Council and subscribes to the council?s program of Responsible Care? Employee Health and Safety Code of Management Practices.\n\nPrevention Program\n\nIn accordance with OSHA?s Process Safety Management standard and EPA?s Risk Management Program rule, the Bethlehem facility has a comprehensive accident prevention program in place. This program is built around process safety concepts such as:\n-Technical documentation of Process Safety Information, describing the physical properties of the hazardous substances, the safety systems in"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 47508,
      "SummaryText": " place to control these substances, and the critical operating parameters of the associated equipment and systems.\n-Procedures and programs to develop, maintain, and control key program elements such as process operations, equipment mechanical integrity, employee training, management of change, hot work permits, incident investigation, and contractor activity. \n-Initial and periodic review of new or modified processes through application of comprehensive design safety and management of change programs that include Process Hazard Analysis study and pre-startup review. \n\nPraxair has an employee participation program that promotes involvement in the process safety program and helps ensure understanding of facility-specific elements of the safety program.\n\nThe prevention program is audited periodically, by our corporate assessment group, to ensure that the process safety concepts and practices are in place and working effectively.\n\nChemical-specific Prevention Steps\n\nIn addition to the required prevention program elements, we have implemented safety features specific to the covered process at our facility. Following is a description of some of these safety features.\n\n-Process automatic and emergency isolation systems, \n-Area atmospheric monitoring systems and associated alarms,\n-Process purge systems, and\n-Dikes for product containment.\n\nFive-year Accident History\n\nThe Bethlehem facility accident history indicates continuous safe operation of our covered chemical process over the last five years. There were no covered process releases that resulted in an EPA RMP recordable accident.\n\nEmergency Response Programs\n\nPraxair has an emergency response program in place to minimize the effects of accidental release of regulated substances on employees, the public, and the environment. The Bethlehem PDI location will be a ?non-responding facility? as defined in section 8.1 of the CEPPO General Guidance for Risk Management Programs (July 1998), i.e. Praxair employees will respond"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 47508,
      "SummaryText": " to minor incidents.\n\nFor other than minor incidents Praxair has in place an emergency response plan in coordination with the Bethlehem Fire Department and the Northampton County LEPC.\n\nAll facility employees are trained in their role in the emergency plan and emergency drills are conducted at least annually.\n\nPlanned Changes to Improve Safety\n\nPraxair has a commitment to safety that is expressed in a company-wide goal of ?Zero/Zero?, which means zero accidents and zero injuries or illnesses at each and every location. We look to constantly improve the safety of our processes using recommendations developed through the prevention program and a program soliciting safety suggestions from our employees.\n\nThere are currently no major projects for safety improvement that have reached the planning stage."
    }
  ]
}