{
  "FacilityID": 47540,
  "FacilityName": "LOS OSOS COOLING",
  "FacilityStr1": "580 South Derby Street",
  "FacilityStr2": null,
  "FacilityCity": "Arvin",
  "FacilityState": "CA",
  "FacilityZipCode": "93203",
  "Facility4DigitZipExt": "1936",
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.203917",
  "FacilityLongDecDegs": "-118.824250",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Ag-Wise Enterprises",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Tim X. Yaksitch",
  "OperatorStr1": "P.O. Box 9729",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93309",
  "OperatorZipCodeExt": "0715",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000198127",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-06-02 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Cold Storage",
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-02-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-02-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-01-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-01-06 00:00:00",
  "DeRegistrationEffectiveDate": "2012-01-05 00:00:00",
  "AnniversaryDate": "2012-01-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility as 'Closed'.",
  "_processes": [
    {
      "ProcessID": 68912,
      "AltID": "cold storage",
      "FacilityID": 47540,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 91650,
          "ProcessID": 68912,
          "ChemicalID": 56,
          "Quantity": 2850.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 70536,
          "ProcessID": 68912,
          "NAICSCode": "115114",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 25299,
              "Process_NAICS_ID": 70536,
              "SafetyReviewDate": "2007-01-25 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2007-01-25 00:00:00",
              "ChangeCompletionDate": "2007-05-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2007-01-25 00:00:00",
              "TrainingReviewDate": "2007-01-25 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-01-25 00:00:00",
              "EquipmentInspectionDate": "2007-10-10 00:00:00",
              "EquipmentTested": "overall system inspection",
              "ComplianceAuditDate": "2007-01-25 00:00:00",
              "AuditCompletionDate": "2007-05-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2007-01-25 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 26466,
                  "PreventionProgram2ID": 25299,
                  "ProcessChemicalID": 91650
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 47540,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2000-06-01 00:00:00",
    "ERTrainingDate": "2006-06-01 00:00:00",
    "CoordinatingAgencyName": "Kern County Environmental Health",
    "CoordinatingAgencyPhone": "6618628700",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 47540,
      "SummaryText": "\n1.    Accidental Release Prevention and Emergency Response Policies:\n\n\n\nWe at Los Osos Cooling are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n\n2.    The Stationary Source and the Regulated Substances Handled:\n\n\n\nOur facility's primary activities encompass Cold Storage of produce.  We have one regulated substance present at our facility.  This substance is Anhydrous Ammonia and is used as a refrigerant in our cold storage facility.\n\n\n\nThe system is used for approximately 6 months a year in the summer and fall time-frames.  Written procedures are used for initial start up and operation of the unit.  Start up and shut down are performed by licensed refrigeration contractors and includes isolating the ammonia in the receiver tank.  During the down months the contractor inspects the equipment monthly.  \n\n\n\nThis facility fall under the CalARP program level 2.  \n\n\n\n3.    The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario:\n\n\n\nTo perform the required offsite consequence analysis for our facility, we have used the EPA's RMP *Comp(TM).  The following paragraphs provide details of the chosen scenarios.\n\n\n\nWorst Case\n\n\n\nThe worst case release scenario involves a catastrophic release from the Ammonia Receiver Tank.  In this scenario, 2,850 lbs. of Ammonia is released.  Total vaporization is assumed within 10 minutes.  Distances to the toxic endpoints are calculated without the passive mitigation of the building.  \n\n\n\nAt Class F atmospheric stability and 1.5 meters/second wind speed to a tox"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 47540,
      "SummaryText": "ic endpoint of 0.1 mg/L. The maximum distance to the toxic endpoint is 0.7 miles, affecting 6,078 persons. \n\n\n\nAlternative Scenarios to Off Site\n\n\n\nTo calculate a release rate that would show offsite consequence, alternative release scenarios involves the release of ammonia vapor from a shaft seal that is assumed to be controlled in 15 minutes.  At a release rate of 150 lbs per minute, RMP Comp calculates the endpoint to be 0.2 miles, affecting 352 persons.\n\n\n\nAlternative Most Likely Scenario\n\n\n\nThe alternative release scenario involves the release of ammonia vapor from a shaft seal that is assumed to be controlled in 30 minutes at a release rate of 75 lbs per minute.  No passive mitigation controls such as a building enclosure have been taken into account to calculate the scenario and the release is assumed to be controlled by the manual shutdown of the system.  At class D atmospheric stability and 3.0 meters/second wind speed, the maximum distance to the toxic endpoint of 0.14 mg/L of ammonia is 0.1 miles, affecting 174 persons.\n\n\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps:\n\n\n\nOur facility has taken all the necessary steps to comply with the California Accidental Release Prevention Program requirements set out under CCR Title 19, Division 2, Chapter 4.5.  This facility was designed and constructed in accordance with Uniform Mechanical Code.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source. \n\n\n\nSafety Information:\n\n\n\nLos Osos Cooling maintains a record of safety information that describes the chemical hazards (an MSDS), operating parameters and equipment designs associated with all processes.\n\n\n\nProcess Hazard Review:\n\n\n\nOur facility has conducted studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The studies were undertaken by a team of qualified personnel with expertise in engi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 47540,
      "SummaryText": "neering and process operations and will be revalidated at a regular interval of every five years or whenever major changes in the process are proposed.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent review of hazards was performed on January 25, 2007.\n\n\n\nOperating Procedures:\n\n\n\nFor the purposes of safely conducting activities within our covered processes, Los Osos Cooling maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.  Procedures were last reviewed on January 25, 2007.\n\n\n\nTraining:\n\n\n\nLos Osos Cooling has a training program in place to ensure that employees who are operating the refrigeration system process are competent in the operating procedures associated with the process.  Refresher training is provided at least every annually at the start up of the facility and more frequently as needed.\n\n\n\nMaintenance Program:\n\n\n\nLos Osos Cooling carries out maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  The most recent review/revision of maintenance procedures was performed on January 25, 2007.  Maintenance checks and operations are carried out by qualified licensed refrigeration contractors.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nCompliance Audits:\n\n\n\nLos Osos Cooling conducts audits on a regular basis to determine whether the provisions set out under the CalARP rule are being implemented.  The most recent compliance audit was conducted on Janua"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 47540,
      "SummaryText": "ry 25, 2007.  These audits will be carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation:\n\n\n\nLos Osos Cooling will promptly investigate any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  Such investigations will be undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports of incidents will be retained for a minimum of 5 years.\n\n\n\n5.    Five-year Accident History:\n\n\n\nLos Osos Cooling has had an excellent record of preventing accidental releases over the last 5 years.  Due to our release prevention policies, there has never been an accidental release at this facility.\n\n6.    Emergency Response Plan:\n\n\n\nLos Osos Cooling has a written emergency response plan that includes the accidental releases of hazardous materials.  The plan includes evacuations, notification of company supervision, notification of local emergency response agencies and the public. \n\n7.    Planned Changes to Improve Safety:\n\n\n\nAg Wise will evaluate and implement changes as necessary to assure the safe operation of this facility.  No changes are planned at the present time.\n\n\n\n"
    }
  ]
}