{
  "FacilityID": 4757,
  "FacilityName": "Fairmont Water Treatment Plant",
  "FacilityStr1": "Morris Park",
  "FacilityStr2": null,
  "FacilityCity": "Fairmont",
  "FacilityState": "WV",
  "FacilityZipCode": "26554",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "54049",
  "LEPC": null,
  "FacilityLatDecDegs": "39.455556",
  "FacilityLongDecDegs": "-80.136111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Fairmont",
  "OperatorStr1": "P.O.Box 1428",
  "OperatorStr2": null,
  "OperatorCity": "Fairmont",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "26555",
  "OperatorZipCodeExt": "1428",
  "RMPContact": "Charles Straight",
  "RMPTitle": "Pumping and Treatment Supervisor",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000059544",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.45556,
  "FRS_Long": -80.13611,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5531,
      "AltID": "Water treatment",
      "FacilityID": 4757,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5647,
          "ProcessID": 5531,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5945,
          "ProcessID": 5531,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505945,
          "ProcessID": 5531,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4757,
      "SummaryText": "The Fairmont water treatment system utilizes chlorine gas for disinfection purposes.  The facility utilizes one ton cylinders of chlorine gas which are received at the facility on a once-per-month basis.  Up to four cylinders are maintained on-site at any one time.  All four cylinders are stored inside the water treatment plant chlorine cylinder storage building.  The process utilizes one cylinder on-line at any one time.  One additional cylinder is connected to an automatic transfer system.  The automatic transfer system allows the second cylinder to go on-line as soon as the chlorine from the first cylinder has been totally utilized.  The average chlorine usage rate at this facility is 145 lbs per day.  The Fairmont water system utilizes a Wallace and Tiernan (WT) chlorinator system.  This system operates such that the chlorine transfer from the cylinder to the chlorinators is under vacuum versus pressure.  This type of arrangement provides for minimal potential for leaks of chlorine through the piping.  The facility has a preventive maintenance program which is designed to maintain the equipment that handles chlorine gas in a good operating mode.  Chlorine cylinders are received from the vendor and the transfer of the cylinders from the truck to the chlorine storage building is always performed during daylight hours, and is attended by the truck driver and a Fairmont water treatment plant operator.  The Fairmont water treatment plant is continuously manned.  There are two chlorine sensor systems located at the facility.  These sensors are designed to detect any chlorine release within either the chlorine cylinder storage area or the chlorinator room.  Both the chlorinator room and chlorine storage building are designed with exhaust fans that automatically start if a chlorine release is identified by either of the sensors.\n\nThe alternative scenario identified for this facility would be for a failure of the yoke piping which connects to the cylinder.  If this pipin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4757,
      "SummaryText": "g and related regulator valve failed, a maximum of 400 lbs per hour of chlorine gas could be released from one cylinder.\n\nEMERGENCY RESPONSE PROCEDURES\n\nIn the event of a severe chlorine release, FWTP employees are instructed to call 911 and request assistance from the City of Fairmont Fire Department.  The City of Fairmont Fire Department personnel can respond within 5 minutes and have the adequate personal protective equipment to isolate valves in the event of such an incident.  Regarding lower volume incidents involving minor leaks, FWTP has a contract with Chemply of Pittsburgh, PA.  Chemply provides emergency response to any chlorine releases.  Chemply personnel can be on-site within 1.5 hours of notification of a need.  Once the chlorine usage area has been adequately ventilated and the release of chlorine stopped, FWTP personnel will enter into the area to perform the repair work necessary.  FWTP personnel have been instructed to never enter into a chlorine usage area in the event of an alarm situation.\n\nTRAINING\n\nFWTP personnel receive annual chlorine awareness training from Chemply.  This training is performed to insure that personnel understand the hazards of dealing with chlorine gas and are familiar with the routine tasks associated with their jobs, as well as aware of the emergency response procedures neceessary to be followed in the event of a chlorine release.  \n\nAFFECTED AREA\n\nIn the event of a release, either a catastrophic release or the alternate scenario type release, there would be a mental impact of recreational area, in that the FWTP is located within the boundaries of Morris Park.  This park is used for a variety of recreational purposes, including walking, picnicking, and contains a playground area."
    }
  ]
}