{
  "FacilityID": 4760,
  "FacilityName": "Norumbega Chemical Feed Facility",
  "FacilityStr1": "55 Oak Street",
  "FacilityStr2": null,
  "FacilityCity": "Weston",
  "FacilityState": "MA",
  "FacilityZipCode": "02193",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25017",
  "LEPC": "Weston LEPC",
  "FacilityLatDecDegs": "42.333111",
  "FacilityLongDecDegs": "-71.291917",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Massachusetts Water Resources Auth.",
  "OperatorStr1": "100 First Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Boston",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "02129",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000059642",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-14 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-05-17 00:00:00",
  "DeRegistrationEffectiveDate": "2004-03-25 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 42.33611,
  "FRS_Long": -71.28978,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5534,
      "AltID": null,
      "FacilityID": 4760,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 5948,
          "ProcessID": 5534,
          "ChemicalID": 62,
          "Quantity": 52500.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5650,
          "ProcessID": 5534,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 3020,
              "Process_NAICS_ID": 5650,
              "SafetyReviewDate": "1999-01-02 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Chlorine Institute, Compressed Gas Association",
              "FR_Comments": null,
              "HazardReviewDate": "1998-10-19 00:00:00",
              "ChangeCompletionDate": "1999-06-21 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Telog, Autodialer, SCADA, Leak detectors",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "installation of weather station, development of more standing operating procedures, change in personal protective equipment requirements",
              "OpProceduresReviewDate": "1999-05-19 00:00:00",
              "TrainingReviewDate": "1999-06-07 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-15 00:00:00",
              "EquipmentInspectionDate": "1999-05-21 00:00:00",
              "EquipmentTested": "Gas Feeders, Ejectors, Supply Pumps, Analyzers, Generator",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1998-05-12 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3082,
                  "PreventionProgram2ID": 3020,
                  "ProcessChemicalID": 5948
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4760,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-04-17 00:00:00",
    "ERTrainingDate": "1999-06-14 00:00:00",
    "CoordinatingAgencyName": "Weston LEPC",
    "CoordinatingAgencyPhone": "7818932324",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": "EPCRA Section 302,304"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4760,
      "SummaryText": "\n1. INTRODUCTION\nThe Norumbega Chemical Feed Facility, located in Weston, Massachusetts uses gaseous chlorine as a part of the treatment process that provides MWRA communities with safe drinking water.  Chlorine is used as a disinfectant, reducing or eliminating the risk of such waterborne diseases as cholera, typhoid, and dysentery.  Since gaseous chlorine quantities stored at the facility exceed the threshold limit for EPA's Accidental Release Prevention Rule, the MWRA must develop and implement a Risk Management Plan.  The Accidental Prevention Rule focuses on three main components: a hazard assessment, a prevention program, and an emergency response program.  This Risk Management Plan document addresses these three components and highlights our efforts to prevent and plan for accidental releases.\n\n2. EXECUTIVE SUMMARY\nA. Accidental release prevention and emergency response policies\nGaseous chlorine has been used at the Norumbega Chemical Feed Facility for over 55 years.  During this time, chlorine operations have been safely conducted without any offsite exposure.  In order to prevent accidental releases, a trained Treatment Operator inspects chlorine process areas daily, monitors chlorine deliveries, and schedules preventative and corrective maintenance with maintenance personnel.  If an accidental release occurs, employees have been trained to understand that notification is the primary immediate objective for emergency situations.  Contact phone numbers are posted at the Norumbega Chemical Feed Facility and are included in the Integrated Contingency Plan.  Employees who are trained to respond to releases shall never respond alone or without the proper personal protective equipment.  If a fire is present or the situation has progressed beyond the control of MWRA Emergency Technical Coordinators, the Weston Fire Department will be notified immediately.  Depending on the severity of the situation and upon direction of the Weston Fire Department, the District Haz"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4760,
      "SummaryText": "ardous Materials Team will respond also.\n\nB. The stationary source and regulated substances handled\nBoth ton containers and 150-pound cylinders are stored at the Norumbega Chemical Feed Facility.  However, only ton containers are used at the Norumbega location.  The 150-pound cylinders are stored for distribution to another chlorination site.  All chlorine containers and cylinders are stored inside the Storage Building.  In the process feed room, a maximum of 12 ton containers can be on-line at any time. In the next room, extra ton containers as well as empty ones are stored outside of the process area.  The facility uses gas feed; although there is capability to use liquid feed.  Liquid feed is required as a treatment process redundancy by the Department of Environmental Protection.  To this day, liquid feed has never been used.  \n\nThere are three buildings located at the Norumbega Chemical Feed Facility site: the Chlorine Storage Building, the Administration Building, and the Gatehouse Building.  Each building is related to the chlorine disinfection process.  The Chlorine Storage Building stores chlorine ton containers and 150 lb. cylinders.  In the process feed room, the 12 active ton containers are piped together on a common manifold.  The 12 containers are grouped in two banks and connected to the gas withdrawal line through pressure regulated piping.  The chlorine gas piping is under pressure from the cylinders.  However, the pressure regulating valve for the active group of six containers lowers the gas pressure to a maximum of 35 psi as the gas leaves the Chlorine Storage Building.  The pressure regulator for the standby group of six containers is set at 25 psi to allow contribution if the active group runs out of chlorine. All piping has manual valves to allow shut off of any or all containers. Piping proceeds underground through a duct bank to the Administration Building where the gas passes through the vacuum regulator before it reaches the chlorinators ("
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4760,
      "SummaryText": "located in an enclosed room).  At the chlorinators, the process feed rates can be monitored and changed by operators via the SCADA system or by manual operation.  Piping then proceeds to another underground duct bank to the Gatehouse Building where chlorine gas is injected into the water system by ejectors.\n   \nC. Hazard assessment, including administrative controls and mitigation measures to limit the distances\nThe worst case scenario is considered a failure of the entire contents of a one-ton chlorine container.  The distance to the endpoint is 1.3 miles.  The most likely alternative scenario would be a break in a flexible connector.  The distance to the endpoint is 0.4 miles.  These results do not consider the storage building as a passive mitigation measure because it is has exhaust fans that ventilate the air to the outside.  However, in the event of a accidental chemical release, the building would still considerably limit the release to the outside air and thus, limit the distance to endpoint.     \n\nChlorine deliveries are scheduled to ensure that the facility never exceeds its maximum intended inventory.  All chlorine is stored inside the Chlorine Storage Building and SCADA monitored leak detectors specifically designed to monitor chlorine gas are located in all three buildings on site.\n\nD. General accidental release prevention program & prevention steps\nEPA established three tiers of requirements (Program 1, 2, and 3).  The Norumbega Chemical Feed Facility qualifies for Program 2.  Therefore, our prevention program must include process safety information, process hazard analysis, operating procedures, training, incident investigation, and compliance audits.\n\nE. Five-year accident history\nIn the last five years, the Norumbega Chemical Feed Facility has not had any accidental releases that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4760,
      "SummaryText": " damage.\n \nF. Emergency response program\nThe emergency response program includes an emergency response plan, training, equipment testing, and conducting incident investigations to identify lessons learned and areas for improvement.  Waterworks has developed an Integrated Contingency Plan for the Norumbega Chemical Feed Facility.  The plan includes notification procedures, roles and responsibilities, ICS incident management procedures, resource lists and other relevant items. It has been distributed to the Weston Local Emergency Planning Committee and the State Emergency Response Commission.  \n\nG.Planned changes to improve safety\nFollowing the hazard review, key SOPs were rewritten and staff retrained on process safety and emergency response.  PPE procedures were also revised and strengthened.  Waterworks Operations has also installed a weather station at another 24hour staffed and SCADA monitored facility as an interim measure.  An additional weather station will be installed at the Norumbega Chemical Feed Facility during the summer of 1999 and connected to the MWRA SCADA system.  This will provide staff with instantaneous weather data in the event of a release.  This weather data can then be placed into the chemical release modeling software, Aerial Locations of Hazardous Atmospheres (ALOHA).  ALOHA helps to determine the potential plume of a hazardous chemical release and thus can help town authorities in determining evacuation routes."
    }
  ]
}