{
  "FacilityID": 4761,
  "FacilityName": "Wausau-Mosinee Paper Corporation- Rhinelander Mill",
  "FacilityStr1": "515 West Davenport Street",
  "FacilityStr2": null,
  "FacilityCity": "Rhinelander",
  "FacilityState": "WI",
  "FacilityZipCode": "54501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55085",
  "LEPC": "Oneida County Emergency Gov't",
  "FacilityLatDecDegs": "45.638056",
  "FacilityLongDecDegs": "-89.419167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 391130910,
  "ParentCompanyName": "Wausau-Mosinee Paper Corporation",
  "Company2Name": "NA",
  "CompanyDUNS": 6135792,
  "Company2DUNS": 0,
  "OperatorName": "Wausau-Mosinee Paper Corporation",
  "OperatorStr1": "515 West Davenport Street",
  "OperatorStr2": null,
  "OperatorCity": "Rhinelander",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54501",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jerome Neis",
  "RMPTitle": "Manager of Environmental Control",
  "FTE": 650,
  "OtherEPAFacilityID": "54507RHNLN515WE",
  "EPAFacilityID": "100000059704",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "Applied For",
  "SafetyInspectionDate": "1999-05-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-10-19 00:00:00",
  "DeRegistrationEffectiveDate": "2017-10-06 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 45.63806,
  "FRS_Long": -89.41917,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5535,
      "AltID": "Process Water Treatment",
      "FacilityID": 4761,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5651,
          "ProcessID": 5535,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5949,
          "ProcessID": 5535,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505949,
          "ProcessID": 5535,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 5536,
      "AltID": "Yeast Processing",
      "FacilityID": 4761,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5652,
          "ProcessID": 5536,
          "NAICSCode": "31111",
          "_desc": {
            "NAICS_CODE": "31111",
            "NAICS_DESCRIPTION": "Animal Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 5950,
          "ProcessID": 5536,
          "ChemicalID": 56,
          "Quantity": 64000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 505950,
          "ProcessID": 5536,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4761,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION PROGRAM RISK MANAGEMENT PLAN FOR:\nWAUSAU-MOSINEE PAPER CORPORATION\nRHINELANDER, WISCONSIN FACILITY\nCOVERED PROCESS: PAPER MANUFACTURING\n\nEXECUTIVE SUMMARY\n\nINTRODUCTION\n\nThe Wausau-Mosinee-Rhinelander, Wisconsin facility is a manufacturer of technical specialty papers.  The nonintegrated mill concentrates on the production of release backing paper and other specialty papers for food packaging and medical applications.  \n\nLake States, a division of Wausau-Mosinee, shares facilities with the Wausau-Mosinee paper manufacturing mill in Rhinelander, Wisconsin.  Lake States is a producer of Torulla yeast.  Following drying and packaging, the yeast is sold.\n\nThis facility is subject to the requirements of 40 CFR 68 Program 3.  Processes conducted onsite require the use of two regulated toxic substances, ammonia and chlorine, in amounts exceeding the respective threshold quantities.  Chlorine is used at the onsite industrial wastewater treatment plant to disinfect process waters.  Anhydrous ammonia is used as Lake States nutrient source in yeast production.  Regulated quantities of flammable substances are not stored at the facility. \n \nRELEASE PREVENTION AND EMERGENCY RESPONSE POLICY\n\nWausau-Mosinee is committed to managing and operating the facility in accordance with pertinent regulations and good operating practices to ensure minimization of the risk of an accidental release of a regulated substance from the paper manufacturing process.  If an accidental release were to occur, Wausau-Mosinee has response measures in place to minimize the release impact. \n\nWORST-CASE RELEASE SCENARIO ANALYSIS\n\nThe worst-case release scenario incorporated the following:\n\nAt the time of this writing, Wausau-Mosinee used the latest available version of USEPA's RMP*Comp software to estimate distances to the toxic endpoints for the two regulated toxic substances stored onsite, ammonia and chlorine.  Wausau-Mosinee does not have regulated flammable substances in e"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4761,
      "SummaryText": "xcess of the threshold quantity onsite.\n\nFor the worst-case ammonia release, the entire contents (64,000 lbs) of the largest ammonia-containing vessel were released.  The worst-case chlorine release consisted of the release of the entire contents of the largest single vessel (2,000 lbs).  The meteorological conditions and model parameters used in RMP*Comp consisted of:\n\n- Atmospheric stability class F;\n- Wind speed of 1.5 meters/second;\n-    Relative humidity of 50 percent;\n-    Ambient temperature of 25o C; and\n-    Urban topography.\n\nPassive mitigation measures were not included in the ammonia worst-case analysis since passive mitigation measures for ammonia are not utilized at the mill.  Since the chlorine cylinders are contained within a roofed shed (three sides steel, 1-side chain link fence), passive mitigation measures were considered.  Within RMP*Comp, the chlorine release was modeled in an enclosed space, in direct contact with outside air.\n\nThe distances to the ammonia and chlorine toxic endpoints are 2.8 miles and 0.9 miles respectively.  The toxic endpoint for ammonia is 0.14 mg/L and 0.0087 mg/L for chlorine.  Both toxic endpoints go offsite.  Since ammonia has the furthest toxic endpoint, it was used in RMP*SUBMIT for the worst case scenario. \n \nALTERNATE RELEASE SCENARIO ANALYSIS\n\nAmmonia and chlorine were each analyzed for the alternate release scenario.  USEPA's RMP*Comp software was used to estimate the toxic endpoints for the alternate scenarios for Wausau-Mosinee processes.\n\nThe meteorological conditions and model parameters used in RMP*Comp consisted of:\n\n-Atmospheric stability class D;\n-Wind speed of 3 meters/second;\n-Relative humidity of 50 percent;\n-Ambient temperature of 25o C; and\n-Urban topography.\n\nAnhydrous Ammonia Alternate Release Scenario\nThe anhydrous ammonia alternate release consisted of an ammonia truck pulling away from the ammonia tank while still attached to the ammonia tank fill pipe.  This action essentially produces a hole in the liq"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4761,
      "SummaryText": "uid space of the tank that is two inches in diameter.  The height of the liquid column above the hole is 7.25 feet.  The release rate of ammonia due to this action is 7,570 lbs/minute as calculated with RMP*Comp.  This distance to the ammonia toxic endpoint of 0.14 mg/L is 0.5 miles.  No active or passive mitigation measures were in place. \n\nChlorine Alternate Release Scenario\nThe chlorine alternate release consisted of a truck backing into the rotameter causing it to break off.  This action essentially causes a release of chlorine from a pipe at a rate of 3,600 lbs/minute as calculated with RMP*Comp. This distance to the chlorine toxic endpoint of 0.0087 mg/L is 0.6 miles.  Since the chlorine cylinders are contained within a roofed shed, passive mitigation measures were considered.  Within RMP*Comp, the chlorine release was modeled in an enclosed space, in direct contact with outside air.\n\n\nRELEASE PREVENTION PROGRAM\n\nIn January 1998, Wausau-Mosinee performed a process hazard analysis (PHA) in order to identify potential hazards at the facility.  Wausau-Mosinee has several process controls in use such as sight gauges, secondary containment structures, relief valves, check valves, and response procedures in place in the event of a release.   \n\nWausau-Mosinee has developed a set of operating procedures that are contained within the Process Safety Management Program. These procedures are reviewed on an annual basis to maintain current and accurate instructions.  \n \nWausau-Mosinee has developed a training plan to attempt to ensure that employees are knowledgeable in facility operations and to reduce the risk of accident both during normal operations and emergencies.  The procedures currently in place are designed to satisfy the requirements of 29 C.F.R. 1910.119 and OSHA Process Safety Management (PSM/RMP) regulations.  They will also satisfy the requirements of the Risk Management Plan (RMP) regulations. \n\nWritten procedures are in place to maintain the mechanical int"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4761,
      "SummaryText": "egrity of the process equipment. This includes preventive maintenance and inspection procedures, the frequency of such procedures, inspection responsibility, and guidance documents for these procedures.\n\nWausau-Mosinee's protocol for Management of Change in Procedure has been incorporated as part of the Process Safety Management Program.  Wausau-Mosinee has implemented this procedure to help ensure that changes are properly reviewed and that hazards introduced by the implementation of change are identified and controlled prior to placing the change in operation.\n\nWausau-Mosinee has implemented a pre-startup safety review, incorporated in the Process Safety Management Program, to help ensure that certain important considerations have been addressed.  This helps ensure that adequate safety measures are in place and are operational and that other aspects of the PSM/RMP program are updated and implemented as needed.  This procedure, in conjunction with other PSM/RMP program elements, is intended to satisfy the requirements of 29 CFR 1910.119 and 40 CFR 68.\n\nCompliance audits are a crucial component of the RMP program and will provide management with information on the success of the program and on areas that need improvement.  Audits are conducted annually under the PSM/RMP Program to ensure that the procedures and practices developed under the RMP standards are being followed.\n\nWausau-Mosinee has incorporated an incident investigation procedure, as required by the RMP standard, for incidents involving covered processes.  The purpose of the RMP incident investigation requirement is to ensure that incidents involving regulated toxic substances are investigated; that recommendations for preventing a reoccurrence are identified and implemented; and that appropriate personnel are briefed on the causes of each incident.\n\nWausau-Mosinee has instituted an employee participation plan in the development of PSM/RMP programs for regulated hazardous processes.  The management has i"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4761,
      "SummaryText": "mplemented this plan in an effort to ensure that employees who may be potentially affected by process operations have knowledge of and access to information relative to the process.  This procedure is intended to outline the employee's participation/responsibilities within the scope of Wausau-Mosinee's PSM/RMP program, and to satisfy the requirements of 29 CFR 1910.119 and 40 CFR 68.\n\nWausau-Mosinee has implemented a Contractor Safety Policy to insure that contractors comply with the Occupational Safety and Health requirements and implement an effective industrial safety program for work at the Wausau-Mosinee-Rhinelander, Wisconsin facility.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThere have been no known accidental releases from covered processes at Wausau-Mosinee's Rhinelander, Wisconsin facility which resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injures, evacuations, sheltering in place, property damage, or environmental damage. \n\nEMERGENCY RESPONSE PROGRAM\n\nWausau-Mosinee has developed an emergency response program that contains procedures:\n\n1) for informing the public and local emergency response agencies about an accidental release;\n2) that document first-aid and emergency medical treatment to treat human exposures;\n3) for emergency response after an accidental release of a regulated substance;\n4) for the use of emergency response equipment and for its inspection, testing and maintenance;\n5) for training for all employees in relevant procedures; and \n6) for emergency response plan review and update. \n\nWausau-Mosinee employees receive annual emergency training specific to their required response roles.  In addition, the Fire Brigade conducts annual fire fighting and chemical spill response drills.  \n\nIn the event of an emergency, the Rhinelander Mill has an audible alarm system for notifying facility personnel.  Local emergency responders will be contacted by the Emergency Response Coordinator or delegate as needed.  In a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 4761,
      "SummaryText": "ddition, the Emergency Response Coordinator is responsible for contacting the appropriate Wausau-Mosinee spokesperson to manage public notification.\n\nCHANGES TO IMPROVE SAFETY\n\nWausau-Mosinee has developed a set of operating procedures that are contained within the Process Safety Management Program.  The PSM Program Manual documents procedures for covered processes.  These procedures are reviewed on an annual basis to maintain current and accurate instructions.  Wausau-Mosinee has developed a training plan to attempt to ensure that employees are knowledgeable in facility operations and to reduce the risk of accidents both during normal operations and emergencies.  Up to date and accurate instruction and continued employee training procedures will aid in future facility safety."
    }
  ]
}