{
  "FacilityID": 47691,
  "FacilityName": "Tropicana Manufacturing Company, Inc.",
  "FacilityStr1": "6500 Glades Cut-Off Road",
  "FacilityStr2": null,
  "FacilityCity": "Fort Pierce",
  "FacilityState": "FL",
  "FacilityZipCode": "34981",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12111",
  "LEPC": "District 10 LEPC",
  "FacilityLatDecDegs": "27.380000",
  "FacilityLongDecDegs": "-080.392778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "OT",
  "FacilityURL": "www.tropicana.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 78452836,
  "ParentCompanyName": "PepsiCo Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1287762,
  "Company2DUNS": 0,
  "OperatorName": "Tropicana Manufacturing Company",
  "OperatorStr1": "6500 Glades Cut-Off Road",
  "OperatorStr2": null,
  "OperatorCity": "Fort Pierce",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "34981",
  "OperatorZipCodeExt": null,
  "RMPContact": "Richard Coyle",
  "RMPTitle": "Plant Manager",
  "FTE": 375,
  "OtherEPAFacilityID": "33482TRPCN6500G",
  "EPAFacilityID": "100000107118",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "111004-002-AV",
  "SafetyInspectionDate": "2004-03-08 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Fort Pierce",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-02-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-02-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-02-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 27.36001,
  "FRS_Long": -80.40862,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 69140,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 47691,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 70780,
          "ProcessID": 69140,
          "NAICSCode": "311411",
          "_desc": {
            "NAICS_CODE": "311411",
            "NAICS_DESCRIPTION": "Frozen Fruit, Juice, and Vegetable Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 91925,
          "ProcessID": 69140,
          "ChemicalID": 56,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 591925,
          "ProcessID": 69140,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 47691,
      "SummaryText": "Tropicana Manufacturing Company, Inc., Ft. Pierce (Tropicana) maintains a strong commitment to protecting both the worker and the surrounding community from any type of hazardous incident that could potentially occur at its facility.  For this purpose Tropicana has developed facility procedures that apply to both daily operations and emergency response situations, in the form of a Risk Management Program, developed and implemented specifically for the Ft. Pierce facility.  The facility risk management program has been developed in accordance with federal (EPA's Risk Management Program, 40 CFR 68) and state (Florida Department of Community Affairs Accidental Release Program) requirements.\n\nTropicana is in Ft. Pierce, St. Lucie County, Florida, situated on, approximately, 315 acres of property.   The plant was originally built in 1973.  The facility is a citrus processing plant producing citrus juices and concentrate, d'limonene and animal feed. \n\nTropicana chilled juices require constant refrigeration to maintain their high quality and freshness.  Refrigeration at the facility is provided by an anhydrous ammonia system.  Ammonia, a regulated substance, is used instead of other refrigerants because ammonia has several advantages over the available alternatives.  Ammonia is a very energy efficient refrigerant, does not cause damage to the ozone, and is one of the most widely used industrial chemicals.  \n\nTropicana complies with OSHA's Process Safety Management (PSM) standards (29 CFR 1910.119), incorporating technology, procedures, and management practices into a comprehensive program that effectively minimizes the potential for hazardous chemical releases.  In addition to mitigation systems (automatic shut-off valves, high pressure relief valves, level alarms, barricades, monitoring/detection systems) engineered into the refrigeration system, Tropicana promotes safety in the operation of the ammonia system, by the following PSM program elements:\n\n1. Involving employee"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 47691,
      "SummaryText": "s in various aspects of program development and implementation;\n2. Maintenance of updated process information, accessible to all employees;\n3. Completion of a process hazard analysis (PHA) that identifies any hazards associated with deviation from normal operating conditions;\n4. Development and implementation of standard operating procedures (SOPs);\n5. Use of safe work practices in all aspects of process operation;\n6. Personnel training;\n7. Contractor safety program;\n8. Pre-startup safety reviews prior to introduction of ammonia into the system;\n9. Comprehensive inspection and maintenance program;\n10. In-depth reviews of any significant changes in the ammonia system; \n11. Investigation of any accidents or near misses, identifying any modifications that could prevent similar incidents in the future;\n12. Internal audits, identifying any areas of program noncompliance and corrective actions required.\n \nThere have been no accidents in the last five years, or in the history of the Tropicana, Ft. Pierce facility, from the ammonia refrigeration system that have resulted in deaths, injuries, or significant property damage on-site; or, off-site deaths, injuries, evacuation, sheltering in place, property damage, or environmental damage.  \n \nThe Tropicana on-site emergency response program entails the organization of a trained emergency response team, capable of implementing established response procedures.  These procedures include response as a stand-alone response unit (on-site personnel only), or in conjunction with off-site authorities.  The facility utilizes the Incident Command System for all response activities, as outlined in the current facility Emergency Response Plan.  On-site capabilities include responses to fires; non-consequential ammonia releases (such as normal operating losses and small, non-impacting sudden occurrences, etc); hazardous material spills; product (juice) releases;  confined space and high angle rescue, first responder medical assistance; bomb "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 47691,
      "SummaryText": "threats; and, workplace violence events. \n \nAn emergency response plan, updated at least annually, outlines the emergency response management system on-site, providing basic facility information (e.g., operations layout and description), essential response organization and procedures (e.g., on-site personnel and off-site agency information,  organizational structure, evacuation and response procedures, etc.) and site specific supporting information (e.g., drawings, chemical information, detail procedures descriptions, etc.).  Tropicana developed an Integrated Contingency Plan (ICP) in 1999 to replace the existing emergency response plan, formatted to follow EPA's Integrated Contingency Plan Guidance.  The ICP provides a single plan that insures emergency preparedness through logistical planning and coordination between facility personnel and local emergency response personnel. \n\nAll aspects of Tropicana's emergency response planning are developed in coordination with appropriate state and local agencies responsible for emergency response management.  Tropicana has made arrangements for coordination of emergency response activities with these agencies, as well as with additional service organizations such as hospitals, health clinics, and pre-approved contractors.\n\nTropicana's on-site Emergency Response Team, comprised of approximately 40  members, represents expertise in environmental operations, security, safety, and refrigeration.  All working shifts have representatives on the emergency response team, to facilitate on-site response to any incident 24 hours per day, 7 days per week.  Most members also carry pagers for immediate notification.  All emergency response team members are trained in emergency response, capable of responding aggressively to a release of a hazardous material, while donning full protective gear (i.e., Self Contained Breathing Apparatus).  All team members have completed and initial training course either 24 or 40 hours in length, in additio"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 47691,
      "SummaryText": "n to completing an 8 hour refresher course, annually.  Additionally, all team members are required to maintain a complete working knowledge of the most current facility emergency response plan.\n\nTropicana was awarded MERIT status in 1994, and STAR status in 1998, in accordance with OSHA's Voluntary Protection Program.  Star status is only given to those facilities that consistently demonstrate excellence in safety and exceed regulatory requirements for maintaining a safe operation.  As a result of this status, Tropicana continually strives to maintain the highest quality safety program possible.  This includes evaluations of existing programs relative to any changes in facility operations, as well as recommendations that arise from incidents, such as injuries or near misses. Since all measures identified have already been implemented to date there are no current planned changes to further improve safety at the facility.\n\nTropicana has, and will continue to be, an industry leader in assuring the proper and safe operation of its ammonia refrigeration system.  This leadership is exemplified by Tropicana employees at all organizational levels and is the basis for the company's commitment to maintaining a comprehensive risk management program, minimizing the potential for accidental releases."
    }
  ]
}