{
  "FacilityID": 4776,
  "FacilityName": "Consolidated Papers, Inc. - Stevens Point Division",
  "FacilityStr1": "707 Arlington Place",
  "FacilityStr2": null,
  "FacilityCity": "Stevens Point",
  "FacilityState": "WI",
  "FacilityZipCode": "54481",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55097",
  "LEPC": "Portage County LEPC",
  "FacilityLatDecDegs": "44.515278",
  "FacilityLongDecDegs": "-89.585",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.consolidatedpapers.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6137756,
  "ParentCompanyName": "Consolidated Papers, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6130777,
  "Company2DUNS": null,
  "OperatorName": "Consolidated Papers, Inc.",
  "OperatorStr1": "231 First Avenue North",
  "OperatorStr2": null,
  "OperatorCity": "Wisconsin Rapids",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54495",
  "OperatorZipCodeExt": null,
  "FTE": 384,
  "OtherEPAFacilityID": "54481CNSLD707AR",
  "EPAFacilityID": "100000059928",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-07 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Aqueous Ammonia, Chlorine (General Duty)",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-05-05 00:00:00",
  "DeRegistrationEffectiveDate": "2004-03-20 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 44.51942,
  "FRS_Long": -89.58392,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5555,
      "AltID": null,
      "FacilityID": 4776,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 5969,
          "ProcessID": 5555,
          "ChemicalID": 57,
          "Quantity": 27000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5672,
          "ProcessID": 5555,
          "NAICSCode": "322121",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4776,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-01 00:00:00",
    "ERTrainingDate": "1999-08-31 00:00:00",
    "CoordinatingAgencyName": "Plover Fire Dept. HAZMAT Team",
    "CoordinatingAgencyPhone": "7153455310",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4776,
      "SummaryText": "Consolidated Papers, Inc. (CPI) is committed to operating in a manner that is safe for CPI workers, the public, and the environment.  As part of this commitment, CPI has established procedures to help ensure safe operation of the processes at its facilities.  CPI's Stevens Point Division (SPD) has developed a risk management program (RMP) that complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40 CFR Part 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule) and helps to manage the risks of the covered substances and processes.  One of the requirements of the RMP rule is to submit a risk management plan describing the risk management program at SPD.  This document is intended to satisfy the risk management plan requirements of the RMP rule.\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIn April 1967, CPI adopted a corporate environmental policy that guides the continuous improvement of its environmental performance as it strives to prevent pollution and achieve the objective of operating facilities with minimal environmental impact.  This policy was updated in November 1996.  The corporate environmental policy statement is publicly available on CPI's Internet website.  As part of its risk reduction objective, CPI will strive to minimize environmental, health, and safety risks to its employees and the communities in which it operates by employing safe technologies and operating procedures.  CPI will be constantly prepared for emergencies.  CPI will continually inform its employees and public of its progress in safety and environmental issues.  \n\nCPI is one of 26 Wisconsin paper companies voluntarily participating in the Wisconsin Paper Council's Pollution Prevention Partnership with the Wisconsin Department of Natural Resources.  As part of this membership, CPI produces an annual report that illustrates CPI and the Wisconsin paper industry's commitment to voluntarily reduce t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4776,
      "SummaryText": "he release of substances that could have adverse environmental impacts.  CPI's Pollution Prevention Partnership Progress Report is available to the public.  \n\nCPI has also pledged to voluntarily align its corporate Environmental Management System to ISO 14001 international standards and to adhere to the American Forest and Paper Association's Environmental Health and Safety Principles.\n\n\nFACILITY DESCRIPTION AND THE REGULATED SUBSTANCES HANDLED\n\nCPI is North America's largest producer of coated printing papers and a major manufacturer of supercalendered printing papers for the printing and publishing industries.  In addition, CPI is the leading manufacturer of coated specialty papers used in consumer product packaging and labeling.  CPI also produces elemental chlorine-free kraft pulp for its own use from virgin wood fiber and recycled pulp from printed and post-consumer wastepaper.  Other products manufactured by CPI include paperboard and paperboard products.\n\nCPI is headquartered in Wisconsin Rapids, Wisconsin.  It owns and operates paper and pulp manufacturing facilities in Biron, Kimberly, Appleton, Niagara, Stevens Point, Whiting, and Wisconsin Rapids, Wisconsin, as well as in Duluth, Minnesota.  It also operates wastewater treatment plants in Stevens Point, Niagara, Kimberly, and Wisconsin Rapids, Wisconsin to treat wastewater generated by the pulp and paper manufacturing plants.  Wastewater treatment is also done at the facilities in Duluth, Minnesota.\n\nSPD is a paper mill owned and operated by CPI in Stevens Point, Wisconsin.  This facility manufactures coated specialty paper used for consumer product packaging and labeling, gift wrap, bar code labels, and pressure-sensitive release papers.\n\nAmmonia (with a concentration of 20% or greater) is the chemical regulated by the RMP rule that is stored or handled at this facility with a concentration greater than or equal to the concentration de minimis level.  Propane is also stored at this facility.  However, a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4776,
      "SummaryText": "RMP addressing propane is not being submitted at this time due to the EPA's temporary stay.  Chlorine is also stored at the SPD; however, the total quantity of chlorine at this facility is below the RMP threshold.  Less than 1,500 lb of chlorine are stored at the SPD.  Therefore, the SPD's chlorination process, which uses chlorine, is subject only to the General Duty clause of the RMP rule.\n\nThe aqueous ammonia is stored in a horizontal aboveground tank with a design capacity of 13,000 gallons.  The ammonia solution has a concentration of 29% by weight ammonia.  The amount of ammonia in the solution is 27,360 lb.  A dike that is capable of holding the entire tank contents surrounds the storage tank.  Aqueous ammonia is a toxic liquid and is used as a nutrient for the wastewater treatment plant micro-organisms.\n\n\nWORST-CASE RELEASE AND ALTERNATIVE RELEASE SCENARIOS\n\nWorst-Case Release Scenario\n\nThe worst-case release scenario for ammonia is defined as the rupture of the aqueous ammonia storage tank, instantaneously releasing its entire contents directly to the surrounding ground.  The tank stores approximately 96,780 lb (13,000 gallons) of aqueous ammonia.  The aqueous ammonia has a concentration of 29% by weight ammonia, which equates to 27,360 lb of ammonia.  A dike capable of holding the entire tank contents surrounds the aqueous ammonia tank.  The dike limits the exposed surface area of the spill, thus reducing the release rate into the atmosphere.  This scenario was modeled using a chemical specific evaporation model to calculate the release rate and the SLAB dispersion model to predict the toxic endpoint.  The worst-case release of ammonia is predicted to have no offsite impact on public or environmental receptors.\n\nAlternative Release Scenario\n\nSince the worst-case release scenario for ammonia predicted no offsite impacts, an alternative release scenario for ammonia is not required.\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTI"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4776,
      "SummaryText": "ON STEPS\n\nAs part of its corporate environmental policy, CPI will continue to protect the environment and the health and well-being of fellow employees and communities by monitoring existing facilities to ensure that they meet all legal requirements through the use of safe technologies and operating procedures.\n\nThe Stevens Point Division complies with the prevention and emergency response procedures from all applicable regulations.\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThere have been no accidents at the Stevens Point Division in the past five years that resulted in any adverse onsite or offsite impacts.\n\n\nEMERGENCY RESPONSE PROGRAM\n\nCPI has a Corporate Spill Reporting Policy that addresses the notification requirements in the event of an accidental release.  The Corporate Spill Reporting Policy also identifies contacts and notification responsibilities.\n\nSPD has written emergency response procedures to respond to accidental releases of hazardous substances.  In addition to SPD's Emergency Response/ HAZMAT Plan, the facility also has an agreement with the Plover Fire Department HAZMAT team to respond to accidental releases at the facility.  SPD has also entered into an agreement with Superior for spill response and recovery on a 24-hour basis.\n\n\nPLANNED CHANGES FOR SAFETY IMPROVEMENTS\n\nThis facility will undergo regular scheduled maintenance and update to meet any new or revised applicable regulation and industry standard to continue to operate safely.  The total quantity of chlorine stored or handled at the Stevens Point Division was voluntarily reduced from 4,000 lb to less than 1,500 lb."
    }
  ]
}