{
  "FacilityID": 47865,
  "FacilityName": "The Fuller Brush Company",
  "FacilityStr1": "One Fuller Way",
  "FacilityStr2": null,
  "FacilityCity": "Great Bend",
  "FacilityState": "KS",
  "FacilityZipCode": "67530",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20009",
  "LEPC": "Barton LEPC",
  "FacilityLatDecDegs": "38.358056",
  "FacilityLongDecDegs": "-098.850833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "http:www.fuller.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 602089161,
  "ParentCompanyName": "CPAC, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Brady Gros",
  "OperatorStr1": "One Fuller Way",
  "OperatorStr2": null,
  "OperatorCity": "Great Bend",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67530",
  "OperatorZipCodeExt": null,
  "RMPContact": "Lewis Gray",
  "RMPTitle": "Vice Pres., Research & Development",
  "FTE": 300,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000137853",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "Kansas 0090006",
  "SafetyInspectionDate": "1995-11-06 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Aerosol filling process",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-03-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-03-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-03-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-03-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 38.35952,
  "FRS_Long": -98.85044,
  "FRS_Description": "POTENTIAL CONTAMINANT SOURCE",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 69411,
      "AltID": "Aerosol Production",
      "FacilityID": 47865,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 71058,
          "ProcessID": 69411,
          "NAICSCode": "325611",
          "_desc": {
            "NAICS_CODE": "325611",
            "NAICS_DESCRIPTION": "Soap and Other Detergent Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 92312,
          "ProcessID": 69411,
          "ChemicalID": 98,
          "Quantity": 33837.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 92313,
          "ProcessID": 69411,
          "ChemicalID": 107,
          "Quantity": 56520.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 107,
            "ChemicalName": "Isobutane  [Propane, 2-methyl]",
            "CASNumber": "75-28-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 592312,
          "ProcessID": 69411,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 592313,
          "ProcessID": 69411,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 69412,
      "AltID": "Formaldehyde",
      "FacilityID": 47865,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 71059,
          "ProcessID": 69412,
          "NAICSCode": "325611",
          "_desc": {
            "NAICS_CODE": "325611",
            "NAICS_DESCRIPTION": "Soap and Other Detergent Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 92314,
          "ProcessID": 69412,
          "ChemicalID": 1,
          "Quantity": 45000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 592314,
          "ProcessID": 69412,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 47865,
      "SummaryText": "The Fuller Brush Company Risk Management Program\nExecutive Summary, January, 2007\n\nA. Accidental Release Prevention and Emergency Response Policies\nThe Fuller Brush Company staff and management are strongly committed to employee, public and environmental safety. This commitment includes a comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. Unforeseeably, if such a release does occur, we are completely coordinated with The Great Bend Fire Department which provides highly trained emergency response personnel to control and mitigate the effects of the release.\n\nB. The Stationary Source and the Regulated Substances Handled\nThe Fuller Brush facility?s primary activities encompass production of brooms, mops, brushes, and cleaners. There are 3 regulated substances present. These substances are Isobutane (Propane, 2-methyl), Propane, and Formaldehyde 37%. Isobutane and Propane are used in production of aerosols, and Formaldehyde is used in production of portable wastewater tank deodorizer products.\n\nC. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nThe facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CCFR part 68 EPA regulations. The following sections briefly describe the elements of the release prevention program that are in place at the Fuller Brush facility.\n\nProcess Safety Information\nThe Fuller Brush Company maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with the aerosol filling process.\n\nProcess Hazard Analysis\nFuller conducts comprehensive studies to ensure that hazards associated with our process are ide"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 47865,
      "SummaryText": "ntified and controlled efficiently. The methodologies used to carry out these analyses are What If/Checklist, HAZOP and Failure Mode and Effects Analysis. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated biannually. Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nThe Fuller Brush Company maintains written operating procedures to safely conduct activities within our covered processes. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations and normal shutdown. The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nThe Fuller Brush Company has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. Refresher training is provided at least biannually and more frequently as needed. \n\nMechanical Integrity\nThe Fuller Brush Company carries out highly documented maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Qualified personnel carry out maintenance operations with previous training in maintenance practices. Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance checks are correct in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at The Fuller Brush Company to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel and any other employee whose job tasks are affected by a modification in process conditions are prom"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 47865,
      "SummaryText": "ptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-startup safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at The Fuller Brush Company. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nThe Fuller Brush Company Conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nThe Fuller Brush Company promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nThe Fuller Brush Company truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility?s implementation of the RMP rule, including information resulting from process hard analyses in particular.\n\nContractors\nOccasionally, The Fuller Brush Company hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. The Fuller Brush Company has a strict policy of informing the contractors of known potential hazards related to the contractor?s wor"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 47865,
      "SummaryText": "k and the processes. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\nD. Five year Accident History\nThe Fuller Brush Company has had an excellent record of preventing accidental releases. Due to our stringent release prevention policies, there has been no accidental release during this period.\n\nE. Emergency Response Plan\nThe Fuller Brush Company carries a written emergency response plan, number 70.007, to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nOur emergency plan has been coordinated and verified with the Barton County LEPC.\n\nF. Planned Changes to Improve Safety\nNo new developments or findings have resulted from the implementation of the various elements of our accidental release prevention program. However, we previously implemented a Process Safety Management program, which includes most of the same elements of the Risk Management Program. In the course of implementing Process Safety Management, several developments and findings resulted in changes which improved safety at the facility. Some of the improvements that arose from the Process Safety Management program are:\n    Improved ventilation\n    Improved electronic monitoring for explosive conditions\n    Improved employee safety awareness and training\n\nG. Certification Statement\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is tru"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 47865,
      "SummaryText": "e, accurate and complete.\n\nName:        Brady Gros                Title:        Chief Operating Officer\n\nSignature    ______________________        Date signed:    ______________________"
    }
  ]
}