{
  "FacilityID": 4798,
  "FacilityName": "Copperhead Chemical Company Inc",
  "FacilityStr1": "2 River Road",
  "FacilityStr2": null,
  "FacilityCity": "Tamaqua",
  "FacilityState": "PA",
  "FacilityZipCode": "18252",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42107",
  "LEPC": "Schuylkill County LEPC",
  "FacilityLatDecDegs": "40.735556",
  "FacilityLongDecDegs": "75.985556",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 799867221,
  "ParentCompanyName": "Welland Chemical LTD",
  "Company2Name": null,
  "CompanyDUNS": 204120976,
  "Company2DUNS": 0,
  "OperatorName": "Copperhead Chemical Company Inc.",
  "OperatorStr1": "2 River Road",
  "OperatorStr2": null,
  "OperatorCity": "Tamaqua",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "18252",
  "OperatorZipCodeExt": null,
  "RMPContact": "V.L. (Vic) Mudie",
  "RMPTitle": "Vice President and General Manager",
  "FTE": 36,
  "OtherEPAFacilityID": "PAR000030874",
  "EPAFacilityID": "100000052195",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-24 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 40.73028,
  "FRS_Long": -75.98361,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5583,
      "AltID": "Mixed Acid",
      "FacilityID": 4798,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5701,
          "ProcessID": 5583,
          "NAICSCode": "325412",
          "_desc": {
            "NAICS_CODE": "325412",
            "NAICS_DESCRIPTION": "Pharmaceutical Preparation Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 5702,
          "ProcessID": 5583,
          "NAICSCode": "325998",
          "_desc": {
            "NAICS_CODE": "325998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6025,
          "ProcessID": 5583,
          "ChemicalID": 58,
          "Quantity": 59000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 58,
            "ChemicalName": "Nitric acid (conc 80% or greater)",
            "CASNumber": "7697-37-2",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506025,
          "ProcessID": 5583,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4798,
      "SummaryText": "The Copperhead Chemical Company Inc. facility at 2 River Road, Tamaqua, Pennsylvania manufactures nitroglycerin for use in various pharmaceutical blends and propellants that are also manufactured at the facility.  The company employs 36 people at the facility in a union environment.  The property consists of 875 acres in Walker Township in Schuylkill County, Pennsylvania.  Facility boundaries include Oak Ridge Hunting Club to the West, Pennsylvania Game Land and private residences to the north and the Little Schuylkill River to the east and south.\n\nThe only regulated substance handled above the Risk Management Program (RMP) threshold quantity at the facility is nitric acid in a mixture with sulfuric acid.  Pure nitric acid is 52% of the mixture.  Pure sulfuric acid is 48% of the mixture.  The total amount of the mixed acid stored at the facility is 8,100 gallons (113,153 pounds) in an aboveground stainless steel tank.  Nitric acid constitutes a maximum of 58,840 pounds of the mixture in the tank.\n\nThe mixed acid is delivered via tank trucks to the storage tank where it is stored until needed in the nitration process at the facility. Nitroglycerin is produced in a batch nitrator by reacting pre-weighed glycerin with the mixed acid.  During the process the nitrator is chilled by a solution that is regulated by a refrigeration system.  Nitroglycerin is separated from spent acid and then washed with water in prewash tanks.  A drown tank is also available for emergency situations.  Reaction of the nitric acid in the nitrator is the last step in the process that uses the regulated substance.\n\nCopperhead Chemical Company is subject to the OSHA Process Safety Management (PSM) Standard in 29 CFR 1910.119 and maintains an existing PSM program for the manufacturing of nitroglycerin.  This program includes the following production areas at the facility: Nitration, Neutralizer, Mix & Pack, and Pharmaceutical Blending.  The mixed acid that is subject to RMP is part of the Nitrati"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4798,
      "SummaryText": "on Process that is included in PSM.  Many sections of the RMP have already been completed for the facility in the PSM program.\n\nCopperhead maintains a detailed emergency response plan in accordance with 29 CFR 1910.120 and 25 PA Code 264, Subchapter D (264.51 through 264.56).  The Project/EHS Engineer serves as facility coordinator and incident commander for implementation of the emergency response plan. Employees are trained to respond to minor accidental releases at the facility.  Copperhead maintains a contract with an off-site emergency responder for large scale environmental emergencies.  The plan is coordinated with the Schuylkill County LEPC and will be included in the community off-site release plan.\n\nThe worst case release, defined by the EPA as the release of the contents of the largest container, would be the release of the entire contents of the 8,100 gallon mixed acid tank.  This tank is located inside an earthen berm with a capacity of approximately 2,100 gallons.  Although the berm is not designed to contain the entire contents of the tank, it does provide some passive mitigation in the event of the worst case release.  The alternate case release scenario modeled was the release of 6,700 pounds of mixed acid, the amount used in one production batch, due to a piping rupture.  \n\nThe release scenarios were modeled using the EPA guidance document \"Offsite Consequence Analysis Guidance\".  For the worst case analysis the EPA specified conditions of 1.5 m/s wind speed, F stability class, and highest daily maximum temperature in the last three years were used.  Urban conditions apply because of the mountainous, wooded surroundings of the facility.  The toxic endpoint for nitric acid is 0.026 mg/l.  Modelling as a ten minute release, the distance to the toxic endpoint for the worst case release scenario is approximately 3.6 miles.  This would possibly affect the neighboring industrial facility, the Oak Ridge Hunting Club, state game lands, and public residence"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4798,
      "SummaryText": "s in surrounding communities.  The estimated population that could be affected is 2,200 people.\n\nFor the alternate release scenario a wind speed of 3 m/s, D stability class atmosphere, and a temperature of 25 0C were used per EPA guidance.  The alternate case modeled was the release of the amount of mixed acid used in one processing batch, 6700 pounds, due to a piping rupture.  The distance to endpoint for this case is 0.4 miles.  This would only possibly affect the neighboring industrial facility and a much smaller residential area. The estimated population that could be affected is 27 people.\n\nCopperhead Chemical Company has taken precautions to ensure that the off-site affects of releases of toxic chemicals are minimal.  Prevention measures include a comprehensive preventive maintenance program, detailed unloading procedures, daily inspections, extensive operator training, and pre-startup inspections for the nitration process.  The Copperhead PSM program includes the following sections that are in practice at the facility.  These procedures, in conjunction with the RMP support documentation, meet the requirements of the RMP Program 3 Prevention Program.\n\n7 Process Safety Information\n7 Process Hazard Review\n7 Operating Procedures\n7 Training\n7 Mechanical Integrity\n7 Compliance Audits\n7 Incident Investigation\n7 Management of Change\n7 Pre-Startup Review\n7 Contractors\n7 Employee Participation\n7 Hot Work Permits \n\nBecause of the prevention measures in place the occurrence of release scenarios that affect off-site receptors in highly unlikely.  In the event of the worst case release scenario, rupture of the mixed acid tank, the spill would be partially mitigated by an earthen berm.  Part of the spilled acid would soak into the ground both inside and outside of the bermed area.  This absorption is not accounted for in the modeling but should reduce the actual distance to the toxic endpoint in the event of the worst case release.  \nPlans are under way to replace the mixed"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4798,
      "SummaryText": " acid tank with a new tank with sufficient secondary containment for the contents of the vessel.  This would greatly reduce, if not eliminate, the number of off-site receptors affected by the worst case release scenario.\n\nThere have been no accidents involving the mixed acid at the facility in the last five years."
    }
  ]
}