{
  "FacilityID": 48051,
  "FacilityName": "Agri-Mark",
  "FacilityStr1": "869 Exchange Sreet",
  "FacilityStr2": null,
  "FacilityCity": "Middlebury",
  "FacilityState": "VT",
  "FacilityZipCode": "05753",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "50001",
  "LEPC": "Vermont District 8",
  "FacilityLatDecDegs": "44.031930",
  "FacilityLongDecDegs": "-073.172260",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G5",
  "LatLongDescription": "PG",
  "FacilityURL": "www.agrimark.net",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 166060368,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Agri-Mark",
  "OperatorStr1": "869 Exchange Sreet",
  "OperatorStr2": null,
  "OperatorCity": "Middlebury",
  "OperatorStateFIPS": "VT",
  "OperatorZipCode": "05753",
  "OperatorZipCodeExt": null,
  "FTE": 109,
  "OtherEPAFacilityID": "VTD020668174",
  "EPAFacilityID": "100000160274",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "AOP-99-014A",
  "SafetyInspectionDate": "2004-09-23 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2007-04-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-04-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2007-04-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-08-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 44.03105,
  "FRS_Long": -73.17078,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C05",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 69651,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 48051,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 92597,
          "ProcessID": 69651,
          "ChemicalID": 56,
          "Quantity": 12900.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 71307,
          "ProcessID": 69651,
          "NAICSCode": "311513",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 40901,
              "Process_NAICS_ID": 71307,
              "SafetyReviewDate": "2007-01-09 00:00:00",
              "PHA_Date": "2007-08-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-07-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Sprinkler systems in the coolers only",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2007-04-09 00:00:00",
              "TrainingReviewDate": "2007-01-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-07-21 00:00:00",
              "EquipmentInspectionDate": "2007-03-09 00:00:00",
              "EquipmentTested": "640 cooler area piping and valve stations",
              "ChangeMgmtDate": "2004-05-25 00:00:00",
              "ChangeMgmtReviewDate": "2004-05-25 00:00:00",
              "PreStartupReviewDate": "2004-05-26 00:00:00",
              "ComplianceAuditDate": "2005-06-24 00:00:00",
              "AuditCompletionDate": "2007-04-30 00:00:00",
              "IncidentInvestigationDate": "2007-02-26 00:00:00",
              "InvestigationChangeDate": "2007-04-30 00:00:00",
              "ParticipationPlansReviewDate": "2004-07-21 00:00:00",
              "HotWorkPermitReviewDate": "2007-04-09 00:00:00",
              "ContractorSafetyReviewDate": "2004-05-24 00:00:00",
              "ContractorSafetyEvalDate": "2007-04-09 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 59761,
                  "PreventionProgram3ID": 40901,
                  "ProcessChemicalID": 92597
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 48051,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2007-06-09 00:00:00",
    "ERTrainingDate": "2007-01-09 00:00:00",
    "CoordinatingAgencyName": "Addison County LEPC",
    "CoordinatingAgencyPhone": "8028774121",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48051,
      "SummaryText": "1.1 DISCUSSION\r\nIf a facility handles, manufactures, uses in a process or stores any of the toxic or flammable substances listed in 40 CFR 68.130 above the specified threshold quantities, the facility is required to develop and implement a Risk Management Program.  The Risk Management Program rule was issued and is administered by the U.S. Environmental Protection Agency (EPA). This rule, ¿Chemical Accident Prevention (CAP) Provisions¿ (Part 68 of Title 40 of the Code of Federal Regulations (CFR)), applies to a wide variety of facilities that handle, manufacture, store or use toxic and/or highly flammable substances.\r\nAgri-Mark stores 12,900 pounds of ammonia at their manufacturing facility on 869 Exchange Street in Middlebury, Vermont.  Agri-Mark is required to address the requirements of the CAP regulations because they exceed the 10,000 pound ammonia threshold. \r\nAgri-Mark owns and operates the Middlebury facility, which produces cheese and other dairy related products.  The purpose of the ammonia is as a heat transfer medium for the facility¿s refrigeration system.  A total of 12,900 pounds of ammonia is maintained in the closed loop refrigeration system.\r\nAgri-Mark is also subject to the Process Safety Management (PSM) standard under the Occupational Safety and Health Administration (OSHA) regulation 29 CFR 1910.119.  The State of Vermont has been delegated authority for OSHA compliance.  There are also a number of other chemicals used at the facility, which are addressed in Agri-Mark¿s EMERGENCY RESPONSE Plan.\r\nThe Risk Management Plan contains the policies and procedures used at Agri-Mark to assure continued compliance with the EPA CAP and OSHA PSM regulations.  Most of the documents that are part of the Risk Management Plan follow a standard format that includes the purpose, organization, responsibilities and authorities, as well as general instructions.  Section references are shown throughout this document in ALL CAPITAL LETTERS for reference purposes.\r\nM"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48051,
      "SummaryText": "ost procedures contain information on document control and filing.  Typically, documents are periodically revised through the procedures outlined in SECTION 9 - MANAGEMENT OF CHANGE.  \r\nAffected employees are encouraged to review the Risk Management Plan¿s policies and procedures.  The manual is available for review by employees at the facility.  Recommendations to improve the plan¿s accuracy or effectiveness in assuring employee, visitor and contractor safety can be directed to the Risk Management Planning Coordinator.\r\nThe goal of the Risk Management Plan is to prevent accidental releases of substances that can cause serious harm to the public and the environment from short-term exposures and to mitigate the severity of releases that do occur.  The 1990 Amendments to the Clean Air Act (CAA) required EPA to issue a rule specifying the type of actions to be taken by facilities to prevent accidental releases of hazardous chemicals into the atmosphere and to reduce their potential impact on the public and the environment. \r\nThe phrase Risk Management Program refers to the requirements of Part 68, which must be implemented on an on-going basis. The phrase Risk Management Plan refers to this document as well as the registration information submitted to EPA.\r\nCovered facilities must develop and implement a Risk Management Plan and maintain documentation required by the plan on site.  The Risk Management Plan includes an analysis of the potential offsite consequences of an accidental release, a five-year accident history, a release prevention program and an emergency response program.\r\nCovered facilities also must submit registration information (RMP Submit) to EPA no later than June 21, 1999 or the date on which the facility first has more than a threshold quantity in use or stored at the site, whichever is later.  Covered facilities are also required to re-submit their Risk Management Plans every five years.  The RMP Submit provides an electronic summary of the faci"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48051,
      "SummaryText": "lity¿s Risk Management Plan.\r\nCovered facilities also must continue to implement the Risk Management Program and update their Risk Management Plans periodically or when processes change, as required by the rule.\r\nSection 2 - Management System\r\nThe implementation and management responsibilities for the Plan must be clearly defined.  This section discusses various duties that must be addressed in order to fulfill the intent of the Plan.  This section also describes the employee responsibilities associated with each duty.\r\nMr. Bernie Boudreau, Operations Manager, is identified as the facility Risk Management Program Coordinators (RMPC).  However, development and execution of the Risk Management Plan is performed by a team of individuals.  The roles and requirements of these individuals are documented in RMP TEAM RESPONSIBILITIES.\r\nSection 3 - Hazard Assessment\r\nA major component of the Risk Management Plan is the assessment of impacts associated with the accidental release of regulated substances.  This section evaluates both the worst-case release as well as alternative releases that are specific to the site.\r\nThe analysis focused on the impact to neighboring areas called receptors.  Receptors include residences, schools, parks, prisons, commercial buildings, etc.  Graphic as well as tabulated exhibits help to define the impact of accidental releases.\r\nBased on guidelines provided by EPA in the 2004 RMP Submit Instruction Manual, release scenario information is not provided in this Executive Summary.\r\nSection 4 - Process Safety Information\r\nProcess Safety Information (PSI) is a repository for information related to the safety of a process.  Three major subjects addressed in this section are:\r\n* The hazards of the chemicals and the process (physical properties, toxicity and exposure limits, fire and explosion characteristics, reactivity data, thermal and chemical stability, corrosivity data)\r\n* The process technology (process chemistry, process flow diagrams, safe oper"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 48051,
      "SummaryText": "ating limits, maximum intended inventories, consequences of deviation)\r\n* Equipment information (piping and instrumentation diagrams, material and energy balances, safety systems involved, materials of construction, electrical classification, relief system design and design basis, ventilation system design and design basis, design codes and standards employed)\r\nThis information is used as a reference during Process Hazards Analyses.  This documentation is found primarily in the Material Safety Data Sheets (MSDS), the Risk Management Plan and the Process Safety Information files.  \r\nSection 5 - Process Hazard Analysis\r\nProcess Hazard Analysis (PHA) is a systematic approach toward evaluating the safety of a process.  PHAs must address the hazards of a process, previous incidents having potential for serious consequences, engineering and administrative controls, facility siting, human factors and an evaluation of the range of exposures if controls fail.  If there is more than one process, a schedule for completing PHAs must be formulated and be based on the extent of process hazards, the number of potentially affected employees, the age of the process and the operating history of the process.  \r\nEmployees must have input into the prioritization of PHAs and this schedule must be fully communicated to affected employees.  PHAs must follow a standard methodology, such as a What If/Checklist Analysis and be performed by a cross-functional team with at least one person who is familiar with the process, at least once every five years.  A system for addressing, resolving, documenting and communicating the recommendations in a prompt manner must also be in place.\r\nTypical documentation should include: \r\n* Information on how PHA studies were prioritized\r\n* Employee briefings on the PHAs\r\n* A copy of each PHA file index\r\n* Evidence of how PHA recommendations were completed.  \r\nThese PHA files include the pertinent process safety information.\r\nThe original PHA was conducted on Au"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 48051,
      "SummaryText": "gust 25, 1999 and included representatives from Agri-Mark, Tighe & Bond and various contract firms which designed the ammonia system, designed the ammonia system controls and service the refrigeration system.  The five year PHA update was conducted on July 21, 2004 by the following participants.\r\nAgri-Mark\rTighe & Bond\r* David Brault - Engineering\r\n* Jeff Flora ¿ Health and Safety / Operations\r\n* James Galenkamp - Maintenance\r* Michael Matilainen, CIH, CSP - Facilitator\r\n* Adam Lomartire ¿ Scribe / Assistant\rThe Agri-Mark personnel present during the PHA were those that have the greatest expertise on the ammonia system and its technical systems.  Tighe & Bond personnel selected for the PHA were those who conducted the initial PHA in 1999.\r\nSection 6 - Operating Procedures\r\nOperating procedures are instructions that outline how to safely operate a process consistent with Process Safety Information.  They must be appropriate, clear, consistent and well communicated.  Procedures must address steps for each operating phase (initial startup, normal operations, temporary operations, emergency shutdown, emergency operation, normal shutdown, startup after a turnaround), operating limits (consequences of deviation, steps to correct or avoid) and safety and health considerations (properties/hazards of chemicals, precautions to avoid exposure, control measures in the event contact occurs, quality control, inventory control, special or unique hazards, safety systems & their function).  Procedures must be accessible and certified to be correct at least annually.  Safe work procedures must exist for hot work, lock-out/tag-out, confined space entry, opening process equipment/piping and controlling entry to storage and distribution areas, for both employees and contractors.\r\nTypical documentation should include evidence that employees had input to the content and format of Operating Instructions, an index of the Operating Instructions, completed Confined Space Entry permits, comple"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 48051,
      "SummaryText": "ted Lock-out/Tag-out Program audit forms, etc.  Copies of the Operating Instructions are kept in the maintenance office.\r\nTighe & Bond personnel conducted a facility survey on August 25, 1999 to investigate and document standard operating procedures for the ammonia refrigeration system.  Operators at the facility reviewed and commented on draft procedures developed by Tighe & Bond.  The Operators comments were addressed in the final procedures incorporated into the Risk Management Plan.\r\nOperating procedures are reviewed on an annual basis by Agri-Mark.  Substantive changes to the procedures are noted in a controlled manner.  If substantial changes to the ammonia system require revision to the operating procedures, such changes are tracked through the Management of Change process.\r\nSection 7 Employee Training Program\r\nInitial training must be provided for employees involved with Risk Management Program processes that cover an overview of the process, specific safety and health hazards, emergency operations including shutdown and other safe work procedures that may be applicable.  For existing employees, the employer must document that operators have the required knowledge and do not need initial training.  Refresher training must be provided periodically that covers understanding and adherence to current operating procedures.  Records must be kept that verify that an employee has received and understood the training; these records must include employee identification, date of training and method of verification.\r\nDocumentation is found primarily in the Training Files.  This file should contain information that employees had input into retraining frequency and other aspects of the training program.\r\nInitial regulatory training was provided on March 8, 1999.  Additional emergency response training was conducted on April 9, 1999, which addressed responding to ammonia incidents.  The training outlines and evaluation quizzes can be found in the facility¿s Process Safety"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 48051,
      "SummaryText": "file.\r\nRefresher training was provided to applicable Agri-Mark employees on January 9, 2007 during the facility¿s Hazardous Waste Operations and Emergency Response (HAZWOPER) Hazardous Material Technician refresher.  In accordance with the CAP regulations, the next refresher training must be conducted by January 9, 2010.\r\nSection 8 - Mechanical Integrity Program\r\nWritten procedures have been developed for maintaining the ongoing integrity of process equipment.  Mechanical Integrity (MI) applies to pressure vessels and storage tanks; piping systems and their components; relief and vent systems and associated devices; emergency shutdown systems; controls (sensors, alarms, interlocks); and pumps.  Employees involved with MI must be trained in an overview of the process and in specifics of the job task.  Inspection and testing must be performed using generally recognized and accepted good engineering practices, at a frequency consistent with manufacturer¿s recommendations or good engineering practices (or more frequently if warranted).  Inspections must be documented and include date, person performing test, equipment identifier, test description and the results of each test or inspection.  \r\nDeficiencies outside acceptable limits must be corrected before further use or within a safe and timely manner, provided that the hazards of continued operation are properly addressed.  Employers must certify that new equipment is fabricated and installed in a suitable manner for the process and in accordance with manufacturer¿s instructions and design specifications.  Employers must certify that maintenance materials, spare parts and equipment are suitable for the process.\r\nDocumentation is found primarily in the Training and Maintenance files.  The Training File contains the maintenance personnel training records.  The Maintenance files contain the inspection records, deficiency reports, etc.\r\nAgri-Mark maintenance personnel only perform inspections and light maintenance on the c"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 48051,
      "SummaryText": "overed process.  Light maintenance can include adjusting operating controls, tightening gaskets and servicing equipment ancillary to the ammonia refrigeration system (e.g., condenser, chiller, etc.).  Where more extensive maintenance needs to be performed, a qualified contractor is called in to perform the maintenance.  Contractors also perform preventative maintenance functions on the ammonia system on a quarterly basis.\r\nAgri-Mark maintains maintenance records in the form of completed work orders from the designated contractors.  Additionally, unusual conditions are documented in the refrigeration system recordkeeping notebook, which is reviewed by the contractor during quarterly preventative maintenance activities.\r\nAgri-Mark certifies that their ammonia system was designed in accordance with recognized engineering standards at the time of construction and during subsequent renovations to the system.  The systems were also visually observed during the Process Hazard Analysis.  The facility follows the manufacturer¿s recommendations for inspection and maintenance found in the Operations and Maintenance Manuals.\r\nSection 9 - Management of Change\r\nA system is used to properly manage changes to process chemicals, technology, equipment and procedures.  The Management of Change (MOC) form must include the technical basis for the change; impact of the change on employee safety & health; modifications to operating procedures; modifications to Process Safety Information; time period involved; and authorization requirements.  Employees and contractors must be informed of the change prior to implementation.\r\nTypical documentation should include MOC worksheets (including employee review sheets) and documentation from training meetings required for a particular MOC.  The Agri-Mark Risk Management Plan maintains a procedure and forms necessary to manage change.  Agri-Mark implements the MOC process whenever making changes to the ammonia system that is not replacement-in-kind o"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 48051,
      "SummaryText": "r the Risk Management Plan.\r\nSection 10 Pre-Startup Safety Review\r\nThe Pre-Startup Safety Review (PSSR) is a review of new or significantly modified processes prior to introducing a highly hazardous chemical.  The review includes: \r\n* Confirmation that construction and equipment are in accordance with design specifications\r\n* Safety, operating, maintenance and emergency procedures are in place\r\n* The action items have been addressed; and that training of employees is complete\r\nTypical documentation includes specific training performed for hazard review team members prior to their participation in a preliminary hazard review or pre-startup safety review.  The review documentation is filed in the PSSR File and includes background information on how recommendations were implemented.  These files also include the pertinent process safety information.\r\nWhile there have been additions and improvements to the ammonia refrigeration system since the Risk Management Plan was initiated in August 1999, there have been no changes to the system that require a formal PSSR.\r\nSection 11 - Compliance Audits\r\nEmployers must certify that they have evaluated facility compliance with the Risk Management Program at least every 3 years.  Certification involves verification that procedures and practices for Risk Management Program elements are adequate and are being followed.  The audit must be performed by a team, with at least one person who is knowledgeable in the process.  A report must be generated that documents deficiencies and corrections.\r\nTypical documentation should include completed compliance audits, including evidence of how recommendations were implemented and attendance sheets from meetings conducted to review the audit findings with employees.\r\nTighe & Bond conducted a compliance audit of Agri-Mark¿s ammonia refrigeration system and Risk Management Program on June 24, 2005.  This audit included a visual survey of the covered process and a review of associated paperwork."
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 48051,
      "SummaryText": "The results of the audit were verbally communicated to Agri-Mark at the conclusion of audit activities.  The final audit report was published in September 2005.\r\nSection 12 - Incident Investigation\r\nA thorough investigation of any incident that could or did result in a catastrophic release of highly hazardous chemicals must take place within 48 hours of the incident.  This investigation must identify the chain of events and uses of the incident and include corrective measures that can be developed and implemented.  A team must perform the investigation with at least one person knowledgeable in the process and others who have appropriate knowledge and experience; a representative of the contractor or the chemical supplier must also be part of the team if either were involved in the incident.  A complete incident report must be developed and a system must be in place that addresses and communicates recommendations in a timely manner.\r\nTypical documentation should include completed Investigation Report Forms, including evidence of how action items were implemented and attendance sheets from meetings conducted to review the incident with employees.\r\nOn February 25, 2007, Agri-Mark detected a leak from the refrigeration system piping around the 640 cooler zone.  This leak was caused by substantial snow load pushing down on three valve clusters causing minor leaks at the gaskets.  The Agri-Mark emergency response team investigated and isolated the leak using self-contained breathing apparatus within three hours of the incident being reported.\r\nSince the leak resulted in an atmospheric release (20 ¿ 40 pounds estimated) and minor injuries were sustained during the initial investigation of the leak, this incident was subject to the investigation requirements in 40 CFR 68.81.  An investigation was initiated within 24 hours of the incident and an investigation report was created.  A revised RMP was submitted in April 2007, within 6 months of the incident, as required in 40 CF"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 48051,
      "SummaryText": "R 68.195.\r\nFurther details regarding the incident can be found in the incident investigation report.\r\nSection 13 - Employee Participation\r\nThis Section outlines how employees participate in the development of the facility¿s Risk Management Plan.  Employers must: \r\n* Train their employees\r\n* Inform them of findings from incident investigations and \r\n* Inform employees on the results of Process Hazards Analyses \r\n* Provide relevant safety and health information regarding the covered process  \r\n* Provide access to the information developed in conformance with the Risk Management Plan\r\nAffected employees at the facility have been involved in the training and operating procedure development.  Select employees have also been involved in performing the Process Hazard Analysis.  Agri-Mark employees have been selected to participate in incident investigations, as well as review operating procedures for the facility.\r\nSection 14 - Hot Work Permit\r\nThis is a permit system for work involving flame, heat, sparks or other activities that has the potential to cause a fire.  This permit system includes hot work operations (e.g., welding, cutting, etc.) conducted on or near a covered process as described in the operating procedures.\r\nAgri-Mark has established and implemented the hot work procedure and permit process for applicable operations outside of designated hot work areas (e.g., maintenance shop welding area).  The hot work permit satisfies the requirements of OSHA 1910.252(a), fire prevention and protection.  The permit indicates the dates and areas involved with the hot work.  The permit is kept on file while hot work proceeds.\r\nSection 15 - Contractor Safety\r\nEmployers must inform contractors of known potential fire, explosion or toxic release hazards; explain applicable provisions of the emergency action plan; develop/implement safe work practices that control the presence, entrance and exit of contract employees in covered process areas; periodically evaluate contractor s"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 48051,
      "SummaryText": "afety performance; and maintain a contractor injury and illness log.  This program applies to contractors working in or around covered processes areas who perform maintenance, repairs, help with facility turnarounds, participate in major renovations, or do specialty work (e.g., chemical suppliers, instrumentation service contractors).  Employers must obtain and evaluate contractor safety performance and programs.\r\nTypical documentation should include criteria for evaluating contractor safety programs, how the criteria were applied, the on-site monitoring performed while contractors were working and actions taken when contractor deficiencies were found.\r\nDuring the implementation of the facility Risk Management Plan, contractor evaluation forms were sent to Stahlman Engineering, Mullaly Brothers and LCS Controls.  Completed evaluation forms and other information can be found at the end of the CONTRACTOR SAFETY section of the Risk Management Plan.\r\nDesignated Agri-Mark personnel periodically review contractor safety practices when on-site to evaluate safety performance.  A review of contractor work is performed before the conclusion of the project and periodically depending on the nature of the work.\r\nSection 16 - Emergency Response Program\r\nAn emergency action plan for the entire facility is required that satisfies the requirements of OSHA 1910.38 and 1910.120.  The plan must include procedures for handling small releases of hazardous chemicals.  Employees must be aware of the plan and trained in specific procedures.  The regulations require a written plan that addresses emergency escape procedures; procedures for employees who remain to operate critical equipment; procedures to account for all personnel; rescue and medical duties; means of reporting emergencies; and a list of persons or departments who can answer questions.  Further, the regulations require an alarm system; an evacuation procedure; and training for new employees and for employees who are affected by"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 48051,
      "SummaryText": "any changes to the plan.\r\nTypical documentation should include critiques from any drills conducted, including evidence of how any recommendations were implemented and attendance sheets from any meetings conducted to review the response effort with employees.\r\nAgri-Mark has an emergency response program for the facility which has been coordinated with the Local Emergency Planning Commission and the Middlebury Fire Department.  Representatives at Agri-Mark have met with the Middlebury Fire Department on numerous occasions to plan and coordinate actions in the event of an ammonia release.  \r\nThe fire department is invited to conduct a facility tour on an annual basis by Agri-Mark.  The purpose of this tour is to identify critical controls and hazards to firefighters.\r\nAgri-Mark also maintains a hazardous chemical emergency response team to address chemical spills and ammonia releases at the facility.  The team has been provided with initial 24 hour Hazardous Material Technician training in accordance with 29 CFR 1910.120 and is provided with eight hours of refresher training annually.  The last refresher training was performed at Agri-Mark on January 9, 2007.\r\nSection 17 - Confidentiality Statement\r\nEmployers must disclose the information necessary to comply with the CAP regulations and the Risk Management Program to those persons completing PSIs, PHAs, operating procedures, incident investigations, emergency planning and response, and compliance audits.  If confidential business information status must be maintained, the employer can enter into confidentiality agreements with the appropriate employees.\r\nTypical documentation should include copies of confidentiality statements or correspondence with any employees.\r\nEPA has made provisions to prevent disclosure of proprietary process information or formulations.  In order to obtain Confidential Business Information (CBI) status for such proprietary information, the facility must submit justification to EPA as to why th"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 48051,
      "SummaryText": "e information is proprietary.  At this time, Agri-Mark has not claimed CBI status for any of the information submitted to EPA."
    }
  ]
}