{
  "FacilityID": 48097,
  "FacilityName": "MBA Poultry",
  "FacilityStr1": "13151 Dovers Street",
  "FacilityStr2": null,
  "FacilityCity": "Waverly",
  "FacilityState": "NE",
  "FacilityZipCode": "68462",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31109",
  "LEPC": "Lancaster County LEPC",
  "FacilityLatDecDegs": "40.959300",
  "FacilityLongDecDegs": "-096.515700",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 806233354,
  "ParentCompanyName": "Tecumseh Poultry, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Mark Haskins",
  "OperatorStr1": "13151 Dovers Street",
  "OperatorStr2": null,
  "OperatorCity": "Waverly",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68462",
  "OperatorZipCodeExt": null,
  "FTE": 250,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000198733",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2007-04-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-04-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2007-04-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-04-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 40.90357,
  "FRS_Long": -96.54342,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1.5",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 69738,
      "AltID": "Poultry Processing",
      "FacilityID": 48097,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 92714,
          "ProcessID": 69738,
          "ChemicalID": 56,
          "Quantity": 10000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 71400,
          "ProcessID": 69738,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 40957,
              "Process_NAICS_ID": 71400,
              "SafetyReviewDate": "2006-11-06 00:00:00",
              "PHA_Date": null,
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2006-11-09 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Engine room Ammonia Detectors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2007-01-23 00:00:00",
              "TrainingReviewDate": "2006-11-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-01-01 00:00:00",
              "EquipmentInspectionDate": "2006-05-22 00:00:00",
              "EquipmentTested": "5/22/2006",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2007-01-01 00:00:00",
              "PreStartupReviewDate": "2006-05-22 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2006-11-17 00:00:00",
              "HotWorkPermitReviewDate": "2006-08-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2006-06-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 59834,
                  "PreventionProgram3ID": 40957,
                  "ProcessChemicalID": 92714
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 48097,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2007-02-01 00:00:00",
    "ERTrainingDate": "2007-01-08 00:00:00",
    "CoordinatingAgencyName": "Lancaster County",
    "CoordinatingAgencyPhone": "4024417441",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 48097,
      "SummaryText": "t using the phone, PA system, or wireless phones. The lead person or supervisor of the affected area, Human Resources, or maintenance personnel are to determine if evacuation of the plant is the safest course of action and should activate the evacuation alarm if necessary.  If the emergency involves the release of ammonia and a decision is made to evacuate the plant, first determine the assembly area.  The location of the assembly area will be based on the current wind direction and will be upwind of the release area.   An announcement will be made over the PA system informing employees that they are to evacuate the building and where to assemble.  If your immediate contact options cannot be reached, dial 911.  In the event of an evacuation, all employees should proceed to the designated assembly area and await further instructions from their evacuation supervisor. Facility map identifying exit doors, evacuation routes and assembly areas are posted at various locations throughout the facility.  All emergency exit doors are clearly marked and are tested monthly for ease of operation and checked that they are free of obstructions.  Once everyone has evacuated the facility and arrived at their designated meeting area, a head count must be conducted by the evacuation supervisor to account for missing people, including visitors and/or contractors in his/her area.  A daily crew/employee list shall be maintained for each department within the facility. Ten minutes will be allowed for critical unit operators to shutdown their equipment and reach the designated meeting location before attendance will be reported.  \nIn the event of an emergency release of ammonia it will be necessary for some specifically assigned and properly trained employees to remain in work areas that are being evacuated long enough to perform critical operations. The critical operations shutdown procedures to be followed by those employees who have been assigned for essential building operations include"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 48097,
      "SummaryText": ":\n\nMaintenance Manager & Motive Power Operation: Shutdown the ammonia refrigeration system by using one of the Emergency Stop (E-stop) switches located just inside of the engine room doors.\nMaintenance Manager, Motive Power Operation, & Building and Equipment Mechanics: Shutdown Critical Equipment.\nMaintenance Manager, Motive Power Operation, Building and Equipment Mechanics, and Emergency Response Personnel:  Operate fire extinguishers if necessary and practical.\n\nIn response to an ammonia release, MBA Poultry, LLC will not respond to releases of hazardous chemicals in an offensive manner. The facility does not have any employees trained at the HAZMAT Technicians or First Responders Operations Level.  However, in the case of an ammonia release, designated maintenance personnel will proceed to the area where the odor was detected and take a reading to determine the ammonia concentration in the area.  The first reading must be taken just inside the door of the affected room. If the level from the first reading is below 25ppm continue in the room to the general area where the odor was reported and take another reading and try to determine the source of the leak. If the level is above 25ppm, notify the Emergency Coordinator immediately and leave the area.\n\nMBA Poultry has not had any accidental releases to report since the commissioning of the plant in June-2006."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 48097,
      "SummaryText": "MBA Poultry, Waverly\nRefrigeration System Risk Management Program\n\nExecutive Summary\n\nThis is to inform all interested persons, including employees that MBA Poultry is complying with OSHA¿s Process Safety Management Standard (called Process Safety Management or PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA¿s Risk Management Program regulations (called RM Program), Title 40 CFR Part 68, to deal with the risks involved with the storage, handling, and processing of hazardous chemicals, In this way we promote overall plant, worker, and public safety.  These programs enable our facility to prevent the occurrence, and minimize the consequences, of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.   Overall, these programs prevent accidental fatalities, injuries and illnesses and avoid physical property damage.  Our safety programs are applied to any activity involving hazardous chemicals including any use, storage, manufacturing, handling, or the on-site movement of such chemicals, or combination of these activities.  Any group of vessels which are interconnected and separate vessels which are located such that a hazardous chemical could be involved in a potential release shall be considered a single process.  \n\n\tOur safety programs prevent accidents because they focus on the rules, procedures, and practices which govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary.  They are also communicated to and accepted by all employees at the facility.\n\n\tMBA Poultry is a poultry processing plant in Waverly, Nebraska which is a food processing plant.  The facility operates an ammonia refrigeration system to provide cooling capabilities.  The system is operated as a single stage system.  The heat loads in the plant originate from coolers, process coolers, and dock cooling.  Pumped liquid flows from the recirculator vessel then through t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48097,
      "SummaryText": "he coils in the air units where it picks up heat, changing the ammonia from a liquid to a vapor.  The recirculated ammonia vapor is sent from the plant to the recirculator via a common suction header.  High side ammonia gas from the recirculator is then fed to the high stage compressors.  During the compression phase in the high stage compressors, the temperature of the ammonia gas will rise as the pressure of the ammonia vapor is increased to approximately 150-180 psig. The high-pressure ammonia vapor flows from the high stage compressors to an evaporative condenser where heat is removed, turning the gas into a high pressure liquid.  The high-pressure liquid is collected in the high-pressure receivers.  The liquid collected in the high-pressure receivers provides liquid make-up for the recirculator.\n\nThe emergency action plan at MBA Poultry requires all associates to be trained in safe evacuation and notification procedures in cases of actual or drill emergencies. Training shall include escape routes, notification of appropriate response agencies, instructions on activating a building fire alarm system and what should be done after evacuating a building. To aid in the training process evacuation drills are conducted at the facility.  In the case of an emergency, Chris John is the safety manager and has overall responsibility for the preparation and implementation of the emergency response plan. The alternate emergency coordinator is Jason Rowe, plant manager and second shift is Rick Brummer, Distribution.  Arrangements have been made to coordinate the MBA Poultry¿s Emergency Action Plan and applicable emergency services with the following local agencies:\n\nLancaster County LEPC \n(402)-441-7441\nDoug Ahlberg\n\nLancaster County Sheriff Department\n(402)-786-6500\n\nWaverly Fire Department\n(402)-786-3055\n\nUpon discovering an emergency situation, all employees shall immediately notify their lead person, supervisor, the Human Resources Department, or the Maintenance Departmen"
    }
  ]
}