{
  "FacilityID": 48168,
  "FacilityName": "Malan Street Cooling, LLC",
  "FacilityStr1": "33 Malan Street",
  "FacilityStr2": null,
  "FacilityCity": "Brawley",
  "FacilityState": "CA",
  "FacilityZipCode": "92227",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06025",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "32.970000",
  "FacilityLongDecDegs": "-115.531667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Malan Street Cooling, LLC",
  "OperatorStr1": "33 Malan Street",
  "OperatorStr2": null,
  "OperatorCity": "Brawley",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92227",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Gonzales",
  "RMPTitle": "Facility Manager",
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000198859",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-05-15 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "New Submission April 2007",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-05-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-05-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-04-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2008-04-15 00:00:00",
  "DeRegistrationEffectiveDate": "2008-04-01 00:00:00",
  "AnniversaryDate": "2012-04-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 69832,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 48168,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 71498,
          "ProcessID": 69832,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 92834,
          "ProcessID": 69832,
          "ChemicalID": 56,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 592834,
          "ProcessID": 69832,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48168,
      "SummaryText": "Malan Street Cooling?s (Brawley, California) accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices. All applicable procedures of the EPA Prevention Program are adhered to. The facility?s emergency response policy involves the preparation of response plans which are tailored to the facility and to the emergency response services available in the community. It is also in compliance with the EPA Emergency Response Program requirements.\n\nThe Malan Street Cooling facility utilizes anhydrous ammonia as a refrigerant in their pre-cooling, cold storage and ice-making operations. Fresh produce is brought from the fields and cooled to remove field heat. The facility holds 28,000 pounds of anhydrous ammonia in the following processes: 2 permanent systems (8,400 lbs each), ice generator (2,240 lbs), and 4 portable systems (2,240 each).\n\nThe offsite consequence analysis includes consideration of two release scenarios for this process, identified as ?worst case release scenario? and ?alternative release scenario.? The first scenario is defined by the EPA, which states that ?the owner or operator shall assume that the...maximum quantity in the largest vessel...is released as a gas over 10 minutes,? due to an unspecified failure. The alternative release scenario is on that is more likely to occur than the worst case release scenario.\n\nAtmospheric dispersion modeling has to be performed to determine the distance traveled by the toxic substance released before its concentration decreases to the EPA toxic endpoint (0.14 mg/L for anhydrous ammonia), which is the Emergency Response Planning Guideline Level 2 (ERPG-2). This is defined by the American Industrial Hygiene Association (AIHA) as the ?maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without which could impair an individual?s ability to take protective action.?  The residential p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48168,
      "SummaryText": "opulation within a radius corresponding to the toxic endpoint distance has to be defined, ?to estimate the population potentially affected.?\n\nThe offsite consequence analysis for these scenarios (worst case and alternate release) was performed for two sets of conditions. The first set followed conditions pre-defined by the EPA, namely release of the entire amount as a gas in 10 minutes, use of the one hour average ERPG-2 as the toxic endpoint, and consideration of the population residing within a full circle with radius corresponding to the toxic endpoint distance. EPA set these conditions to facilitate the performance of the offsite consequence analysis; however, the assumptions used may be unrealistic because:\n\n?    Only the population within an elliptical plume extending downwind of a release point is potentially affected. This plume, or footprint, is approximately 6% (one-twentieth) of the area of the full circle.\n\n?    It is not appropriate to compare a 10-minute release to a one hour average standard. The one hour ERPG value can be modified using available time of exposure/concentration relationships to match the ten minute release time.\n\nWhen atmospheric dispersion modeling for the worst case scenario was performed using the EPA assumptions, a distance to a toxic endpoint of 1.1 miles and an estimate of residential and commercial population potentially affected of 7,670 were obtained for an ammonia release. The typical meteorological conditions used for this scenario was a Stability Class F, wind speed 1.5 m/s, average air temperature, and average humidity. \n\nThe alternative release scenarios involved the lifting of the largest pressure relief valve for 10 minutes. After 10 minutes the valve reseats itself. The amount of ammonia released was predicted to be 60.4 lbs/min and the toxic endpoint distance from ERPG-2 was 196 yards. The toxic concentration levels outside this endpoint distance are below the allowable standards for toxic substances established by AIHA. T"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48168,
      "SummaryText": "he typical meteorological conditions used for this scenario was a Stability Class D, wind speed 3.0 m/s, average air temperature, and average humidity. \n\nThe general accidental release prevention program is based on the following key elements:\n?    Training of the operators.\n?    Preventative maintenance program.\n?    Use of state-of-the-art process and safety equipment.\n?    Use of accurate and effective operating procedures.\n?    Performance of a process hazard analysis of equipment and procedures.\n?    Implementation of an auditing and inspection program.\n\nChemical specific prevention steps including awareness of the hazardous and toxic properties of these toxic substances.\n\nNo accidental releases of anhydrous ammonia have occurred at this facility in the past five years.\n\nMalan Street Cooling will fully implement the RMP and will initiate appropriate changes as needed to maintain a safe operation.\n\nThe emergency response program includes an emergency response notification plan. Emergency response drills and drill evaluations are conducted once every year; emergency operations and response procedures are also reviewed at that time."
    }
  ]
}