{
  "FacilityID": 48173,
  "FacilityName": "City of El Centro Water Treatment Plant",
  "FacilityStr1": "3010 South 8th Street",
  "FacilityStr2": null,
  "FacilityCity": "El Centro",
  "FacilityState": "CA",
  "FacilityZipCode": "92243",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06025",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "32.765500",
  "FacilityLongDecDegs": "-115.562500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.cityofelcentro.org/pworks/index.html",
  "FacilityEmailAddress": "Psteward@epcw.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of El Centro",
  "Company2Name": "N/A",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of El Centro",
  "OperatorStr1": "307 W. Brighton Ave.",
  "OperatorStr2": null,
  "OperatorCity": "El Centro",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92243",
  "OperatorZipCodeExt": null,
  "RMPContact": "Paul R. Steward, Jr.",
  "RMPTitle": "Water Treatment Plant Supervisor",
  "FTE": 8,
  "OtherEPAFacilityID": "N/A",
  "EPAFacilityID": "100000151113",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-02-22 00:00:00",
  "SafetyInspectionBy": "Joint Powers Insurance Authority",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "June 2005",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-05-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-05-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-05-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-05-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 32.7655,
  "FRS_Long": -115.56136,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 69838,
      "AltID": "Water Treatment",
      "FacilityID": 48173,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 71505,
          "ProcessID": 69838,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 92843,
          "ProcessID": 69838,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 592843,
          "ProcessID": 69838,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48173,
      "SummaryText": "RISK MANAGEMENT PLAN - CITY OF EL CENTRO WATER TREATMENT PLANT\n\nThe City of El Centro Water Treatment Plant is located at 3010 South 8th Street, El Centro, CA 92243, off Interstate 8. \n\nThe City of El Centro (CEC) has developed a Risk Management Plan to address California Accidental Release Prevention (CalARP) Program requirements (California Code of Regulations, Title 19, Division 2, Chapter 4.5, Sections 2735-2785).  CEC is extremely diligent in the handling of all chemicals and is dedicated to the safety of its employees and the neighboring Community.  CEC staff is highly trained and utilizes modern equipment to monitor its facility to provide safeguards, while effectively and safely using chlorine for water treatment.  Chlorine plays an important role in water treatment and water reclamation, enabling everyone to lead healthier lives.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nThe facility has a long-standing commitment to its workers and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as personnel training and consideration of safety in the design, operation, and maintenance of the chlorine system. The facility?s policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. \n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\nThe chlorine system at the City of El Centro's Water Treatment Plant is used for the treatment of water from the supply canals prior to pumping into the City's water supply pipelines.\n\nThe Chlorine Storage Room contains 8-10 one-ton chlorine cylinders, one chlorine detector (set @ 1 ppm), automatic switchover valves, one vacuum regulator, and one exhaust fan that is operated manually whenever personnel enter the room.  Two independent manifold systems (one active and the other kept on standby) are connected to a common header that feeds into the Chlorination Room.  City of El Centro Operators use a monorail hoist to replace chlorine cylin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48173,
      "SummaryText": "ders.\n\nThe chlorine system is operated under vacuum conditions.  Each active one-ton cylinder is placed on a scale to allow City of El Centro Operators to plan ahead for ordering more chlorine and for planning the change-out procedure.  Each container is positioned so that the valves are vertically aligned.  A vacuum regulator is mounted directly on the active chlorine cylinder.  A vacuum is created when process water is pumped through the injectors.  This flow generates a vacuum which opens the vacuum regulator.  Upon loss of vacuum in the line from the active one-ton cylinder, a diaphragm in the vacuum regulator will close, stopping any chlorine from escaping.  Any chlorine in the piping upon loss of vacuum will be drawn through the chlorinators and into solution.\n\nScrubbers are not installed in any of the Water Treatment Plant rooms; however, each chlorine detector triggers an alarm that will alert the Operators to a high ambient chlorine concentration in either the Chlorination Room or in the Chlorine Storage Room.\n\nHAZARD ASSESSMENT SUMMARY/OFFSITE CONSEQUENCE ANALYSIS\n\nWorst-Case Release Scenario \nPer the CalARP Regulations, one worst-case analysis has been defined.  RMP*Comp and SLAB Dispersion modeling were used to determine the maximum downwind endpoint distance.  The results can be found in the Hazard Assessment documentation. The chlorine cylinders are located in a building; therefore, this passive mitigation measure was incorporated in the calculations.  The most pessimistic meteorological conditions were used, as specified by regulation.  RMP*Comp and SLAB Dispersion Modeling were used to determine the maximum downwind endpoint distance. \n\nAlternative Release Scenario\nThe meteorological conditions specified by regulation for alternative release scenarios were used.  RMP*Comp and SLAB Dispersion Modeling were used to determine the maximum downwind endpoint distance.  The downwind distance for this alternative release scenario is significantly less than t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48173,
      "SummaryText": "hat for the worst-case scenario. The results can be found in the Hazard Assessment documentation.\n \nRisk Considerations\nAlthough the storage and use of chlorine has inherent potential risks, and worst-case release scenarios can potentially reach the Community; the City of El Centro Water Treatment Plant has recognized these potential risks and structured its safety programs to make this type of event non-credible.\n\nIn addition to the use of conservative analysis assumptions that overpredict the effects of a potential release, other characteristics of the facility and site serve to minimize the potential risks associated with a chlorine release:\n?Valves to permit isolation of the process exist.\n?Personal Protective Equipment (PPE) (e.g., protective clothing, self-contained breathing apparatus) is used by plant personnel.\n?The history of the CEC Water Treatment Plant (i.e., no RMP-applicable chlorine releases) reflects the adequacy of the design and diligence of the plant staff in safely operating the Chlorine System.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\nAs part of the implementation of this CalARP Program, key prevention program elements were implemented by the facility to manage process safety issues associated with the use of chlorine systems. In addition, common industry standards, policies, and procedures are currently utilized to ensure safe practices are being performed.  This includes common practices outlined by the Chlorine Institute.  In addition to the Management Programs, there are chlorine leak detectors situated in all rooms that contain chlorine (2 total).  In the event of a chlorine gas leak, the detectors relay a signal that activates a horn and a light outside the room where chlorine has been detected.  In addition, the alarm is displayed on the control system panel.  At 1 ppm, the alarm signal is directly wired to alert the El Centro Police Department Dispatch. The Prevention Program 3 elements include:\n?Pro"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 48173,
      "SummaryText": "cess Safety Information\n?Process Hazard Analysis\n?Operating Procedures\n?Training\n?Mechanical Integrity\n?Management of Change\n?Pre-startup Safety Review\n?Compliance Audits\n?Incident Investigation\n?Employee Participation\n?Hot Work Permit\n?Contractors\n?Emergency Response Plan\n\nThe entire prevention program elements are kept in the CalARP/EPA/RMP Compliance Workbook located onsite.  The prevention program elements satisfy the requirements of CalARP, EPA RMP, and OSHA PSM.\n\nFIVE-YEAR ACCIDENT HISTORY\nThere have been no CalARP-applicable releases of chlorine at the facility in at least the past five (5) years. \n\nEMERGENCY RESPONSE PROGRAM\nThe City of El Centro has developed a facility-specific emergency response plan to handle potential emergency situations at the Water Treatment Plant.  This plan is designed to meet the following objectives:\n?Saving lives\n?Minimizing and avoid injuries\n?Protecting the environment\n?Minimizing property damage\n\nKey elements of the Emergency Response Plan include:\n?A detailed Emergency Response Action Guide\n?Key phone numbers and contact points for City of El Centro personnel\n?Incident Command System (ICS) w/Unified Command interface\n?ICS position descriptions w/responsibilities\n?Vicinity and evacuation maps\n?Detailed task-by-task plans for:\noEvacuation\noFire in a Process or Non-Process Area\noInjuries\noThreats/Civil Disorder\noWildland or Adjacent Property Fire\noExternal Events (e.g., seismic)\noPotential Imminent Danger to Personnel\noChemical Spill (e.g., caustic)\noChlorine Release\noOff-Site Event Involving a Hazardous Material\n\nThe City of El Centro Water Treatment Plant does not have a designated emergency response team; however, El Centro Fire Department specialists are trained and fully equipped to respond to hazardous material releases.  The City of El Centro Water Treatment Plant Emergency Preparedness Coordinator maintains an Emergency Response Plan for the facility.\n\nThe Emergency Response Plan provides the response protocols and noti"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 48173,
      "SummaryText": "fication procedures, evacuation routes, chlorine health hazards, and mitigation procedures, which have been implemented to respond effectively to emergency situations that may arise at the facility.  This Plan will be reviewed and updated at least once per year to ensure compliance with PSM, RMP, and CalARP regulations.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nSeveral studies have been conducted to examine mitigation measures to improve safety at the facility.  These studies include the following: Process Hazard Analysis, Seismic Assessment, and Hazard Assessment.  Any outstanding recommendations from these studies were addressed by December 2005."
    }
  ]
}