{
  "FacilityID": 48451,
  "FacilityName": "C & G Farms, Inc.",
  "FacilityStr1": "817 West Hackleman Road",
  "FacilityStr2": null,
  "FacilityCity": "El Centro",
  "FacilityState": "CA",
  "FacilityZipCode": "92243",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06025",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "32.810833",
  "FacilityLongDecDegs": "-115.638333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Tanimura & Antle, Inc.",
  "OperatorStr1": "1 Harris Road",
  "OperatorStr2": null,
  "OperatorCity": "Salinas",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93908",
  "OperatorZipCodeExt": null,
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000143775",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "T&A Operated - Update Reg 7/05 Corrections 5/07",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-06-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-06-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-06-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-07-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 32.81084,
  "FRS_Long": -115.62265,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "C06",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 70280,
      "AltID": "NH3 Refrigeration",
      "FacilityID": 48451,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 93475,
          "ProcessID": 70280,
          "ChemicalID": 56,
          "Quantity": 19939.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 71972,
          "ProcessID": 70280,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 41362,
              "Process_NAICS_ID": 71972,
              "SafetyReviewDate": "1998-05-28 00:00:00",
              "PHA_Date": "2005-02-14 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-11-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "operator error, maintenance, physical damage, vandalism",
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Implementation of IIAR and RMP guidelines and purchase of safety equipment.",
              "OpProceduresReviewDate": "2005-02-14 00:00:00",
              "TrainingReviewDate": "2005-02-14 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2005-02-14 00:00:00",
              "EquipmentInspectionDate": "2004-11-01 00:00:00",
              "EquipmentTested": "Pre-startup inspection of all ammonia refrigeration equipment and controls.",
              "ChangeMgmtDate": "1998-05-27 00:00:00",
              "ChangeMgmtReviewDate": "2005-02-14 00:00:00",
              "PreStartupReviewDate": "2004-11-01 00:00:00",
              "ComplianceAuditDate": "2005-01-05 00:00:00",
              "AuditCompletionDate": "2005-11-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2005-02-14 00:00:00",
              "HotWorkPermitReviewDate": "2005-02-14 00:00:00",
              "ContractorSafetyReviewDate": "2005-02-14 00:00:00",
              "ContractorSafetyEvalDate": "2004-11-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Ammonia Refrigeration",
              "_chemicals": [
                {
                  "PrimaryKey": 60436,
                  "PreventionProgram3ID": 41362,
                  "ProcessChemicalID": 93475
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 48451,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2005-02-14 00:00:00",
    "ERTrainingDate": "2004-11-01 00:00:00",
    "CoordinatingAgencyName": "Imperial County Fire Department",
    "CoordinatingAgencyPhone": "7603535222",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48451,
      "SummaryText": "Executive Summary for Abatti Cooling Cold Storage\n\nIntroduction\nThis report and Risk Management Plan was developed to comply with US EPA and Cal ARP requirements. Resources used in the process was International Institute of Ammonia Refrigeration Guidelines, RMP Pro 98 Software by Dyadem and Cold Storage Technologies.\n\nReport organization includes; Certification statement, Summary, Detailed Elements and Map of  Potential Impact.\n\n1.    Accidental Release Prevention and Emergency Response Policies\nWe at Tony Abatti Cooling, LLC. are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances. Our new Cold Storage Facility is state-of-the ?art including the latest diffusion tank safety equipment providing neutralization of all Ammonia releases.\n\n2.    The Stationary Source and the Regulated Substances Handled\nOur facility?s primary activities encompass Packing and storage of fresh fruit..  We have 1 regulated substance present at our facility. Ammonia (anhydrous) is used for Refrigeration.\n\n3.    The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\nTo evaluate the worst case scenarios, we have used the EPA's RMP Guidance for Ammonia Refrigeration  Reference Tables or Equations.  For alternative release scenario analyses we have employed the EPA's OCA Guidance Reference Tables or Equations. No specific unusual external events were included due to the facilities rural location, remote equipment location and recent construction meeting all applicable seismic and safety codes. Potential impacts by forklift"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48451,
      "SummaryText": " or other facility traffic typical to this type of operation were included. Any catastrophic type events would result in the same impacts as presented in this OCA or less. The following paragraphs provide details of the chosen scenarios. \n\nThe worst case release scenario submitted for Program 2 and 3 toxic substances as a class involves a catastrophic release from Ammonia Refrigeration.  In this scenario 19939 lb. of Ammonia (anhydrous) is released.  The toxic liquid released is assumed to form a 1 cm deep pool from which evaporation takes place.  The entire pool is estimated to evaporate over 10 minutes. No mitigation or administrative controls were used.  At Class F atmospheric stability and 1.5 m/s windspeed, the maximum distance of 2.52 miles is obtained corresponding to a toxic endpoint of 0.14 mg/L. Circle population from census information is 4303 however the plume footprint would be approximately 10% of this value. This scenario does not represent a realistic scenario.\n\nThe alternative release scenario for Ammonia (anhydrous) involves a release from Ammonia Refrigeration.  The scenario involves the release of 300.00 lb. of vapor. The vapor is discharged from a failed compressor seal that can be isolated manually in 60 minutes.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.14 mg/L of Ammonia (anhydrous) is 0.06 miles.\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1998 Edition.    The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nTony Abatti Cooling, LLC. maintains a detailed record of safety information that describes the chemical hazards, "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48451,
      "SummaryText": "operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is What If/Checklist (combined).  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of5 years.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA/update was performed on 05/26/1999.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Tony Abatti Cooling, LLC. maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nTony Abatti Cooling, LLC. has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every 3 years and more frequently as needed.\n\nMechanical Integrity\nTony Abatti Cooling, LLC. carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are correct"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 48451,
      "SummaryText": "ed in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Tony Abatti Cooling, LLC. to manage changes in process chemicals, technology, equipment and procedures.  The most recent review/revision of maintenance procedures was performed on 06/18/1999.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Tony Abatti Cooling, LLC..  The most recent review was performed on 06/02/1999.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nTony Abatti Cooling, LLC. conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent compliance audit was conducted on 06/18/1999.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nTony Abatti Cooling, LLC. promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nTony Abatti Cooling, LLC. truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 48451,
      "SummaryText": " have access to all information created as part of the facility?s implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Tony Abatti Cooling, LLC. has a strict policy of informing the contractors of known potential hazards related the contractor?s work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n5.    Five-year Accident History\nTony Abatti Cooling, LLC. has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n6.    Emergency Response Plan\nTony Abatti Cooling, LLC. carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n7.    Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Implementation of IIAR RMP/PSM Guidelines, safety equipment and improved access to isolation are some of the major steps we want to take to improve safety at our facility.  These changes are expected to be implemente"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 48451,
      "SummaryText": "d by the end of the year."
    }
  ]
}