{
  "FacilityID": 48476,
  "FacilityName": "West Virginia-American Water   Weston WTP",
  "FacilityStr1": "Rt. 19 South of Weston",
  "FacilityStr2": "1243 US Highway 19 South",
  "FacilityCity": "Weston",
  "FacilityState": "WV",
  "FacilityZipCode": "26452",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "54041",
  "LEPC": "Lewis/Upshur County LEPC",
  "FacilityLatDecDegs": "39.005000",
  "FacilityLongDecDegs": "-080.285600",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.amwater.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7944622,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "West Virginia-American Water",
  "OperatorStr1": "Rt. 19 South of Weston",
  "OperatorStr2": "1243 US Highway 19 South",
  "OperatorCity": "Weston",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "26452",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gregg VanPelt",
  "RMPTitle": "Division Manager",
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000098841",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-08-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-08-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-09-09 00:00:00",
  "DeRegistrationEffectiveDate": "2021-08-30 00:00:00",
  "AnniversaryDate": "2009-08-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 39.01389,
  "FRS_Long": -80.48222,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "240000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 70310,
      "AltID": "Utility",
      "FacilityID": 48476,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 72002,
          "ProcessID": 70310,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 93507,
          "ProcessID": 70310,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 593507,
          "ProcessID": 70310,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48476,
      "SummaryText": "\nWEST VIRGINIA-AMERCIAN WATER COMPANY\nWESTON WATER TREATMENT PLANT \nRisk Management Plan Executive Summary\n\nAccidental Release Prevention and Emergency Response Policies\n\nWest Virginia-American Water Company?s Weston Water Treatment Plant is committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner. We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees, contractors, and the public, as well as protection of the environment. This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n    A description of our facility and use of substances regulated by the Environmental     Protection Agency's (EPA's) risk management program (RMP) regulation\n\n    A summary of results from our assessment of the potential off-site consequences         from accidental chemical releases\n\n    An overview of our accidental release prevention program\n\n    A 5-year accident history for accidental releases of chemicals regulated by EPA?s         RMP rule \n    An overview of  our emergency response program\n    An overview of planned improvements at the facility to help prevent accidental         chemical releases from occurring and adversely affecting our associates,             contractors, the public, and the environment\n\nWeston Water Treatment Plant Regulated Substances\n\nThe Weston Water Treatment Plant is a water treatment facility that takes raw river water from the Westfork River in Weston, West Virginia, and treats the river water with chlorine and other chemicals to make potable (drinking) quality water for public distribution and consumption.  Sewage treatment is not a part of plant operations. The plant handles one RMP-regulated toxic substance above the EPA threshold quantity, which is chlorine. No regulated flammable substances are present at the treatment plant\n\nChlorine is deliver"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48476,
      "SummaryText": "ed to our plant and stored in 1-ton (\"ton\") containers and is fed to the process from one of the containers at a time. The container storage room can hold up to 4 ton containers. One container is connected to the same feed piping manifold. An alternate supply arrangement consists of one additional ton containers connected to a parallel, but normally isolated, feed piping manifold. Chlorine is stored as a liquefied gas under pressure, fed as a gas to the chlorinators, and injected as a vapor at the outlet of the into the water stream. The chlorine process is classified as a Program Level 3 process, and we implement a complete accident prevention program.\n\nOffsite Consequence Analysis\n\nWe performed an off-site consequence analysis to estimate the potential for an accidental release of chlorine from our facility as a regulated toxic substance that could affect the public or the environment. The off-site consequence analysis consisted of evaluating both a worst-case scenario (WCS) and an alternative release scenario (ARS) following identification of the appropriate ARS. We do not expect a worst-case release scenario to ever occur. An ARS represents a release that might occur during the lifetime of a facility similar to our water treatment plant. ARS?s can be used to help the Lewis/Upshur (local) Emergency Planning Committee (L/UEPC) improve and prepare an effective community emergency response plan.\n\nWe have submitted release scenario analyses to EPA and have shared that information with L/UEPC and other organizations involved in emergency response activities. It is also available to local residents, schools, hospitals, and businesses. For these events, we have emergency mitigation systems that should help reduce the consequences of the events if they occur. In all cases, if such events occur, we would activate our emergency response plan to respond to the event notify local authorities, and take appropriate actions to protect our employees, contractors, and people in t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48476,
      "SummaryText": "he community. The paragraphs below briefly describe the scenarios we have included in our risk management plan (RMPlan), including information about the key administrative controls and mitigation measures we have put in place to limit the exposure distances for each scenario.\n\n        Worst-case Release Scenario for Chlorine\n\n    The worst case scenario at our water treatment facility involves a failure of a ton         container holding approximately 2000 lbs of liquefied chlorine gas under             pressure, resulting in a release with vaporization of the entire contents of the         container. In this scenario, the chlorine is released as a vaporizing liquid inside a         completely enclosed chlorine storage room in our water treatment building. The         containment provided by the building mitigates the release. Such building             confinement reduces the release rate of chlorine vapor directly to the outdoors.         Since this facility is located in a semi-populated area, the toxic cloud formed by         the evaporating chlorine would reach off-site end points and nearby public         receptors.\n\n    A sump is provided to collect and contain portions of a liquid release that do not         immediately vaporize. In reality, the sump could serve to reduce the vaporization         rate of chlorine to the storage room air, and likewise reduce the rate at which         chlorine gas is released from the room directly to the outside air. However,         because we based our analysis on a very conservative approach, we did not take         credit for the sump as a form of mitigation in reducing the endpoint distance         reached off-site.\n\n    Numerous administrative controls are in place to prevent a release of this type and     should one occur, to provide for effective emergency response. Controls include         container design, storage, operation, maintenance and inspection; container repair         and emergency response equipment; and personnel training conducted in             accordance with regulatory requirements, chlorine industry standards and             practices, and o"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 48476,
      "SummaryText": "ur company?s corporate policies and procedures, which are strictly     enforced at the water treatment plant.\n\n\n    Alternative Release Scenario for Chlorine\n\n    Our alternative release scenario for chlorine involves a chlorine release of             approximately 317lbs through the vent line, should a vacuum regulator failure         occur. Credit is taken in accordance with EPA's simplified approach for             the partial containment of chlorine vapor by the room/building enclosure, which         mitigates the release, and also by conservatively figuring the vacuum feed system         to fail at a point during a leak. The building confinement reduces the release rate         of chlorine vapor directly to the outdoors. Since this facility is located in a semi-         populated area, the toxic cloud formed by the evaporating chlorine would reach         off-site end points and nearby public receptors.\n\n    As in the WCS, we have taken a very conservative approach to determining the         ARS endpoint distance off-site. In determining the ARS endpoint distance we         have, in this case, taken credit for active mitigation provided by engineered         safeguards that include chlorine monitors/detectors that automatically activate an         alarm in the control room and the vacuum feed system. The chlorine leak             detection system is calibrated to initiate alarms at very low concentrations of         chlorine (i.e., lower than industry recommended settings). As stated in the             description of the WCS, numerous administrative controls are in place to prevent         a release of this type and to provide effective emergency response should one         occur.\n\n    We are using this information to help us ensure that our site/facility emergency         response plan and the community emergency response plan address all reasonable     contingency cases.\n\nAccidental Release Prevention Program and Chemical-specific Prevention Steps for Chlorine\n\nWe take a systematic, proactive approach to preventing accidental releases of hazardous chemicals. Our RMP-regulated chlorine process i"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 48476,
      "SummaryText": "s also subject to the Occupational Safety and Health Administration's (OSHA's) process safety management (PSM) standard. We have extended the PSM program at this facility, where necessary, to satisfy EPA's Program Level 3 accident prevention program requirements. Our PSM Program and RMP Level 3 Prevention Program are designed to comply with OSHA and EPA requirements.  Additionally, we adhere to chlorine industry    (i.e.., Chlorine Institute) and American Water Works Association guidance and recommended practices for PSM and RMP programs, including facility and chlorine system design and safety practices.\n\nOur accidental release prevention programs and our contingency planning efforts help us effectively manage the hazards that are posed to our employees, contractors, the public, and the environment by our use of chlorine in treating drinking-quality water. We are using this information to help us ensure that our emergency response plan and the community emergency response plan address all reasonable contingency cases. Our systematic, proactive management systems address each of the key features of successful prevention programs including:\n\n        Process safety information\n         Process hazard analysis\n         Operating procedures\n         Training\n         Mechanical integrity\n        Management of change\n        Pre-startup review\n        Compliance audits\n         Incident investigation\n            Employee participation\n         Hot work permit\n         Contractors\nAs part of our prevention efforts, the following is a list of key safeguards and chlorine-specific accidental release prevention steps that we have implemented at our site:\n\n          A new, state-of-the-art chlorine feed system\n\n    Instrumentation and control systems with an emergency power supply designed         in accordance with current industry (recognized and generally accepted good         engineering) practices\n\n    Corrosion-resistant equipment components and piping systems\n\n    Protective devices to prevent the formation of excessive pressure in chlorine         equipment\n\n    Isolat"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 48476,
      "SummaryText": "ion valves to permit isolation of different parts of the process\n\n    Chlorine monitors/detectors with alarm notification to a constantly attended         control room and to other key facility locations\n\n    A liquid chlorine spill collection and containment system consisting of floor         drains\n\n    Chlorine rooms designed to help contain a chlorine release, and building             construction materials that will not support fire development, fire spread, and fire         damage to equipment\n\n    Strict administrative controls prohibiting the entry and use of combustible             materials in chlorine handling/use areas to prevent and control fire spread that         may pressurize equipment\n\n       Cross-trained operations and maintenance personnel that are equally             trained in emergency response actions for chlorine releases to the OSHA             (29CFR1910.120) HAZWOPER responder level\n\nThese individual elements of our prevention program work together and in tandem with the chlorine release prevention steps to prevent accidental chemical releases. Our company, our employees, and contractors are committed to the standard that these management systems set for the way we do business, and we have specific, internal management accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\nFive-year Accident History\n\nWe keep records for all significant accidental chemical releases that occur at our facility.  During the past 5 years we have not had any releases involving chlorine from the RMP-covered process that had any reportable on-site or off-site effects.  Our facility has instituted procedures that require formal investigation of incidents involving chemical releases, regardless of chemical identity or listing by the EPA RMP rule. For each incident, we conduct formal incident investigations to identify and correct the root causes of the events.\n\nEmergency Response Program\n\nThe West Virginia-American Water Company's Weston Water Treatment Plant maintains an integrated"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 48476,
      "SummaryText": " contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning. Our program provides the essential planning and training for effectively protecting workers, contractors, the public, and the environment during emergency situations. The program consists of procedures for responding to a chlorine release. The procedures address all aspects of emergency response, including (1) proper first aid and emergency medical treatment for human exposures, (2) facility evacuation plans and accounting for facility personnel after an evacuation, (3) notification of local emergency response agencies and the public if a release occurs, and (4) post-incident follow-up requirements. Procedures are in place governing the establishment of the plant's Emergency Operation Center where management personnel can direct and control emergency operations on an as-needed basis.\n\nIn addition, we have procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment. Employees receive training in these procedures to perform their specific emergency response duties. The emergency response program is updated when necessary based on modifications made to plant facilities or to the chlorine storage and feed process, or when improvement benefits are recognized. Affected personnel are informed about, and trained on, the changes.\n\nThe overall emergency response program for the plant is coordinated with the local emergency planning committee (LEPC) having jurisdiction in Lewis and Upshur Counties - and with Lewis County and Weston, West Virginia, emergency management officials. We have around-the-clock communications capability with appropriate emergency response organizations (e.g.., contracted chlorine emergency response [HAZMAT] teams, local fire department, police department). This provides a means for notifying the public of"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 48476,
      "SummaryText": " an incident, if necessary, as well as facilitating quick response to an incident. Additionally, we conduct periodic walk-around orientation tours of the plant facilities with key representatives of local emergency response organizations. During such tours we discuss and review the source of chlorine at our site, the hazards of a chlorine release, release mitigation features and emergency response actions involving the chlorine system.  Thus, our emergency response plan is fully coordinated with the community emergency response plan.\n\nPlanned Changes to Improve Safety\n\nAt the West Virginia-American Water Company Weston Water Treatment Plant we constantly strive to improve the safety of our operations through periodic safety reviews, our incident investigation program, and a program for soliciting safety suggestions from our facility workers. We resolve all findings from our reviews of proposed changes to facilities, equipment, and operations and from analyses of process hazards. Some findings of this type can result in modifications to the process. the prevention program, or administrative controls. The following is a list of improvements that we are planning to implement at the facility during the next 5 years to help prevent and/or better respond to accidental chemical releases:\n\n    An engineering review of the leak-tightness of each chlorine room to more         precisely determine the building (containment) mitigation factor, possibly             resulting in reduced endpoint distances for WCS and ARS releases of chlorine\n\n    An assessment of the effectiveness of each element of the Level 3 Prevention         Program to ensure that the program will achieve its objectives and to strive for         continuous program improvement\n"
    }
  ]
}