{
  "FacilityID": 48503,
  "FacilityName": "Pregis Corporation - Queensbury, NY - Plant 2",
  "FacilityStr1": "300 Lower Warren Street",
  "FacilityStr2": null,
  "FacilityCity": "Queensbury",
  "FacilityState": "NY",
  "FacilityZipCode": "12804",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36113",
  "LEPC": "Warren County LEPC",
  "FacilityLatDecDegs": "43.312041",
  "FacilityLongDecDegs": "-073.620712",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A6",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Pregis Corporation",
  "Company2Name": null,
  "CompanyDUNS": 609692012,
  "Company2DUNS": 0,
  "OperatorName": "Pregis Corporation",
  "OperatorStr1": "1650 Lake Cook Road",
  "OperatorStr2": "Suite 400",
  "OperatorCity": "Deerfield",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60015",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gene Tomczak",
  "RMPTitle": "Plant Manager",
  "FTE": 80,
  "OtherEPAFacilityID": "NYR000039206",
  "EPAFacilityID": "100000191561",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-10-01 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-06-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 1,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-06-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-06-08 00:00:00",
  "CBIFlag": 1,
  "CBIUnsanitizedVersionFlag": 1,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 70340,
      "AltID": "Plant 2",
      "FacilityID": 48503,
      "ProgramLevel": 3,
      "CBI_Flag": 1,
      "_naics": [
        {
          "Process_NAICS_ID": 72032,
          "ProcessID": 70340,
          "NAICSCode": "32615",
          "_desc": {
            "NAICS_CODE": "32615",
            "NAICS_DESCRIPTION": "Urethane and Other Foam Product (except Polystyrene) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 93542,
          "ProcessID": 70340,
          "ChemicalID": 155,
          "Quantity": null,
          "CBI_Flag": 1,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 74266,
              "ProcessChemicalID": 93542,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 74267,
              "ProcessChemicalID": 93542,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 593542,
          "ProcessID": 70340,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 1,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48503,
      "SummaryText": "Pactiv Corporation Queensbury, NY Facility (Plant 2)\nRisk Management Plan (RMP) Executive Summary\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nPactiv is committed to employee, public and environmental safety. Corporate EH&S personnel assist facilities in developing programs to meet internal environmental and safety goals.  The Queensbury, NY facility (Plant 2) has on-site support to coordinate health, safety and environmental programs.\n\nThe facility maintains a comprehensive accidental release prevention program that covers design, installation, operation, maintenance and training for affected processes.  Pactiv maintains programs and procedures consistent with the requirements of OSHA's Process Safety Management (PSM) program, which serves as a basis for implementation of the facility's RMP program.  In the event that any unforeseeable release might still occur, the facility coordinates emergency response primarily with local fire departments.  The Warren County LEPC is provided, on an annual basis, the approximate quantities maintained onsite within their covered processes.  The covered process for Plant 2 includes (1) 12,800 gallon tank and all associated conveyance systems for the storage and transfer of the RMP-regulated process blowing agent.\n\nStationary Source and regulated Substance\n\nThe facility manufactures various polyethylene foam products and bubble wrap.  The foam manufacturing processes use a regulated flammable gas as a blowing agent.  The maximum inventory of blowing agent at the facility exceeds the 10,000-lb RMP threshold.\n\nThe General Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nSummarized below is a brief description of the facilitys program elements:\n\nProcess Safety Information\nThe facility maintains process safety information that describes chemical hazards, operating parameters and equipment designs associated with the covered process.\n\nProcess Hazard Analysis\nIn order to identify and then "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48503,
      "SummaryText": "control the hazards of the process, the facility has performed a What-If HAZOP analysis using a team of qualified personnel.  The hazard review is updated at least every 5 years or when major changes are made.  The findings are addressed in a timely manner and documented.\n\nOperating Procedures\nTo ensure the covered process is operated safely, written operating instructions have been developed, maintained and made available to operators.  These procedures address various modes of operation such as start-up, shutdown, normal operation, temporary operations, emergency shutdown and emergency operation.\n\nTraining\nThe facility trains employees that operate covered processes initially, as changes are made and conducts refresher training\n\nMechanical Integrity\nThe facilitys maintenance personnel perform documented maintenance on covered process equipment to ensure proper operation.  The work is performed by trained maintenance personnel and the equipment includes storage tanks, piping systems, relief vent and vent systems, control pumps, etc.\n\nManagement of Change\nWritten Management of Change procedures are maintained at the facility, which cover changes to process chemicals, technology, equipment and procedures.  Operating and maintenance personnel affected by changes are made aware of the changes and trained as needed.\n\nPre-Start Up Safety Reviews\nThese reviews are conducted for initial startups and following modifications.  The reviews confirm that construction, equipment and operating and maintenance procedures are suitable for a safe startup prior to placing the equipment into operation.\n\nCompliance Audits\nAudits are conducted to ensure that the provisions of PSM and RMP are being implemented.  Any necessary corrective actions are undertaken in a safe and prompt manner.\n\nIncident Investigation\nFacility personnel promptly investigate any incident that has or could reasonably have resulted in a catastrophic release of a regulated substance.  The investigations seek to ide"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48503,
      "SummaryText": "ntify root causes and any corrective actions necessary to prevent recurrences.\n\nContractors\nThe facility occasionally uses outside contractors to perform specialized maintenance or construction activities.  Hazards that could be encountered related to the covered process are reviewed as well as site specific safety rules and emergency response procedures.\n\nWorst-Case and Alternative Release Scenarios\n\n    Worst-Case Release Scenario  Vapor Cloud Explosion\n    Quantity Released  One, 12,000 gallon tank (Approximately 52,000 lbs)\n    Alternative Release Scenario  Pool Fire\n    Quantity Released  One, 12,000 gallon tank (Approximately 52,000lbs)\n\nThe affected process at the facility is equipped with various process controls and mitigation systems such as relief valves, check valves, automatic shutoffs, interlocks, alarms, excess flow devices, sprinkler systems, fencing etc. and maintains operating procedures to decrease the potential for a release event. \n\nFive-Year Accident History\n\nThere have been no significant accidental releases from the covered process during the past 5 years.\n\nEmergency Response Plan\n\nThe facility maintains a written emergency response plan to deal with potential accidents related the covered process.  The plan includes first aid response, notification of emergency responders and evacuation.  Pactiv employees do not directly respond to incidents such as fires beyond the incipient stage.  The plan is communicated to employees and updated as needed.\n\nPlanned Stages to Improve Safety\n\nPactiv involves all employees in managing safety by setting goals, conducting safety meetings/training, forming safety teams and enforcing safety rules."
    }
  ]
}