{
  "FacilityID": 48560,
  "FacilityName": "Foamex, LP",
  "FacilityStr1": "2060 N. Batavia Ave,",
  "FacilityStr2": null,
  "FacilityCity": "Orange",
  "FacilityState": "CA",
  "FacilityZipCode": "92865",
  "Facility4DigitZipExt": "3102",
  "FacilityCountyFIPS": "06059",
  "LEPC": null,
  "FacilityLatDecDegs": "33.821389",
  "FacilityLongDecDegs": "-117.864444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.foamex.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 803865997,
  "ParentCompanyName": "Foamex International, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 619971039,
  "Company2DUNS": null,
  "OperatorName": "Foamex, LP",
  "OperatorStr1": "2060 N. Batavia Ave,",
  "OperatorStr2": null,
  "OperatorCity": "Orange",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92865",
  "OperatorZipCodeExt": "3102",
  "FTE": 310,
  "OtherEPAFacilityID": "CAD008352361",
  "EPAFacilityID": "100000107591",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-03-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2007-06-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2004-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 33.82137,
  "FRS_Long": -117.86208,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 70442,
      "AltID": "Polyurethane Foam Manufac",
      "FacilityID": 48560,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 93653,
          "ProcessID": 70442,
          "ChemicalID": 77,
          "Quantity": 1118858.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 72135,
          "ProcessID": 70442,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 25761,
              "Process_NAICS_ID": 72135,
              "SafetyReviewDate": "2004-03-01 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2003-12-03 00:00:00",
              "ChangeCompletionDate": "2003-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-06-10 00:00:00",
              "TrainingReviewDate": "2004-06-10 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-06-10 00:00:00",
              "EquipmentInspectionDate": "2004-06-10 00:00:00",
              "EquipmentTested": "TDI Pump/Piping/Heat Exchanger/Flow Meters/Level Controls/Unloading Lines/Storage Tanks",
              "ComplianceAuditDate": "2002-06-25 00:00:00",
              "AuditCompletionDate": "2004-07-15 00:00:00",
              "IncidentInvestigationDate": "1999-05-19 00:00:00",
              "InvestigationChangeDate": "1999-11-01 00:00:00",
              "MostRecentChangeDate": "1999-05-19 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 26952,
                  "PreventionProgram2ID": 25761,
                  "ProcessChemicalID": 93653
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 48560,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-07-15 00:00:00",
    "ERTrainingDate": "2003-12-05 00:00:00",
    "CoordinatingAgencyName": "Orange Fire Dep't",
    "CoordinatingAgencyPhone": "7142882500",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48560,
      "SummaryText": "EXECUTIVE SUMMARY\n\nAccidental release prevention and emergency response policies\n\nAt the Foamex LP Plant in Orange, California, we handle toluene diisocyanate (TDI), which is considered hazardous and regulated by the EPA.  The same properties that make TDI valuable for use at our facility also make it necessary to observe certain safety precautions in the handling of the substance.  Safety precautions have been implemented to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as our co-workers, and to reduce the threat to nearby members of our community.  It is our policy to adhere to all applicable federal and state rules and regulations.\n\nWe are committed to the safety of our employees and the public, and to the preservation of the environment, through the prevention of accidental releases of hazardous substances.  Successful implementation of our accidental release prevention program will help ensure that emergencies are unlikely and reduce the likelihood that emergency response procedures will be needed.  Nevertheless, an emergency such as a release of TDI is possible.  We have emergency response procedures to help ensure that accidents will be mitigated properly without undue risk to the public, environment, employees, contractors, or other personnel within the plant.\n\nDescription of the facility and the regulated substances handled\n\nThe primary purpose of this facility is to produce flexible polyurethane foam and carpet pad, which is sold to other facilities and used to produce bedding, furniture, carpet pad and a number of other products.  TDI is one of the reactants required to produce polyurethane foam and carpet pad.  TDI is received by rail car and by tank truck, and is stored in outdoor storage tanks.  The maximum quantity of TDI stored in rail cars and in storage tanks at our plant is about 1,200,000 pounds.  The TDI is piped to a mix head or reactor  where it is mixed with other reactants to produce a slab of"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48560,
      "SummaryText": "polyurethane foam or carpet pad.  The foam is conveyed to cutting stations where it is cut to the size and shape specified by our customers.\n\nTDI is the only substance handled at our plant that is regulated by EPA¿s risk management program (RMP) rule.  TDI is covered because the maximum quantity stored onsite exceed EPA¿s threshold quantity (TQ) of 10,000 pounds.\n\nOffsite consequence analysis of release scenarios\n\nAn offsite consequence analysis (OCA) was performed to estimate the potential for an accidental release to affect the public or the environment.  The OCA consists of evaluating worst case release scenarios (WRSs) and alternative release scenarios (ARSs).  We do not expect a worst case release scenario to ever occur.  An ARS represents a release that might occur during the lifetime of a facility like ours.  ARSs help us to work with the local emergency planning committee (LEPC) to improve the community emergency response plan.\n\n\n\n\n\n\nFoamex LP Orange, California Plant\nRMP Executive Summary\nJune 11, 2004\nPage 2\n\nThe main objective of performing the OCA is to determine the distance at which certain effects might occur to the public because of an accidental release (called the endpoint distance).  The following effects could occur at the endpoint distance:\n\n¿\tMost people at the endpoint distance of a TDI release would be able to walk away from the exposure without any long-term health consequences, although some short-term consequences (e.g., strong eye or throat irritation) are likely.  Some people who are particularly susceptible to the released substance could be incapacitated.\n\nWorst case release scenarios.  Catastrophic failure of a TDI rail car, having a capacity of 200,000 lbs. TDI, would be a worst case release for a toxic substance because a TDI rail car is the largest non-bermed outdoor TDI container at the plant.  The TDI vendors limit the quantity of TDI loaded into a railcar to 192,000 lbs. maximum to allow space for thermal expansion during possi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48560,
      "SummaryText": "ble heating of the TDI.  During cold weather, we pre-heat the TDI to a maximum temperature of  95 °F to facilitate unloading and prevent TDI solidification.  During hot weather, the TDI temperature could reach the maximum ambient temperature of 100 °F.  Because a release at a higher temperature will result in the greatest endpoint distance, we assumed the release would occur at 100 °F.  We also assumed that the entire contents of the railcar would be released as a liquid, form a pool that would spread to cover an area of approximately 80,000 ft2 with a depth of about 0.4 inches (1 cm), and evaporate to form a cloud that would disperse downwind.  Refined dispersion modeling predicts a distance of 483 ft. from the rail car to the TDI toxic endpoint concentration of 0.98 ppm (0.007 mg/L).\n\nAlternate Release Scenarios.  Rupture of the transfer line from the railcar-unloading pump to the TDI storage tank would release TDI to the ground at the standard pump rate of 610 lb/min.  We assumed that the release would continue for the 15  minutes required for an employee to stop the pump using remote emergency shutdown controls.  The resulting pool would spread to cover an area of approximately 3660 ft2 with a depth of 0.4 inches and evaporate to form a cloud that would disperse downwind.  Refined dispersion modeling predicts a distance of less than 36 ft. from the pool to the TDI toxic endpoint concentration of 0.98 ppm.\n\n\nThe general accidental release prevention program and specific prevention steps\n\nThe plant has implemented programs and procedures that comply with EPA¿s Level 2 Accidental Release Prevention Program Rule.  Our facility qualifies for Level 2 coverage because (1) our worst case release scenarios for TDI can impact persons across the property boundary of the nearest public receptor, and (2) TDI is not a substance covered by OSHA¿s process safety management standard (PSM).  Our accidental release program is designed to systematically accomplish the following fun"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 48560,
      "SummaryText": "ctions:\n\n-\tControl the creation and retention of safety information regarding the regulated substances, processes and equipment\n-\tConduct hazard reviews to identify, evaluate, and control process hazards associated with the regulated substances, processes, and procedure\n-     Create, maintain and evaluate operating procedures for processes that use regulated substances\n\n\nFoamex LP Orange, California Plant\nRMP Executive Summary\nJune 11, 2004\nPage 3\n\nThe general accidental release prevention program and specific prevention steps (continued)\n\n-\tProvide training for personnel who operate covered processes so that they safely perform their jobs\n-\tMonitor and control maintenance activities that can affect the mechanical integrity of equipment used in covered processes\n-\tConfirm through compliance audits that RMP practices at the plant are consistent with our written programs and that the programs are adequate to address all of the requirements of the RMP rule\n-\tEnsure that process incidents, particularly those of catastrophic magnitude or potential, are thoroughly investigated using our incident investigation procedures and that relevant findings are communicated throughout the company to help prevent recurrence\n\t\n\t\n\tThe TDI process at our plant has hazards that are carefully managed to ensure continued safe operation.  The prevention program outlined above is applied to the TDI process.  Collectively, these prevention program activities help prevent potential accidental releases that could be caused by equipment failures, human errors, and by management system failures.\n\t\n\tIn addition to the accidental release prevention program, our plant has safety features on many units to help (1) contain or control a release, (2) quickly detect a release, and (3) reduce the consequences of or mitigate a release.  The following types of safety features are used in various units of the TDI process:\n\t\n\tRelease detection \n\t\n-\tThree stage alarm system on TDI day tank\n\t-     Low and high"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 48560,
      "SummaryText": "flow monitors on chemical streams on foam production machine\n\t\n\tRelease Containment/Control\n\t\n-\tTDI storage tanks have high level unloading pump shut-off\n-\tCurbing or dikes to contain TDI liquid releases\n-\tTDI storage tanks located inside a bermed area\n-\tAutomated shutdown systems for critical process parameters (e.g. high level, high pressure)\n-\tPressure/vacuum relief devices on vessels to prevent rupture or collapse\n-\tRemote shutdown of unloading and transfer pumps\n-\tMagnetic drive TDI centrifugal pumps without seals for unloading and transfer\n-\tValves to permit isolation of the process\n-\tTDI railcar inner tank is surrounded by an outer shell filled with insulation\n-\tTDI railcars are top unloaded through a nozzle in the top of the tank\n-\tVapor from storage tank is piped to a carbon bed adsorber\n\t\n\t\n\t\n\t\nFoamex LP Orange, California Plant\nRMP Executive Summary\nJune 11, 2004\nPage 4\n\t\n\tThe general accidental release prevention program and specific prevention steps (continued)\n\t\n\tRelease Mitigation\n\t\n-\tFire suppression and extinguishing systems\n-\tTrained emergency response personnel\n-\tPersonal protective equipment (e.g., protective clothing, self-contained breathing apparatus, breathing air stations)\n\nFive-year accident history\n\nWe have had no releases of TDI in the last 5 years that resulted in deaths, injuries, or significant property damage on site, or known deaths, injuries, evacuations, sheltering-in-place, property damage, or environmental damage off site.  We have had 1 small release of TDI over the past 5\nyears.  This release occurred inside an operating building and was too small to result in injuries or significant damage.\n\nEmergency Response Program\n\nOur emergency response program is based on the requirements in OSHA¿s emergency action and fire prevention plan regulation, OSHA¿s hazardous waste and emergency operations regulation, and EPA¿s emergency response program requirements in its RMP rule.  Our program consists of procedures for responding to a releas"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 48560,
      "SummaryText": "e of TDI.  The procedures address all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident cleanup and decontamination requirements.  In addition, the plant has procedures that address maintenance, inspection and testing of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary, based on modifications made to plant processes or other facilities.  Personnel affected by changes in the program are informed and or trained on those changes.\n\nThe overall emergency response program for the plant is coordinated with the LEPC.  This coordination includes participation in periodic meeting of the committee, which includes local emergency response officials, local government officials, and other industry representatives.  The plant has around-the-clock communications capability with the appropriate LEPC officials and emergency response organizations such as the fire department.  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  The plant also conducts periodic emergency response drills. \n\n\n\n\n\n\nFoamex LP Orange, California Plant\nRMP Executive Summary\nJune 11, 2004\nPage 5\n\nPlanned changes to improve safety\n\nWe strive to continuously improve the safety of our plant TDI process through periodic safety reviews and a program of soliciting safety suggestions from employees.  Our hazard review and incident investigation programs are especially designed to identify needed process safety improvements, some of which result in changes to the processes.  The following changes are currently planned for implementation:\n\n-\tUpgrade inspections and tests of sele"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 48560,
      "SummaryText": "cted equipment and instrumentation designed to prevent TDI releases\n\n-     Revise operating procedures to resolve findings from the latest TDI process hazard \n      review"
    }
  ]
}