{
  "FacilityID": 48582,
  "FacilityName": "Exel Fontana, CA  Scotts",
  "FacilityStr1": "13277 San Bernadino Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Fontana",
  "FacilityState": "CA",
  "FacilityZipCode": "92335",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06071",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "34.077750",
  "FacilityLongDecDegs": "-117.518800",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A6",
  "LatLongDescription": "AB",
  "FacilityURL": "exel.com",
  "FacilityEmailAddress": "eric.spalsbury@us.exel.com",
  "FacilityDUNS": 147211270,
  "ParentCompanyName": "OM Scotts Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Exel, Inc.",
  "OperatorStr1": "13277",
  "OperatorStr2": "San Bernadino Ave.",
  "OperatorCity": "Fontana",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92335",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brent Humphrey",
  "RMPTitle": "General Manager",
  "FTE": 22,
  "OtherEPAFacilityID": "CAL000268252",
  "EPAFacilityID": "100000183473",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2005-06-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2005-05-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-09-24 00:00:00",
  "DeRegistrationEffectiveDate": "2005-10-01 00:00:00",
  "AnniversaryDate": "2010-05-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 34.07583,
  "FRS_Long": -117.51333,
  "FRS_Description": "NE CORNER OF LAND PARCEL",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 70472,
      "AltID": "Warehousing",
      "FacilityID": 48582,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 72166,
          "ProcessID": 70472,
          "NAICSCode": "49311",
          "_desc": {
            "NAICS_CODE": "49311",
            "NAICS_DESCRIPTION": "General Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 93694,
          "ProcessID": 70472,
          "ChemicalID": 98,
          "Quantity": 1.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 593694,
          "ProcessID": 70472,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48582,
      "SummaryText": "\n\n\nFONTANA, CA SCOTTS FACILITY\n\nRisk Management Program\n\nExel General Manager ? Brent Humphrey \nExel Corporate Safety, Health and Environmental Manager ? Eric Spalsbury\nExel Regional Safety, Health and Environmental Manager ? Cherene Donaldson\n\nPrepared by:  Brent Humphrey, Eric Spalsbury and Cherene Donaldson\n\nExel\n13277 San Bernadino Ave\nFontana, CA     92335\n\n\n\n\nApplicable Chemical/Substance ?     Propane CAS # 74-98-6\n\nExecutive Summary\n\nEPA Risk Management Plans are required for facilities that store, handle, process, or manufacture ?Hazardous Substances? per CAA 112(r). Propane is the only product stored at the Fontana Scotts location, which meets the reporting requirements, stipulated for listed EPA RMP chemicals/substances. The processes being performed at the Fontana Scotts operation are limited to basic warehousing and distribution activities.  While the operations are not subject to the requirements of the OSHA Process Safety Management (PSM) Program, we implement critical aspects of the program (see below) as good business practice.  \n\nProgram Elements\n\nThe following program elements are currently in place at the Fontana Scotts facility designed to meet regulatory requirements;\n\n\n\nRisk Management Program Elements \n\n-    Emergency Response Plan\n-    Hazard Evaluation and Release Program\n-    Hazard Evaluation and Release Modeling Information (RMP*Submit)\n-    Prevention Program\n\nProcess Safety Elements -\n\n-    Process Safety Information\n-    Process Hazard Analysis\n-    Operating Procedures\n-    Training\n-    Mechanical Integrity\n-    Management of Change\n-    Documented Compliance Audits\n-    Incident Investigation Procedures\n-    Employee Participation\n-    Hot Work Permits\n\n\n\n\nThese program elements have been implemented in an effort to comply with the EPA RMP Level I program requirements.\n\n\n\n\nExel Fontana Scotts Facility\nEPA RMP Program\n\nTable of Contents\n\n\n1.    Risk Management Plan Program Elements\n\n1.1.    Emergency Response Plan\n1.2.    Program Elements Included in Completion of RMP*Submit \n\n2.    Proce"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48582,
      "SummaryText": "ss Safety Management Program Elements\n\n2.1.    Process Safety Information\n2.2.    Process Hazard Analysis\n2.3.    Operating Procedures\n2.4.    Training\n2.5.    Mechanical Integrity\n2.6.    Management of Change\n2.7.    Compliance Audits\n2.8.    Incident Investigations\n2.9.    Employee Participation\n2.10.    Hot Work Permits\n\n\n\n1.      Risk Management Plan Program Elements\n\n\n1.1    Emergency Response Plan\n  \nEmergency response information is also included the RMP*Submit program. The site-specific program is as follows:\n\n\nExel Fontana Scotts Emergency Action Plan\n\nPurpose:\nThe purpose of this Emergency Action Plan (EAP) is to present in general outline form, an organized plan that should be followed in the event of an emergency situation.\n\nScope:\nThis Emergency Action Plan applies to all occupants of this facility.  (Exel Associates, Contract Workers, Visitors and Vendors)\n\nProcedure:\nEmergency Response Signaling\nEmergency Response Signaling can be done by one of two methods: air horns and word of mouth.  Emitting a sequence of blasts from an air horn will be the primary means of Emergency Response Signaling.\n\nThe Emergency Response Signaling Sequence will be as follows:\n\nFire Emergency        =     Long Blast-----Short Blast-----Long Blast\n(Sequence of blast will stop for 4 seconds and sequence of blast will sound again.)\n\nSpill Emergency        =    Short Blast---Short Blast---Short Blast\n(Sequence of blast will stop for 4 seconds and sequence of blast will sound again.)\n\nEarthquake/Tornado Emergency    =    Long Continuous Blast.\n\nIf the Emergency Response Signaling Horns are malfunctioning or are found not to be effective, the ?Person in Charge? must notify other facility occupants of the emergency situation and give them instructions.  ?Person in Charge? must utilize telephone, radio or send Associate to facility location, which is not receiving the Emergency Response Horn signal.\n\n\nFire Emergency Response:\n\nA.    Notify someone (co-worker or supervisor) that a fire has started in the facility before trying to extinguish it y"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48582,
      "SummaryText": "ourself.  The reason for this is so that the fire department can be called and on its way and facility occupants can be notified to evacuate.  (This will help save valuable fire fighting time.)\nB.    Once the fire emergency signal is sounded, workers must shut off machinery or equipment and evacuate the facility to the assembly point.\nC.    The Emergency Response Team (ERT) is responsible for insuring that all non-ERT employees have safely evacuated the facility (Visitors, Contractors, Customers and Truck Drivers)\nD.    If the fire is fueled by an electrical source the electrical power must be turned off.\nE.    Emergency Response Team members must use the wall-mounted portable fire extinguishers to fight a fire.  The ERT members must only attempt to extinguish small fires, which cover a very small and limited area.  If one or two portable fire extinguishers seem to have no effect on the fire and the fire seems to be growing, the ERT members need to evacuate the area and report to the assemble areas.\nF.    Once a fire has been extinguished, the ERT members need to remain and secure the scene (insure that the fire does not re-ignite.)  They must clean up spills, damaged product and/or damaged equipment.\n\n\nMedical Emergency Response:\n\nA.    For serious medical emergencies, someone must call ?911? immediately.  Other workers should never drive workers with serious medical conditions to the emergency room.  The local fire department/EMS should respond within 4 minutes of emergency call.\nB.    If injured workers condition requires immediate medical attention before the ambulance arrives (heavy bleeding, shock or breathing stops,) first-aid-trained workers must attempt to stabilize the worker?s condition.\nC.    The ERT member?s first concern during an emergency response is to ensure that all workers are able to evacuate the facility.  If for some reason a worker is unable to do so, the ERT member must first assist the worker in evacuation before tending to the emergency itself.\n\nEarthquake Respon"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 48582,
      "SummaryText": "se:\n\nA.  Seek immediate safe shelter.\n\nB.    Evacuate the building if necessary.\n\nC.    Ensure that all associates are safely distanced from bulk storage piles and rack storage area.\n\nE.    Activate the facility?s Emergency Action Plan (EMP)\n\nF.  Activate the facility?s Incident Command System Plan (EMP)\n\n\n\n\n\nTornado Emergency Response:\n\nA.    Facility Managers will monitor weather conditions and local radio station for tornado warnings or sightings in general area.  If the Facility Manager has reason to believe that a tornado is in the area, they must sound the tornado-warning signal to alert workers of the danger.  Office and remote workers, which may not hear the warning signal, must be notified of a tornado emergency.\nB.    Once workers have been alerted of a tornado they must precede to the innermost part of the office area or structure portion of the warehouse.  If you are unable to reach the inside of a facility before a tornado strikes, try to find a low-lying area such as a ditch to lie down in.\nC.    Do not attempt to close bay doors or bring equipment into facility.  Tornadoes strike quickly.\n\nHurricane Emergency Response:\n\nThe following items are to be completed during a ?Hurricane Warning & Watch? or in anticipation of a ?Tropical Storm? which is believed to pass the Houston area and should be followed in a three-part phase:\n\nPhase 1\n\nThis phase is designed to help sites get prepared for a hurricane or tropical storm by completing tasks, which are more time consuming and better accomplished when there is a full work-force still available on site.\n\n?    Secure loose objects such as pallets, drums, scrap items on warehouse facility parking lots\n?    Move other loose objects and equipment indoors\n?    Maker sure breaks are set on all the railcars and dropped trailers\n?    Cover all windows to the offices\n?    Secure all warehouse bay doors which are non-essential and will not be used to bring equipment indoors\n\nPhase 2\n\nThe initiation of this phase will be at the direction of the General "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 48582,
      "SummaryText": "Manager.  Phase 2 coves the orderly closing, isolation and subsequent evacuation of the facility.  The objective of phase 2 is to have the facility secured and the associates released from normal duties prior to the arrival of severe storm conditions n the area.\n\nIn the event of a loss of communication between the General Manager and the facility, the Emergency Action Plan ?Person in Charge? will initiate Phase 2.  The general actions of Phase 2 include:\nA.    Release personnel, including contract associates, who are not essential to an orderly shutdown of the warehouse, shipping & receiving and packaging activities\nB.    All truck and rail doors are to be fastened securely\nC.    Three separate copies of inventory in storage will be made.  Once copy will be kept on site, the second copy will go home with the facility General Manager and the third copy will go home with the Office Manager or ?Person in Charge.?\nD.    Where practical, electrical power will be left on for equipment such as lighting, air compressors, sprinklers system alarms and security systems, etc.\nE.    All other items not secured during Phase 1, such as operation computer equipment should be secured in the innermost office where there are no windows.\n\nPhase 3\nAfter the storm has passed, Associates should report back to the facility as instructed by supervisors.\n\n\nBomb Threat? Response:\n\nA.    All bomb threats should be taken seriously and the facilities General Manager should call ?911.?  If the General Manager is not present on the campus, the facility?s ?Person in Charge? should make the ?911? call.\nB.    Workers should evacuate the facility immediately and not return until the police give the OK to do so.\n\n\nSpill Emergency Response:\n\n1.    Small Spills:\n\nA.    The Spill Emergency signal must be sounded for small or significant spills of Hazardous Chemicals (>55 gal).  This will alert Emergency Response Team members to a spill emergency and give other employees the opportunity to safely evacuate the facility\nB.    Employees w"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 48582,
      "SummaryText": "ho cause or discover a spill situation must notify Facility Supervisor or ERT Member of emergency and follow their instructions\nC.    Only Authorized Individuals shall respond to hazardous chemical spills\nD.    Responder should position the drum in such a manner to prevent further leaking\nE.    Use absorbent material and containment booms to control and clean up spill.\nF.    Place leaking drum into a recovery drum.  The absorbent and other clean-up material along with contaminated PPE should be placed into a separate recovery drum.\nG.    The floor area may need to be washed down.  Follow the instructions indicated in the products MSDS.\nH.    Facility should be allowed to ventilate Hazardous Chemical vapors before allowing work to resume.\n\n2.    Large Spills:\n\nA large or major spill (Hazardous Chemical) would be a spill that could possible exit the building and enter the storm drains or be a ?Hazardous Chemical? which Exel ?Emergency Response Team? members are not authorized to clean up.  ?Hazardous Chemical? spills, which Exel ?Emergency Response Team? members are not authorized to respond, will require Exel to call a third party ?Hazardous Material Spill Responder.?\n\nHazardous Chemical:\n\nProduct Name    Hazard Classification    Customer\nPropane    Flammable Gas    OM Scott\n        \n\nThird Party ?Hazardous Material Spill Responders?: (call by order of listing)\nERTS            1-800-210-6804\nCURA            1-800-579-2872\nCHEMTREC        1-800-424-9300\n\nA.    All spills will require immediate notification of Facility Manager or ?Person in Charge.?\nB.    ?Person in Charge? should signal the spill emergency horn to alert workers to evacuate the facility.  Assembly points should be chosen based on wind direction.  Office serves as ?secondary assembly point.? (turn off air-conditioner)\nC.    All storm drains in immediate area need to be sealed off.  Parking lot ditch serves as containment for spills exiting warehouse facility.  Please view ?Facility Map? for automatic ?gate valve close switch? stations.\nD.    ERT members need to prevent as much"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 48582,
      "SummaryText": " spilled liquid from escaping the facility as possible.\nE.    If third party ?Hazardous Material Spill Responder? is called, a copy of spilled material MSDS will need to be presented to Responder.\n\nExternal (off-site) Hazardous Chemical Spill or Release:\n\nExternal hazardous chemical spill or release will consist of the following:\n?    Hazardous chemical release from nearby facilities\n?    Hazardous chemical release from transport vehicles on I 10, I 15, San Bernadino Ave., Etiwanda Blvd., Valley Blvd., or Commerce Dr.\nFollow instructions given by ?Person in Charge,? evacuation may require occupants to assemble inside office.\n\nEmergency Response Phone Numbers\n\nEmergency Response:\nFire        911 \nPolice        911 \nMedical    911 \nHAZMAT    911\n\nPoison Control Center                    1-800-764-7661\n  (California Poison Control)                    909-424-8802\nCHEMTREC                            1-800-424-9300\nNational Response Center                    1-800-424-8802\nERTS                                1-800-210-6804\nTexas Natural Resource Conservation Commission    1-512-908-1000\nState Emergency Response                    1-512-465-2138\nSan Antonio Medical Center                    909-948-8050\nOntario Community Hospital                    909-988-3805\n\nNon-Emergency:\nCity of Fontana Water Department        909-822-2201\nInland Industrial Clinic            909-930-5270\nAlarm/Security ADT                909-274-4320\nFontana Fire Department            909-383-4321\nFontana Police                909-829-4441\n\nCompany Principals:    Work    Home\n\nBrent Humphrey/General Manager    909-357-1413    951-712-1006\nTony Jacobs/Operations Manager    909-357-1413    760-403-6867\n        \n\n\n\n\nEmergency Action Plan Organization\n\nPerson in Charge:  \n\n?    Directs Emergency Response Activity\n?    Signal Emergency Warning Device\n?    Takes head-count of all Associates, Contractors, Visitors, Customers and Truck Drivers at their location or suspected of being on the property at the time of an emergency\n?    Reports emergency situation to arriving Authorities or Professional Emergency Responders and coordinates activities with them\n?    Makes sure that security and protection measures are restored to their facility after an emergen"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 48582,
      "SummaryText": " Hotwork or utilize vendor/contractor services to conduct Hotwork is required to complete the attached ?Exel Hotwork Plan? for the site and utilize the Hotwork Permit Process  and generate a Hotwork Permit for each Hotwork activity. The site should keep copies of these documents for at least 1 year.  The only time Hotwork can be performed without implementing the process and permit is if a ?safe? Hotwork area is established.  \n\nRisk Management Department Responsibilities\n\nThe Risk Management Department will provide Hotwork Awareness Information and/or Training materials to the site(s).\n\nThe Risk Management Department will periodically quality review any Hotwork Permits utilized at the sites.\n\nContractor/Vendor Responsibilities\n\nAny non-Exel service intending to perform Hotwork onsite is required to follow the OSHA standard.  The contractor/vendor may use Exel?s permit or a comparable permit of their own. Failure to possess and/or utilize an acceptable permit per OSHA standard and Exel guidelines will exclude the use of the contractor/vendor.\nPermit on Following Page\n\nHOT/SAFE WORK PERMIT\nPermit No.\nNOT FOR CONFINED SPACE ENTRY    IN CASE OF EMERGENCY\n    Phone or Radio Channel:    \n    Contact Name:    \nHOT WORK TYPE:    ?  Welding/Cutting    ?  Internal Combustion Engine    ?  Electrical Tools/Equipment\n?  Grinding/Chipping    ?  Live Electrical    ?  Abrasive Blasting    ?  Other \nSAFE WORK TYPE:    ?  Line Breaking    ?  Elevated Work    ?  Asbestos Handling    ?  Other\nLocation & Equipment Involved:                                                                                    \nWork Description (Be Specific):                                                                                    \nPersonal Protective Equipment    Required\nX or N/A        Fire Watch Personnel ? Print Name(s)\nHard Hat            \n\n\n\nFace Shield/Goggles/Safety Glasses            \nCoveralls:  Chem. Resistant/Cotton/Fire Retardant            \nGloves:  cloth/Leather/Chem. Resistant            Special Requirements\nSafety:  Toe/Chemical Resistant Footwear            \nRespiratory Protection:  Air Supplied/Air-Purifying  Type:            \nHearing Protection            \nStandard Welding/Cutting Gear (hood, leathers, etc.)            \nFull"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 48582,
      "SummaryText": "cy situation\n?    Must notify Exel Principals of an Emergency Incident.  (You may be required to fill out a report covering the incident, including dollar loss amounts.)\n?    Must insure that all Associates at their facility affected by Emergency Action Plan receive training in their responsibilities under the plan\n\nPerson Calling Emergency Response Numbers:\n\n?    Call promptly upon receiving order from responsible individual.  (?Person in Charge? or if not on-site, an Associate)\n?    Answer the Emergency Dispatchers questions with short answers.  Do not try to go into great detail when describing the emergency situation but do give a specific facility location of where the emergency situation is occurring.\n?    Remain on phone, if possible, until Profession Emergency Responders (Police or Fire Department) arrive.  If the Emergency Situation threatens the area where you are placing the emergency call, tell the dispatcher of this and evacuate area immediately\n?    Report to assigned assembly area once the Professional Emergency Responders have arrived to the facility\n\nEmergency Response Team Member:\n\n?    Insure that all non-Emergency Responders have evacuated facility to proper Assembly Points\n?    Clean up spills\n?    Extinguish small fires that can be done with portable fire extinguishers.  When it becomes apparent that the portable fire extinguishers will not extinguish the fire, evacuate the facility.  Do not allow your evacuation route to be cut off by a fire\n?    Someone from the Emergency Response Team must keep constant radio contact with the Person in Charge\n?    Duties of ?Emergency Response Team: is not limited to this list\n\n\n\nAll Other Personnel:\n\nAll other personnel not assigned to duties are to report to their assigned assembly area and wait for further instructions from the ?Person in Charge.?\n\n\n1.2    RMP Program Elements (RMP*Submit)\n\nThe EPA RMP* Submit program has been completed in its entirety and shall be submitted to the EPA per regulatory guidelines. The following elements are i"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 48582,
      "SummaryText": "ncluded in the program:\n\n-    Facility Information\n-    Flammable Worst Case Scenario\n-    Flammable Alternate Case Scenario\n-    Accident History\n-    Prevention Program Level I\n-    Emergency Response\n-    Executive Summary\n-    Certification Letter\n\n\n2    Process Safety Management Program\n\n2.1     Process Safety Information\n\nThe manufacturer of the product, OM Scotts, has provided the process safety information and handling procedures to Exel. The Exel Fontana Scotts location will adopt the OM Scotts storage and handling procedure. Furthermore, all current site associates will undergo instruction reference the safe handling and storage of products containing Propane as prescribed by OM Scotts.\n\n\nOM Scotts  -  Storage and Handling Information\n\nProduct: Aerosols containing Propane\nPackage Type: Steel aerosol cans\nApproximate Gross Weight: 14 ounces each.\nApproximate Empty Weight: ~ 4 ounces.\n\nAerosol cans are packaged in fiberboard boxes (6 ? 12 per box).  Boxes will arrive and be shipped on wooden pallets secured by plastic shrink wrapping.  All shipments will be moved by enclosed van trailers.\n\nStorage area must be segregated and have containment (i.e. caged areas or cutoff rooms).\n\nThis material is listed hazardous substance per EPA RMP 112(r) with a threshold quantity of 10,000lbs.\n\nStorage should be in accordance with NFPA 30B for Level III aerosols.  Do not store near flames, sparks or hot surfaces.  Exposure to heat or prolonged exposure to the sun may cause the container to burst.  The container should not be punctured, incinerated or stored above 130 degrees F.\n\n\nCenter for Chemical Process Safety (CCPS) Propane Warehouse Safety\n\n\nWarehouse associates are to be shown new containers and how to identify by markings and labels\n\nExel shall notify its associates of all hazards associated with this product and provide employees sufficient training to include MSDS and product safety bulletins.\n\nStorage area should be selected to provide for adequate fire suppression and containment (i.e. cage"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 48582,
      "SummaryText": "d areas or cutoff rooms if applicable) while not restricting or blocking emergency exits.\n\n\n\n2.2    Process Hazard Analysis (PHA)\n\nExel site management and local risk management resources have conducted a PHA for handling and storing aerosols containing propane. Since the Exel Fontana Scotts facility is a warehouse and distribution center, the processes utilized are quite unsophisticated.  \n\n2.3    Operating Procedures\n\nAll Exel associates undergo a formal orientation process where they review the site?s standard operating procedures. Specifically, Exel reviews the OM Scotts proper handling and storage requirements as described in section 1.1.\n\n\n2.4    Training\n\nAll affected Exel associates shall receive awareness training on aerosols containing propane during their orientation, annually, and when there is a process change. All associates are required to attend a site-sponsored orientation that includes:\n\n-    Site operating procedures\n-    Hazard Communication Training (right to know area)\n-    MSDS location and format\n-    Exel drug and smoking policy\n-    Site safety policy and work rules\n-    Incident reporting/investigation procedures\n-    Equipment maintenance and training prior to use\n-    Powered Industrial Truck training per 1910.178\n-    Emergency action plan procedures\n-    Proper housekeeping/sanitation procedures\n-    First aid cabinet location/contents\n-    Eyewash/shower station locations/inspections\n-    Loading and unloading procedures\n-    Safety committee form and function\n-    Required personal protective equipment (use, care, storage)\n-    Site dress code (acceptable clothing)\n-    49CFR Hazmat \n-    Safe handling and storage of aerosols containing acetone and propane\n\n2.5    Mechanical Integrity\n\nExel has established and implemented written procedures for maintaining the on-going integrity of process equipment.\n\nExel has trained and oriented all associates involved in maintaining the on-going integrity of process equipment in an overview of that process and its hazards and in the procedures applicable to the "
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 48582,
      "SummaryText": "employee's job tasks to assure that the employee can perform the job tasks in a safe manner.\n\nInspections and tests are performed on process equipment.\nThe frequency of inspections and tests of process equipment are consistent with applicable manufacturers' recommendations and good engineering practices.\n\nAll equipment inspections/tests are documented. \n\nEquipment found to be unsafe, or have any other deficiencies is taken out of service until the appropriate actions have been taken to return the equipment to its safest operating condition.\n\nAll powered industrial trucks are maintained by a outside vendor on scheduled intervals. Associates are required to inspect list everyday before each work shift. The form used is as follows:\n\nOPERATOR?S POWERED INDUSTRIAL TRUCK INSPECTION SHEET\n\n\n\nOperator:    Shift:\nEquipment #    Date:  \n\n\nHOUR METER READING  -  \n\n\n\nSAFETY & OPERATIONAL CHECKS PRIOR TO USE    OK    Needs Maintenance\nVisual Checks        \nFluid Levels ? Oil, Radiator, Hydraulic        \nLeaks ? Hydraulic, Oil, Battery, Fuel        \nTires ? Condition and/or Pressure        \nAttachment ? Top Clip Retaining Pin and Heel         \nHydraulic Hoses        \nMast Chains and Stops        \nSafety Warnings ? Attached and Legible        \nData Plate ? Information Matches Model and Attachments        \nSeat Belt ? Buckle and Retractor Working Smoothly        \nPropane/Battery ? Free Form Leaks, Securely Fastened        \nOperational Checks        \nAccelerator Linkage        \nParking Brake ? Firm and Lockable        \nBrakes ? (report to supervisor immediately)        \nSteering ? (report to supervisor immediately)        \nDrive Control ? Forward and Reverse        \nTile Control ? Forward and Back        \nHoist and Lowering Control        \nAttachment Control        \nSide-Shift Control        \nHorn        \nLights ? Braking, Strobe, Reverse, Forward        \nBack-up Alarm        \n\n\nOperator Signature      \n\nSupervisor Signature\n\n\n2.6    Management of Change\n\n\nExel has established and implemented written procedures to manage changes in process chemicals, technology, equipment, and procedures; and, changes to facilities that affect a covered p"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 48582,
      "SummaryText": "rocess. \n\nExel addresses the following conditions;\n\n-    The technical basis for the proposed change\n-    Impact of change on safety and health\n-    Modifications to operating procedures\n-    Necessary time period for the change,\n-    Authorization requirements for the proposed change.\n-    Employees involved in operating a process and maintenance and contract\n-    Employees whose job tasks will be affected by a change in the process shall be informed of, and trained in, the change prior to start-up of the process or affected part of the process.\n\n\n\nExel Management of Change Procedure\n\n\nPurpose\n\nThis procedure is designed to manage changes to process chemicals, technology, equipment, and procedures; and, changes to facilities that affect a covered process.\n\nScope \n\nAll Exel sites that are subject to the requirements of 29CFR1910.191 must adhere and follow this procedure\n\nProcedure\n\nThe following steps should be taken when there is a 1910.191 substance process \n\nThe site General Manager and MOC team will assess the following:\n\nTechnical basis of change\n\n\n\nImpact of change on site safety & health\n\n\n\nModifications of operating procedures\n\n\n\nSite manager should also ensure:\n\n-    Associates involved in operating a process and maintenance and contract employees whose job tasks will be affected by a change in the process shall be informed of, and trained in, the change prior to start-up of the process or affected part of the process.\n\n-    The process hazard analysis for the process is updated and communicated to affected associates\n\n\n\n2.7    Compliance Audits\n\nExel conducts weekly, monthly and yearly compliance audits. All levels of associates are included in the audits to ensure compliance with local, state and federal regulations. The audit examines work processes, facilities, machinery, racking, and human behavior, in an effort to prevent personal injury and environmental releases.\n\n\n2.8    Incident Investigations\n\nExel sites are required investigate all incidents which include (near misses, property"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 48582,
      "SummaryText": " damage, injury, environmental release). A site safety committee is trained to investigate incidents to determine; primary and secondary causes, root causes. Once the causes are identified, the committee drafts and disseminates lessons learned, and develops an action plan to address and action items that have been identified.\n\nExel Incident Investigation Procedure\n    \n    Scope, Application and Purpose\n\nThis procedure is designed to ensure the proper and most cost effective management of material incidents and work related injuries/illnesses occurring in, or in association with, Exel operations. The Team?s mission is to facilitate timely and thorough investigations of all incidents, provide a Quality Review of the investigations, and provide clear, concise guidance on root cause and recommended corrective actions\n\nDefinitions\n\n?Incidents? - may include any non-routine or emergency event (e.g. spill, fire, etc) or occupational injury and illness as defined in 29 CFR (OSHA standards).\n?Team Leader? ? Tony Jacobs\n?Team Members? ? Cherene Donaldson, Eric Spalsbury, Matt Lutz, Craig Elliott \n\nProcedure\n\n?    The GM notifies the Team Leader immediately\n?    The Team Leader provides forms and initial guidance\n?    Insurer and Risk Management Department are contacted immediately.\n?    The site establishes a committee and performs the investigation (1 day) utilizing the Incident Investigation Procedure, Forms and Checklists or other applicable tools.\n?    The site returns the investigation form and any accompanying materials to the Team Leader\n?    The Team Leader sends the investigation and materials to the Team Members for review (5 days) utilizing the root cause flow chart\n?    The Team Members respond to the leader with root cause and proposed corrective actions\n?    The Team Leader compiles information and contacts the GM to discuss developing an action plan \n?    The Team Leader posts all information on the SH&E web site\n?    The site executes the corrective actions identified  in the action plan\n\nSite "
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 48582,
      "SummaryText": "Responsibilities\n\nEach Exel site experiencing an incident must follow the procedure outlined above utilizing all applicable tools referenced therein.\n\n\nRisk Management Department Responsibilities\n\nThe Risk Management Department will consult with the site to most efficiently manage the incident.\n\nContractor/Vendor Responsibilities\n\nAny non-Exel services intending to perform work onsite are required to provide the information needed to complete Exel Contractor safety form prior to beginning activities (see ?Contractor/Vendor Safety Procedure?).  If ER contractors are used, they must be on the approved list (see ?Emergency Response Contractor Procedure?).  Medical providers must be a part of the ?Exel Medical Provider Program?, unless the exclusive use of program providers is prohibited by State law.  Failure to provide the information in a timely and accurate manner will exclude the use of the contractor/vendor.\n\n\n2.9    Employee Participation\n\nAll affected Exel associates receive process specific training. Additional associates serve on the site safety committee. The site safety committee performs incident investigations, weekly audits, and other duties as outlined in the safety committee charter:\n\nPurpose \n\nProvide for strategic planning, implementation, and communication of Safety, Health, and Environmental (SH&E) goals, consistent with Exel values.\n\nMembership\n\nThe Site Safety Committee will be an on-going committee. Membership will be composed of two associates per shift, one maintenance representative, and one manager or supervisor. The manger or supervisor shall chair the committee. One associate and the chair will represent the committee as members of the Exel Regional Safety Council\n\n?    Membership should be voluntary.\n?    Once an associate becomes a committee member, meeting attendance is mandatory.\n?    Member effectiveness and participation should be evaluated every six months. \n?    Member rotation is encouraged every two years.\n?    Once a member leaves his or her posit"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 48582,
      "SummaryText": "ion they should be replaced with in one month. \n\nResponsibilities\n\n1.    Conduct weekly: 1-facility audit and 1-behavior audit. Ensure items/deficiencies identified are addressed. Create summary spreadsheet and post audit findings and corrective actions. Every committee member should conduct an audit on a rotating schedule. Provide this information to the Exel Regional Safety Council.\n\n2.    Assist Team Leaders when conducting incident investigations. Present investigative derived root causes and action items to safety committee. Ensure all actions items have been addressed \n\n3.    Review incidents from the previous month. Formulate summary spreadsheet with accident/incident description and lessons learned. Post information in conspicuous location (i.e. break room). Provide this information to the Exel Regional Safety Council.\n\n4.    Monitor facility BLS rate and related performance. Set performance objectives related to this information. Institute programs designed to improve safety performance.\n\n5.    Identify safety-related deficiencies, and propose corrective actions.\n\n6.    Facilitate site safety training. Ensure training is up-to-date.\n\n7.    Members shall serve as a voice and an example for associates.\n\n8.    Manage site safety programs; safety bingo, safety slogan contest, safety dinners, etc. Monitor effectiveness of various safety programs.\n\n9.    Members should receive periodic specialty training;\n\n?    OSHA 10 Hour \n?    Accident/Incident Investigation\n?    CPR/First Aid & Emergency Response\n?    Audit Process and Procedure\n\n10.    Post safety-meeting minutes in a conspicuous location.\n\n\n\nFrequency and Duration of Meetings\n\n?    Meetings will be held on a monthly basis, the same time and date each month is recommended.\n?    Meetings will last no more than one hour without consensus agreement of members present.\n\n2.10    Hot Work Permits\n\nExel issues a hot work permit for hot work operations conducted on or near a covered process.\n\nThe Exel permit documents that the fire prevention and protection requirem"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 48582,
      "SummaryText": "ents in 29 CFR 1910.252(a) have been implemented prior to beginning the hot work operations; it also indicates the date(s) authorized for hot work; and identifies the object on which hot work is to be performed. The permit is kept on file until completion of the hot work operations.\n\nExel Hot Work Procedure\n\n    NOTE:  Any Hotwork being performed at the site will be done by external contractors or in a designated safe hotwork area.  All contractors are required to follow the Exel Logistics ?Contractor and Vendor Safety Procedure?.  This procedure requires the contractor to be properly trained and utilize the proper permits and/or tools to perform the desired work.  No Hotwork or Hotwork Permit will be performed or prepared by Exel associates.  This procedure is provided for contractor guidance and information.\n    \n    Scope, Application and Purpose\n\n    See ?Site Specific Information? section at the end of this procedure for additional facility and implementation details.\n\nThis procedure is designed to protect Exel employees from, and inform them of, ?Hotwork? being performed onsite by Exel and/or contract personnel. The process is applicable to all OSHA covered Exel operations.  The applicable OSHA standard is found in 29 CFR 1910.232. \n\nDefinitions\n\nHotwork is defined as any potentially spark or ignition producing activity such as:\n\n    Cutting    Welding    Brazing    Hot Tapping\n    Grinding    Drilling    Grit Blasting\n\nProcedure\n\n-    Hotwork Awareness Information and/or Training is provided or conducted at the site(s).\n-    The site documents all training.\n-    The site completes the ?Exel Hotwork Plan? for their location.\n-    A safe Hotwork area is established by removing all combustible materials and performing Hotwork in this area only.\n-    If a safe Hotwork area cannot be established, the Hotwork Permit Process must be followed.\n-    A Hotwork Permit must be prepared and followed by the party(s) performing Hotwork (Exel or contract personnel).\n\nSite Responsibilities\n\nEach Exel site intending to conduct"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 48582,
      "SummaryText": "-body Harness/Life Line            \nOther:            \nSafety Precautions    Required\nX or N/A        Initial Atmospheric Testing\nMonitoring must be conducted immediately prior to hot work.  \nFire Extinguisher No:     Class:            ?  Required    ?  N/A\nWater Hose:  Standby/Running at Worksite                \nFire Sprinklers Operational                Acceptable Range    Actual\nCombustibles Within 35? ? Moved or \nCovered with Flame Resistant Material            Oxygen    19.5 ? 22.5%    \n            Flammability    0% LEL    \nDrains/Sewers/Sumps. Etc. Covered            Toxicity    See MSDS    \nSpark/Arc Shielding                    \nNon-Sparking Tools            Date & Time Tested        \nExplosion-Proof/Low Voltage Lighting            Tested By (Name):        \nExcavation Shoring/Sloping/Shielding            Monitor No.:    Date Last Calibrated:    \nArea Barricaded & Signs Posted                    \nVentilation:  Natural/Forced Air            On-going Atmospheric Monitoring\nScaffolding            \nPersonnel Notifications            ?  N/A    ?  Continuous    ?  Periodic:  Frequency\nLines Blinded or Disconnected/Misaligned/Capped            Additional Permits\nLines Plugged            ?  Confined Space Entry    ?  Hot Tap    ?  Other:\nDe-pressured/Drained/De-energized            Hot Work Authorization\nSteamed/Blown Out/Cleaned with:            \nInert Gas Purge with:            Permit Issued:        \nEnergy Sources Locked/Tagged Out            Permit Expires:        \nEquipment Bonded/Grounded                        \nSupervisor of Equipment Under Repair            \n                  Date\nGFCI Used with Portable Equipment                \nEmergency Comm./Response Established                        \nSupervisor of Personnel Performing Work            \n                  Date\nUtility Drawings/P&ID/MSDS Review                \nTraining Requirements Reviewed                        \nHot Work Coordinator            \n                  Date\nFacility Procedure Review - #:                \n                \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}