{
  "FacilityID": 48872,
  "FacilityName": "Sunnyvale Water Pollution Control Plant",
  "FacilityStr1": "1444 Borregas Ave",
  "FacilityStr2": null,
  "FacilityCity": "Sunnyvale",
  "FacilityState": "CA",
  "FacilityZipCode": "94088",
  "Facility4DigitZipExt": "1008",
  "FacilityCountyFIPS": "06085",
  "LEPC": null,
  "FacilityLatDecDegs": "37.416694",
  "FacilityLongDecDegs": "-122.000167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Sunnyvale",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sunnyvale WPCP",
  "OperatorStr1": "P.O. Box 3707",
  "OperatorStr2": null,
  "OperatorCity": "Sunnyvale",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94088",
  "OperatorZipCodeExt": "3707",
  "RMPContact": "Lorrie B. Gervin",
  "RMPTitle": "Environmental Division Manager",
  "FTE": 60,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000152755",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "AO733",
  "SafetyInspectionDate": "2006-03-02 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-06-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-06-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-06-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-01-25 00:00:00",
  "DeRegistrationEffectiveDate": "2018-01-05 00:00:00",
  "AnniversaryDate": "2012-06-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 37.41917,
  "FRS_Long": -122.01528,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 70816,
      "AltID": "Disinfection",
      "FacilityID": 48872,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 72514,
          "ProcessID": 70816,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 94054,
          "ProcessID": 70816,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 594054,
          "ProcessID": 70816,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 70817,
      "AltID": "Dechlorination",
      "FacilityID": 48872,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 72515,
          "ProcessID": 70817,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 94055,
          "ProcessID": 70817,
          "ChemicalID": 49,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 594055,
          "ProcessID": 70817,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48872,
      "SummaryText": "EXECUTIVE SUMMARY\nIntroduction:\nThe City of Sunnyvale's Water Pollution Control Plant (SWPCP) uses chemicals such as chlorine and sulfur dioxide to disinfect treated wastewater to provide water safe for discharge to the environment and for recycled water for uses such as landscaping irrigation. Storing large quantities of these chemicals can be a hazard if they are not handled properly. We take our safety obligations for storing and using hazardous chemicals as seriously as we take providing reliable wastewater treatment.  This Summary describes the steps we take to prevent an accidental chemical release, to ensure we have a safely operated plant, and how we respond to an emergency.  To date, we have an excellent record in preventing accidental releases. Please feel free to contact Lorrie Gervin, Environmental Division Manager at (408) 730-7260 if you have questions.\n\nAccidental Release Prevention and Response Policies\nThe SWPCP implements programs to comply with other accidental release prevention regulations including California's OSHA Process Safety Management (PSM) program and the California Accidental Release Prevention Program (CalARP).  In the SWPCP Priorities Policy developed by management, Safety is listed at the number one priority and is not to be compromised for any other issue.  All employees are to ensure that both employees and the community are safe at all times from any harm related to operations at the SWPCP.  Compliance is the next priority in the SWPCP Priorities Policy and should be planned for as we plan for safety, so that there is never a need to make a choice between the two.  Compliance at the SWPCP means meeting the obligations to various federal, state, and local agencies, as well as protecting the environment and providing an important service to our customers and the citizens of Sunnyvale.\n\nThe SWPCP has written Standard Operating Procedures (SOPs) established for all plant processes related to PSM and RMP requirements.  Written operato"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48872,
      "SummaryText": "r training programs for plant processes are in use for new operators.  The SWPCP has a Safety Committee consisting of representatives from each section within the Plant that meets on a monthly basis to discuss safety issues and plant operations.  Each SWPCP section has bi-weekly staff safety training meetings to provide training on pertinent operations and plans, with many of the training sessions related to chlorine and sulfur dioxide process safety.\n\nGeneral Facility and Regulated Substances Information\nThe SWPCP is located at 1444 Borregas Avenue in Sunnyvale, near the southern tip of the San Francisco Bay. SWPCP treats wastewater from the City of Sunnyvale, a small section of the City of Cupertino, and a portion of the Moffett Field Naval Air Station, located in Sunnyvale.  The plant has a treatment capacity of 29.5 million gallons per day; average flow is currently 14-16 million gallons per day. Plant processes include preliminary treatment to remove large solids and grit, primary sedimentation to remove settlable solids, oxidation ponds as secondary treatment, biological treatment to convert ammonia to nitrates, flocculation and coagulation for algae removal, filtration to remove suspended solids, disinfection to inactivate disease-causing organisms, and dechlorination of treated water prior to discharge to render chlorine harmless in the final effluent.  The SWPCP is a 24-hour per day/7-day per week operation.  A Senior Operator is always on duty at the facility and will initiate established emergency response procedures in the event of an accidental release or other emergency situation.\n\nThe facility currently stores chlorine and sulfur dioxide, which are regulated substances under the RMP and CalARP rules. These are stored in one-ton cylinders and exceed the RMP and Cal ARP threshold quantities. The facility also produces methane gas in its digesters which is used to power influent pump engines and for the co-generation of electricity in two 800 kW generato"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48872,
      "SummaryText": "rs that operate using a mixture of landfill gas, digester gas, and natural gas.  Digester gas is stored in four digester domes and associated piping.  Calculations maintained at the SWPCP demonstrate that the amount of digester gas stored does not exceed the CalARP rule threshold. In addition, based on 2004 revisions to the RMP rule, methane that is used as fuel at a wastewater treatment plant is no longer covered in the RMP program by EPA.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention\nChlorine is added to the wastewater prior to discharge to kill disease-causing organisms.  Sulfur dioxide is used after disinfection is completed to convert chlorine to chloride, which is harmless to fish and other aquatic life in the receiving water.  Chlorine and sulfur dioxide are stored, transported, and applied in physically separate, but similar systems. The SWPCP's Risk Management Plan and Process Safety Management Plan are based on the following key elements:\n- Management system, levels of responsibilities, and team member roles;\n- Comprehensive process safety information that is readily available to staff, emergency responders, and contractors;\n- A preventive maintenance and work order tracking program using MAXIMO computer programs;\n- A completed process hazard analysis of equipment and procedures with operations and maintenance staff participation and review;\n- Use of state-of-the-art process and safety equipment;\n- Use of accurate and effective operating procedures with participation of operations and maintenance staff for review and revision, as required;\n- High level of training of operators and maintenance staff; and\n- Incident investigation, inspection and auditing programs using qualified staff.\n\nProduct Delivery and Storage\nChlorine and sulfur dioxide cylinders are delivered to the facility on flatbed trucks. Twenty-four hour prior notification of the delivery and driver identification is required from the supplier before the truck i"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 48872,
      "SummaryText": "s allowed onsite to unload.  Cylinders are received by SWPCP personnel from the supplier's truck.  Once inside the SWPCP, all chlorine and sulfur dioxide cylinders are immediately unloaded and placed inside storage buildings where they are safety-secured.  The containers are never left outside or unattended.  After the cylinders are secured in the storage buildings, an intruder alarm system is activated.  The intruder alarm system is active when SWPCP staff are not working in the storage buildings.\n\nProcess and Chemical Safety Information\nComprehensive chemical data have been assembled to include regulatory reporting and action thresholds, health hazards, and chemical exposure limitations, as well as detailed physical properties of each regulated substance.  This information was compiled from numerous sources prior to conducting the Process Hazard Analysis.  It includes MSDS sheets, chlorine and sulfur dioxide background information, and chlorine and sulfur dioxide reaction chemistry.\n\nEquipment safety information has been compiled on the chlorine and sulfur dioxide processes, including maximum intended inventory, safe upper and lower temperatures, safe upper and lower pressures, and codes and standards used to design build, and operate the processes.  SWPCP also has procedures in place to update safety information if there is a major change that makes existing information inaccurate.   \n\nProcess Hazard Analysis\nPlant staff, engineering, and administrative staff conducted an initial, detailed PHA in December 1993.  A revalidation of the PHA was conducted in December 1999 by a team of maintenance, operations, engineering, and administrative staff using the \"Hazard and Operability\" (HAZOP) method and \"What If\" methods as per acceptable approach guidance from EPA. Another revalidation using the HAZOP and \"What if\" methodologies was completed in January 2003 using a similar team make-up. The most recent HAZOP revalidation was initiated in 2006 and completed in April 200"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 48872,
      "SummaryText": "7.   Revalidations were led by a consulting industrial safety professional who was knowledgeable about the types of processes being used and a team of operations and maintenance staff from the SWPCP participated. \n\nA list of actions and suggested improvements from the hazard review findings of the December 1999 PHA revalidation was prepared and all actions (with one exception) were completed or addressed by January 2003.  The piping and chlorine evaporator corrosion inspection construction actions were completed October 20, 2005, when the SWPCP staff completed the Management of Change - Pre-startup review.  A request for proposals for the sulfonator piping and corrosion inspection upgrades is in development. The project will start in FY 07-08 and will upgrade and replace sulfonators, in ways similar to the chlorinator replacement and upgrades that occurred in 2005.  Additional discussions are included in the \"Planned Changes to Improve Safety\" section below.\n\nOperating Procedures\nThe SWPCP maintains current, accurate, written operating procedures that include clear instruction for the operation of chlorine and sulfur dioxide processes.  Operating procedures are incorporated into operation and maintenance training programs.  Step-by-step written operating instructions were developed for the chlorine and sulfur dioxide systems that include procedures for process start up, shutdown, and normal, alternate, and emergency operations.  The SWPCP Safety Committee reviews and updates procedures, as needed.  Also, procedures are developed and put in place whenever a change occurs that alters the steps needed to operate safely.  Operating procedures are developed and put in place prior to any new process equipment coming on-line or the start-up for a changed process.\n\nOperations and Maintenance Training Program\nEach SWPCP employee presently involved in operating or maintaining the chlorine and sulfur dioxide processes is trained in an overview of the process and detailed, appl"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 48872,
      "SummaryText": "icable operating and maintenance procedures.  The SWPCP training program provides information to help employees understand the nature and cause of problems arising from operations involving chlorine and sulfur dioxide, and increases awareness of employees with respect to process hazards.  The SWPCP training program includes both initial and refresher training that covers (1) a general overview of the process, (2) the properties and hazards of chlorine and sulfur dioxide, (3) SCBA use and Level A protective gear qualifications (40-hour HAZWOPER class), (4) quarterly drills/training related to chlorine and sulfur dioxide safety procedures, and (5) a detailed review of process and operating procedures and safe work practices.\n\nTraining documentation maintained by SWPCP includes: (1) the dates of the most recent reviews or revision of the training program; (2) type of training provided; and (3) the type of competency testing or demonstrations used to ensure that staff understand the training.\n\nContractors\nThe SWPCP has procedures and policies in place to ensure that only contractors with good safety programs are selected to perform work on and around the chlorine and sulfur dioxide processes.  Contractors are informed of process hazards, process area access limitation and emergency response procedures so that they may safely complete their work.  SWPCP sets minimum contractor safety performance requirements to perform work on or around the chlorine and sulfur dioxide process areas and equipment, holds contractor safety briefings before allowing contractors near or into the process areas, controls access to process areas, and evaluates contractor performance.\n\nMechanical Integrity Program\nThe SWPCP maintains the mechanical integrity of all facility equipment, including covered process equipment to help prevent equipment failures that could potentially endanger workers, the public, or the environment.  We believe that this program is the primary line of defense against a "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 48872,
      "SummaryText": "release and addresses equipment testing and inspection, preventive maintenance schedules, and personnel training.  The SWPCP mechanical integrity program includes the following:\n- Procedures for maintaining mechanical integrity through inspection and testing of process equipment based on instructions and recommendations from manufacturers, equipment vendors, industry codes, and prior operating experience.\n- Implementation of the written procedures in performing inspections and tests on process equipment at specified intervals.\n-Training of maintenance personnel in procedures for safe work practices such as lockout/tagout, line or equipment opening, avoidance and correction of unsafe conditions; and\n-Procedures specifying training requirements for contract maintenance employees, as well as requiring contractors to use plant developed maintenance procedures for process areas.\n\nHot Work Permits\nSWPCP requires employees and contractors to use safe work practices when performing \"hot work\" in, on, or around the chlorine and sulfur dioxide process areas, as well as other areas around the facility where flammable materials may be used or stored.  Employees must follow the requirements of the Welding, Brazing, Soldering, Cutting, and Related Hot Work SOP and a Hot Work Permit must be issued by a department supervisor before any hot work is performed outside of the designated welding booth.  Copies of all permits issued for the previous two years are kept on site.\n\nManagement of Change and Pre-startup Safety Reviews\nThe SWPCP has a process in place to implement changes or modifications to equipment, procedures, chemicals, and processing conditions.  This systems allows employees to identify and review safety hazards, provide additional safety, process, or chemical information to existing data, evaluate the proposed change to confirm that it would not compromise system safety, and establish training requirements before implementation.  The SWPCP ensures that a pre-startup saf"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 48872,
      "SummaryText": "ety review is completed for any new process at the plant or for significant modifications to an existing covered process that requires a change in the process safety information.  All proposed process changes must be submitted in writing and include all schematics, diagrams, and specifications for review by Operations, Maintenance, and Management divisions and the plant-wide Safety Committee before plant management authorizes proposed changes.\n\nInternal Compliance Audits\nSafety audits of the chlorine and sulfur dioxide process equipment are conducted annually.  Internal compliance audits are completed every three years using a team of personnel who are knowledgeable about the RMP/PSM plan and the chlorine and sulfur dioxide processes.  The team includes representatives from Operations, Maintenance, and Management, plus a consulting safety professional.  The team evaluates whether the RMP/PSM Plan and its implementation satisfy the requirements of the RMP/CalARP, and PSM, and if the plan is sufficient to ensure safe operation of the chlorine and sulfur dioxide processes.  The results of the audit are documented, recommendations reviewed and resolved, and appropriate enhancements to the RMP/PSM Plan are adopted.\n\nIncident Investigation\nIn addition to its routine industrial accident investigation program, the SWPCP investigates all incidents involving chlorine or sulfur dioxide that caused or could reasonably have resulted in a serious injury to personnel, the public, or the environment, so that similar accidents can be prevented. The SWPCP trains employees to identify and report any incident that requires investigation.\n\nAn investigation team is assembled to investigate covered process incidents.  Results of the investigation are documented, recommendations are resolved, and appropriate processes enhancements are implemented.  Incident investigation report findings are reviewed by affected staff, used to revise operating and maintenance procedures, and submitted to th"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 48872,
      "SummaryText": "e Maintenance Manager and Supervisors for inclusion into existing training programs, if warranted, to prevent future incidents.  To date, only minor incidents or \"near misses\" have been investigated, as there have been no significant releases or injuries.\n\nToxic Gas Ordinance Compliance\nThe chlorine and sulfur dioxide storage systems include several safety features and are in full compliance with Santa Clara County's stringent Toxic Gas Ordinance, as well as the Toxic Gas Ordinance (TGO) for the City of Sunnyvale (Sunnyvale Municipal Code Section 16.53).  Safety provisions include:\n- Secondary containment containers and all process equipment are located within the building.  The building is under negative pressure under normal and emergency ventilation conditions.\n- A 3,000 cubic feet per minute (cfm) packed-bed scrubber to treat exhausted air if a release of chlorine or sulfur dioxide occurs.\n- Louvers automatically close upon detection of a leak and the room space is exhausted to the packed-bed scrubber.\n- Sulfur dioxide and chlorine storage and use rooms are equipped with smoke detectors, gas leak detectors, and seismic detectors and manually activated panic buttons at the chlorine and sulfur dioxide facility exits. \n- Gas leak detectors in each chlorine and sulfur dioxide storage and use room are interconnected to the PLC system with a tiered action system that includes automatic shutdown of the building ventilation systems, activation of the scrubber system, activation of chlorine and sulfur dioxide shutoff valves, and activation of the audible and visual alarm system (plant siren) if triggered.  Automated dampers are used to direct airflow to the scrubber from the appropriate containment area. A sensor at the scrubber stack exit will provide automatic shutdown of the scrubber in the event of a detected release above the trigger level.\n- Seismic detectors will cause liquid chlorine and sulfur dioxide supply valves to close and annunciate alarms to indicate the "
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 48872,
      "SummaryText": "shutoff valves have closed in the event of significant seismic activity.\n- Manually-activated panic buttons will cause the chlorine and sulfur dioxide supply valves to close and annunciate alarms to indicate the shutoff valves have closed.\n\nAncillary chlorine and sulfur dioxide process equipment used for handling chlorine and sulfur dioxide containers includes the following features:\n- Containers are equipped with fusible plugs for pressure relief and steel protective housings for the valve area.\n-  All valves and fittings used on the chlorine system are certified for chlorine use.\n-  The header system is equipped with a frangible disk, shut-off valves, and a high-pressure switch.\n-  The chlorine and sulfur dioxide evaporators are thermostatically controlled\n-  The chlorine system pressure relief valve is vented through the scrubber\n-  The facility maintains a Chlorine Institute Emergency \"B\" Kit for use in responding to a leak from the one-ton cylinders, self-contained breathing apparatus (SCBAs) and appropriate personal protection equipment for use in emergency response situations.  The SCBAs are also used by staff and are on \"standby\" during equipment change out.\n- The SWPCP is enclosed by a fence and the chlorine and sulfur dioxide storage areas are equipped with motion sensor alarms to notify operators of unauthorized entry to the buildings.\nSystem alarms are monitored at the computer control center staffed with operators 24 hours per day, 7 days each week.\n\nFacility maintenance:\n- The SWPCP has a comprehensive written mechanical integrity program with an automated tracking and scheduling for the work order and preventive maintenance system. \n- The facility has a written Management of Change standard operating procedure that is to be used when changes to the process procedures, process chemicals, equipment, or technology may affect the chlorine or sulfur dioxide facilities.\n- Items identified for improvement during HAZOP reviews as a part of the Process Hazard "
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 48872,
      "SummaryText": "Analysis are tracked to ensure their implementation.\n\nStaff training:\n- SWPCP Operations and Maintenance staff receive chlorine and sulfur dioxide process and facility safety training five times each year.\n- Additional safety training related to plant processes and operations is provided on a biweekly basis.  Annual updates regarding chlorine and sulfur dioxide safety plans are provided to all staff as a part of the regular safety program.\n\nFive-Year Accident History\nThere have been no releases of chlorine of sulfur dioxide in the last five years that have resulted in deaths, injuries, or significant property damage onsite and no known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.   \n\nEmergency Response Program\nThe SWPCP has established a written emergency response program for employees to help safely respond to accidental releases of hazardous substances.  This program has been coordinated with the City of Sunnyvale - Certified Unified Public Agency (CUPA) emergency response agencies.  The program includes emergency response procedures and an evacuation plan specific to chlorine and sulfur dioxide processes.  Chlorine and sulfur dioxide area SWPCP operators are trained as first responders. Emergency response drills with other agencies are conducted annually.  Operator training and response for the chlorine and sulfur dioxide processes are conducted quarterly.  Emergency operation and response procedures are reviewed at the time of the annual drill. \n\nFlooding Considered\nA flood of the SWPCP would result in a loss of power to the facility.  This would cause a PRV shut down, the loss of service air, loss of heat, and shut-down of chlorinator and sulfonator systems.  All chlorine and sulfur dioxide cylinders are secured, so there is no danger of their movement.\n\nPlanned Changes to Improve Safety\nA list of action items based on the chlorine and sulfur dioxide PHA completed on 4/4/2007 was prepared, with one carry "
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 48872,
      "SummaryText": "over action from the 2003 PHA and four additional action items were identified:\n -Hydrostatic testing and interior examination of the sulfonator is needed every five years. With the current piping configuration and system, it is not possible to complete an inspection  without taking apart all system elements. A replacement and upgrade to the chlorinator system was completed in 2005.  The sulfonators will be replaced and upgraded to match the upgrades to the chlorinator system starting in FY 07-08. Once the work is completed, a preventive maintenance and inspection schedules for hydrostatic testing of the sulfonators will be included in the SWPCP maintenance management database.\n- Staff will develop standard operating procedures for line purge and leak test procedures for an preventive maintenance or corrective action that includes a chlorine liquid or gas line removal, replacement, or repair of in-line equipment. These procedures will be linked to a job plan in the SWPCP maintenance management system that invokes purge and leak teast procdures to ensure that the test is completed after a preventative maintenance or corrective action is complete.\n-The Operations Manager and Maintenance Manager will review the feasibility of linking the Applied Water Channel (AWC) low water level indicator to the chlorinator feed rate to automatically shut off chlorine to the AWC, which would prevent the revised alternative release scenario for chorine from happening in the future. If this is not possible, standard operating procedures will be developed to shut off the chlorinator before the SWPCP operations go into a recirculation mode, which could result in a low water level in the AWC. \n-Determine if there are potential operational changes or safeguards that could be implemented to prevent a high-pressure release of chlorine gas within the chlorinator room in the event of both high temperature and high pressure occuring within the chlorinator system. Implement changes or safeguards"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 48872,
      "SummaryText": " that are identified. \n-Joint Sunnyvale Public Safety and SWPCP \"first responder\" training exercises to improve coordination in the event of an emergency will continue annually\n\nThe Operations Manager and Maintenance Manager will place documentation of the closeout of these actions in the RMP/Chlorine and Sulfur Dioxide Safety facility file."
    }
  ]
}