{
  "FacilityID": 48934,
  "FacilityName": "City of Quincy WWTP",
  "FacilityStr1": "201 12th Avenue, SW",
  "FacilityStr2": null,
  "FacilityCity": "Quincy",
  "FacilityState": "WA",
  "FacilityZipCode": "98848",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53025",
  "LEPC": "Grant County LEPC",
  "FacilityLatDecDegs": "47.201111",
  "FacilityLongDecDegs": "-119.888055",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I7",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Earth Tech, Inc.",
  "OperatorStr1": "201 12th Avenue, SW",
  "OperatorStr2": null,
  "OperatorCity": "Quincy",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98848",
  "OperatorZipCodeExt": null,
  "FTE": 15,
  "OtherEPAFacilityID": "WA0021067",
  "EPAFacilityID": "100000199395",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2007-06-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-06-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2007-06-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2011-12-20 00:00:00",
  "DeRegistrationEffectiveDate": "2009-06-01 00:00:00",
  "AnniversaryDate": "2012-06-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 47.217025,
  "FRS_Long": -119.884524,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "0.5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 70887,
      "AltID": "Exterior Storage Tank",
      "FacilityID": 48934,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 94131,
          "ProcessID": 70887,
          "ChemicalID": 56,
          "Quantity": 4400000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 72588,
          "ProcessID": 70887,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 26066,
              "Process_NAICS_ID": 72588,
              "SafetyReviewDate": "2007-05-23 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2007-05-23 00:00:00",
              "ChangeCompletionDate": "2007-06-08 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "CRASH BARRIERS",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "DAILY INSPECTION",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2007-05-22 00:00:00",
              "TrainingReviewDate": "2007-05-22 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-05-22 00:00:00",
              "EquipmentInspectionDate": "2007-05-23 00:00:00",
              "EquipmentTested": "ALL COMPONENTS INSPECTED",
              "ComplianceAuditDate": "2007-05-22 00:00:00",
              "AuditCompletionDate": "2007-06-08 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2003-05-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 27257,
                  "PreventionProgram2ID": 26066,
                  "ProcessChemicalID": 94131
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 48934,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2003-09-01 00:00:00",
    "ERTrainingDate": "2007-05-23 00:00:00",
    "CoordinatingAgencyName": "Grant LEPC",
    "CoordinatingAgencyPhone": "5097875000",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48934,
      "SummaryText": "The Quincy Wastewater Treatment Facility is a processor of wastewater for local vegetable processors as regulated under the Clean Water Act and other requirements. The Wastewater Treatment Plant Facility covered by this Risk Management Plan is located at 201 12th Avenue S.W. in Quincy, Washington.\n\nThe Quincy WWTP has adopted this Risk Management Program to implement the requirements of the United States Environmental Protection Agency under the Clean Air Act Amendments.  This Risk Management Program is required under 40 Code of Federal Regulations, Part 68-Chemical Accident Prevention Provisions, because the Quincy WWTP stores more than 10,000 pounds (lbs) of anhydrous ammonia (NH3) which is the threshold quantity.  The Risk Management Program will identify the process, the worst case and alternate scenarios, five-year accident history, process safety information, process hazard analysis (PHA), operating procedures, training, mechanical integrity, management of change, pre-startup review, compliance audits, incident investigations, employee participation, hot work permit and contractors  to enable all those who may be affected to be able to identify and understand the hazards posed by the processes that involve NH3.\n\nThe Risk Management Program will be regularly reviewed and updated whenever necessary to reflect new or modified tasks and procedures.\n\nIn conjunction with the PHA, the Quincy WWTP completed a compilation of written process safety information in order to enable the Quincy WWTP supervisory and operations personnel to identify and understand the hazards posed by NH3, including a  Material Safety Data Sheet for NH3.\n\nNH3 is the chemical formula for ammonia which exists as a gas at room temperature and atmospheric pressure.  NH3 is considered to be a non-flammable gas by the Department of Transportation and consists of 99.5 percent (%) of grade C (industrial grade) anhydrous ammonia, 0.4 % water and 0.1 % oil.  NH3 has, for most people, a noticeable odor a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48934,
      "SummaryText": "t 20 parts per million (ppm).  NH3 is moderately irritating to the nose at approximately 100 ppm and causes major throat irritation at approximately 400 ppm.\n\nAmmonia gas can be compressed into a liquid.  Liquid ammonia is a corrosive material which causes burns and is harmful if swallowed.   NH3 is reactive with the halogens (chlorine and bromine).  NH3 is also reactive with heavy/precious metals and their salts (silver, mercury and gold) to produce shock sensitive materials which when dry tend to explode.\n\nNH3 is thermally stable as a gas and as a liquid.  However, when not confined, the NH3 will evaporate.  NH3 is reactive with many organic materials including acids, acid chlorides, halogens, acid anhydrides, oxidizing agents, chloroformates, galvanized iron, zinc, copper and tin and their alloys and, therefore, is not a stable material when in contact with other substances.  Ammonia is most stable when confined in steel containers.\n\nThe Quincy WWTP uses Anhydrous Ammonia as part of the nutrient addition process of the treatment system. The physical state of NH3 in the nutrient addition process is the initial bulk storage of the liquefied gas for dissolution within the water as the Ammonia is feed into the waste stream.\n\nThe maximum inventory at the Quincy WWTP is approximately 44,000 lbs of NH3 as stored in an exterior, bulk, steel tank designed to contain NH3 at 90% capacity, and the associated distribution piping and pumping system that delivers the material for the nutrient addition process. \n\nThe Quincy WWTP has assembled a team with expertise in engineering and process operations to perform the PHA hazard evaluation required by the Standard.  At least one member of the team is knowledgeable in the specific process hazard analysis methodology being used.  The team also includes at least one employee who has experience and knowledge specific to the process being evaluated.\n\nThe Quincy WWTP has developed and implemented written operating procedures for the tas"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48934,
      "SummaryText": "ks that the Quincy WWTP personnel perform either directly or via subcontractor services (bulk delivery, tank maintenance, piping/pump maintenance, unit operations, and inspections).  Contractors who perform these and other maintenance and repair activities will familiarize themselves with the Quincy WWTP systems and prepare operating procedures for their activities whether directly or indirectly associated with the nutrient loading unit process.  The Quincy WWTP procedures do, and their contractor¿s operating procedures will, provide clear instructions for safely conducting activities involved in each aspect of the nutrient loading process.  Operating procedures have been prepared for initial startup, normal operation, temporary operations as the need arises, emergency operations, including emergency shutdowns, and authorized personnel to initiate these procedures, normal shutdown and startup following a turnaround, or after an emergency shutdown.\n\nEach employee presently involved in a process has been, and each employee before working in a newly assigned process, will be trained in an overview of the process and in the operating procedures.  The training will include emphasis on the specific safety and health hazards, and procedures and safe practices applicable to the employee's job tasks.\n\nWhen selecting a contractor, the Quincy WWTP will obtain and evaluate information regarding the contract employer's safety performance and programs.\n\nIf the Quincy WWTP establishes new facilities or modifies facilities for which the modification necessitates a change in the process safety information, the Quincy WWTP will perform a pre-startup safety review.  A permit will be required for all hot work operations.\n\nAll contemplated changes to a process must be thoroughly evaluated in order to assess their potential impact upon the safety and health of employees and to determine what modifications to operating procedures may be necessary.  Quincy WWTP has therefore established wr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 48934,
      "SummaryText": "itten procedures to manage those changes to process chemicals, technology, equipment, procedures and facilities that affect the process covered under this Program.  Those procedures will not, however, cover replacements in kind.¿\n\nWritten procedures to manage changes to the process were developed and will be adhered to.  All incidents will be investigated that have either resulted in a catastrophic release of ammonia in the workplace, or could reasonably have so resulted.  Each such incident investigation will be initiated as promptly as possible, but not later than 48 hours following the incident.  The five-year accident history extends to 2001 and no releases have occurred.\n\nAn off-site consequence analysis has been performed to evaluate worst-case and likely upset conditions.\n\nThe Quincy WWTP has established a process to assign an incident investigation team to thoroughly investigate and analyze each such incident.  The members of the investigation team include at least one person knowledgeable in the process involved, including a contract employee if the incident involved work of the contractor, and other persons with appropriate knowledge and experience.  The investigation team must prepare a report at the conclusion of the investigation activities.\n\nThe Quincy WWTP will establish a system to promptly address and resolve the incident report's findings and recommendations.  All corrective actions and resolutions that are taken in response will be documented.  The report of the investigation team will be reviewed with all affected persons whose job tasks are relevant to the incident findings, including contract employees where applicable.  All incident investigation reports will be retained for five years.\n\nThe Quincy WWTP has established an Emergency Action Plan for the entire plant in accordance with the provisions of 29 CFR §1910.38(a), the Occupational Safety and Health Administration standard that provides for the adoption of an Emergency Action Plan. The Q"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 48934,
      "SummaryText": "uincy WWTP Emergency Action Plan also includes procedures for handling small releases.  Large releases will be addressed by Local Emergency Response resources.\n\nThe Risk Management Program is designed to be a written statement of overall process safety management and risk management rules and policies.  There are a number of additional work rules, procedures, requirements, documents, reports, and separate programs that apply in particular situations or that are required by particular laws or regulations (for example:  hazard communication/right-to-know).  Some of them are in writing and some are not.  Others will be added from time to time in the future whenever required by applicable local, state or federal law or regulation or when deemed necessary by the Quincy WWT Utility or its primary operating contractor, Earth Tech, Inc.\n\nAll employees of the Quincy WWT Utility, Earth Tech, Inc. and other associated contractors must observe those rules and programs just as they are required to observe the provisions of this Program."
    }
  ]
}