{
  "FacilityID": 48968,
  "FacilityName": "Fritz Products, Inc",
  "FacilityStr1": "255 Marion Street",
  "FacilityStr2": null,
  "FacilityCity": "River Rouge",
  "FacilityState": "MI",
  "FacilityZipCode": "48218",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26163",
  "LEPC": "Wayne County LEPC",
  "FacilityLatDecDegs": "42.273650",
  "FacilityLongDecDegs": "-083.120890",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 161887930,
  "ParentCompanyName": "Fritz Enterprises, Inc",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Leonard Fritz",
  "OperatorStr1": "1650 W. Jefferson",
  "OperatorStr2": null,
  "OperatorCity": "Trenton",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48183",
  "OperatorZipCodeExt": "5294",
  "RMPContact": "John Splan",
  "RMPTitle": "Plant Superintendent",
  "FTE": 30,
  "OtherEPAFacilityID": "MI0000895078",
  "EPAFacilityID": "100000135953",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-05-31 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-07-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-06-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-06-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 42.27625,
  "FRS_Long": -83.12426,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 70931,
      "AltID": "Chlorine Tank",
      "FacilityID": 48968,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 72633,
          "ProcessID": 70931,
          "NAICSCode": "331314",
          "_desc": {
            "NAICS_CODE": "331314",
            "NAICS_DESCRIPTION": "Secondary Smelting and Alloying of Aluminum"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 94185,
          "ProcessID": 70931,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 594185,
          "ProcessID": 70931,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48968,
      "SummaryText": "1  Executive Summary\n1.1 Applicability\nAn owner or operator of a stationary source that has more than a threshold quantity of a regulated substance in a process shall prepare a Risk Management Plan in accordance with 40 CFR 68.  In addition, a facility which exceeds the OSHA threshold for highly hazardous chemicals listed in Appendix A to 29 CFR1910.119 is required to meet the Process Safety Management standards under this section.  The threshold quantities for chlorine under 40 CFR 68 and 29 CFR 1910.119 are 2,500 and 1,500 pounds, respectively. Since Fritz Products, Inc. stores chlorine in quantities exceeding these thresholds they are required to meet both requirements.\n\nBecause of similar elements between the Risk Management Plan (RMP) and the Process Safety Management (PSM) Plan, Fritz Products, Inc. has chosen to integrate their PSM into the RMP.  In addition copies of other plans have been included in this plan as attachments.  These include:\n-Spill Prevention Control and Countermeasures/Pollution Incident Prevention Plan;\n-Chemical Spill Control and Prevention Plan;\n-Emergency Response Plan.\n\n1.2 Company Policy\nFritz Products, Inc. (Fritz Products) recognizes the intrinsic value for the well being of the employees and customers of their River Rouge, Michigan aluminum plant, and considers that their safety is a primary objective.\n\nThe facility will provide for a safety program committed to: developing safe work practices and procedures to maintain property and equipment in a safe condition; providing training to its employees to enable them to work without accident; and ensuring that all employees comply with all safety rule, regulations, practices and procedures.  All aspects of the safety program will be administered with fairness and consistency.\n\nThe plant manager will be held accountable and responsible for, and actively support and participate in the program, including communication of, understanding and compliance with, and monitoring of safety perform"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48968,
      "SummaryText": "ance.\n\n1.3 Stationary Source Information\nFritz Products River Rouge facility is a secondary aluminum plant employing approximately 30 employees in River Rouge, Michigan.  The facility uses chlorine for de-magging purposes.  The facility stores a maximum of 16 pressurized storage containers, each with a capacity of one ton.  The plant is located on the East Side of River Rouge, with the Detroit River to the East, industrial areas to the North and South, and residential areas to the West.        \n\n1.4 Scenarios and Controls\nThe Risk Management Plan addresses the potential off-site impacts from a catastrophic release of Chlorine.  Two scenarios are considered in the Risk Management Plan.  The details of each scenario are contained in the Risk Management Plan.\n\n1.5 Accidental Release Prevention Program\nFritz Products River Rouge has developed a Process Safety Management Plan and work procedures and controls to ensure that an accidental release of chlorine does not occur at the foundry.  The employees have been trained to ensure familiarity with these processes and procedures, and written procedures can be referred to.  Periodic and refresher training is also conducted to review these procedures and any new procedures that may be developed and implemented.  These procedures are also reviewed with contractors working with the chlorine system.\n\n1.6 Five-Year Accident History\nFritz Products has not experienced a release of chlorine at the River Rouge foundry in the five years preceding the preparation and submittal of this updated Risk Management Plan.  Fritz Products will respond appropriately as outlined in our Emergency Response Plan in the event of a chlorine release from the process.  In addition, the implementation of this Risk Management and Process Safety Management Plan will help ensure that a release of chlorine does not occur from this process.\n\n1.7 Emergency Response Program\nFritz Products has prepared an Emergency Response Plan that is designed for timely, safe and e"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48968,
      "SummaryText": "fficient response actions to minimize hazards to human health and safety, the environment, and property in situations involving releases of chlorine from the covered process at the foundry.  See Section 6.0 for details on the plan.  The plan is reviewed periodically to ensure that the information is accurate.  Local response authorities are provided a copy of the plan in the event that they would be required to respond to an emergency at the facility."
    }
  ]
}