{
  "FacilityID": 4908,
  "FacilityName": "Burris Retail Logistics",
  "FacilityStr1": "111 Reese Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Harrington",
  "FacilityState": "DE",
  "FacilityZipCode": "19952",
  "Facility4DigitZipExt": "0000",
  "FacilityCountyFIPS": "10001",
  "LEPC": "Kent County LEPC",
  "FacilityLatDecDegs": "38.918889",
  "FacilityLongDecDegs": "-75.584444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.burrisfoodsinc.com",
  "FacilityEmailAddress": "info@burrisfoods.com",
  "FacilityDUNS": 75479931,
  "ParentCompanyName": "Burris Foods Inc.",
  "Company2Name": null,
  "CompanyDUNS": 75479931,
  "Company2DUNS": 0,
  "OperatorName": "Burris Foods Inc.",
  "OperatorStr1": "510 Southeast 5th Street",
  "OperatorStr2": null,
  "OperatorCity": "Milford",
  "OperatorStateFIPS": "DE",
  "OperatorZipCode": "19963",
  "OperatorZipCodeExt": "0000",
  "RMPContact": "Mr. Ed Givens",
  "RMPTitle": "Director of Maintenance",
  "FTE": 160,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000066126",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-09 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "prepared by Jon Shaver (phone 610/701-0629)",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 38.91884,
  "FRS_Long": -75.57959,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5737,
      "AltID": "Refrigeration System",
      "FacilityID": 4908,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5860,
          "ProcessID": 5737,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6192,
          "ProcessID": 5737,
          "ChemicalID": 56,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506192,
          "ProcessID": 5737,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4908,
      "SummaryText": "The Burris Retail Logistics facility in Harrington, Delaware provides storage and distribution services for packaged frozen food.  Our customers include food chain stores in the mid-Atlantic region of the United States.  We are proud of our safety record and take stringent precautions to ensure that our operations are designed and our activities are performed to prevent hazards in our workplace.\n\nOur operations require that appropriate temperatures be maintained in parts of our facility to prevent spoilage and damage of materials being stored.  To maintain these temperatures safely and consistently we operate a refrigeration system that uses anhydrous ammonia as a refrigerant.  This is standard practice for storage of foods and the system we operate is a standard refrigeration system.  We recognize that, in the unlikely event of a mishap, a release of ammonia could occur from this system and, therefore, we follow special practices for controlling hazards and managing risks within this process. \n\nOur approach for controlling potential risks from a release of ammonia includes:\n\n- Conducting assessments to identify hazards and risks present\n- Using recognized industry practices and good engineering practices and codes for designing, installing and operating our refrigeration system\n- Maintain contingency plans for responding to any emergency that may occur\n\nIn assessing the hazards of our refrigeration process we used EPA-approved methods to determine that the worst case release would be represented by a release of 11,200 lbs. of anhydrous ammonia from our Receiver.  Although very unlikely to occur, the distance to endpoint under such a scenario, with winds of 3.4 mph, is 1.2 miles surrounding our site.  Portions of this distance include residences, schools, recreation areas and neighboring commercial and industrial sites.  There would be no environmental impacts from such a release.  Alternative release scenarios determined that this distance would be reduced to 0.3 m"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4908,
      "SummaryText": "iles (approximately 1600 feet) under actual operating conditions.\n\nWe have excellent release prevention programs in place for preventing releases of ammonia from our facility.  These programs have been developed to be consistent with recommendations from the US Occupational Safety and Health Administration (OSHA) and are in compliance with OSHA \"Process safety Management\" standards.  Our equipment includes well maintained piping and pressure vessels that have been built and installed to meet ASTM specifications. \n\nThere has not been a reportable release of any hazardous substance from our facility since we began operation over 25 years ago. \n\nWe have installed monitoring systems to detect any leak of ammonia well before it can migrate or disperse offsite.  Such detection would cause our emergency response plan to be activated.  This plan has been reviewed and accepted by the Harrington Fire Department and includes steps we would immediately take to minimize the consequences of the leak and, if necessary, contacting the Harrington Fire Department. \n\nIt is our policy to continually seek new and better ways to operate our facilities, including, especially, programs and practices that affect the safety of our operations.  To do this management frequently reviews our practices to ensure we have the most effective safety and release prevention equipment and procedures in place.  As a testimony to this, over the next few months we intend to update our training for maintenance staff, conduct a mock emergency response drill, upgrade our safety manuals and conduct an audit to verify that we are fully compliant with current Process Safety Management and Risk Management Program regulations."
    }
  ]
}