{
  "FacilityID": 49113,
  "FacilityName": "Heartland Coop- Holland",
  "FacilityStr1": "203 Market Street",
  "FacilityStr2": "PO Box 126",
  "FacilityCity": "Holland",
  "FacilityState": "IA",
  "FacilityZipCode": "50642",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19075",
  "LEPC": "Grundy County LEPC",
  "FacilityLatDecDegs": "42.398833",
  "FacilityLongDecDegs": "-092.800556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.heartlandcoop.com",
  "FacilityEmailAddress": "bchizek@heartlandcoop.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Heartland Coop",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Heartland Coop",
  "OperatorStr1": "2829 Westown Parkway, Suite 350",
  "OperatorStr2": null,
  "OperatorCity": "West Des Moines",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50266",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000133937",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-07-01 00:00:00",
  "SafetyInspectionBy": "Iowa Department of Ag",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-07-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-07-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-07-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-05-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 42.4049,
  "FRS_Long": -92.7976,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS BLOCK/TRACT-1990-CENTROID",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 71189,
      "AltID": null,
      "FacilityID": 49113,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 94546,
          "ProcessID": 71189,
          "ChemicalID": 56,
          "Quantity": 428000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 72895,
          "ProcessID": 71189,
          "NAICSCode": "42491",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 26152,
              "Process_NAICS_ID": 72895,
              "SafetyReviewDate": "2007-01-24 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Applicable building, electrical and plumbing codes. This facility complies with the Iowa Fertilizer Law.",
              "FR_Comments": "We utilize those portions of these codes which are deemed applicable by the jurisdictional authority",
              "HazardReviewDate": "2007-01-27 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Vandalism/theft, Provisions have been made to install a protective barrier around the plant perimeter to reduce the potential of vehicular damage.",
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Regular plant inspections/Routine preventive maintenance and repairs",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Routine visual inspections",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2007-01-24 00:00:00",
              "TrainingReviewDate": "2007-01-24 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-01-24 00:00:00",
              "EquipmentInspectionDate": "2007-03-15 00:00:00",
              "EquipmentTested": "Pumps, seals, pipes, plumbing, valves, electrical equipment and safety equipment. The breakaway couplers, pressure relief valves, and hoses are also inspected and replaced as necessary",
              "ComplianceAuditDate": "2007-02-07 00:00:00",
              "AuditCompletionDate": "2007-06-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "The plan is to minimize those hazards to human health and to the environment that are associated with accidental releases of anhydrous ammonia. Employees working at the bulk storage plant make routine observations prior to and during transfer operations of anhydous ammonia fromthe storage vessel(s) to nurse tank. In doing so, they are able to detect problems before they arise. This routine inspection identifies any portion of the system which may be under stress or about to fail.  Repairs can be made before they become problematic.  Employees are annually trained to recognize hazards associated with anhydrous ammonia. This training is performed annually and for all new hires which includes classroom instruction, on-site training at the plant and follow-up observations to determine their individual comprehension and understanding for the new hire.  Finally, the company routinely invites local fire and ems departments to visit the site.",
              "_chemicals": [
                {
                  "PrimaryKey": 27343,
                  "PreventionProgram2ID": 26152,
                  "ProcessChemicalID": 94546
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 49113,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Grundy County LEPC",
    "CoordinatingAgencyPhone": "3198146933",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 49113,
      "SummaryText": "Accidental Release Prevention and Emergency Response\nfor Heartland Co-op, Holland, Iowa\n\nIt is the policy of Heartland Co-op to adhere to all applicable Federal, State, and local regulations. If an emergency were to occur, it is our policy to call 911 and request emergency responders be dispatched to an anhydrous ammonia release.  Incidental to the 911 call, the County Emergency Coordinator will be contacted as well as the LEPC (if different from the County Emergency Coordinator).\n\nWhile we have planned for an emergency, it is acknowledged that a real emergency will be unexpected and may very well be much different and cannot be ensured to duplicate what may have be planned. In reality, the situation that develops may not happen in the manner in which it has been planned. In that event, what may have been planned will serve only as a guideline to follow.\n\nThe Emergency Action Plan for this facility describes certain procedures that are intended to minimize the hazards associated with human health and the environment from fires, explosions, the sudden and unexpected release of chemicals (i.e., Anhydrous Ammonia), tornadoes, bomb threats or other accidents or acts of God which might occur on our premises.\n\nThe primary emergency coordinator for the Holland, Iowa location is the Location Manager. His work and 24-hour emergency response telephone numbers are provided in the Registration Section of this document. In addition, the following individuals (with associated work and 24-hour emergency response telephone numbers) are to be contacted in order:\nGrant Ostercamp, location manager\nWork:    319.824.6638\nEvening:   515.210.5332\n\nAl Harberts\nWork:         319.824.6638\nEvening:  319.239.6111\n\n\nDESCRIPTION OF THE ANHYDROUS AMMONIA STORAGE/DISTRIBUTION PLANT AND THE REGULATED SUBSTANCE HANDLED AT HEARTLAND CO-OP, HOLLAND, IOWA:\nThis facility is a bulk anhydrous ammonia storage and distribution plant. The anhydrous ammonia that is stored at  this facility is distributed to agri"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 49113,
      "SummaryText": "cultural crop producers in the surrounding area who utilize the anhydrous ammonia for crop nutrient purposes. \n\nThe system consists of 2 storage tanks with associated piping, valves, liquid pump(s), and other miscellaneous equipment. The anhydrous ammonia plant is only operated on a seasonal basis (Spring and Fall). Full-time equivalent employee numbers were computed on that basis. At a maximum, the plant operates a total of three months (1/4 of the year). \n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS:\nThis facility complies with EPA's accident prevention rule and all applicable State and local codes and regulations. The anhydrous ammonia system is designed, installed, and maintained in accordance with ANSI Standard K-61.1-1995 and State law. \n\nIn addition the company has specific operating procedures in place intended to minimize the potential for an accidental (and potentially catastrophic) release of anhydrous ammonia. Finally, Heartland Co-op has extended to the local fire department the opportunity to visit our anhydrous ammonia plant, to participate in mock emergency simulation training, and to avail themselves of specific anhydrous ammonia health hazard information and training provided by the company.\n\nFIVE-YEAR ACCIDENT HISTORY:\nHeartland Co-op has never had an accident involving anhydrous ammonia that caused death, injuries, property or environmental damage, evacuations or sheltering in place.\n\nTHE EMERGENCY RESPONSE PROGRAM:\nHeartland Co-op is included in this Counties Annex P.  The company does not have it?s own emergency response plan.  In the event of an emergency involving our anhydrous ammonia system, it is the policy of Heartland Co-op to immediately notify the local fire department and the County Emergency Coordinator (often also the LEPC contact) to request that they respond to the emergency.  In the unlikely event that the local fire department is unable to adequately respond to an emergency at this locati"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 49113,
      "SummaryText": "on, the hazmat team with whom this fire department has a reciprocal agreement will be summoned.\n\nPLANNED CHANGES TO IMPROVE SAFETY:\nThe plan is to minimize those hazards to human health and to the environment that are associated with accidental releases of anhydrous ammonia. Employees working at the bulk storage plant make routine observations prior to and during transfer operations of the anhydrous ammonia from the storage vessel(s) to nurse tanks. In so doing, they are able to detect problems before they arise. This routine inspection identifies any portion of the system which may be under stress or about to fail. Repairs can be made before they become problematic. Employees are annually trained to recognize the hazards associated with storage and handling of anhydrous ammonia. In addition to annual training for employees who have been on the job for a number of years, the company conducts training for new hires. This training includes classroom instruction, on-site training at the plant, and follow-up observation to determine their individual comprehension and understanding of the new hire. Finally, the company routinely invites local fire department personnel to visit the site. In the event that the local fire department requests assistance in training its employees on anhydrous ammonia, the company cooperates fully in their endeavors."
    }
  ]
}