{
  "FacilityID": 494,
  "FacilityName": "HIGH LINER FOODS, INC.",
  "FacilityStr1": "1 HIGH LINER AVENUE",
  "FacilityStr2": null,
  "FacilityCity": "PORTSMOUTH",
  "FacilityState": "NH",
  "FacilityZipCode": "03802",
  "Facility4DigitZipExt": "0839",
  "FacilityCountyFIPS": "33015",
  "LEPC": "Portsmouth LEPC",
  "FacilityLatDecDegs": "43.0685",
  "FacilityLongDecDegs": "-70.800111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "HTTP://WWW.HIGHLINERFOODS.COM",
  "FacilityEmailAddress": "COWMER@NATSEA.CA",
  "FacilityDUNS": 71982839,
  "ParentCompanyName": "NATIONAL SEA PRODUCTS, INC.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "ERIC CONRAD, VP OPERATIONS",
  "OperatorStr1": "1 HIGH LINER AVENUE",
  "OperatorStr2": null,
  "OperatorCity": "PORTSMOUTH",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03802",
  "OperatorZipCodeExt": "0839",
  "RMPContact": "RICHARD COWMEADOW",
  "RMPTitle": "ENGINEERING MANAGER",
  "FTE": 250,
  "OtherEPAFacilityID": "03802NTNLSHIGH",
  "EPAFacilityID": "100000004639",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1992-10-21 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-04-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-04-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-04-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-04-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0.5e",
  "FRS_Lat": 43.0619,
  "FRS_Long": -70.79581,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 563,
      "AltID": null,
      "FacilityID": 494,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 567,
          "ProcessID": 563,
          "NAICSCode": "311712",
          "_desc": {
            "NAICS_CODE": "311712",
            "NAICS_DESCRIPTION": "Fresh and Frozen Seafood Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 637,
          "ProcessID": 563,
          "ChemicalID": 56,
          "Quantity": 38000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 500637,
          "ProcessID": 563,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 494,
      "SummaryText": "1.0 ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT YOUR FACILITY\nIt is High Liner Foods policy to adhere to all applicable federal, state and local laws.  The ammonia refrigeration process at High Liner Foods (process) has been designed and operates in compliance with EPAs Accidental Release Prevention rule and applicable state and local codes and regulations.  High Liner Foods has qualified engineering, operations, and maintenance personnel knowledgeable in the safe operation of compressed ammonia systems in direct responsibility of the process.  The process is also designed and operated in compliance with the Occupational Safety and Health Administrations Process Safety Management (OSHA-PSM) rule. \n\nThrough its Emergency Action Plan as required under OSHA-PSM, and through close communication with the Portsmouth Fire Department, High Liner Foods has emergency response procedures in place which comply with the Accidental Release Prevention program.\n\n2.0 A DESCRIPTION OF YOUR FACILITY AND THE REGULATED SUBSTANCES HANDLED\nHigh Liner Foods is a fish processing facility engaged in the preparation and packaging of seafood products.  The facility maintains approximately 38,000 pounds of anhydrous ammonia within the process.  The Accidental Release Prevention Program applicability threshold for anhydrous ammonia is 10,000 pounds.  As High Liner Foods anhydrous ammonia storage capacity exceeds this threshold, the facility is subject to the program and is required to prepare a RMP for this process.  The anhydrous ammonia refrigeration system at High Liner Foods is the only process that stores a substance in greater quantities than the Accidental Release Prevention Program applicability threshold.\n\nThe process is subject to Risk Management Program 3 because it is subject to OSHA-PSM provisions and it is not eligible for Program 1.\n\n3.0 THE WORST-CASE RELEASE SCENARIO\nThe worst-case release scenario was based on a rupture of an existing outdoor storage ve"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 494,
      "SummaryText": "ssel containing 7,000 pounds of anhydrous ammonia. The worst-case radius of impact (or distance to toxic endpoint) for rural conditions given a release mass of 7,000 pounds is 7,800 feet, or 1.5 miles. The estimated population affected by the worst-case release scenario has been estimated to be 5,000 people.  The facility is located directly off Route I-95 in an industrial setting.  Computerized census mapping indicates that two schools, the Sherburne School and the Franklin School, and one church, the Saint Catherine Church, are within the worst-case release scenario radius of influence.  Portsmouth Regional Hospital (not shown on the computerized map), Interstate 95, and a small group of industries, businesses and hotel facilities are also known to exist within the worst-case scenario radius of influence. An area of wetland exists south of the facility in the Great Bay basin. No other public or environmental receptors have been identified within the worst-case release radius of influence.\n\n4.0 THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\nThe process is currently designed and maintained in compliance with both American National Standards Institute (ANSI/ASHRAE) guidance and American Society of Mechanical Engineering (ASME) guidance.  Process verification takes place through design audits by certified consultants. The schedule of such verifications are at least once every three years. Contractors were recently retained to evaluate the three main components of the process:  the main ammonia receiver and scrubber, the transfer lines inside and outside the facility, and the evaporative condensers.  Potential process failures were identified and corrective actions were implemented. \n\nPreventative maintenance (PM) is an active part of High Liner Foods daily operations.  PM is performed on a computerized schedule in accordance with OSHA-PSM, and, in many cases, the process safety equipment PM schedule prescribed by High Liner F"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 494,
      "SummaryText": "oods exceeds recommended equipment maintenance schedules. Ammonia detection sensors in the engine room, cold storage, and above the accumulators in the production area are tested every six months.  At least once per year, all valves on the process are exercised (turned full open and full shut).  Relief valves are replaced on a 5-year schedule.  Differential pressure gages are replaced immediately upon discovery of any damage which may breach the integrity of the compressed ammonia process.\n\n5.0 FIVE-YEAR ACCIDENT HISTORY\nWithin the last five years, High Liner Foods, Inc. has not had an accident involving compressed ammonia that caused deaths, injuries, property or environmental damage, evacuations, or shelterings in place.     \n\n6.0 THE EMERGENCY RESPONSE PROGRAM\nA process release would be detected by ammonia sensors located in the engine room, cold storage, and above the accumulators in the production area.  A \"horn\" evacuation signal is triggered and would sound throughout the plant.  An alarm is also activated at the American District Telephone Company (ADT).  \n\nIn the event of a process release, ADT calls the plant maintenance department, which would contact the Portsmouth Fire Station if any of the following conditions are present:\n\n7 The release is severe enough to require response assistance; \n7 Reportable quantities of ammonia are released; and\n7 A potential for fire exists (in this case, ADT directly notifies the Fire Department).\n\nThe Portsmouth Local Emergency Planning Committee (LEPC, or Portsmouth Fire Department) is trained and equipped to respond to ammonia releases at High Liner Foods, Inc."
    }
  ]
}