{
  "FacilityID": 4963,
  "FacilityName": "North Charleston Distribution Terminal",
  "FacilityStr1": "35th Street and 3rd Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Charleston",
  "FacilityState": "WV",
  "FacilityZipCode": "25312",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "54039",
  "LEPC": "Kanawha/Putnam Emerg. Plan Com",
  "FacilityLatDecDegs": "38.374722",
  "FacilityLongDecDegs": "-81.692778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "kellerrr@ucarb.com",
  "FacilityDUNS": 5005483,
  "ParentCompanyName": "Union Carbide Corporation",
  "Company2Name": null,
  "CompanyDUNS": 1289008,
  "Company2DUNS": 0,
  "OperatorName": "H. M. Agee",
  "OperatorStr1": "437 MacCorkle Av. SW",
  "OperatorStr2": null,
  "OperatorCity": "South Charleston",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "25303",
  "OperatorZipCodeExt": null,
  "FTE": 29,
  "OtherEPAFacilityID": "25303NNCRB437MA",
  "EPAFacilityID": "100000060872",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-29 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Union Carbide North Charleston Distribution Term.",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMPlanner",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-06-18 00:00:00",
  "DeRegistrationEffectiveDate": "2004-01-15 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 38.37472,
  "FRS_Long": -81.69278,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5820,
      "AltID": "Vinyl Acetate Bulk Storag",
      "FacilityID": 4963,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 6281,
          "ProcessID": 5820,
          "ChemicalID": 29,
          "Quantity": 5606940.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5956,
          "ProcessID": 5820,
          "NAICSCode": "49311",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2448,
              "Process_NAICS_ID": 5956,
              "SafetyReviewDate": "1998-02-04 00:00:00",
              "PHA_Date": "1995-05-03 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1996-01-16 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Flammable mixtures inside vessels",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "variac vent,double hulled vessels, flame arrestors",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Fire water spray monitors, Foam fire suppressant",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "weighmaster surveillance",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-12-01 00:00:00",
              "TrainingReviewDate": "1999-04-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-04-01 00:00:00",
              "EquipmentInspectionDate": "1999-03-12 00:00:00",
              "EquipmentTested": "Vinyl acetate monomer pump",
              "ChangeMgmtDate": "1999-01-06 00:00:00",
              "ChangeMgmtReviewDate": "1999-01-26 00:00:00",
              "PreStartupReviewDate": "1999-01-06 00:00:00",
              "ComplianceAuditDate": "1996-12-16 00:00:00",
              "AuditCompletionDate": "1997-07-24 00:00:00",
              "IncidentInvestigationDate": "1999-03-20 00:00:00",
              "InvestigationChangeDate": "1999-03-31 00:00:00",
              "ParticipationPlansReviewDate": "1997-07-02 00:00:00",
              "HotWorkPermitReviewDate": "1998-09-01 00:00:00",
              "ContractorSafetyReviewDate": "1995-05-01 00:00:00",
              "ContractorSafetyEvalDate": "1999-02-01 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2740,
                  "PreventionProgram3ID": 2448,
                  "ProcessChemicalID": 6281
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4963,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-09-02 00:00:00",
    "ERTrainingDate": "1999-02-13 00:00:00",
    "CoordinatingAgencyName": "Kanawha/Putnam LEPC",
    "CoordinatingAgencyPhone": "3047441838",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "Clean Air Act, TSCA, FRA"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4963,
      "SummaryText": "UNION CARBIDE CORPORATION\nNORTH CHARLESTON DISTRIBUTION TERMINAL\nRISK MANAGEMENT PLAN\n\nEXECUTIVE SUMMARY\n\n1 Accidental Release Prevention and Emergency Response Policies\nThe Union Carbide North Charleston Distribution Terminal is committed to operating and maintaining all of our processes in a safe and responsible manner.  We have implemented a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as to protect the environment.  These programs include both Union Carbides Responsible Care. requirements and governmental requirements, such as the Environmental Protection Agencys (EPA) Risk Management Program (RMP) rule and the Occupational Safety and Health Administrations (OSHA) Process Safety Management (PSM) standard.\n2    Stationary Source and Regulated Substances\nThe Union Carbide North Charleston Distribution Terminal is a storage and redistribution facility for chemicals manufactured at other locations.  The North Charleston Distribution Terminal is managed by the Union Carbide South Charleston Plant. It is treated as a separate stationary source because the Kanawha River separates it from the South Charleston Plant, therefore, it is considered noncontiguous with the South Charleston Plant.  The North Charleston Distribution Terminal stores and distributes chemical materials to the South Charleston Plant for processing.  One of these chemicals is vinyl acetate monomer, which is used in the manufacture of polyvinyl acetate. The RMP rule requires that if a facility, such as the North Charleston Distribution Terminal, has a specific amount (threshold) or more of any one of 140 toxic and flammable chemicals, the facility must follow the RMP rule requirements.  Union Carbide handles and stores threshold quantities of the following RMP-regulated toxic substances at the North Charleston Distribution Terminal:\n\n7 Vinyl Acetate Monomer\n\nThere are no Union Carbide o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4963,
      "SummaryText": "wned EPA RMP regulated flammable chemicals stored at the site in threshold quantities.\n    3    Key Offsite Consequence Analysis Scenarios\nEPAs RMP rule requires that we provide information about the worst-case release scenario(s) and alternative release scenario(s) for our facility.  The following are brief summaries of these hypothetical scenarios.  Unless otherwise specified, no credit was taken for administrative controls or mitigation measures in evaluating the off-site impact of the scenarios.  Chemical-specific steps to prevent these scenarios from occurring, and to mitigate their effects should they occur, are shown immediately after the scenario description.  The terminal's general accident prevention program is described in Section 4.\nRegulated Toxic Substances\n\nWorst-Case Release Scenario\n\nThis scenario assumes catastrophic failure of a railroad tank car releasing 190,000 lbs of vinyl acetate monomer as a liquid to the atmosphere.  According to EPAs Off-Site Consequence Analysis (OCA) Guidance Table, this release could impact off-site public receptors.\nOther specific steps to prevent this scenario from occurring, and to mitigate its effects should they occur, include:\n7 Pressure Relief Device:  This device is designed to relieve pressure at a predetermined set point and prevents over pressure of the railroad tank car.\n7 Collection Pan:  A collection pan can be used to contain small spills and direct material into process sewer to minimize evaporation to atmosphere.\n7 Operator Surveillance:  An operator is required to be present while unloading a vinyl acetate monomer railroad tank car.\n7 Foam Trailer:  Foam material can be sprayed across the surface of a vinyl acetate monomer spill to minimize evaporation to the atmosphere.\n7 Fire Water Spray Monitors: Area fire water spray monitors can be used to help suppress vinyl acetate monomer vapors.\n\nAlternate-Case Release Scenario\n\nThis scenario assumes a liquid release from a pump discharge line when pumping vinyl a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4963,
      "SummaryText": "cetate monomer to a South Charleston Plant production unit, releasing vinyl acetate monomer at a rate of 1,564 lbs per minute for 120 minutes.  According to the OCA Guidance Table, this release could impact off-site public receptors. The pump discharge line is in a diked area to contain and minimize evaporation of the vinyl acetate monomer.\nThe following passive mitigation measure was used in this analysis:\n7 Earthen Dike:  The dike contains and minimizes vinyl acetate monomer evaporation to the atmosphere.\nThe following active mitigation measures were used in this analysis:\n7 Emergency Shutdown System:  A manual activated emergency shutdown system is designed to shut-off the vinyl acetate monomer transfer pump and place transfer valves in closed position.\n7 Surveillance:  Operators routinely monitor the process every 120 minutes.\nThis scenario assumes that the operator detects the release and manually actuates the emergency shutdown system within 120 minutes.\nOther specific steps to prevent this scenario from occurring, and to mitigate its effects should they occur, include:\n7 Foam Trailer: Foam material can be sprayed across the surface of a vinyl acetate monomer spill to minimize evaporation to the atmosphere.\n7 Fire Water Spray Monitors: Area fire water spray monitors can be used to help suppress vinyl acetate monomer vapors.\n\n\nWorst-Case Release Scenario(s) Regulated Flammable Chemicals\n\nNo Union Carbide owned EPA RMP regulated flammable chemicals stored in threshold quantities at the site.\n\nAlternate-case Release Scenario(s) Regulated Flammable Chemicals\n\nNo Union Carbide owned EPA RMP regulated flammable chemicals stored in threshold quantities at the site.\n\n4    General Accidential Release Prevention Program \n\nGeneral Program\n\nOur general accident prevention program consists of compliance with the EPA RMP rule and OSHAs PSM standard and implementation of Union Carbides Operational Safety Program and Episodic Risk Management System.  Key elements include:\n\nEqu"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4963,
      "SummaryText": "ipment Design:  Vessels (including shipping containers) and other process equipment are designed according to recognized industry standards and/or governmental requirements.\nProcess Safety Information: Chemical hazard, process technology, and equipment information is is documented, maintained up-to-date, and available to operating personnel.\nProcess Hazard Analysis:  Process hazard analyses are conducted every five years to identify major process hazard scenarios and to recommend corrective action(s) needed to prevent their occurrence.\nEpisodic Risk management System:  Periodic reviews are conducted to identify hazards which could have significant community impact and to recommend corrective action(s) needed to prevent their occurrence.  These reviews utilize advanced quantitative risk assessment techniques.\nOperational Safety Standards:  Design requirements for active and passive mitigation controls used to prevent major process hazards are documented in operational safety standards.\nOperating Procedures:  Operating procedures provide detail on how to safely operate a process and are maintained up-to-date.\nOperator Training/Certification Program:  The plant has a training and testing program which provides operators with the proper skills and knowledge prior to allowing them to independently operate a process.\nTechnical Staff Training and Support:  Trained technical staff employees are available 24 hours a day to support operations.\nMaintenance Procedures: The plant has specific procedures for maintaining process equipment so that it operates safely.\nMaintenance Training:  The plant trains persons who perform routine or complex maintenance tasks on process equipment.\nMechanical Integrity Program:  Vessels (including shipping containers) and other process equipment are periodically tested and inspected to ensure safe operation of process equipment, following recognized standards and/or government requirements.\nManagement of Change:  The plant has a management system"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4963,
      "SummaryText": " to ensure that modified facilities and processes are safe for operation.\nPre-Startup Safety Reviews:  Reviews are conducted just prior to startup to ensure that modified facilities and processes are safe for operation.\nIncident Investigation:  The plant has a program to ensure accidents and incidents are properly investigated to determine the cause(s) and implement corrective action(s) that are needed to prevent the event from reoccurring.\nEmployee Participation:  The plant has a program to involve employees in prevention program elements.\nHot Work Permit:  The plant has a procedure to ensure that welding, cutting and brazing are safely performed in areas where flammable or combustible material may be present.\nContractor Safety Program:  The plant has a program to ensure that contractors are properly trained and perform their work in compliance with safety requirements.\nCompliance Audits:  Periodic Corporate and plant-led audits are conducted to ensure that process operations comply with governmental and Union Carbide requirements.\nOperational Safety Program:  Union Carbide has a comprehensive program to ensure that all the elements listed above are implemented at every Union Carbide location.  This program includes accountabilities for timely and proper implementation of the program elements.\n\nThese general prevention elements and the chemical specific steps discussed in the previous section are parts of an overall management system  to prevent accidental chemical releases.  Our company and our employees are committed to the standards that these management systems set.  We have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\n5    Five-Year Accident History\nIn the last five years there has not been an accident or incident involving an EPA RMP chemical at the Union Carbide North Charleston Distribution Terminal that resulted in an on-site death, injury, or property damage; or a known off-site death, i"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 4963,
      "SummaryText": "njury, evacuation, shelter-in-place, property damage or environmental damage.\n\n6    Emergency Response Program\nThe South Charleston Plant (provides emergency response services to North Charleston Distribution Terminal) maintains a written emergency response program to protect worker and public safety, as well as the environment.  The program consists of procedures for responding to releases of hazardous substances, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response including:\n7 Proper first-aid and medical treatment for exposures \n7 Evacuation plans and accounting for personnel after an evacuation\n7 Notification of local emergency response agencies and the public if a release occurs\n7 Post-incident cleanup and decontamination requirements, and\n7 Inspecting, testing, maintaining, and using emergency response equipment.\nThe emergency response program is updated when necessary based on modifications made to facility processes.\n\nThe South Charleston Plant maintains a trained emergency squad to handle fires, explosions, toxic vapor releases, spills, and medical emergencies.   The plant emergency squad trains and drills with local emergency responders to enhance their skills and tactics for responding to an accidental chemical release.   Critiques are held on drills and actual events.  In addition to the plant emergency squad, Union Carbide staffs a Hazardous Emergency Leaks Prevention (HELP ) team in the Kanawha Valley that responds to accidental releases from transportation equipment throughout the continental United States.  \n\nThe emergency response program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Detailed emergency response plans are developed and coordinated with the Kanawha/Putnam emergency Planning Committee and the community.\n\n7    Planned Changes to Improve Safety"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 4963,
      "SummaryText": "\nThe following is a list of improvements that we are planning to implement at the facility to help prevent and/or better respond to accidental chemical releases:\n7 Implement a new Corporate program which utilizes semi-quantitative assessment techniques in process hazard analyses to ensure that controls used for prevention or mitigation of hazards provide adequate protection\n7 Implement a new Corporate program designed to ensure that process safety information is maintained evergreen\n7 Implement the Apollo Root Cause Analysis problem solving technique to identify causes of process problems and effective solutions to prevent their reoccurrence\n7 Replace vinyl acetate monomer, isopropanol and caustic transfer line piping to minimize possibility of leaks\n7 Shutdown the trucking operations, which will reduce the number of chemicals stored at the site\n7 Enhancement of spill prevention practices associated with the process sewer collection tank\n7 Implement a Corporate-wide strategy to avoid computer hardware and software systems operating disruptions due to the year 2000 changeover.  The latest information on the company's Y2K efforts can be found on our Internet site -- www.unioncarbide.com.  This information will be periodically updated through first quarter 2000.\n"
    }
  ]
}