{
  "FacilityID": 49683,
  "FacilityName": "Wild Rocket Foods, LLC",
  "FacilityStr1": "1730 Eastrigde Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Riverside",
  "FacilityState": "CA",
  "FacilityZipCode": "92507",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06065",
  "LEPC": null,
  "FacilityLatDecDegs": "33.931944",
  "FacilityLongDecDegs": "-117.300000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "wildrocketfoods.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Wild Rocket Foods, LLC",
  "OperatorStr1": "1730 Eastrigde Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Riverside",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92507",
  "OperatorZipCodeExt": null,
  "FTE": 120,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000199965",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-08-06 00:00:00",
  "SafetyInspectionBy": "Prelim walk-thru by Riverside Fire Dept.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Riverside - (HA used \"Liquefied by Pressure\")",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-09-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-09-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-09-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-12-18 00:00:00",
  "DeRegistrationEffectiveDate": "2015-12-03 00:00:00",
  "AnniversaryDate": "2012-09-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 72061,
      "AltID": "Main Plant Refrigeration",
      "FacilityID": 49683,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 95630,
          "ProcessID": 72061,
          "ChemicalID": 56,
          "Quantity": 42000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 73780,
          "ProcessID": 72061,
          "NAICSCode": "311991",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 42191,
              "Process_NAICS_ID": 73780,
              "SafetyReviewDate": "2007-09-04 00:00:00",
              "PHA_Date": "2007-08-09 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-01-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Ammonia Diffusion Tank",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "First PHA for new facility and refrigeration system",
              "OpProceduresReviewDate": "2007-09-07 00:00:00",
              "TrainingReviewDate": "2007-09-04 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-08-09 00:00:00",
              "EquipmentInspectionDate": "2007-09-07 00:00:00",
              "EquipmentTested": "Pressure testing of oversall system in progress at noted date - C&L Refrigeration in conjuction with start-up",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2007-09-04 00:00:00",
              "PreStartupReviewDate": "2007-09-07 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-09-04 00:00:00",
              "HotWorkPermitReviewDate": "2007-09-04 00:00:00",
              "ContractorSafetyReviewDate": "2007-09-04 00:00:00",
              "ContractorSafetyEvalDate": "2007-05-30 00:00:00",
              "CBI_Flag": 0,
              "Description": "The ammonia process is a mechanical refrigeration system.",
              "_chemicals": [
                {
                  "PrimaryKey": 61568,
                  "PreventionProgram3ID": 42191,
                  "ProcessChemicalID": 95630
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 49683,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2007-09-07 00:00:00",
    "ERTrainingDate": "2007-09-07 00:00:00",
    "CoordinatingAgencyName": "City of Riverside Fire Department",
    "CoordinatingAgencyPhone": "9518265338",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "California  (Title 19) CalARP; 29 CFR 1910.120(q) First Responder Training"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 49683,
      "SummaryText": "SCOPE\nThe EPA RMP regulation requires that an Executive Summary be provided as part of the registration submitted to the EPA. The following areas are addressed in this summary:\n?Accidental Release Prevention and Emergency Response Policies\n?Stationary Source Activities and Regulated Substances Handled\n?Worst-Case and Alternative-Case Release Scenarios\n?Prevention Program\n?Five-Year Accident History\n?Emergency Response Program\n?Planned Changes to Improve Safety\n\nSCOPE\nThe EPA RMP regulation requires that an Executive Summary be provided as part of the registration submitted to the EPA. The following areas are addressed in this summary:\n?Accidental Release Prevention and Emergency Response Policies\n?Stationary Source Activities and Regulated Substances Handled\n?Worst-Case and Alternative-Case Release Scenarios\n?Prevention Program\n?Five-Year Accident History\n?Emergency Response Program\n?Planned Changes to Improve Safety\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nWild Rocket Foods, LLC (Wild Rocket) committed to complying with all of the regulatory requirements of the EPA Risk Management Program. Wild Rocket has developed their Risk Management Plan / Process Safety Management (RMP/PSM) Manual to document Wild Rocket policies that address the implementation of these regulations. The PSM sections pertain to the prevention of accidental releases and include the Process Hazard Analysis study and procedures for operating, training, maintenance, emergency response, and others. The RMP sections pertain to management systems and include the Hazard Assessment (Offsite Consequence Analysis) Report.\n\nSTATIONARY SOURCE ACTIVITIES AND REGULATED SUBSTANCES HANDLED\nThe Wild Rocket -Riverside facility fruits and vegetables into various salads and juices. As part of the operations, cooling is required both during processing and for short-term cold storage. The facility is located in a light industrial area of Riverside. Ammonia is used as the refrigerant in the Main "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 49683,
      "SummaryText": "Refrigeration System (?Main System?). The ammonia quantity in the system is over 10,000 lbs.\n\nAll refrigeration systems are direct, mechanical refrigeration systems. The facility is under construction and is scheduled for operation September 2008. The ammonia equipment is located outside, in the Refrigeration Room and in the Refrigerated Rooms. All Main System equipment is permanently mounted.\n\nHAZARD ASSESSMENT\nThe regulation requires that the Worst-Case Release Scenario use the ammonia quantity in the largest vessel or pipe.\n\nNOTE: It is important to consider that the Worst-Case Scenario is extremely unlikely to occur since this scenario does not consider any safety features of the system - in either design or operation.  The scenario parameters are established by the regulation to provide uniformity for dialog between the industry, community, and regulatory agencies.\n\nThe regulation allows the facility to select the Alternate-Case Scenario.\n\nPREVENTION PROGRAM\nWild Rocket's Prevention Program is described in the RMP/PSM Manual. The RMP Prevention Program is equivalent to OSHA's Process Safety Management Program (PSM). The Prevention Program implemented by Wild Rocket is essential to help prevent releases and to minimize the effects if a release does occur.\n\nKey objectives of Wild Rocket's Prevention Program are briefly described below:\n\n1. Maintain current and complete refrigeration system technical information. (Addressed under the Process Safety Information chapter)\n2. Provide thorough team evaluation of the refrigeration system. The evaluation considers a number of potential problems including: mechanical problems, human errors, and external events (e.g., earthquakes). All safety recommendations developed by the team are reviewed and addressed by Wild Rocket. (Addressed under Process Hazard Analysis chapter.)\n3. Written procedures and policies that establish how the refrigeration system should be operated and maintained and how to investigate accidental releas"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 49683,
      "SummaryText": "es. (Addressed under Operating Procedures, Mechanical Integrity, and Incident Investigation chapters.) 4. Certification of refrigeration operators to safely operate the refrigeration system. Wild Rocket certifies operators following completion of operator training and Wild Rocket's confirmation of the operator's ability apply what they have learned. (Addressed under Training chapter.)\n5. Employee involvement in the Prevention Program. This is addressed on two levels. First, refrigeration equipment operators participate in the planning and evaluation of the Prevention Programs (e.g., Process Hazard Analysis study team, writing and/or reviewing operating procedures, Incident Investigation team, etc.). This involvement encourages ownership of the Prevention Program and positively affects the operators' day-to-day activities.  \nSecond, all Wild Rocket employees (direct hires and contract) at this facility receive ammonia awareness training. Additionally, they have access to the RMP/PSM information. These activities improve the overall safety of the employees. (Both levels are addressed under Employee Participation chapter)\n6. Implementation of additional measures when changes are planned (procedural or mechanical). These measures begin before any changes are made and may include a Process Hazard Analysis, operator training, and Process Safety Information updates plus other measures required by Wild Rocket's Management of Change Procedure.  \nIf a mechanical change is required and for maintenance contracts, Wild Rocket has a procedure for selecting a contractor based on the company's experience and safety history. Additionally, if welding, grinding, or other \"Hot Work\" occurs inside the building and close to the refrigeration system, a Wild Rocket Hot Work permit is required. The purpose of the permit and the associated Hot Work procedure is to minimize the possibility of a fire. \nFollowing completion of a mechanical change, a pre-startup safety review is required before "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 49683,
      "SummaryText": "the system can be started. (These areas are addressed under Management of Change, Contractor Qualifications, Hot Work Permit, and Pre-Start-up Safety Review chapters.)\n7. Verification of Wild Rocket's compliance with the RMP/PSM program. This self-audit process is an important tool to confirm whether each of the elements in the Prevention Program (and the Risk Management Program) has been implemented and properly documented by Wild Rocket personnel. Wild Rocket has established a Management System procedure to address any shortcomings, which the audit may find. (Addressed under Compliance Audit chapter.)   \n8. Minimize employee injury and illness. (Addressed under Wild Rocket's Illness and Injury Prevention Program.)\n\n\nFIVE-YEAR ACCIDENT HISTORY\nThe Wild Rocket facility had no reportable accidental ammonia releases in the last five years. The facility is currently under construction.\n\nEMERGENCY RESPONSE PROGRAM\nWild Rocket's Emergency Response Program is described in their Emergency Response Plan for the Riverside facility.\n\nThis plan includes planned responses and procedures for evacuations, notifying responders and governmental agencies. The plan also includes first aid procedures for immediate care and instructions for follow-up medical care when necessary. The plan addresses training requirements for employees including production employees, supervisors, managers, and operators. Evacuation drills are an important part of the training. \n\nUnder Wild Rocket's Emergency Response policy, Wild Rocket employees who have been trained as \"First Responders\" may initially respond to releases that can be addressed without entering the danger area (i.e., de-energizing equipment). Wild Rocket will evacuate affected area, begin notification process, and rely on off-site responders (e.g., the fire department, refrigeration contractor).\n \nPLANNED CHANGES TO IMPROVE SAFETY\nThe Process Hazard Analysis (PHA) study team developed recommendations to improve safety.\nKey recommendations"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 49683,
      "SummaryText": " identified during study include (partial listing):\n?    Establish additional written procedures for practices and maintenance\n?    Require Technicians to carry portable eye wash bottles when working on roof\n?    Confirm alarm system and alarm notification system\n?    Expand preventative maintenance (PM) program and define written PM Schedule, including ?fail? test of safety components.\n?    Critical valve tagging \n?    Develop confine space policy and confirm all confined spaces are posted as such\n?    Purchase hand-held ammonia sensor\n?    Add control elements to control systems (CP-RCP1)\n?    Add access platforms\n\nImplementation of the measures has begun according to the schedule set by Wild Rocket.\n\nNote: As of August 29, 2007, Bob Wright, V.P. of Operations at Wild Rocket will ensure a collaborative plan for the Community Emergency Response Plan between Wild Rocket and the City of Riverside EOC Office, Anthony Colletta will be developed in the near future.\n\nNote: The September 7, 2007 date for the Pre-Startup Safety Review is noted to reflect that  this measure is currently in progress. The Pre-Startup Safety Review will be completed prior to the initial ammonia charge of the quantity noted in the RMP Report Section 1.17."
    }
  ]
}