{
  "FacilityID": 49702,
  "FacilityName": "Glacier Cold Storage LTD.",
  "FacilityStr1": "2233 Jesse St.",
  "FacilityStr2": null,
  "FacilityCity": "Los Angeles",
  "FacilityState": "CA",
  "FacilityZipCode": "90023",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.030000",
  "FacilityLongDecDegs": "-118.220000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Felix Goldberg",
  "OperatorStr1": "6820 Wilson Ave",
  "OperatorStr2": null,
  "OperatorCity": "Los Angeles",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90001",
  "OperatorZipCodeExt": null,
  "FTE": 17,
  "OtherEPAFacilityID": "000-265-106",
  "EPAFacilityID": "100000160032",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-09-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-09-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-09-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-09-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 34.05,
  "FRS_Long": -118.36667,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 72084,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 49702,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 95656,
          "ProcessID": 72084,
          "ChemicalID": 56,
          "Quantity": 15769.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 73804,
          "ProcessID": 72084,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 42206,
              "Process_NAICS_ID": 73804,
              "SafetyReviewDate": "2007-03-21 00:00:00",
              "PHA_Date": "2007-03-07 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2008-03-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Daily Visual Inspection",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2007-03-21 00:00:00",
              "TrainingReviewDate": "2007-03-21 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-03-21 00:00:00",
              "EquipmentInspectionDate": "2007-06-01 00:00:00",
              "EquipmentTested": "Compressor and Evaporators",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2007-03-21 00:00:00",
              "PreStartupReviewDate": "2007-03-21 00:00:00",
              "ComplianceAuditDate": "2007-03-21 00:00:00",
              "AuditCompletionDate": "2008-03-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-03-21 00:00:00",
              "HotWorkPermitReviewDate": "2007-03-21 00:00:00",
              "ContractorSafetyReviewDate": "2007-03-21 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-19 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Glacier Cold Storage facility chills and stores a variety of frozen food products in their cold storage warehouse. The facility utilizes an Ammonia Refrigeration System to provide cooling capabilities. The Ammonia Refrigeration System is operated as a single stage system. No\nchemical reactions occur during the process cycle of an Ammonia Refrigeration System.",
              "_chemicals": [
                {
                  "PrimaryKey": 61585,
                  "PreventionProgram3ID": 42206,
                  "ProcessChemicalID": 95656
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 49702,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Los Angeles Fire Department",
    "CoordinatingAgencyPhone": "2134856217",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 49702,
      "SummaryText": "The Glacier Cold Storage, LTD. facility is located approximately 0.2 miles West of US-101 freeway, and 0.13 miles North of East 7th Street.\n\nThe facility has developed a Risk Management Program to address California Accidental Release Prevention (CalARP) Program requirements (California Code of Regulations, Title 19, Division 2, Chapter 4.5, Sections 2735-2785).  The facility is extremely diligent in the handling of all chemicals and is dedicated to the safety of its employees and the neighboring community. The facility staff is highly trained and utilizes log sheets and employee rounds to monitor the facility and provide safeguards, while effectively and safely using ammonia as a refrigerant. The facility has a qualified Ammonia Refrigeration Contractor to assist with their operation and maintenance. \n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nThe facility has a long standing commitment to its workers and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as personnel training and consideration of safety in the design, operation, and maintenance of the Ammonia Refrigeration System. The facility?s policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. \n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\nThe Glacier Cold Storage, LTD. facility chills and stores a variety of frozen food products in their cold storage warehouse. The facility utilizes an Ammonia Refrigeration System to provide cooling capabilities. The Ammonia Refrigeration System is operated as a single stage system. No chemical reactions occur during the process cycle of an ammonia refrigeration system. The operation of a refrigeration system requires controlling the ammonia (NH3) refrigerant pressure and temperature at key points in the system. High pressure liquid ammonia travels from the High Pressure Receiver through a controlled pressure receiver where it is divided into two directions. In o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 49702,
      "SummaryText": "ne direction, the ammonia is a low pressure, temperature vapor and is sent to the Booster Compressors. In the other direction, the liquid ammonia travels to the Intercoolers and Evaporators and is a low pressure, low temperature vapor as it enters the evaporator.  Inside the evaporator, the ammonia gains heat and is evaporated at a constant pressure to become a vapor. This vapor is characterized as a low pressure, low temperature saturated vapor; it leaves the evaporator and enters the accumulators. From the accumulators the ammonia is sent to the compressors, where it is compressed. The compressors compress the vapor at constant entropy and the refrigerant becomes a superheated vapor. The super heated vapor returns to the condenser where it is condensed at constant pressure back to a saturated liquid. Heat transfer to the evaporator and from the condenser occurs with an unlimited temperature difference between the substance emitting the heat and the substance absorbing the heat. This is not true during the de-superheating process in the condenser.  \n\nHAZARD ASSESSMENT SUMMARY/OFFSITE CONSEQUENCE ANALYSIS\n\nWorst-Case Release Scenario \nPer the CalARP Regulations, one worst case analysis has been defined.  RMP*Comp was used to determine the maximum downwind endpoint distance.  The results can be found in the Hazard Assessment documentation located behind the Hazard Assessment Tab in the Compliance Workbook.  This worst case release scenario is highly unlikely to occur because of passive mitigation measures that can be taken into account and weather conditions that are unlikely as well.\n\nAlternative Release Scenario\nThe meteorological conditions specified by regulation for alternative release scenarios were used.  RMP*Comp was used to determine the maximum downwind endpoint distance.  The downwind distance for this alternative release scenario is significantly less than that for the worst-case scenario.  The results can be found in the Hazard Assessment documentation l"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 49702,
      "SummaryText": "ocated behind the Hazard Assessment Tab in the Compliance Workbook. \n\nRisk Considerations\nAlthough the storage and use of Anhydrous Ammonia has inherent potential risks, and worst-case release scenarios can potentially reach the community; the facility has recognized these potential risks and structured its safety systems to make the worst case event non-credible.  In addition to the safety practices of the facility and facility personnel that make this worst-case event non-credible, it should also be recognized that there are inherent analysis assumptions that make the results of the atmospheric dispersion analysis appear worse than what would actually be expected during such an event (e.g., In the event of a release, sudden rupture and flashing of ammonia would be highly turbulent.  Turbulence causes entrainment of air and the released vapor dilutes much more quickly than is shown in the model).\n\nIn addition to the use of conservative analysis assumptions that over-predict the effects of a potential release, other characteristics of the facility and site serve to minimize the potential risks associated with an ammonia release:\n?    There are process valves to permit isolation of any leaks in place without exposing anyone to the anhydrous ammonia.\n?    The system utilizes automatic shut-downs that would prevent a deviation from resulting in a release. \n?    Personal Protective Equipment (PPE) is used by plant personnel, as necessary.\n?    The system has ammonia sensors that automatically notify an alarm company and activate various alarms and shutdowns.  \n?    The machine room is equipped with an emergency ventilation system.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\nAs part of the implementation of this CalARP Program, key prevention program elements were implemented by the facility to manage process safety issues associated with the use of ammonia for refrigeration.  In addition, common industry standards, policies, and procedures are current"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 49702,
      "SummaryText": "ly utilized to ensure safe practices are being performed; this includes common practices outlined by the International Institute of Ammonia Refrigeration (IIAR).  As ammonia is ?self alarming? due to its pungent odor, even minor releases are readily noticeable.  The Prevention Program 3 elements include:\n?    Process Safety Information\n?    Process Hazard Analysis\n?    Operating Procedures\n?    Training\n?    Mechanical Integrity\n?    Management of Change\n?    Pre-startup Safety Review\n?    Compliance Audits\n?    Incident Investigation\n?    Employee Participation\n?    Hot Work Permit\n?    Contractors\n?    Emergency Response Plan\n\nIn addition, key emergency response elements were addressed in the Business Emergency Plan (BEP).  The entire prevention program elements are kept in the CalARP/EPA RMP/OSHA PSM Compliance Workbook located onsite.  The prevention program elements satisfy the requirements of CalARP, EPA RMP, and OSHA PSM.\n\nFIVE-YEAR ACCIDENT HISTORY\nThere have been no CalARP-applicable releases of ammonia at the facility in at least the past five (5) years. \n\nEMERGENCY RESPONSE PROGRAM\nThe facility has filed a Chemical Inventory Business Emergency Plan with the City of Los Angeles and this plan includes:\n?    Emergency Alarm Procedures\n?    Evacuation Procedures\n?    Safety and Health Considerations\n?    Notification Procedures\n\nPLANNED CHANGES TO IMPROVE SAFETY\nSeveral studies have been conducted to examine mitigation measures to improve safety at the facility.  These studies include the following: Process Hazard Analysis, Seismic Assessment, and Hazard Assessment.  Any outstanding recommendations from these studies will have been addressed by March 2008."
    }
  ]
}