{
  "FacilityID": 49750,
  "FacilityName": "Honeywell Kingman Facility",
  "FacilityStr1": "4790 Olympic Drive",
  "FacilityStr2": null,
  "FacilityCity": "Kingman",
  "FacilityState": "AZ",
  "FacilityZipCode": "86401",
  "Facility4DigitZipExt": "6771",
  "FacilityCountyFIPS": "04015",
  "LEPC": "Mohave County LEPC",
  "FacilityLatDecDegs": "35.267694",
  "FacilityLongDecDegs": "-113.942556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "AB",
  "FacilityURL": "http://my.honeywell.com/default.htm",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 39136262,
  "ParentCompanyName": "Honeywell International",
  "Company2Name": null,
  "CompanyDUNS": 139691877,
  "Company2DUNS": null,
  "OperatorName": "Honeywell International",
  "OperatorStr1": "101 Columbia Road",
  "OperatorStr2": null,
  "OperatorCity": "Morristown",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07962",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": "86401LLDSG47900",
  "EPAFacilityID": "100000106592",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-11-06 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2007-09-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-09-19 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2007-09-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-01-28 00:00:00",
  "DeRegistrationEffectiveDate": "2013-12-12 00:00:00",
  "AnniversaryDate": "2012-09-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 35.267694,
  "FRS_Long": -113.942556,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 72165,
      "AltID": "EO Storage and Unloading",
      "FacilityID": 49750,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 95753,
          "ProcessID": 72165,
          "ChemicalID": 9,
          "Quantity": 100000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 73885,
          "ProcessID": 72165,
          "NAICSCode": "32512",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 42270,
              "Process_NAICS_ID": 73885,
              "SafetyReviewDate": "2006-12-15 00:00:00",
              "PHA_Date": "2002-12-02 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-02-11 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Procedure Modifications",
              "OpProceduresReviewDate": "2007-12-15 00:00:00",
              "TrainingReviewDate": "2006-02-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2006-04-20 00:00:00",
              "EquipmentInspectionDate": "2007-06-15 00:00:00",
              "EquipmentTested": "EO Car Unloading Hose",
              "ChangeMgmtDate": "2006-05-01 00:00:00",
              "ChangeMgmtReviewDate": "2007-06-15 00:00:00",
              "PreStartupReviewDate": "1998-10-05 00:00:00",
              "ComplianceAuditDate": "2006-12-19 00:00:00",
              "AuditCompletionDate": "2007-12-01 00:00:00",
              "IncidentInvestigationDate": "2004-05-05 00:00:00",
              "InvestigationChangeDate": "2004-05-10 00:00:00",
              "ParticipationPlansReviewDate": "2007-06-15 00:00:00",
              "HotWorkPermitReviewDate": "2007-03-16 00:00:00",
              "ContractorSafetyReviewDate": "2004-06-14 00:00:00",
              "ContractorSafetyEvalDate": "2007-06-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 61662,
                  "PreventionProgram3ID": 42270,
                  "ProcessChemicalID": 95753
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 49750,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2007-05-29 00:00:00",
    "ERTrainingDate": "2007-09-14 00:00:00",
    "CoordinatingAgencyName": "Mohave County LEPC",
    "CoordinatingAgencyPhone": "9287539141",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 49750,
      "SummaryText": "RMP*Submit Executive Summary\r\nHoneywell Kingman Facility\r\n\r\nAbout Honeywell\r\nThe Kingman Facility is a manufacturing facility located in Kingman, AZ.  It is part of the Specialty Materials business group of Honeywell International Inc.\r\n\r\nHoneywell is a $32 billion diversified technology and manufacturing leader, serving customers worldwide with aerospace products and services; control technologies for buildings, homes and industry; automotive products; turbochargers; and specialty materials.  Headquartered in Morris Township, NJ, Honeywell¿s shares are traded on the New York, London, Chicago and Pacific Stock Exchanges. \r\n\r\nHoneywell Specialty Materials, also based in Morris Township, NJ, is a Honeywell business group and a global leader in providing high-performance specialty materials such as fluorocarbons, specialty films, advanced fibers, customized research chemicals and intermediates.\r\n\r\nHealth, Safety and Environment/Responsible Care\r\nHoneywell is committed to managing health, safety and the environment as a core business value. The company also integrates health, safety and environmental management into all aspects of our businesses as a competitive advantage in achieving profitable growth and accelerated productivity.\r\n\r\nHoneywell participates in the Responsible Care program of the American Chemistry Council. Established in 1988, Responsible Care is a voluntary program focused on achieving improvements in environmental, health and safety performance beyond levels required by the U.S. government\r\n\r\nIn addition to detailing practices for the safe use of materials and requiring audits, the Responsible Care initiative requires its member and partner companies to develop mechanisms for outreach with the communities in which they operate. Community Advisory Panels (CAP) serve as important links between chemical facilities and their neighboring communities. \r\n\r\nHoneywell Kingman Facility\r\nThe Honeywell Kingman Facility is a sterilant manufacturing facility that"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 49750,
      "SummaryText": "has 7 employees. The plant¿s products are used to sterilize medical devices by both the original manufacturers and by hospitals before reuse for multiple use devices.  \r\n\r\nOne of the materials used by the facility is ethylene oxide (EO), which is on the RMP Rule's list of regulated substances.  The Honeywell Kingman Facility¿s storage and use of ethylene oxide exceeds the specified threshold of 10,000 lbs., as defined by the EPA¿s RMP Rule.  \r\n\r\nIn accordance with the requirements of the RMP Rule, a description of the following six elements is provided for the Honeywell Kingman Facility: \r\n\r\n1) Accidental Release Prevention and Emergency Response Policies: \r\n\r\nIt is the policy of the Honeywell Kingman Facility to operate a safe and environmentally sound facility by identifying and controlling health, safety, and environmental risks related to its operations; by designing its processes to protect people, property and the environment; by conducting and continually reviewing and improving programs for safety, health and environmental excellence; and by establishing processes to assure that all laws and regulations applicable to its operations and products are known and observed.  The accidental release prevention and emergency response policy associated specifically with the plant's use of ethylene oxide involves the integration of safety devices and technologies inherent in the design of the process, safe operational procedures and management practices, operator training, the preparation and testing of site emergency response plans, the maintenance of onsite emergency response equipment and a professionally trained Safety Brigade, coordinating our efforts and resources with local emergency response services, and communicating with the community. \r\n\r\n2) Description of the Facility and the Regulated Substance Handled:  \r\n\r\nThe Kingman Facility is located in the Kingman Airport Industrial Park at 4790 Olympic Drive, Kingman, Arizona.  The facility currently has 7 employe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 49750,
      "SummaryText": "es.  \r\n\r\nAt the Kingman facility chlorotetrafluoroethane (Refrigerant-124) is mixed with ethylene oxide to make Oxyfume 2000, and chlorotetrafluoroethane (Refrigerant 124) and chlorodifluoromethane (Refrigerant 22) are mixed with EO to make Oxyfume 2002.  Oxyfume 2000 is used primarily by medical device manufacturers to sterilize medical devices such as sutures and lens implants prior to shipment to hospitals and doctor¿s offices.  Oxyfume 2002 is used primarily by hospitals to sterilize reusable heat sensitive devices such as various types of scopes used for arthoscopic surgery.\r\n\r\nThe Plant Manager of the Kingman facility is a member of the Local Emergency Planning Committee (LEPC) and is active in helping to prepare the community to handle a potential emergency situation.\r\n\r\nThe only chemical in the Kingman facility that requires the facility to participate in EPA¿s Risk Management Program is EO.  At the Kingman facility, EO is stored in the same rail car in which it is shipped.  The car is surrounded by a water deluge system for fire protection and to suppress vapors in the unlikely event a leak should occur.  The EO car is only connected to the EO distribution piping when a transfer is being made to a blend tank.  At all other times the car is disconnected and sealed.  Transfers occur on an average of twice per month and take about 4 hours.\r\n\r\n3.\tGeneral accidental release prevention program and chemical specific accident prevention program\r\n\r\nThe Kingman facility has a comprehensive general accidental release prevention program.  The program is comprised of 12 elements.  The activities at the Kingman facility in each of these elements are described briefly below.\r\n\r\nProcess Safety Information:\r\n\r\nThe Process Safety Information section of the program is designed to help those involved in operating the process identify and understand the hazards posed by regulated chemicals.\r\n\r\n   Process Safety Information includes information on: \r\n\t\r\n-\tThe hazards of the regu"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 49750,
      "SummaryText": "lated chemicals used or produced by the process.\r\n\r\n   -\tInformation on the technology of the process.\r\n\r\n   -\tInformation on the equipment in the process\r\n\r\nProcess Hazard Analysis:\r\n\r\nA Process Hazards Analysis has been completed for all processes that use regulated chemicals.  These analyses are used to review areas involved in the use, storage, manufacturing, handling, or onsite movement of regulated chemicals.  The ¿What If¿ method was used to perform PHA¿s at the Honeywell Kingman facility.\r\n\r\nStandard Operation Procedures ¿ (SOP):\r\n\r\nWritten operating procedures have been developed that provide clear instructions for safely conducting activities involved in the processes that use regulated chemicals.  Each of these SOPs includes steps to complete the operating phases, operating limits, and safety and health considerations.\r\n\r\nAll RMP operation procedures are reviewed, modified as necessary, and reissued annually.\r\n\r\n   Training:\r\n\r\nAll employees, including maintenance and contract employees involved with the covered process, are trained on the specific safety and health hazards of the process.  They are also trained on emergency operations including shutdown, and other applicable safe work practices.\r\n\r\n   Mechanical Integrity:\r\n\r\nThe Mechanical Integrity Program at the Kingman facility is structured to assure that equipment involved in the use, storage, manufacturing, handling, or onsite movement of regulated chemicals is designed, fabricated, installed, and maintained to minimize the risk of releases of these chemicals.\r\n\r\n   Management of Change\r\n\r\nThe Management of Change process at the Kingman facility is the process by which any permanent or temporary modifications to process chemicals, technology, equipment, or facilities are managed.  The process is used to sustain or enhance the level of process safety within the Kingman facility.\r\n\r\nThe Management of Change procedure applies to all Honeywell employees and contractors at the Kingman facility that are"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 49750,
      "SummaryText": "n the car, high EO concentration above the car (see No. 4) or by manual activation.\r\n\r\nWater from the rail car deluge system falls into a collection pan.  The collection pan drains underground to a below ground lined collection basin.\r\n\r\n4)\tWhen the EO car is positioned under the water deluge system, there is an EO detection point immediately above the dome of the car.  There is also a detection point next to the EO transfer pump.  These detectors are set to activate a local alarm at 15 ppm EO.  The facility¿s off site security company receives an alarm at 30 ppm EO so that it can notify plant personnel 24 hours a day.  The detector on top of the railcar is set to turn on the water deluge at .7% EO to suppress escaping vapor and prevent ignition.  Early awareness of small EO leaks helps the facility take the appropriate action to prevent a release that would impact off site population.\r\n\r\n5)\tThe hose used to transfer liquid EO from the EO railcar to the distribution system is a double walled hose.  If the inner hose fails, the EO is trapped inside the outer hose and does not escape.  The annular space between the hoses is checked for pressure each time the car is connected.  The annular space is checked for trace amounts of EO every 6 months.  If a leak in the inner hose is detected, the hose is replaced.  This procedure reduces the risk of a serious failure of the transfer hose resulting in a significant leak.\r\n\r\n6)\tThe liquid and vapor outlets of the EO railcar are connected through automatic valves during transfers to the blend tanks.  The automatic valves will close to isolate the contents of the railcar in the event of abnormal circumstances.  By closing the automatic valves on the EO car during abnormal conditions, the amount of EO that can potentially be released if a leak should occur is minimized.\r\n\r\n7)\tAll four-blend tanks are equipped with safety relief valves to release excess pressure in the tank prior to catastrophic failure of the vessel.  In addition"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 49750,
      "SummaryText": "involved in operating and/or maintaining any of the equipment covered by the Risk Management Program\r\n\r\n   Pre-Startup Review:\r\n   \r\nPre-start-up safety reviews are used to help ensure designs and procedures are complete and thorough prior to bringing on line a new unit or a significantly redesigned existing unit.  Reviews are done on all units covered by the Risk Management Program.\r\n   \r\n   Compliance Audits:\r\n   \r\nCompliance audits are performed by Kingman facility personnel or outside corporate auditors as required.\r\n\r\n   Incident Investigation:\r\n   \r\nProper incident investigation is necessary to continuously improve the safety in the Kingman facility.  By identifying contributing factors that create variations (incidents) and defining corrective actions, prevention efforts can be properly focused.\r\n\r\nAll incidents that cause or have the potential to cause injury to personnel or significant damage to equipment, the environment, or the public are investigated.\r\n   \r\n   Employee Participation:\r\n\r\nThe Kingman facility¿s management consults with employees on the development and implementation of the elements of RMP.  Management also consults with plant employees during the conduct of process hazards analysis.  The plant provides to employees access to process hazard analysis and other information required to be developed under this standard.\r\n\r\n   Hot Work Permits:\r\n\r\nThe Kingman facility has a comprehensive procedure outlining requirements for completing any activity involving hot work.  The procedure requires that the activity be reviewed and the hazards identified and communicated to all personnel whose activities could affect the safety of the individuals performing the hot work or of the process in general.\r\n\r\n   Contractors:\r\n   \r\nThe Kingman facility has a program to insure that contractors who work in the Kingman facility do so without compromising their safety or the safety of others in the plant.  This program covers all contractors working in or adjacent"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 49750,
      "SummaryText": "to a covered process.\r\n\r\nSafety performance shall be considered during the contractor selection process.  \r\nIn addition, contractors shall maintain, for Honeywell¿s review, records documenting that the contractor employees are properly trained.  Contractors shall also maintain for Honeywell¿s review all records of safety meetings and safety-related incidents requiring disciplinary action.\r\n\r\nChemical specific accident prevention programs:\r\n\r\nThe facilities, equipment, and the chemical covered by the EPA Risk Management Program at the Kingman facility have been reviewed several times by multiple teams comprising people from widely varying backgrounds.  Recommendations from these reviews have been studied and implemented as appropriate.  Safeguards include the following engineering controls:\r\n\r\n1)\tEO is shipped to the facility in two specially designed and constructed railcars.  These cars exceed DOT standards for the transport of EO and are only used to transport EO to the Kingman facility.  In order to minimize the amount of EO in the facility, only one car is present at the site at a time, and the cars hold a maximum of 75,000 pounds.  \r\n\r\n2)\tThe only storage of pure EO that occurs at the Kingman facility is in the railcar in which the EO was shipped to the facility.  The EO car is only connected to the facility¿s EO distribution system while a transfer to a blend tank is occurring.  At all other times, the car is disconnected and sealed.  By following this procedure, the facility minimizes the risk of contamination of the railcar and reduces the potential for leaks in the transfer piping.\r\n\r\n3)\tThe EO car is positioned under a water deluge system at all times while on the facility.  The deluge will protect the car in the event of a fire or, if the car should begin to leak, the deluge can be used to suppress the escaping vapor.  Should an exothermic reaction occur in the car, the deluge can be used to remove the heat of reaction.  The deluge is activated by fire o"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 49750,
      "SummaryText": ", each tank has remotely operated automatic valves on all bottom outlets from the tanks.  The valves can be used to isolate the tank contents from transfer piping from a remote location in the event a leak occurs.  Shutting these valves minimizes the amount of material that may leak out.\r\n\r\n8)\tIn conjunction with the EO detection system described in Item 4 above, an additional EO monitoring system covers the Kingman facility.  This system alarms when an EO concentration in excess of 1 ppm is detected at any one of 20 monitoring points.  3 of these monitoring points are located at the property fence line and will provide warning should a release in the facility have a potential off site impact.  \r\n\r\n4) The Five Year Accident History:\r\n The Kingman facility has never had a release of ethylene oxide that had a significant on site or offsite impact.\r\n\r\n5) The Emergency Response Plan: \r\n\r\nThe Kingman facility has a written facility specific Plant Emergency Response and Spill Plan.  It is the objective of the Plan to ¿provide sufficient information to formulate an initial response to a fire, explosion, or any unplanned release of hazardous material to the air, soil, or surface water at the facility.¿\r\n\r\nIn the event of a Plant Emergency, all personnel in the facility have been trained to gather at the assembly point.  The nature of the emergency will then be determined and, if the emergency can be handled with plant personnel and there is no potential for off site impact, mitigation of the emergency will begin immediately.\r\n\r\nIf the emergency includes a fire or has the potential for off site impact, the Hualapai Valley Fire Department and the Sheriff¿s department will be notified to coordinate fire fighting and evacuation of the surrounding population respectively.  In addition the Mohave County Local Emergency Planning Committee (LEPC) will be notified to assist as necessary.\r\n\r\nFirst aid and subsequent treatment of any injured plant personnel or surrounding population w"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 49750,
      "SummaryText": "ill be handled by Kingman Regional Medical Center.  KRMC has a fact book on the Kingman facility¿s Chemicals, including Material Safety Data Sheets and treatment recommendations.\r\n\r\nAll plant personnel receive a minimum of 16 hours of emergency response training each year.  This training includes classroom training as well as hands on training of simulated emergencies.  The Hualapai Valley Fire Department has sent personnel to participate in the 16-hour emergency response session held each fall.\r\n\r\n6) Planned Changes to Improve Safety: \r\n\r\nThe Kingman facility has never had an RMP accident.  However, all incidents that cause or have the potential to cause injury to personnel or significant damage to equipment, the environment, or the public are investigated.  From those investigations several changes have been made to the equipment and procedures at the Kingman facility.\r\n\r\nIn addition, a Process Hazards Analysis has been completed for all processes that use regulated chemicals.  These analyses are used to review areas involved in the use, storage, manufacturing, handling, or onsite movement of regulated chemicals.  The analyses are reviewed and updated on a periodic basis.\r\n\r\nRecommendations for changes to improve process safety are gathered from the incident investigations and hazard reviews.  All outstanding recommendations have been carefully reviewed and appropriate measures have been implemented at the Kingman facility."
    }
  ]
}