{
  "FacilityID": 49814,
  "FacilityName": "W.A. Parish Electric Generating Station",
  "FacilityStr1": "2500 Y.U. Jones Road",
  "FacilityStr2": null,
  "FacilityCity": "Thompsons",
  "FacilityState": "TX",
  "FacilityZipCode": "77481",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48157",
  "LEPC": "Fort Bend LEPC",
  "FacilityLatDecDegs": "29.482500",
  "FacilityLongDecDegs": "-095.631111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "SE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "NRG Texas Power LLC",
  "Company2Name": null,
  "CompanyDUNS": 168456049,
  "Company2DUNS": 0,
  "OperatorName": "NRG Texas Power LLC",
  "OperatorStr1": "P.O. Box 4710",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77210",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Kush",
  "RMPTitle": "Lead Environmental Specialist",
  "FTE": 380,
  "OtherEPAFacilityID": "77481wprshyujon",
  "EPAFacilityID": "100000180895",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-00074",
  "SafetyInspectionDate": "2004-05-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-10-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-10-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-09-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-09-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 29.50472,
  "FRS_Long": -95.59917,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 72328,
      "AltID": "NH3 Storage and Handling",
      "FacilityID": 49814,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 74050,
          "ProcessID": 72328,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 95945,
          "ProcessID": 72328,
          "ChemicalID": 57,
          "Quantity": 2300000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 595945,
          "ProcessID": 72328,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 49814,
      "SummaryText": "The following provides a brief summary of the key components of the Risk Management Plan (RMP) Program for the aqueous ammonia storage and handlign system at W.A. Parish Electric Generating Station.\n\nGeneral Description of the Facility and Regulated Substance\n\nW.A. Parish Electric Generating Station is located in Thompsons, Texas.  The facility is a 3,800-MW electric generation facility consisting of eight steam electric generating units.  A Selective Catalytic Reduction (SCR) system is associated with the each of the four coal-fired units.  The SCRs employ aqueous ammonia injection technology to control emissions of oxides of nitrogen (NOx).  Aqueous ammonia is classified as a toxic chemical subject to the requirements of the RMP Program.  The aqueous ammonia used in these SCR systems is an approximately 30% solution of ammonia in water.\n\nThe ammonia storage and handling system at W.A. Parish is comprised of storage tanks, transfer pumps, and piping which terminate at the vaporizer for each unit where the aqueous ammonia is atomized and vaporized.  The four tanks each have a capacity of 80,000 gallons but are administratively limited to holding 76,000 gallons.  Each tank is equipped with a presure relief valve, a vacuum breaker valve with flame arrestor, and liquid level indicators.\n\nAll other regulated substances onsite are below applicable thresholds for RMP.\n\nFive-Year Accident History\n\nThere have been no accidental releases from the aqueous ammonia storage and handling.\n\nSummary of Prevention Program 2\n\nW.A. Parish is covered by an accidental release prevention program, which includes the following:\n-Periodic hazard review and updates\n-Periodic audits of the system and its operation\n-Emergency response plan coordinated with local resonding agencies\n\nThe aqueous ammonia storage and handling system prevention program includes the following components:\n-Comprehensive plan covering all components of the aqueous ammonia system with respect to operation, maintenance,"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 49814,
      "SummaryText": " inspection, and training\n-Internal compliance audits\n-Incident investigation\n\nSummary of the Emergency Response Program\n\nAn emergency response plan for the ammonia storage and handling system has been developed and incorporates elements of the facility's Integrated Contingency Plan (ICP).  W.A. Parish employees have been trained in this plan and would be the first responders in the event of an emergency.\n\nPlaned Changes to Improve Safety\n\nA hazard review of the aqueous ammonia storage and handling system at W.A. Parish was conducted as part of this RMP.  There are not any planned changes to the system at this time.\n\n\nThe following provides a brief summary of the key components of the Risk Management Plan (RMP) Program for the aqueous ammonia storage and handling system at W. A. Parish Electric Generating Station.\n\n\n\nGeneral Description of the Facility and Regulated Substance\n\n\n\nW. A. Parish Electric Generating Station is located in Thompsons, Texas.  The facility is a 3,800-MW electric generation facility consisting of eight steam electric generating units.  A Selective Catalytic Reduction (SCR) system is associated with each of the four coal-fired units.  The SCRs employ aqueous ammonia injection technology to control emissions of oxides of nitrogen (NOx).  Aqueous ammonia is classified as a toxic chemical subject to the requirements of the RMP Program.  The aqueous ammonia used in these SCR systems is an approximately 30% solution of ammonia in water.\n\n\n\nThe ammonia storage and handling system at W. A. Parish is comprised of storage tanks, transfer pumps, and piping which terminate at the vaporizer for each unit where the aqueous ammonia is atomized and vaporized.  The four tanks each have a capacity of 80,000 gallons but are administratively limited to holding 76,000 gallons.  Each tank is equipped with a pressure relief valve, a vacuum breaker valve with flame arrestor, and liquid level indicators.  \n\n\n\nAll other regulated substances onsite are below applicable"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 49814,
      "SummaryText": " thresholds for RMP.\n\n\n\n\n\nFive-Year Accident History\n\n\n\nThere have been no accidental releases from the aqueous ammonia storage and handling system since its inception.\n\n\n\n\n\nSummary of Prevention Program 2\n\n\n\nW. A. Parish is covered by an accidental release prevention program, which includes the following:\n\n* Periodic hazard review and updates\n\n* Periodic audits of the system and its operation\n\n* Emergency response plan coordinated with local responding agencies\n\n\n\nThe aqueous ammonia storage and handling system prevention program includes the following components:\n\n* Comprehensive plan covering all components of the aqueous ammonia system with respect to operation, maintenance, inspection, and training\n\n* Internal compliance audits\n\n* Incident investigation\n\n\n\nSummary of the Emergency Response Program\n\n\n\nAn emergency response plan for the ammonia storage and handling system has been developed and incorporates elements of the facility's Integrated Contingency Plan (ICP).  W. A. Parish employees have been trained in this plan and would be the first responders in the event of an emergency. \n\n\n\nPlanned Changes to Improve Safety\n\n\n\nA hazard review of the aqueous ammonia storage and handling system at W. A. Parish was conducted as part of this RMP.  There are not any planned changes to the system at this time.\n\n1\n\n\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}