{
  "FacilityID": 49912,
  "FacilityName": "RCWD Cole Creek Chlorine Facility",
  "FacilityStr1": "42533 Tenaja Road",
  "FacilityStr2": null,
  "FacilityCity": "Murrieta",
  "FacilityState": "CA",
  "FacilityZipCode": "92562",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06065",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.560556",
  "FacilityLongDecDegs": "-117.240000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.ranchowater.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Rancho California Water District (RCWD)",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Rancho California Water District",
  "OperatorStr1": "42135 Winchester Road",
  "OperatorStr2": null,
  "OperatorCity": "Temecula",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92590",
  "OperatorZipCodeExt": null,
  "RMPContact": "Craig Elitharp",
  "RMPTitle": "Director of Systems Operations",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000200285",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-10-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-10-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-10-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-03-13 00:00:00",
  "DeRegistrationEffectiveDate": "2012-03-09 00:00:00",
  "AnniversaryDate": "2012-10-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 72500,
      "AltID": "Chlorination",
      "FacilityID": 49912,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 74224,
          "ProcessID": 72500,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 96161,
          "ProcessID": 72500,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 596161,
          "ProcessID": 72500,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 49912,
      "SummaryText": "Facility Description\n\nThe Rancho California Water District (RCWD) Cole Creek Chlorine Facility is located in Murrieta in Riverside County, California. The facility is for chlorine use for disinfection of the reclaimed water from Cole Creek Reservoir Tank and Joaquin Ranch Offsite Storage Pond.  The Cole Creek Chlorine Facility is situated in the middle of a site that includes the Cole Creek Reservoir Tank, Joaquin Ranch Offsite Storage Pond, Cole Creek Pump Station and Cole Creek No. 2 Pump Station.  \n\nThe chlorine is housed outside under a roof and is surrounded by a chain link fence that extends up to the roof.  There are brown slats inserted in the fence to limit visibility into the Cole Creek Chlorine Facility.  A windsock is mounted on the roof.\n\nThe chlorine system includes two (2) @ 1-ton chlorine cylinders stored in ChlorTainer? vessels.  During normal operations, chlorine is withdrawn from the cylinders and the gaseous chlorine is fed by chlorinators to injectors which mix chlorine with water to form a chlorine solution.  An automatic switchover device provides the ability for continuous chlorine feeding when one cylinder is empty.  \n\nThe two chlorinators route the chlorine to the Cole Creek Pump Station and the Cole Creek No. 2 Pump Station.  At the pump stations, the injector systems are installed to mix the gaseous chlorine with feed water and inject the chlorine solution into the pump station discharge pipelines.  Each injector systems include an ejector, multistage centrifugal pump, pressure gage and appropriate valves.\n\nThe ChlorTainer? vessels are able to contain releases of chlorine to minimize the worst case release scenario during normal operations.\n\nChemicals Subject To USEPA Risk Management Plan (RMP), California Accidental Release Prevention Program (CalARP) and OSHA Process Safety Management (PSM)\n\nRCWD uses chlorine at the Cole Creek Chlorine Facility in quantities large enough to trigger the USEPA RMP and CalARP.  The USEPA RMP threshold qua"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 49912,
      "SummaryText": "ntity for chlorine is 2,500 pounds.  The CalARP threshold quantity for chlorine is 100 pounds.  The maximum quantity present is 4,000 pounds of chlorine.  The 1-ton chlorine cylinders are transported to the facility by truck.  \nThe RCWD Cole Creek Chlorine Facility is also subject to OSHA PSM regulations for all equipment and operations associated with chlorine storage and disinfection systems.  The threshold quantity under PSM for chlorine is 1,500 pounds.\n\nAccidental Releases During Past Five Years\n\nThe RCWD Cole Creek Chlorine Facility has not had any releases of chlorine during the past five years that resulted in any injuries, off-site evacuations, or property damage.\n\nRCWD?s RMP programs include the following to minimize the potential for an accidental release:\n\n? Review of the design of all equipment and controls for the chlorine storage and disinfection systems, and dechlorination systems, to ensure they are properly designed and installed.\n? Updating of standard operating procedures to include specific information on safety procedures. All procedures are reviewed and certified annually.\n? Initial safety training and 3-year refresher training is provided for all operators and maintenance staff.\n? Procedures to select only contractors with good health and safety programs for working with chlorine.\n? Regular inspection of all equipment, monitoring systems and controls, including documentation of all inspections.\n? Prompt corrective action for any non-conforming items identified by the regular inspections.\n? Safety reviews conducted prior to system startup, if any equipment or operations are modified.\n? Investigation of any incidents that have the potential to have caused chlorine releases.\n? Periodic evaluation of the safety records of all outside contractors who work on the RMP-regulated systems.\n? Development of an effective emergency response program.\n? Implementation of an employee participation program to ensure that all plant-wide staff are aware of the "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 49912,
      "SummaryText": "PSM/RMP program, and are actively consulted regarding safety issues.\n? Independent audits of the entire PSM/RMP program every three years.\n\nEmergency Response Procedures\n\nEmergency procedures are described in RCWD?s Emergency Response Plan. In the unlikely event of an accidental release of chlorine, the key elements of RCWD?s emergency response program are as follows:\n\n? All operations staff is trained in the specific elements of the program.\n? A team of supervisors and operators are trained, certified and equipped for hazardous materials (HAZMAT) emergency operations to repair accidental releases.\n? The Cole Creek Chlorine Facility uses visual indicators at the leak detector panel and an alarm on SCADA to alert the staff of a chlorine leak.\n? In the event of a large release, RCWD personnel would immediately make mandatory notifications which include 911, Riverside County Fire Station #34 (HAZMAT), State of California Office of Emergency Services and RCWD emergency response personnel.\n\nRCWD?s Recent Steps to Improve Safety\n\nRCWD has completed the following actions to either reduce the likelihood or severity of potential chemical releases:\n? Installed TGO Technologies Inc. ChlorTainer? Total Containment Vessels to store the 1-ton chlorine cylinders and contain chlorine releases.\n? Installed leak detectors downwind of the ChlorTainer? Total Containment Vessels which are connected to SCADA.\n? Installed an alarm on the fence of the Cole Creek Chlorine Facility that is connected to SCADA and will inform RCWD of entry into the chlorine area.\n\nRCWD?s Proposed Steps to Improve Safety\n\nBased on the 2007 PHA safety reviews that were conducted as part of the RMP implementation, RCWD is considering the following actions to either reduce the likelihood or severity of potential chemical releases:\n\n? Provide a safety review meeting for all RCWD chlorine personnel to reinforce that when field personnel see or hear a chlorine alarm, they should evacuate the site and call 911, etc. a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 49912,
      "SummaryText": "s indicated in the RCWD Emergency Response Plan.  They should not investigate the chlorine alarm.\n? Train operators to complete a Management of Change (RMP Section 11) review for any temporary or permanent change, other than replacement in kind, affecting Cal/OSHA PSM, CalARP, and/or USEPA RMP-regulated processes, which presently include the chlorine storage areas and chlorination/dechlorination processes.  The Standard Operating Procedures (SOPs), also known as the ?Chlorine Handling? guides, must also be updated and recertified following any process changes in accordance with the Management of Change procedure.  The Management of Change requirements have been incorporated as Item 7 in the ?Chlorine Handling? guide.\n? Update the mandatory notifications in the RCWD Emergency Response Plan to include the State of California Emergency Services (within 15 minutes) and prepare a phone tree for required notifications within RCWD.  Inform RCWD personnel of the revision to the mandatory notifications."
    }
  ]
}