{
  "FacilityID": 49991,
  "FacilityName": "Boron Products, LLC a Ceradyne Company",
  "FacilityStr1": "798 Hwy 69A",
  "FacilityStr2": null,
  "FacilityCity": "Quapaw",
  "FacilityState": "OK",
  "FacilityZipCode": "74363",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40115",
  "LEPC": "Ottawa LEPC",
  "FacilityLatDecDegs": "36.976667",
  "FacilityLongDecDegs": "-094.546111",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ceradyneboron.com",
  "FacilityEmailAddress": "jwaugh@ceradyneboron.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Ceradyne, Incorporated",
  "Company2Name": null,
  "CompanyDUNS": 50791177,
  "Company2DUNS": 0,
  "OperatorName": "James Waugh",
  "OperatorStr1": "798 Hwy 69A",
  "OperatorStr2": null,
  "OperatorCity": "Quapaw",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74363",
  "OperatorZipCodeExt": null,
  "FTE": 90,
  "OtherEPAFacilityID": "OKD980623037",
  "EPAFacilityID": "100000095871",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-06-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-10-26 00:00:00",
  "ErrorReportDate": "2007-10-26 00:00:00",
  "ReceiptDate": "2007-10-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-10-25 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-10-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 36.97399,
  "FRS_Long": -94.7672,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 72598,
      "AltID": "Boron Trifluoride",
      "FacilityID": 49991,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 96290,
          "ProcessID": 72598,
          "ChemicalID": 52,
          "Quantity": 21000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 74325,
          "ProcessID": 72598,
          "NAICSCode": "325188",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 42579,
              "Process_NAICS_ID": 74325,
              "SafetyReviewDate": "2007-03-01 00:00:00",
              "PHA_Date": "2007-03-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2007-04-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2005-04-28 00:00:00",
              "TrainingReviewDate": "2007-03-15 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-12-01 00:00:00",
              "EquipmentInspectionDate": "2006-08-01 00:00:00",
              "EquipmentTested": "Enrichment column",
              "ChangeMgmtDate": "2005-06-01 00:00:00",
              "ChangeMgmtReviewDate": "2007-01-02 00:00:00",
              "PreStartupReviewDate": "2006-10-05 00:00:00",
              "ComplianceAuditDate": "2005-06-12 00:00:00",
              "AuditCompletionDate": "2007-06-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-03-01 00:00:00",
              "HotWorkPermitReviewDate": "2007-03-01 00:00:00",
              "ContractorSafetyReviewDate": "2007-03-01 00:00:00",
              "ContractorSafetyEvalDate": "2007-03-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Enrichment of Boron10 & 11",
              "_chemicals": [
                {
                  "PrimaryKey": 62044,
                  "PreventionProgram3ID": 42579,
                  "ProcessChemicalID": 96290
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 49991,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2007-03-01 00:00:00",
    "ERTrainingDate": "2007-03-01 00:00:00",
    "CoordinatingAgencyName": "Quapaw Fire Department",
    "CoordinatingAgencyPhone": "9186742710",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 49991,
      "SummaryText": "Executive Summary\n\n    CERADYNE, INCORPORATED BORON PRODUCTS, LLC\n\n    ACCIDENTAL RELEASE PREVENTION and EMERGENCY RESPONSE     POLICIES \n\n    BORON TRIFLOURIDE\n\n    REGULATED SUBSTANCE\n\n     Boron Products utilizes boron trifluoride in the production of enriched boron products.   Boron trifluoride is delivered to the site in tube trailers that consist of six tubes.  Upon delivery, each tube    contains 3500 pounds of BF3 gas at a pressure of 1800 psig.  From these tubes, The BF3 gas is directly piped into the production area.  Only one tube is opened or used at a time.\n\n    WORST CASE\n\n    US EPA's Offsite Consequence Analysis (OCA) Guidance specifies that the worst case scenario for non-refrigerated toxic gases liquefied under pressure shall be considered the failure of the largest vessel in the process that could participate in a single incident leading to a release.  For this event, the Area of Concern (OCA), within which individuals outside the plant property are considered \"affected public receptors,\" is defined as the circular area with a radius extending from the release point at which the predicted atmospheric concentration of BF3 reaches a regulatory endpoint value \nof 28 mg/m3.  In 2005 Honeywell the BF3 supplier for Boron Products, specified 2.8 mg/m3, or 1ppm, a new ceiling for BF3 exposure.  \n\n    Based upon tube design and general guidance provided by industry sources, Boron Products assumes that no more than one tube could realistically be involved in any plausible accident scenario.  OCA Guidance specifies that the worst-case release rate be calculated assuming that the entire vessel contents are lost within ten minutes.  On this basis, the maximum rate of BF3 release is 350 pounds per minute.  \n\n    Previous dispersion calculations utilized EPA Guidance Reference Tables to calculate toxic release endpoints.  Based on the tables, an endpoint distance of 3.92 miles at a release rate of 316.7 pounds per minute was found for a regulatory endpoint concentration of 28 mg/m3.  This calcu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 49991,
      "SummaryText": "lation was performed in 1999.  Since then, the regulatory endpoint value has changed to 2.8    mg/m3 and due to the change in tube size the new worst case release rate is 350 pounds per minute.  The Gaussian Dispersion Model was used to calculate endpoint distance for the new conditions.  Using the stability classes and dispersion parameters developed by Pasquill and \nGifford, an endpoint distance of 5.23 miles was calculated for a concentration of 2.8 mg/m3.  Since, the AOC extends beyond the facility property, offsite consequences were predicted.  \n    \n    RMP rules require consideration of at least one or more less severe but more likely alternative releases.  When modeling the consequences of such releases, less conservative assumptions are allowed than for the worst-case analysis.  The effect of active mitigation systems can also be considered.  One condition of RMP rules is that for the alternative scenario to be valid, it must result in off-site consequences.  Two scenarios were considered: a leak from a tube during the final stages of use and a leak sized to be the smallest possible with off-site consequences.  \n\n    TUBE LEAK SCENARIO 1\n\n    BF3 is assumed to be leaking from a tube on a parked trailer at 7.5 pounds per minute.  After ten minutes, the leak has stopped, resulting to a total release of 75 pounds.  This amount corresponds the amount of BF3 present when a tube is near-empty.  Using the Gaussian Dispersion Model for less conservative atmospheric conditions from the OCA Guidance, the endpoint distance is found to be 0.412 miles, or 2175 feet.  A concentration profile was generated plotting endpoint concentration against distance and is shown in Figure 1.\n\nFigure 1.  BF3 Concentration vs. Distance\n\n\n    \n    TUBE LEAK SCENARIO 2\n\n    Under this scenario, the Gaussian Dispersion Model is applied in order to determine the maximum ten minute release rate in which an endpoint value of 2.8 mg/m3 would be reached     inside facility boundaries.  Setting the endpoint distance at t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 49991,
      "SummaryText": "he nearest property line distance of 885 feet yields a maximum release rate of 1.64 pounds per minute.  Setting the endpoint distance at the nearest residence distance of 1320 feet yields a maximum release rate of 3.28 pounds per     minute. A graph was generated plotting release rate against distance and is shown in Figure 2.\n\nFigure 2.  BF3 Release Rate vs. Distance\n\n\n    RMP rules require identification of the type of public receptors (schools, parks, offsite     commercial developments, etc.) and estimation of affected populations residing within the AOC based upon census data or other means.  Using data from the 2000 Census, 5586 people reside in the AOC area of 85.88 square miles (?*5.232).\n\n    In the alternative scenario, it is estimated that no more than four residents are located inside the AOC.  The 0.412 mile endpoint for the alternative scenario does not reach any nearby towns or cities.  \n\n    RMP rules also require the identification of environmental receptors (national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preserves, or refuges).  Review of the site map reveals that there are no such environmental receptors in the AOC under any release scenario considered.\n\n\n\n\n    \n    \n    RELEASE PROTECTION\n\n    The boron trifluoride process area has been regulated by OSHA's Process Management (PSM) since 1994.  The facility has successfully implemented all fourteen elements of the PSM program for the covered process. \n    The facility has developed written operating and safety procedures for every facet of the covered    process from delivery of the boron trifluoride tube trailer through the production of boron isotopes.  \n    Employees working in the covered process are retrained every three years in the operating procedures as required by the PSM standard.\n    The covered process is routinely reviewed by the operating staff.  A process hazard analysis must be performed every five years and in the event of a specific process modification in order to identif"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 49991,
      "SummaryText": "y process concerns and develop solutions for them.  In addition, all fourteen elements of the PSM program are reviewed every three years to ensure the program is in compliance with all OSHA PSM requirements.\n    In the covered process, the Boron Department has eight operators that are trained under the Hazardous Waste Operations and Emergency Response (HAZWOPER) 40-hour operations level.\n    This program requires that operators be trained in the hazardous chemical awareness and emergency response procedures. These individuals are trained to respond to hazardous chemical releases and to implement proper responses to minimize any effects on human health and the environment.  All HAZWOPER operators receive an annual eight-hour refresher course to maintain their certification.\n\n    Practices at the Boron facility to prevent chemical releases include a preventative maintenance    program over covered process equipment and hourly process inspections to insure there are no equipment leaks and equipment is functioning properly.  In addition, the covered process is     monitored through process sensors and alarms on a continuous basis to alert operators of any process disruptions so that they can immediately be abated.  These same sensors can also automatically shut the operation down as well with minimal impact on the environment.\n\n    FIVE YEAR ACCIDENT HISTORY\n\n    There have been no accidents at this facility in the past five years involving boron     trifluoride.\n\n\n    THE EMERGENCY RESPONSE PROGRAM\n\n    Boron Products implements a 24-hour walk-about procedure in which every hour, employees check the process for leaks and other problems.  If a problem is found, employees will notify proper personnel and take necessary precautionary measures.  If warranted, Boron Products will notify the local fire department and request assistance.  \n    In the worst case scenario involving a BF3 release from a tube trailer, the Boron Products has trained personnel in the prevention and mitigation of a boron trifluorid"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 49991,
      "SummaryText": "e leak. Operators have been trained by the supplier specifically on how to address leaks from the tube trailer. Trained personnel have the necessary personal protective equipment and replacement parts necessary to address any process leaks described in the alternative release scenario.  \n    In the event of a release that may potentially affect offsite areas, Boron Products personnel will notify the proper local authorities as outlined in our Emergency Response Plan to inform them of the situation and advise accordingly.  Boron Products officials have met with local officials and outlined a course of action for informing the public.\n    The boron trifluoride tube trailer is designed to meet Department of Transportation standards for toxic gases.  The tube trailer is maintained by the supplier, Honeywell, and is recertified and hydrostatic tested every five years in addition to routine inspection before and after it leaves the    Honeywell facility.\n\n    PLANNED CHANGES TO IMPROVE SAFETY\n    No process modifications involving production have occurred in this area.  The installation of active mitigation systems such as, a sprinkler system, have been discussed.  Minor modifications and written procedural changes have occurred as a result of the Process Safety Management program.\n\n        Risk Management Plan - 2007\n\n1\nExecutive Summary\n\n\n\n    CERADYNE, INCORPORATED BORON PRODUCTS, LLC\n\n\n\n    ACCIDENTAL RELEASE PREVENTION and EMERGENCY RESPONSE     POLICIES \n\n\n\n    BORON TRIFLOURIDE\n\n\n\n    REGULATED SUBSTANCE\n\n\n\n     Boron Products utilizes boron trifluoride in the production of enriched boron products.   Boron trifluoride is delivered to the site in tube trailers that consist of six tubes.  Upon delivery, each tube    contains 3500 pounds of BF3 gas at a pressure of 1800 psig.  From these tubes, The BF3 gas is directly piped into the production area.  Only one tube is opened or used at a time.\n\n\n\n    WORST CASE\n\n\n\n    US EPA's Offsite Consequence Analysis (OCA) Guidance specifies that the worst case scenario for non"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 49991,
      "SummaryText": "-refrigerated toxic gases liquefied under pressure shall be considered the failure of the largest vessel in the process that could participate in a single incident leading to a release.  For this event, the Area of Concern (OCA), within which individuals outside the plant property are considered \"affected public receptors,\" is defined as the circular area with a radius extending from the release point at which the predicted atmospheric concentration of BF3 reaches a regulatory endpoint value \n\nof 28 mg/m3.  In 2005 Honeywell the BF3 supplier for Boron Products, specified 2.8 mg/m3, or 1ppm, a new ceiling for BF3 exposure.  \n\n\n\n    Based upon tube design and general guidance provided by industry sources, Boron Products assumes that no more than one tube could realistically be involved in any plausible accident scenario.  OCA Guidance specifies that the worst-case release rate be calculated assuming that the entire vessel contents are lost within ten minutes.  On this basis, the maximum rate of BF3 release is 350 pounds per minute.  \n\n\n\n    Previous dispersion calculations utilized EPA Guidance Reference Tables to calculate toxic release endpoints.  Based on the tables, an endpoint distance of 3.92 miles at a release rate of 316.7 pounds per minute was found for a regulatory endpoint concentration of 28 mg/m3.  This calculation was performed in 1999.  Since then, the regulatory endpoint value has changed to 2.8    mg/m3 and due to the change in tube size the new worst case release rate is 350 pounds per minute.  The Gaussian Dispersion Model was used to calculate endpoint distance for the new conditions.  Using the stability classes and dispersion parameters developed by Pasquill and \n\nGifford, an endpoint distance of 5.23 miles was calculated for a concentration of 2.8 mg/m3.  Since, the AOC extends beyond the facility property, offsite consequences were predicted.  \n\n    \n\n    RMP rules require consideration of at least one or more less severe but more likely alternative releases."
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 49991,
      "SummaryText": "  When modeling the consequences of such releases, less conservative assumptions are allowed than for the worst-case analysis.  The effect of active mitigation systems can also be considered.  One condition of RMP rules is that for the alternative scenario to be valid, it must result in off-site consequences.  Two scenarios were considered: a leak from a tube during the final stages of use and a leak sized to be the smallest possible with off-site consequences.  \n\n\n\n    TUBE LEAK SCENARIO 1\n\n\n\n    BF3 is assumed to be leaking from a tube on a parked trailer at 7.5 pounds per minute.  After ten minutes, the leak has stopped, resulting to a total release of 75 pounds.  This amount corresponds the amount of BF3 present when a tube is near-empty.  Using the Gaussian Dispersion Model for less conservative atmospheric conditions from the OCA Guidance, the endpoint distance is found to be 0.412 miles, or 2175 feet.  A concentration profile was generated plotting endpoint concentration against distance and is shown in Figure 1.\n\n\n\nFigure 1.  BF3 Concentration vs. Distance\n\n\n\n\n\n    \n\n    TUBE LEAK SCENARIO 2\n\n\n\n    Under this scenario, the Gaussian Dispersion Model is applied in order to determine the maximum ten minute release rate in which an endpoint value of 2.8 mg/m3 would be reached     inside facility boundaries.  Setting the endpoint distance at the nearest property line distance of 885 feet yields a maximum release rate of 1.64 pounds per minute.  Setting the endpoint distance at the nearest residence distance of 1320 feet yields a maximum release rate of 3.28 pounds per     minute. A graph was generated plotting release rate against distance and is shown in Figure 2.\n\n\n\nFigure 2.  BF3 Release Rate vs. Distance\n\n\n\n\n\n    RMP rules require identification of the type of public receptors (schools, parks, offsite     commercial developments, etc.) and estimation of affected populations residing within the AOC based upon census data or other means.  Using data from the 2000 Census, 5586 people resi"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 49991,
      "SummaryText": "de in the AOC area of 85.88 square miles (?*5.232).\n\n\n\n    In the alternative scenario, it is estimated that no more than four residents are located inside the AOC.  The 0.412 mile endpoint for the alternative scenario does not reach any nearby towns or cities.  \n\n\n\n    RMP rules also require the identification of environmental receptors (national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preserves, or refuges).  Review of the site map reveals that there are no such environmental receptors in the AOC under any release scenario considered.\n\n\n\n\n\n\n\n\n\n    \n\n    \n\n    RELEASE PROTECTION\n\n\n\n    The boron trifluoride process area has been regulated by OSHA's Process Management (PSM) since 1994.  The facility has successfully implemented all fourteen elements of the PSM program for the covered process. \n\n    The facility has developed written operating and safety procedures for every facet of the covered    process from delivery of the boron trifluoride tube trailer through the production of boron isotopes.  \n\n    Employees working in the covered process are retrained every three years in the operating procedures as required by the PSM standard.\n\n    The covered process is routinely reviewed by the operating staff.  A process hazard analysis must be performed every five years and in the event of a specific process modification in order to identify process concerns and develop solutions for them.  In addition, all fourteen elements of the PSM program are reviewed every three years to ensure the program is in compliance with all OSHA PSM requirements.\n\n    In the covered process, the Boron Department has eight operators that are trained under the Hazardous Waste Operations and Emergency Response (HAZWOPER) 40-hour operations level.\n\n    This program requires that operators be trained in the hazardous chemical awareness and emergency response procedures. These individuals are trained to respond to hazardous chemical releases and to implement proper responses to minimize a"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 49991,
      "SummaryText": "ny effects on human health and the environment.  All HAZWOPER operators receive an annual eight-hour refresher course to maintain their certification.\n\n\n\n    Practices at the Boron facility to prevent chemical releases include a preventative maintenance    program over covered process equipment and hourly process inspections to insure there are no equipment leaks and equipment is functioning properly.  In addition, the covered process is     monitored through process sensors and alarms on a continuous basis to alert operators of any process disruptions so that they can immediately be abated.  These same sensors can also automatically shut the operation down as well with minimal impact on the environment.\n\n\n\n    FIVE YEAR ACCIDENT HISTORY\n\n\n\n    There have been no accidents at this facility in the past five years involving boron     trifluoride.\n\n\n\n\n\n    THE EMERGENCY RESPONSE PROGRAM\n\n\n\n    Boron Products implements a 24-hour walk-about procedure in which every hour, employees check the process for leaks and other problems.  If a problem is found, employees will notify proper personnel and take necessary precautionary measures.  If warranted, Boron Products will notify the local fire department and request assistance.  \n\n    In the worst case scenario involving a BF3 release from a tube trailer, the Boron Products has trained personnel in the prevention and mitigation of a boron trifluoride leak. Operators have been trained by the supplier specifically on how to address leaks from the tube trailer. Trained personnel have the necessary personal protective equipment and replacement parts necessary to address any process leaks described in the alternative release scenario.  \n\n    In the event of a release that may potentially affect offsite areas, Boron Products personnel will notify the proper local authorities as outlined in our Emergency Response Plan to inform them of the situation and advise accordingly.  Boron Products officials have met with local officials and outlined a course of action fo"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 49991,
      "SummaryText": "r informing the public.\n\n    The boron trifluoride tube trailer is designed to meet Department of Transportation standards for toxic gases.  The tube trailer is maintained by the supplier, Honeywell, and is recertified and hydrostatic tested every five years in addition to routine inspection before and after it leaves the    Honeywell facility.\n\n\n\n    PLANNED CHANGES TO IMPROVE SAFETY\n\n    No process modifications involving production have occurred in this area.  The installation of active mitigation systems such as, a sprinkler system, have been discussed.  Minor modifications and written procedural changes have occurred as a result of the Process Safety Management program.\n\n\n\n        Risk Management Plan - 2007\n\n\n\n1\n\n\n\n"
    }
  ]
}