{
  "FacilityID": 50027,
  "FacilityName": "International Rectifier Epi Services",
  "FacilityStr1": "550 West Juanita Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Mesa",
  "FacilityState": "AZ",
  "FacilityZipCode": "85210",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.382950",
  "FacilityLongDecDegs": "-111.843636",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 868624057,
  "ParentCompanyName": "International Rectifier",
  "Company2Name": null,
  "CompanyDUNS": 41674912,
  "Company2DUNS": 41674912,
  "OperatorName": "International Rectifier",
  "OperatorStr1": "550 West Juanita Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Mesa",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85210",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike May",
  "RMPTitle": "Director of Epi Operations",
  "FTE": 104,
  "OtherEPAFacilityID": "85210NTRNT55WJU",
  "EPAFacilityID": "100000200524",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-09-22 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-05-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-11-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-10-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-10-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 72681,
      "AltID": "International Rectifier",
      "FacilityID": 50027,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 74411,
          "ProcessID": 72681,
          "NAICSCode": "334413",
          "_desc": {
            "NAICS_CODE": "334413",
            "NAICS_DESCRIPTION": "Semiconductor and Related Device Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 96411,
          "ProcessID": 72681,
          "ChemicalID": 54,
          "Quantity": 21000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 54,
            "ChemicalName": "Hydrogen chloride (anhydrous) [Hydrochloric acid]",
            "CASNumber": "7647-01-0",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 596411,
          "ProcessID": 72681,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50027,
      "SummaryText": "International Rectifier (IR) Epi Services owns and operates a semiconductor epitaxy (Epi) wafer facility (SIC code 3674) in Mesa, Arizona.  IR Epi Services is located at 550 West Juanita Avenue in Mesa, Maricopa County, Arizona.  The approximate location of IR Epi Services is 33?23'00\" North Latitude and 111?50'39\" West Longitude.\n\nIR Epi Services utilizes anhydrous hydrogen chloride (HCl) for the wafer etching steps and process cleaning steps performed at the facility.  HCl is a ?listed chemical? in the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) regulations under Title 29 of the Code of Federal Regulations (29 CFR) ?1910.119 (Process Safety Management of Highly Hazardous Chemicals), and a ?regulated substance? under the United States Environmental Protection Agency (U.S. EPA) Risk Management Program (RMP) regulations under 40 CFR Part 68 (Chemical Accident Prevention Provisions).   Since the manufacturing process at the IR Epi Services contains HCl in quantities greater than the PSM and RMP applicability threshold of 5,000 pounds, IR has developed and implemented RMP and PSM plans for the HCl storage and distribution systems at the Epi Services.  \n\nThe covered process for PSM/RMP includes HCl in tube trailer to the Epi process chambers. The required elements of both the PSM and RMP plans are contained in this document.  This executive summary is prepared in accordance with the requirements of 40 CFR ?68.155, as part of the RMP plan.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIR is committed to preventing accidental releases from Epi Services.  HCl storage and distribution at the IR Epi Services is covered by an accidental release (Program 3) Prevention Program developed and implemented by IR.  In addition, IR Epi Services has developed a site emergency response program, which includes, but is not limited to, procedures for response to an accidental release, procedures for informing public and local emer"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50027,
      "SummaryText": "gency response agencies, and employee training on emergency procedures.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nIR Epi Services utilizes anhydrous hydrogen chloride (HCl) for the wafer etching steps and process cleaning steps at the facility.  HCl is a regulated substance under 40 CFR Part 68, and a listed substance under 29 CFR ?1910.119.  The processes at the IR Epi Services contain anhydrous HCl in quantities greater than the RMP and PSM program applicability threshold of 5,000 pounds.  \n\nHCl is supplied to IR Epi Services by a Bulk Specialty Gas Supply (BSGS) system owned and operated by Air Products and Chemicals Incorporated (APCI).  The BSGS system is located on-site at the northwest corner of the IR Epi Services site.  HCl is delivered from the APCI BSGS system to the IR Epi Services HCl distribution system through a single feed line to the production building.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nIn accordance with the requirements of the RMP regulations, IR Epi Services has implemented a Program 3 Prevention Program for HCl at facility.  This program contains a variety of measures to prevent accidental releases, including, but not limited to, the following:\n\n-  Periodic hazard reviews and updates\n-  Periodic audits of the system and its operation\n-  Emergency response plan that is coordinated with local emergency response agencies\n\nThe HCl system is designed, installed, and maintained in accordance with all applicable regulations.  IR Epi Services employees responsible for handling HCl are thoroughly trained on HCl safety procedures, and operation and maintenance procedures for HCl systems.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no accidental releases of HCl from the covered process at the IR Epi Services in the past five years that have resulted in death, injury, or property damage on site, or known offsite impacts (deaths, injuries, evacuations, sheltering-in-place, property damage, or "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50027,
      "SummaryText": "environmental damage).\n\nEMERGENCY RESPONSE PROGRAM\n\nAn emergency response program was developed by IR Epi Services in accordance with the requirements of the RMP regulations.  The key components of this program include:\n\n- Development of emergency response plan containing the following elements:\n- Procedures for informing public and local emergency response agencies\n- Proper first-aid and emergency medical treatment\n- Procedures for response after an accidental release\n- Procedures for emergency response equipment use, inspection, testing, and maintenance\n- Training for all employees\n- Procedures for emergency response plan review and updates\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nA process hazard analysis was completed for the facility in accordance with the RMP Program 3 Prevention Program requirements.  The process hazard analysis yielded the following action items:\n\n- Post the Piping and Instrumentation Diagrams (P&IDs) in cabinets and Valve Manifold Boxes (VMBs) \n- Evaluate need for continuous monitoring, detection/alarm system, or containment for outdoor HCl distribution lines\n\nAs required by RMP regulations, the process hazard analysis will be reviewed every five years to update HCl safety measures and implement improvements as needed to ensure the ongoing safe operation of the HCl systems at the facility.\n\nOFFSITE CONSEQUENCE ANALYSIS\n\nThe RMP program requires affected facilities to determine offsite impacts resulting from a prescribed worst-case scenario (WCS).  Per 40 CFR ?68.25, the WCS is defined as the release of the entire volume of HCl from the single largest HCl storage tank or cylinder, over a period of 10 minutes.  \n\nIn addition to the worst-case scenario, offsite impacts must also be determined for an alternative case scenario (ACS), which is defined as an incident that is more likely to occur than the worst-case scenario.  For IR Epi Services, the alternative release scenario is defined as the release of HCl from the distribution pipeline leaving th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50027,
      "SummaryText": "e HCl BSGS system, at an approximate distance of 50 feet downstream of the BSGS system connection.  \n\nThe following points summarize the approach used in the offsite consequence modeling analysis:\n\n- The distances to the toxic endpoints for the WCS and ACS were determined using the U.S. EPA approved Area Locations of Hazardous Atmospheres (ALOHA) air dispersion model. \n- Meteorological parameters for the analysis were obtained from 2006 National Weather Service data collected at the Phoenix Sky Harbor International Airport.\n- The offsite impacts were evaluated using LANDVIEW 6 software.\n\nThe following is a summary of the results obtained in the offsite consequence analysis:\n\nWorst Case Scenario\nDistance to Endpoint:  2.10 miles\nAffected Population:  77,582\n\nAlternate Case Scenario\nDistance to Endpoint:  0.43 miles\nAffected Population:  2,742"
    }
  ]
}