{
  "FacilityID": 50175,
  "FacilityName": "Foster Farms Demopolis Corn Dog Plant (2007)",
  "FacilityStr1": "232",
  "FacilityStr2": "North South Industrial Park",
  "FacilityCity": "Demopolis",
  "FacilityState": "AL",
  "FacilityZipCode": "36732",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01091",
  "LEPC": null,
  "FacilityLatDecDegs": "32.484028",
  "FacilityLongDecDegs": "-087.832028",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Foster Poultry Farms",
  "Company2Name": null,
  "CompanyDUNS": 9178856,
  "Company2DUNS": null,
  "OperatorName": "Foster Poultry Farms",
  "OperatorStr1": "232",
  "OperatorStr2": "North South Industrial Park",
  "OperatorCity": "Demopolis",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36732",
  "OperatorZipCodeExt": null,
  "FTE": 325,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000131635",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-05-15 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2007-11-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-11-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2007-11-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-11-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 32.484028,
  "FRS_Long": -87.832028,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 72892,
      "AltID": "Foster Farms Demopolis",
      "FacilityID": 50175,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 96685,
          "ProcessID": 72892,
          "ChemicalID": 56,
          "Quantity": 30000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 74626,
          "ProcessID": 72892,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 42782,
              "Process_NAICS_ID": 74626,
              "SafetyReviewDate": "2007-10-10 00:00:00",
              "PHA_Date": "2007-11-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-11-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Leak Detection, Alarms and Emergency Ventilation System",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Leak Detection, Alarms, and Emergency Ventilation System",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2007-07-15 00:00:00",
              "TrainingReviewDate": "2007-01-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-10-08 00:00:00",
              "EquipmentInspectionDate": "2007-11-21 00:00:00",
              "EquipmentTested": "Compressors",
              "ChangeMgmtDate": "2007-03-12 00:00:00",
              "ChangeMgmtReviewDate": "2007-01-02 00:00:00",
              "PreStartupReviewDate": "2007-03-12 00:00:00",
              "ComplianceAuditDate": "2007-05-15 00:00:00",
              "AuditCompletionDate": "2009-05-15 00:00:00",
              "IncidentInvestigationDate": "2007-06-19 00:00:00",
              "InvestigationChangeDate": "2007-06-19 00:00:00",
              "ParticipationPlansReviewDate": "2007-01-02 00:00:00",
              "HotWorkPermitReviewDate": "2007-01-02 00:00:00",
              "ContractorSafetyReviewDate": "2007-09-20 00:00:00",
              "ContractorSafetyEvalDate": "2007-01-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 62338,
                  "PreventionProgram3ID": 42782,
                  "ProcessChemicalID": 96685
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 50175,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2007-08-10 00:00:00",
    "ERTrainingDate": "2007-05-16 00:00:00",
    "CoordinatingAgencyName": "Demopolis Fire Department",
    "CoordinatingAgencyPhone": "3342890111",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50175,
      "SummaryText": "FOSTER FARMS\nDEMOPOLIS CORN DOG PLANT\nRISK MANAGEMENT PROGRAM AND\nPROCESS SAFETY MANAGEMENT PROGRAM\n\nAnhydrous Ammonia Refrigeration System\nRevised November 2007\n\nEXECUTIVE SUMMARY\n\nFoster Farms Demopolis revised this document, previously submitted in June 2004, due to the expansion of their ammonia refrigeration system and an updated process hazard analysis and regulatory requirements requiring re-submittal within six months of a change that resulted in a revised process hazard analysis.  \n\nFoster Farms Demopolis (referred to hereafter as ¿Foster Farms¿ or ¿Demopolis¿) prepared a Chemical Risk Management Program and Process Safety Management Program (RMP/PSM) in general accordance with Title 40 of the Code of Federal Regulations (CFR), Part 68.  The Environmental Protection Agency (EPA) promulgated the Risk Management Program (RMP) regulations as required in the 1990 Amendments to the Federal Clean Air Act.  The goal of the RMP is to prevent accidental releases of substances that can cause serious harm to the public and the environment from short-term exposures and to mitigate the severity of releases that do occur.  The RMP regulations apply to facilities that handle, manufacture, use, or store toxic and flammable substances listed in the regulations above specified threshold quantities. In addition to the RMP regulations, the Occupational Safety and Health Administration (OSHA) regulates facilities with certain acutely hazardous materials under Process Safety Management (PSM) regulations, as defined in CFR Title 29 Part 1910 Section 119, respectively. As the PSM regulations contain similar requirements to the RMP requirements, Demopolis¿ RMP/PSM was developed with consideration to both RMP and PSM regulations.\n\nFoster Farms prepared an RMP/PSM to satisfy regulatory requirements and to demonstrate a commitment to evaluate and improve anhydrous ammonia handling systems and practices at the facility. Foster Farms incorporated many state-of-the-art safety features in"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50175,
      "SummaryText": "to the ammonia refrigeration system at the facility as part of the original system construction and system modifications.  In the unlikely event that a chemical release does occur at the facility, Foster Farms personnel are trained in the appropriate response measures, relying on support services provided by the local fire department and hazardous materials response team.  Foster Farms will continue to improve ammonia-handling safety through the implementation of the prevention program elements of the RMP/PSM.\n\nThe Foster Farms facility is located in an industrial park approximately one and one-half miles south of Highway 80 in Demopolis, Alabama.  Highway 80 is on the southern edge of the developed area of Demopolis.  Foster Farms and only a few other facilities occupy the industrial park.  The area surrounding the industrial park is rural agricultural with scattered residential sites.  Several tree plantations are within site of the plant.  The facility is surrounded by chain-link fencing and has a secured entrance that is staffed by security personnel 24-hours-per-day, 365-days-per-year.\n\nThe Demopolis plant was constructed in approximately 1994.  Foster Farms purchased the facility approximately three years ago to expand the company¿s corn dog production capabilities. In late 1998, the facility was expanded to include a cook plant.  The corn dog plant receives ground meat products from Foster Farms and other meat processing facilities, produces and cooks franks, produces corn dogs, and packages corn dogs for distribution.  \n\nThe facility's ammonia refrigeration system, which is a closed system, contains approximately 17,000 pounds of anhydrous ammonia. The system provides cooling for production areas, product cooling, water chilling, product freezing, and cold storage.  The desired temperatures are maintained by controlling the flow of ammonia with manually and electrically operated valves, float switches, transfer pumps, and compressor controls.  \n\nThe RMP/PSM"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50175,
      "SummaryText": "regulations require a review of the five-year accident history at the regulated facility.  Foster Farms reported no reportable accidental releases of ammonia in the past five years.\n\nThe RMP regulations require a review of the accidental release prevention program and chemical specific prevention steps used by the facility.  Foster Farms has incorporated many safety features in the ammonia refrigeration system to prevent system failures and to mitigate potential releases.  The predominant safety concern with closed-loop ammonia systems is an inadvertent buildup of pressure exceeding pressure ratings or capacities of equipment due to ammonia expansion.  The Foster Farms ammonia system is continuously monitored by automated control systems that shut down components if deviations from normal operating conditions occur.  Further, all pressure vessels in the system are equipped with pressure relief valves.\n\nOther safety features at the facility include: \n¿emergency shutdown systems\n¿component specific safety shutdowns\n¿an ammonia leak detection system is installed in the engine rooms and cook plant\n¿pressure relief valves on all vessels, compressors, and several other areas in the system where trapped ammonia could build pressure\n¿ammonia pipes, valves and components are labeled\n¿pressure relief valves are replaced at least every five years\n¿a fire alarm and sprinkler system is installed in the plant\n¿engine room is ventilated\n¿operators receive ongoing training in operations, maintenance and emergency response\n¿alarm systems and engine room ventilation systems are connected to an emergency power generator\n\nIn addition to the physical features of the ammonia refrigeration system at the facility, Foster Farms has administrative controls to maintain safe operation of the system.  Administrative controls include, but are not limited to, formal training programs for system operators and mechanics, emergency training, a hot work permit program, a lock-out/tag-out program, a c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50175,
      "SummaryText": "ontractor safety program, an incident investigation program, a mechanical integrity program, a management of change program, a pre start-up safety review program, and a RMP auditing and inspection program.  Written standard operating procedures (SOPs) have been prepared for the ammonia system at the facility.  The SOPs provide a basis for site specific operator training and a ready reference for operating and trouble-shooting the systems.\n\nFoster Farms is committed to maintaining the mechanical integrity of the ammonia refrigeration system.  A preventive maintenance system is being developed to manage the maintenance of the refrigeration system.  Preventive maintenance at the facility will include shift, daily, weekly, and periodic inspection; calibration; testing; and overhaul of ammonia system equipment.  The system will be used to track equipment performance and to create reports that are used by maintenance personnel to monitor the frequency of repairs and deviations from normal operating parameters.\n\nChanges to improve safety at the facility are ongoing.  Some of the mitigation measures suggested by the process hazard analysis team have already been implemented.  Others will be implemented within the next two to three years.  The status of significant mitigation measures is as follows:\n¿Foster Farms developed a program to test all safety alarms and shutoffs at least annually\n¿line labeling and valve tagging is ongoing\n¿Foster Farms uses spring return valves for all oil draining\n¿Foster Farms revised the preventive maintenance program to verify that all new ammonia system components are included and maintenance frequencies are appropriate\n¿Foster Farms evaluated equipment protection issues at the plant and is correcting any problems identified\n¿equipment and critical valve access issues have evaluated and corrected\n\nFoster Farms is committed to respond to all suggested mitigation measures as promptly as possible and is establishing completion schedules for the p"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 50175,
      "SummaryText": "roposed actions.  Management responses and support will be consistent with Foster Farms' commitment to safe and environmentally responsible operations.\n\nFoster Farms recognizes that the RMP/PSM is a continuous process for evaluating, monitoring, and improving anhydrous ammonia handling operations at its facility. As such, this document and related attachments and program elements will evolve as Foster Farm continues their ongoing focus and dedication of risk minimization and safety improvement for their employees and the surrounding community. Foster Farms will submit revised information if a change occurs that is considered significant and requires resubmission under the regulations. However, minor improvements/modifications to the RMP/PSM, related attachments, and program elements will be incorporated consistent with Foster Farms¿ internal review practices, and Foster Farms will maintain the most current version on site. Thus, the most current RMP/PSM, related documents, and elements maintained on site may vary slightly from the information in submittals made to EPA and other regulatory agencies."
    }
  ]
}