{
  "FacilityID": 50173,
  "FacilityName": "Flint Hills Resources, LP - Bettendorf Terminal",
  "FacilityStr1": "4100 Elm Street",
  "FacilityStr2": null,
  "FacilityCity": "Bettendorf",
  "FacilityState": "IA",
  "FacilityZipCode": "52722",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19163",
  "LEPC": "Scott County LEPC",
  "FacilityLatDecDegs": "41.523916",
  "FacilityLongDecDegs": "-090.478610",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": "www.fhr.com",
  "FacilityEmailAddress": "diane.schmiddt@fhr.com",
  "FacilityDUNS": 152515383,
  "ParentCompanyName": "Koch Industries, Inc",
  "Company2Name": null,
  "CompanyDUNS": 6944334,
  "Company2DUNS": null,
  "OperatorName": "Flint Hills Resources, LP",
  "OperatorStr1": "PO Box 64569",
  "OperatorStr2": null,
  "OperatorCity": "St. Paul",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55164",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": "IAD000671495",
  "EPAFacilityID": "100000200702",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-04-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-07-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-11-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2007-11-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2012-04-06 00:00:00",
  "DeRegistrationEffectiveDate": "2012-04-02 00:00:00",
  "AnniversaryDate": "2012-11-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 41.523916,
  "FRS_Long": -90.47861,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "the facility does not use , store or produce a regulated substance above the TQ",
  "_processes": [
    {
      "ProcessID": 72890,
      "AltID": "Denaturant",
      "FacilityID": 50173,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 96683,
          "ProcessID": 72890,
          "ChemicalID": 155,
          "Quantity": 42000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 77879,
              "ProcessChemicalID": 96683,
              "ChemicalID": 115
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 74624,
          "ProcessID": 72890,
          "NAICSCode": "42471",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 26763,
              "Process_NAICS_ID": 74624,
              "SafetyReviewDate": "2007-04-09 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "American Petroleum Institute, NFPA, NEC",
              "FR_Comments": null,
              "HazardReviewDate": "2007-04-09 00:00:00",
              "ChangeCompletionDate": "2007-09-11 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Water cannons",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2007-09-11 00:00:00",
              "TrainingReviewDate": "2007-09-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-09-11 00:00:00",
              "EquipmentInspectionDate": "2007-09-18 00:00:00",
              "EquipmentTested": "Tank 1",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 27961,
                  "PreventionProgram2ID": 26763,
                  "ProcessChemicalID": 96683
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 50173,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2007-08-01 00:00:00",
    "ERTrainingDate": "2007-10-05 00:00:00",
    "CoordinatingAgencyName": "Scott County Emergency Mgmt Agency",
    "CoordinatingAgencyPhone": "5633268663",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50173,
      "SummaryText": "This Executive Summary briefly reviews the major elements of the Risk Management Program (RMP) for the Flint Hills Resources, LP (FHR) refined products terminal in Bettendorf, Iowa. This summary is presented in response to the requirements of the United States Environmental Protection Agency (USEPA) under 40 CFR Part 68 and Section 112(r) of the Clean Air Act. The Bettendorf terminal is subject to the RMP rule due to the planned storage of natural gasoline, a regulated flammable mixture, above the threshold quantities. This RMP submittal is for initial storage at the terminal of natural gasoline.   While the terminal has been operating as a fuels terminal, it is now being modified for storage of natural gasoline.  Natural gasoline is used by the ethanol industry as a denaturant.\n\n1. Accidental Release Prevention and Emergency Response Policies\nFHR is committed to protecting the environment and operating facilities in a manner that promotes the safety of employees and the general public. The management has adopted and implemented policies that adhere to all applicable Federal and State rules and regulations. Safety is the number one consideration in the handling of natural gasoline with the goal to prevent accidental releases through the proper design, installation, operation and maintenance of the equipment, and the training of personnel.\n \nIn the event that a release does occur, the facility¿s emergency response is contained in an Integrated Contingency Plan. The response plan includes procedures to coordinate response actions with local emergency responders such as the fire and law enforcement departments as well as any potentially affected neighbors.\n\n2. Facility Description and Regulated Substances Handled\nThe FHR Bettendorf facility will operate as a bulk natural gasoline and denatured ethanol distribution and storage terminal. The facility will serve the ethanol manufacturing industry through the storage and distribution of natural gasoline and denatured ethan"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50173,
      "SummaryText": "ol. Natural gasoline will be received at the facility via barge or pipeline, stored in product storage tanks and distributed to customers via bulk tanker trucks at the terminal¿s product loading racks. Denatured ethanol will be received at the terminal by transport truck, stored in product storage tanks and distributed to customers via barge or bulk tanker truck.\n\nNatural gasoline is the only RMP regulated substance that the facility will handle above the threshold quantity; it is considered to have a National Fire Protection Association flammability hazard rating of 4 (NFPA-4). Natural gasoline is a liquid at ambient conditions and has a flash point below 73 degrees Fahrenheit and a boiling point below 100 degrees Fahrenheit. Denatured ethanol is not a NFPA-4 flammable material and is not regulated by the RMP rule.\n\nThe facility is enclosed by a fence and access is restricted to authorized personnel only.\n\n3. Accidental Release Prevention Program and Chemical Specific Prevention Steps\nFHR has programs in place to address accidental release prevention measures required by EPA, OSHA, and all notification requirements of EPA's Emergency Response and Community Right-to-Know regulations.\n\nProcess Hazard Review and Process Safety Information\nThe Bettendorf facility utilizes the HAZOP technique of hazard review. The hazard review identified the following potential major hazards: fire, explosion, over-pressurization, over-filling and equipment failure. Floods were not evaluated as a hazard due the presence of the flood control levee and flood control devices utilized by the City of Bettendorf.  Corrosion was also not evaluated as a hazard during the HAZOP as the MSDS for natural gasoline does not indicate corrosive characteristics.  The facility utilizes process controls such as vents, relief valves, check valves, manual shutoffs, automatic shutoffs, interlocks, alarms and procedures, grounding equipment and excessive flow devices to prevent or limit releases. The facility"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50173,
      "SummaryText": "operates a sprinkler system, water cannons and dikes as fire and spill mitigation systems.\n\nFHR will maintain up-to-date safety information related to the storage and handling of natural gasoline. This information includes material safety data sheets, storage tank capacity information, safe operating parameters, equipment specifications and the codes and standards used to design, build, and operate the natural gasoline storage and handling processes at the terminal.\n\nOperating Procedures and Training\nFHR maintains written procedures that address all modes of process operations, including: unit startup, normal operations, temporary/maintenance operations, emergency shutdown and normal shutdown. These procedures can be used as a reference by operators and provide consistent training of new operators. The facility trains all employees involved in facility operations via procedure reviews and on-the-job training.\n\nManagement of Change\nThe facility¿s Management of Change (MOC) program reviews all proposed changes to process chemicals, technology, equipment, procedures, materials and design conditions prior to implementation of  any such change. Changes are reviewed to ensure that adequate controls are in place to manage any new hazards, and to verify that existing controls have not been compromised by a process change.\n\nMaintenance\nThe facility has well-established practices and procedures to maintain the storage tanks, truck loading rack, piping systems, relief systems, pumps, emergency shutdown systems and controls in a safe operating condition. This program includes written procedures, training and regular inspections and equipment testing. FHR conducts a pre-startup safety review for any new facility or facility modification that requires a change in the process safety information to ensure that safety features, procedures, personnel, and the equipment are appropriately prepared for startup prior to placing the equipment into service.\n\nCompliance Audits\nFHR has deve"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50173,
      "SummaryText": "loped an internal auditing program to ensure compliance with known regulations.  As part of these audits, the procedures and practices developed under the RMP standard are audited to ensure they are adequate and are being followed. The audits will include a review of documentation and process safety information, inspection of the physical facilities, and interviews with all levels of plant personnel.\n\nIncident Investigation\nFHR has procedures to promptly investigate any incident that has resulted in, or could reasonably result in, a release of a regulated substance. The procedure establishes the minimum guidelines and activities of the incident investigation program in order to reduce the likelihood of repetitive occurrences of events which could reasonably lead to catastrophic releases. Investigations will be undertaken to identify the situation leading to the incident as well as any corrective actions to prevent a similar release in the future. \n\n4. Accident History\nThe facility has not had any accidents reportable under RMP. This RMP submittal is for initial storage of  natural gasoline at the facility.\n\n5. Emergency Response Program\nFHR maintains a written emergency response program to protect worker and public safety as well as the environment. The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address all aspects of emergency response, including proper first-aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident cleanup and decontamination requirements. In addition, FHR has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment. Employees rec"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 50173,
      "SummaryText": "eive training in these procedures as necessary to perform their specific emergency response duties. Flint Hills Resources works with the local Fire Department and emergency responders to ensure the proper execution of our plan. The emergency response program is updated when necessary based on modifications made to facility processes.\n\n6. Planned Changes to Improve Safety\nSafety practices are continually reviewed. Equipment and maintenance programs are monitored on an ongoing basis. At the submission of this plan, no immediate changes are scheduled."
    }
  ]
}