{
  "FacilityID": 5019,
  "FacilityName": "Antioch Water Treatment Plant",
  "FacilityStr1": "401 Putnam Street",
  "FacilityStr2": "P.O. Box 5007",
  "FacilityCity": "Antioch",
  "FacilityState": "CA",
  "FacilityZipCode": "94531",
  "Facility4DigitZipExt": "5007",
  "FacilityCountyFIPS": "06013",
  "LEPC": null,
  "FacilityLatDecDegs": "37.993833",
  "FacilityLongDecDegs": "-121.807778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ci.antioch.ca.us",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Antioch",
  "OperatorStr1": "401 Putnam Street",
  "OperatorStr2": "P.O. Box 5007",
  "OperatorCity": "Antioch",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94531",
  "OperatorZipCodeExt": "5007",
  "RMPContact": "Jon M. Billeci",
  "RMPTitle": "Water Treatment Superintendent",
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000061728",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-13 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP Pro 98",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-11-25 00:00:00",
  "DeRegistrationEffectiveDate": "2020-10-20 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 37.99375,
  "FRS_Long": -121.81031,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5894,
      "AltID": "chlorine",
      "FacilityID": 5019,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 6039,
          "ProcessID": 5894,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6405,
          "ProcessID": 5894,
          "ChemicalID": 62,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506405,
          "ProcessID": 5894,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5019,
      "SummaryText": "\nCITY OF ANTIOCH\nWATER TREATMENT PLANT\nANTIOCH, CALIFORNIA\nRISK MANAGEMENT PLAN\nEXECUTIVE SUMMARY\n\nBackground Data\nIn accordance with Title 40 of the Code of Federal Regulations, Chapter 68 (40 CFR 68), promulgated by the Environmental Protection Agency (EPA) and Article2, Chapter 6.95 of the California Health and Safety Code (HSC), the City of Antioch (\"City\") submits this Risk Management Plan (RMP) for operations at their Water Treatment Plant (\"WTP\") in Antioch, California. The City provides potable water to their service area, which coincides with the City limits.  The facility is capable of treating 24 million gallons per day (MGD) of water, however it currently averages 12 MGD.  \nAccidental Release Prevention and Emergency Response Policy\nThe City is committed to protecting the health and safety of its employees, the surrounding community, and the environment; therefore, it is the City's policy to manage a safe and healthy workplace, protect the environment and maintain compliance with safety, health, and environmental regulations: 40 CFR 68 as well as Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) regulations promulgated as Title 29 of the Code of Federal Regulations, Chapter 1910, Section 119 (29 CFR 1910.119. This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\nStationary Sources and Regulated Substances\nThe City is subject to Section 112(r) of the Clean Air Act because chlorine, a regulated substance, is present at the facility in amounts greater than 2,500 pounds.  The City is required to treat the water supply so that it meets or exceeds the drinking water quality standards of the California Department of Health Services.  The"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5019,
      "SummaryText": " City uses chlorine (the 112(r) regulated substance) to disinfect the water.  The City's chlorine disinfection process consists of one-ton chlorine cylinders, chlorinators, a piping system that is all under vacuum, and an emergency scrubber to neutralize a chlorine release.  The process and storage cylinders can contain a maximum amount of 28,000 pounds of chlorine.\nWorst-Case Release Scenario\nAs required by 40 CFR 68 Subpart B, the City has evaluated a worst-case release scenario for chlorine using the parameters specified by the EPA.  The City's worst-case release scenario is the rupture of a one-ton cylinder of chlorine and the loss of the entire contents over a 10-minute period.  The distance to the toxic endpoint was determined using EPA's RMP Guidance for Waste Water Treatment Plants Reference Tables and/or Equations.  The following paragraphs provide details of the chosen scenarios.\n\nThe toxic liquid released is assumed to form a 1-cm deep pool from which evaporation takes place.  The entire pool is estimated to evaporate over 10 minutes.  The released quantity has not been limited by administrative controls.  At Class F atmospheric stability and 1.5 m/s windspeed, the maximum distance of 1.3 miles is obtained corresponding to a toxic endpoint of 0.0087 mg/L.\n\nThe worst-case release scenario was developed following EPA regulations and is not considered to be a likely release scenario.  Historically throughout the chlorine industry, the rupture of one-ton cylinders is rare.  The rupture of a cylinder outside the building would probably only occur during unloading of the cylinder.  This would be a daytime activity.  The meteorological condition required to be used by the EPA is F stability class.  By definition this stability class only occurs at nighttime.  Therefore, the results of this worst case offsite consequence analysis are extremely conservative.\nAlternative Release Scenario\nA more realistic release scenario (alternative release) was developed by the C"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5019,
      "SummaryText": "ity taking into consideration the history of operation's experience and the hazards identified in the process hazard analyses (PHAs).  The PHA was conducted to ensure that the City's plant hazards are identified and minimized. These analyses were conducted under the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) regulations promulgated as Title 29 of the Code of Federal Regulations Chapter 1910, Section 119 (29 CFR 1910.119).\nThe selected alternative release scenario for chlorine involves a vapor release from a break in the flexible 1/2\" tubing.  Since the system is under vacuum, a break alone would result in only a small release of chlorine gas from the tubing downstream of the regulator and upstream of the break.  However, if the break occurred and was accompanied by failure of the vacuum regulator, a release could occur from a valve.  The opening would be about 1/2 inch and potentially 37 lbs of chlorine per minute could be released.  This scenario would result in the release inside the chlorine building.  We conservatively assume the duration of the release is 30 minutes.  The leak detectors would notify an operator and the automatic controls would activate the emergency scrubber.  Standby help would arrive within minutes.  The leak would more likely be 15 minutes, the estimated maximum response time from detection and alarm to securing the leak.\nThe caustic scrubber can neutralize 1 ton of chlorine in 2 hours.  Assuming 99.9 percent efficiency on the scrubber, we estimate that 1.1 pound of chlorine would be released in 30 minutes.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.0087 mg/L of chlorine is <0.1 miles.  This is the minimum distance on the reference tables.  We anticipate that the release will not go offsite and there will be no impacts.\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply w"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5019,
      "SummaryText": "ith the accidental release prevention program requirements set out under 40 CFR part 68 of the EPA.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nAntioch Water Treatment Plant maintains a record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is a HAZOP.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA/update was performed on June 17, 1999.\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Antioch Water Treatment Plant maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nAntioch Water Treatment Plant has a training program in place to ensure that employees who are operating the processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every year and more frequently as needed.\n\nMechanical Integrity\nAntioch Water Treatment Plant carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; emergency scrubber, one-ton chlorine cylinders, piping systems, relief and vent systems, leak detectors and controls.  Maintenance operations are carried out by qualified personnel with previous training in main"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5019,
      "SummaryText": "tenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Antioch Water Treatment Plant to manage changes in process chemicals, technology, equipment and procedures.  The most recent review/revision of management of change procedures was performed on June 17, 1999.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Antioch Water Treatment Plant.  The most recent review was performed on November 01, 1999.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nAntioch Water Treatment Plant conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent compliance audit was conducted on June 17, 1999.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nAntioch Water Treatment Plant promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nAntioch Water Treatment Plant truly believes that process safety mana"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5019,
      "SummaryText": "gement and accident prevention is a team effort.  Agency employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our agency hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Antioch Water Treatment Plant has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\nFive-year Accident History\nAntioch Water Treatment Plant has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period that caused any onsite death, injury or significant property damage, or known offsite death, injury, property damage, environmental damage, evacuations, or sheltering in place.\n\nEmergency Response Plan\nAntioch Water Treatment Plant carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nT"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 5019,
      "SummaryText": "he City participates in the Contra Costa County Community Awareness and Emergency Response (CAER) Group.  CAER has designed and funded an emergency warning system to provide alert and notification to the community.  This includes sirens and emergency alert receivers for schools, daycare, senior centers, and hospitals throughout the industrial corridor.  Also included is the most advanced technology for emergency notification, such as automated radio, TV, and cable broadcasts for use throughout the County.  The warning system would be used in the event of an off-site release.  The community is being educated to shelter-in-place when the sirens sound.\n\nContinuous Efforts to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  We are pleased with the safety program that we already have implemented.  We plan to continue to improve safety by reviewing, revising, and enhancing our written Standard Operating Procedures.\n5\n\n\n\nP:\\Gen\\17867 Antioch RMP\\exsum.txt.doc\n\nP:\\Gen\\17867 Antioch RMP\\exsum.txt.doc\n\n"
    }
  ]
}