{
  "FacilityID": 5021,
  "FacilityName": "Jefferson Cold Storage, Inc.",
  "FacilityStr1": "Plant One 230 Collins Road",
  "FacilityStr2": "Plant Two 1025 Industrial Avenue",
  "FacilityCity": "Jefferson",
  "FacilityState": "WI",
  "FacilityZipCode": "53549",
  "Facility4DigitZipExt": "0419",
  "FacilityCountyFIPS": "55055",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "42.990861",
  "FacilityLongDecDegs": "-88.810194",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 78927951,
  "ParentCompanyName": "Associated Freezers Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Richard W. & Dianne M. Sharratt",
  "OperatorStr1": "Plant One 230 Collins Road",
  "OperatorStr2": "Plant Two 1025 Industrial Avenue",
  "OperatorCity": "Jefferson",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53549",
  "OperatorZipCodeExt": "0419",
  "RMPContact": "Michael E. Holman",
  "RMPTitle": "Safety/Compliance Manager",
  "FTE": 72,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000062004",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-07 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 42.99095,
  "FRS_Long": -88.81084,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5896,
      "AltID": "Refrigeration",
      "FacilityID": 5021,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 6041,
          "ProcessID": 5896,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6407,
          "ProcessID": 5896,
          "ChemicalID": 56,
          "Quantity": 34884.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506407,
          "ProcessID": 5896,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5021,
      "SummaryText": "Jefferson Cold Storage, Inc.\nRMP Executive Summary\n\nI.   The accidental release prevention and emergency response policies at Jefferson Cold Storage, Inc.:\n     A.  Accidental release prevention policies.\n           1. Forklift Operation Policy\n                a)  Forklift operators are prohibited from stacking product within 2 feet of ammonia piping in\n                     designated areas.  Other areas are guarded or marked to prevent ammonia pipe impact.  All \n                     forklift operators, employees and temporary workers are properly trained and informed of the \n                     dangers of ammonia.  Also, all operators are evaluated initially, and every 3 years thereafter,\n                     on their skill level.  Any deficiencies noted during their evaluation or course of employment are \n                     addressed immediately with retraining.\n\n          2.  Contractors Policy\n                a)  Contractors are evaluated in terms of their familiarity with the system, their knowledge of \n                      ammonia refrigeration and their safety performance.  All contractors are supervised by \n                      Jefferson Cold Storage, Inc.  refrigeration operators to verify their compliance with PSM and \n                      other safety-related guidlines.  Any refrigeration maintenance needed at L.D. Foods, a \n                      tenant  of Jefferson Cold Storage, Inc.  is coordinated by the Refrigeration Manager of \n                      Jefferson Cold Storage, Inc.  L.D. Foods personnel has limited access to the refrigeration \n                      system so as to prevent inexperienced or improperly trained operators from tampering with \n                      the system.\n\n           3.  Prcess Safey Management Policy\n                a)  Refrigeration operators must comply with all the components of Jefferson Cold Storage, Inc.'s \n                      Process Safety Management Program.  The purpose of the PSM Program is to prevent"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5021,
      "SummaryText": " a \n                      catastrophic release of ammonia.  It consists of 14 elements that play an active role in helping\n                      with the operation and maintenance of the ammonia refrigeration system.\n\n       B.  Emergency Response Policy\n            It is the policy of Jefferson Cold Storage, Inc. to implement the requirements of the Company's \n            Emergency Response Plan to minimize the risk of an ammonia release.  Company personnel who \n            have been trained in ammonia emergency response are expected to cooperate with other trained \n            responders to protect employees and the surrounding community from harmful exposures to \n            ammonia.  In conjuction with this effort, trained refrigeration operators will comply with all the \n            requirements of the PSM Standard and general good operating practices to prevent a catstrophic \n            release of ammonia.\n\nII.    The stationary source and regulated subatances handled at Jefferson Cold Storage, Inc.:  Stationary \n       source: Jefferson Cold Storage, Inc., Plant 1 230 Collins Road, Jefferson , Wi  53549, Engine rooms 1 \n       and 2.  Jefferson Cold Storage, Inc., Plant 2, 1025 South Industrial Avenue, Jefferson, WI 53549, \n       Engine room 3.  Regulated substance handled: Anhydrous Ammonia\n\nIII.    The worst-case and alternative release scenario including administrative controls and mitigation \n       measures to limit distances for each reported case.  In the event of an anhydrous ammonia release, \n       ammonia liquid or vapor would potentially expose persons to toxic levels that my adversely affect their \n       health.  Using the EPA's RMP Guidance for Ammonia Refrigeration Reference Tables or Equations, the \n       following worst and alternative case scenarios were established:\n\n       Worst Case Scenario\n\n       The High Pressure Receiver (HPR) located outside the Plant 1 facility, adjacent to the rairoad tracks, \n       has a normal operating lev"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5021,
      "SummaryText": "el of 50%.  During ammonia plant repair or maintenance that requires \n       ammonia to be pumped back into the HPR for storage, the maximum permitted level is 75%.  The \n       Maximum 75% level is strictly enforced by administrative controls and training.\n\n       The worst case scenario assumes that the HPR is 75% full at 180 psig.  The receiver ruptures the \n       vessel and connected piping, emptying the equivalent of 20,000 pounds of ammonia in a period of 10 \n       minutes and a release rate of 2,000lbs./min. Assuming Atmospheric Stability Class F and a wind \n       speed of 1.5 meters per second, in an urban setting, the distance to the toxic end point is 8,600 feet.  \n       In the event of an ammonia release of the magnitude described in the worst case scenario, the \n       Ammonia Response Team and Plan will be initiated to control the release.\n\n      Alternative Case Scenario\n      An ammonia charging hose ruptures during the charging process, a 1/2\" opening in the hose allow a \n      release rate of 200lbs./min. for 2 minutes, causing 400 pounds of ammonia to be released.  Using \n      Atmospheric Stability Class D with a moderate wind speed of 3 m/s, in an urban setting, the distance to \n      the toxic end point is 940 feet.\n\n      Administrative controls set fourth in the Ammonia Charging Operation Procedures require the ammonia \n      plant technician to stand by with the ammonia delivery truck driver during the entire charging process.  \n      When the hose ruptures, the ammonia plant technician closes the plant charging valve while the \n      ammonia delivery truck driver stops the pump and closes the hose valve, limiting the release to 2 \n      minutes and 400 pounds.  In the event of an ammonia release of the magnitude described in the \n      alternative case scenario, the Ammonia Response Team and Plan will be initiated to control the release.\n\nIV.  The general accidental release prevention program and chemical specific steps at Jefferon Cold "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5021,
      "SummaryText": "\n      Storage, Inc.:\n     A. The general accidental release prevention program consists of the following Process Safety Management elements:\n          1. Employee Participation\n          2. Process Safety Information\n          3. Process Hazard Analysis\n          4. Operating Procedures\n          5. Contractors\n          6. Training\n          7. Hot Works Permit\n          8. Mechanical Integrity\n          9. Pre-Startup Safety Review\n         10. Management of Change\n         11. Incident Investigation\n         12. Emergency Planning and Response\n         13. Compliance Audits\n\nThe combination of these elements helps guard against a catastrophic release of ammonia.  Furthermore, Jefferson Cold Storage, Inc. is monitored 24 hours a day by ADT Security.  Management personnel, who carry 24-hr. pagers, are immediately notified of any refrigeration system failures or alarms.  In this way, system failures can be addressed immediately to prevent a catastrophic situation.  Lastly, each year, and as needed, refrigeration operators are trained on system hazards, operating procedures, emergency response procedures, and other system related issues.  In most cases, this training serves as a refresher for those who work directly with the system.  On-going training helps operators to effectively manage and operate the refrigeration system.\n\nV.   The five year accident history at Jefferson Cold Storage, Inc.:\n\n      A.  Jefferson Cold Storage Corporation (as of 7/1/98 Jefferson Cold Storage, Inc.) in the past five years \n            has not had a leak of the magnitude described in the RMP Standard 68.42(a) and 68.42 (b).\n\nVI.  The Ammonia Emergency Response Plan at Jefferson Cold Storage, Inc.:\n\n      A.   The Ammonia Emergency Response Plan for Jefferson Cold Storage, Inc. consists of the following \n             elements:\n             1.  Overview of Response Plan\n             2.  Facility Description\n             3.  Emergency Response Organization\n             4.  Emergency Res"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5021,
      "SummaryText": "ponse Procedures\n             5.  Notification Procedures\n             6.  Evacuation Procedures\n             7.  Emergency Action Plans for Severe Weather and Fires\n             8.  Emergency Preparedness and Planning\n\n             Each element (with the exception of Facility Description) carefully describes personnel involved\n             and their responsibilities.  The plan is organized in a 3 ring binder and has tabs at each element's \n             section.  It is located near the Ammonia Emergency Response Equipment and has been\n             reviewed by  management and the Company's Ammonia Response Team.\n\nVII.  Planned changes to improve safety at Jefferson Cold Storage, Inc.:\n\n       A.  Additional guarding and marking for ammonia piping will be done to further enhance the protection\n             of the ammonia refrigeration system at Jefferson Cold Storage, Inc.\n\n       B.  Safety relief valves are being replaced every 5 years.  An audit system will be established to \n            periodically review operating and mechanical integrity procedures.\n\n      C.   Continued training among system operators and emergency response members will be a priority \n            to insure the proper operation and response of system processes and hazards.\n\n      D.   The Ammonia Emergency Response Plan will be evaluated annually and revised to reflect any \n            system, personnel, equipment or policy changes."
    }
  ]
}