{
  "FacilityID": 50402,
  "FacilityName": "California Dairies, Inc. Visalia",
  "FacilityStr1": "2000 North Plaza Drive",
  "FacilityStr2": null,
  "FacilityCity": "Visalia",
  "FacilityState": "CA",
  "FacilityZipCode": "93291",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.328360",
  "FacilityLongDecDegs": "-119.390100",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "California Dairies",
  "OperatorStr1": "11709 E. Artesia Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Artesia",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90701",
  "OperatorZipCodeExt": null,
  "RMPContact": "Harry De Lint",
  "RMPTitle": "VP Engineering",
  "FTE": 65,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000200828",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-10-11 00:00:00",
  "SafetyInspectionBy": "Zurich Insurance",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-12-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-12-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-12-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-12-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 73157,
      "AltID": "Ahydrous Ammonia",
      "FacilityID": 50402,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 74922,
          "ProcessID": 73157,
          "NAICSCode": "31151",
          "_desc": {
            "NAICS_CODE": "31151",
            "NAICS_DESCRIPTION": "Dairy Product (except Frozen) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 97052,
          "ProcessID": 73157,
          "ChemicalID": 56,
          "Quantity": 39000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 597052,
          "ProcessID": 73157,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50402,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe California Accidental Release Prevention (CalARP) Program and Federal EPA Risk Management Program requirements apply to California facilities that have quantities of hazardous materials over threshold values that were gauged to have a potential for off-site hazard.  These facilities are required to develop and submit a Risk Management Plan (RMP).  \n\n\nSTATIONARY SOURCE and REGULATED SUBSTANCE\n\nIn reviewing the potentially covered processes at California Dairies Visalia Facility, the only RMP covered process is the Anhydrous Ammonia utilized in the facility Refrigeration System.\n\nCalifornia Dairies uses the anhydrous ammonia refrigeration system to chill and store their dairy products. The ammonia system utilized by California Dairies is a \"closed-loop\" system that includes compressors, condensers, a high pressur receiver, recirculator package with pumps and system loads consisting of evaporators, chillers and silo tanks. \n\nThis CalARP/RMP Submittal is offered to address the following regulatory requirement:\n\nCalifornia Health & Safety Code, Title 19, Division 2, Chapter 4, Sections 2735-2785, \"California Accidental Release Prevention Program (CalARP)\"\n\nCalifornia Dairies Visalia facility is located at 2000 North Plaza Drive Visalia, CA. The surrounding rural area consists of industrial and commercial businesses and residential development. The facility maintains approximately 75 full time employees. The facility produces and stores dairy products. \n\nThe California Dairies Visalia, California facility has developed a Risk Management Program to address California Accidental Release Prevention (CalARP) Program requirements (California Health & Safety Code, Title 19, Division 2, Chapter 4, EPA Title 40 CFR Part 68 and OSHA 29 CFR 1910.119) and to enhance an already existing safety and emergency action programs. California Dairies is extremely diligent in the handling of all chemicals and is dedicated to the safety of its employees and the neighbori"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50402,
      "SummaryText": "ng community. California Dairies staff is highly trained and utilizes modern equipment to monitor the facility and provide safeguards, while effectively and safely using ammonia as a refrigerant\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nCalifornia Dairies Visalia, California facility has a long-standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as personnel training and consideration of safety in the design, operation, and maintenance of the Ammonia Refrigeration System. Their policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. \n\nHAZARD ASSESSMENT SUMMARY/OFFSITE CONSEQUENCE ANALYSIS\n\nWorst-Case and Alternate-Case Release Scenarios\n\nAs stipulated in EPA and Cal ARP guidelines, the worst-case and alternate case release scenarios with potential mitigation were determined for the covered ammonia process and the calculated results are held on file at the Cal Dairies Visalia facility. \n\nWorst-Case Release Scenario\n\nScenario Description: Per the RMP and CalARP regulations, one worst case analysis has been defined as a release of the maximum quantity of anhydrous ammonia that can be stored in the largest equipment item.   The most pessimistic meteorological conditions were used, as specified by the RMP and CalARP regulations.  RMP Comp was used to determine the maximum downwind endpoint distance.  \n\nAlternative Release Scenario\n\nScenario Description: A more realistic alternative release scenario was modeled as a release of anhydrous ammonia vapor. The meteorological conditions specified by regulation for alternative release scenarios were used.  RMP Comp was used to determine the maximum downwind endpoint distance.   The downwind distance for this alternative release scenario is significantly less than that for the worst-case scenario.\n\nRisk Considerations\n\nAlthough the storage and use of anhydrous ammonia has inherent p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50402,
      "SummaryText": "otential risks, and worst-case release scenarios can potentially reach the community; the Facility has recognized these potential risks and structured its safety programs to make the worst-case type of event non-credible.  In addition to the safety practices of the company and plant personnel to make this worst-case event non-credible, it should also be recognized that there are inherent analysis assumptions that make the results of the atmospheric dispersion analysis appear worse than what would actually be expected during such an event (e.g., In the event of a release, sudden rupture and flashing of ammonia would be highly turbulent.  Turbulence causes entertainment of air and the released vapor dilutes much more quickly than is shown in the model).\n\nIn addition to the use of conservative analysis assumptions that over-predict the effects of a potential release, other characteristics of the facility and site serve to minimize the potential risks associated with an ammonia release:\n- There are process valves to permit isolation of any leaks in place.\n- Floor drains in the Engine Room would provide containment for liquid release \n  and therefore minimize the potential for offsite impact.\n- Enclosure mitigation was taken into consideration for scenarios due to the  \n  ammonia systems inside location.\n- Plant personnel receive HAZMAT Training and are Operations Level \n  Responders.\n- This is a new system.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIEC PREVENTION STEPS\n\nAs part of the implementation of the CalARP Program, key Prevention Program elements were implemented by California Dairies to manage process safety issues associated with the use of ammonia for refrigeration.  In addition, common industry standards, policies, and procedures are currently utilized to ensure safe practices are being performed.  \nThe CalARP Prevention Program elements include:\n\n- Hazard Review \n- Operating Procedures\n- Incident Investigation\n- Compliance Audits \n- Maintenan"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50402,
      "SummaryText": "ce \n- Training   \n- Safety Information\n- Process Hazard Analysis\n\n FIVE-YEAR ACCIDENT HISTORY\n\nThere have been no CalARP/RMP-applicable releases of ammonia at the California Dairies Facility in the past five years.  \n\nEMERGENCY RESPONSE PROGRAM\n\nCalifornia Dairies has filed a Chemical Inventory Business Emergency Plan with Turlock County and this plan includes:\n-Emergency alarm procedures.\n-Evacuation procedures\n-Safety and health considerations.\n-Notification procedures.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nSeveral studies have been conducted to examine mitigation measures to improve safety at the California Dairies Facility.  These studies include the following:  Hazard Analysis (HA), and Hazard Assessment.  Any outstanding recommendations from these studies will have been implemented by December 31, 2007."
    }
  ]
}