{
  "FacilityID": 50423,
  "FacilityName": "Better Baked Foods of Erie, LLC",
  "FacilityStr1": "2200 East 38th Street",
  "FacilityStr2": null,
  "FacilityCity": "Erie",
  "FacilityState": "PA",
  "FacilityZipCode": "16510",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42049",
  "LEPC": "Erie County LEPC",
  "FacilityLatDecDegs": "42.012056",
  "FacilityLongDecDegs": "-080.020556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PP",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "NE Foods, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 159806079,
  "Company2DUNS": 0,
  "OperatorName": "Christopher Miller, CEO",
  "OperatorStr1": "2200 East 38th Street",
  "OperatorStr2": null,
  "OperatorCity": "Erie",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "16510",
  "OperatorZipCodeExt": null,
  "RMPContact": "Fritz Seegert",
  "RMPTitle": "Refrigeration Manager",
  "FTE": 100,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000155734",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-08-09 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-12-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-12-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-12-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-07-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 42.11981,
  "FRS_Long": -80.01961,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 73178,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 50423,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 74943,
          "ProcessID": 73178,
          "NAICSCode": "311919",
          "_desc": {
            "NAICS_CODE": "311919",
            "NAICS_DESCRIPTION": "Other Snack Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 97076,
          "ProcessID": 73178,
          "ChemicalID": 56,
          "Quantity": 25000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 597076,
          "ProcessID": 73178,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50423,
      "SummaryText": "\nBetter Baked Foods of Erie, LLC is located at 2200 East 38th Street in Erie, Pennsylvania.  The primary business operation of Better Baked Foods, Inc. is the production of hand held, bread based, frozen foods.  Anhydrous ammonia is used as a manufacturing aid in the refrigeration process.\n\n\n\nThe policy of Better Baked Foods of Erie, LLC. is to develop and implement the programs necessary to protect the health of its employees against on-the-job hazards which may cause injury. As the operator of a facility at which uncontrolled situations could cause harm to the public and damage to the environment, we will strive for environmental excellence with a commitment to continual improvement, pollution prevention and compliance with legislative requirements.   Employees and supervisors are required to comply with our policies and are subject to corrective action in those cases determined to indicate willful violation Better Baked Foods of Erie, LLC takes a proactive approach to the protection of its employees, the public, and the environment. In consideration of the hazardous effects that Ammonia may have on human health and the environment, the following policies, procedures, and programs have been implemented: a written emergency response plan, an offensively trained and equipped emergency action team in accordance with 29 CFR 1910.120,  periodic hazard analysis , safe work practices, initial and periodic training of employees, pre-startup safety reviews, compliance audits, incident investigations, contractor safety program, hot work permit program, mechanical integrity program, preventive maintenance program, continual evaluation for methods to improve facility safety including a standing facility safety committee and participation in the Local Emergency Planning Committee. \n\n\n\nA written plan of action regarding the implementation of employee participation in the program has been developed as a part of our Process Safety Management Program as specified by 29 CFR 1910.11"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50423,
      "SummaryText": "9. Process safety information has been gathered to enable Better Baked Foods of Erie, LLC and the employees involved in the ammonia operations to operate safely. This process safety information includes information pertaining to the toxicological and physical hazards of anhydrous ammonia and the technology of the processes and information pertaining to any equipment used in the processes. \n\n\n\nA complete hazard analysis and study of the ammonia system's mechanical integrity has been conducted on the ammonia refrigeration system. This analysis was completed by safety and health staff, engineering, maintenance personnel, and certain operational personnel. The analyses involved a review of each operation of the refrigeration processes to address steps for each operating phase, operating limits, safety and health considerations, and safety systems and their functions. The assessment also included information concerning the emergency action plans related to the process; development and implementation of safe work practices regarding the control of entrance and exit of personnel in the process areas; pre-startup safety; mechanical integrity of equipment; inspection and testing, correction of deficiencies in equipment, planned or unexpected changes to the process, equipment, and procedures to the processes. A system was developed and is maintained to promptly address the team's findings and recommendations. The hazard analyses will be updated as needed and at five (5) year intervals. \n\n\n\nBetter Baked Foods of Erie, LLC has developed and implemented written operating procedures to provide clear instructions to maintain the safety of our associates.  These standard operating procedures are consistent with process safety information and address steps for each handling phase, operational limitations, safety and health considerations, and safety systems and their functions. Other written documentation of standard operating procedures as a part of this program is included in the "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50423,
      "SummaryText": "following programs: Mechanical Integrity, Equipment Preventive Maintenance Program, Written Emergency Response Plan, and the Employee Emergency Action and Evacuation Plan. Each employee involved in operations within the processes where the ammonia is received, processed, or used at the facility has been trained in the processes and in the operating procedures as outlined by OSHA regulations. Refresher training is required every three years, and more often if necessary. Training includes:  emphasis on the specific safety and health hazards, emergency operations in the case of a release including shutdown, and safe work practices applicable to the employee's job tasks. \n\n\n\nA contractor safety program has been developed to address maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to areas where the ammonia is utilized in the facility. This program includes specific requirements in selection of contractors including a review of the contractor's safety performance and programs.  These specific program elements will be reviewed: emergency action plans related to the process, safe work practices regarding the control of entrance and exit of contract employers and contract employees in the process areas, periodic evaluation of the contractor related to safety management at the process; maintenance of certain records related to contractor employee injury and illness; development of written procedures for any new processes, and provision of training to employees. Contractors performing work on or adjacent to equipment or processes in which ammonia is present must have clearance from the Maintenance Supervisor prior to beginning operations. Each contractor will also complete the Better Baked Foods of Erie, LLC Contractor Safety Orientation prior to entry into the facility. This orientation will include an introduction to the Better Baked Foods of Erie, LLC Process Safety Management Program, information concerning the toxicological and physic"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50423,
      "SummaryText": "al hazards of Ammonia, and the emergency response plan in the case of an incident involving a release. Upon completion, the contractor will be issued any necessary permits by the Refrigeration Department in order to begin work. \n\n\n\nPrevention of a release is a core component of the Better Baked Foods of Erie, LLC Risk Management Program. This program is designed to insure proper work practices and an on-going mechanical integrity program. This program also insures compliance with 29 CFR 1910.38, 1910.120, 1910.1200, 40 CFR, Part 68, Part 112, and Part 260. Other written documentation of standard operating procedures as a part of this program is included in the following documents: Mechanical Integrity Study of Process Equipment Preventive Maintenance Program Written Emergency Response Plan Employee Emergency Action and Evacuation Plan Training Each employee involved in operations within the process where Ammonia is received, processed, or used at the facility has been trained in an overview of the process and in the operating procedures as outlined by 29 CFR 1910.119. Refresher training is provided no less than every three years and more often if necessary. Also, each maintenance person who has responsibilities to perform maintenance on the process components receives training on an as needed basis, but no less than every three years. \n\n\n\nA team of individuals has been trained and is equipped as a HAZMAT team. The team is equipped with Self-Contained Breathing Apparatuses, Level A suits, leak detection and monitoring equipment, decontamination equipment, and leak repair and ventilation equipment in order to respond in an offensive manner to contain and clean-up any potential spill in the shortest amount of time possible.  A system of ammonia sensors has been strategically placed in all refrigerated spaces and compressor rooms and has been tied into an audio/visual alarm system and paging system.  Several key associates have been issued pagers to alert them to a pote"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 50423,
      "SummaryText": "ntial incident even when offsite.   A record of the training, which contains the identity of the employee, the date of training, and the means, is maintained to verify that the training was complete and understood by the responders. \n\n\n\nAs a part of the Better Baked Foods of Erie, LLC proactive program concerning the hazards of ammonia to it?s' workers and the surrounding public, its staff has conducted a thorough hazard assessment. For the hazard assessment and the RMP, populations potentially affected are defined as those within a circle that has as its center the point of release and its radius the distance to the toxic endpoint. Owners or operators may use census data to define this population. The presence of schools, hospitals, other institutions, public arenas, recreational areas, and large commercial and industrial developments that can be identified on street maps within this circle must be noted. The presence of environmental receptors within this circle must also be listed. The EPA has defined environmental receptors as natural areas such as national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preserves, refuges, or areas; and Federal wilderness areas, that can be exposed to an accidental release. \n\n\n\nBetter Baked Foods of Erie, LLC has had no reportable accident under the guidelines of the Risk Management Program during the past 5 years.  \n\n\n\nMaintenance of a refrigeration system is a continual process.  Continuous safety improvement will be utilized to maintain the status of a world class manufacturer.  As new process, control, and emergency response technology becomes available it will be instituted as a good engineering practice.  New training material and information will be provided to responders on an annual basis in order to maintain a high level of competency.  As a specific example of a commitment to improvement, canister pumps will be installed on all new or refurbished equipment as a substitute for pumps "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 50423,
      "SummaryText": "with a mechanical seal.  Canister pumps are specifically designed to contain ammonia without the possibility of leaks.\n\n\n\n"
    }
  ]
}