{
  "FacilityID": 50563,
  "FacilityName": "Guayama Regional Wastewater Treatment Plant",
  "FacilityStr1": "Road PR #-3 Int. 710 Km 2.2",
  "FacilityStr2": "Bo. Barrancas",
  "FacilityCity": "Guayama",
  "FacilityState": "PR",
  "FacilityZipCode": "00784",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "72057",
  "LEPC": "GUAYAMA LEPC",
  "FacilityLatDecDegs": "17.949167",
  "FacilityLongDecDegs": "-066.141944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PC",
  "FacilityURL": "acueductospr.com",
  "FacilityEmailAddress": "ciecentral@acueductospr.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Puerto Rico Aqueduct and Sewer Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Pr Aqueducts & Sewer Authority",
  "OperatorStr1": "PO Box 7066",
  "OperatorStr2": null,
  "OperatorCity": "San Juan",
  "OperatorStateFIPS": "PR",
  "OperatorZipCode": "00916",
  "OperatorZipCodeExt": "7066",
  "RMPContact": "Jose A. Capeles",
  "RMPTitle": "Compliance and QC Director",
  "FTE": 33,
  "OtherEPAFacilityID": "PR0025445",
  "EPAFacilityID": "100000120754",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-01-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-01-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-01-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-03-02 00:00:00",
  "DeRegistrationEffectiveDate": "2016-02-09 00:00:00",
  "AnniversaryDate": "2013-01-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 17.94889,
  "FRS_Long": -66.14167,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA ON)",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 73397,
      "AltID": "Chlorine injection/stor.",
      "FacilityID": 50563,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 75165,
          "ProcessID": 73397,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 97326,
          "ProcessID": 73397,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 597326,
          "ProcessID": 73397,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50563,
      "SummaryText": "Guayama Regional Sewage Treatment Plant is located at the road PR#-3 Int. 710 Km 2.2 Bo. Barrancas Guayama, Puerto Rico, 00784. This water treatment plant in owened by Puerto Rico Aqueduct and Sewer Authority (PRASA) wich is a Government Agency. PRASA has developed the RMP following the Program 3 for the Management and Prevention of Risks associated with the storage and handling of the toxic substance chlorine for water disinfection. The RMP was prepared in compliance with EPA 40 CFR Part 68. The Prevention Program was prepared in accordance with OSHA Process Safety Management (PSM) regulation, as established in 29 CFR Part 1910.119.\n\nAccidental Release Prevention\n\nIt is PRASA's policy to comply with EPA and OSHA Federal and State applicable requierments. Chlorine is a toxic substance regulated by EPA, for that reason Guayama Regional Sewage Tratment Plant is observing the appropriate engineering controls. Changes have been put in place to improve security and as a part of the Prevention Plan implanted to protect the wellness of workers, employees, contractors, visitors and inmediately surrounding areas and inhabitants.\n\nThe Stationary Source and Regulated Substances Handled\n\nThe Guayama Wastewater Treatment Plant is located close to the area where the plant discharges the trated water. The chlorine is used as disinfectant to destroy the microrganism that could cause illness and contamination.\n\nChlorine is delivered from PRASA's Storage Center in Puerto Nuevo to the plant in one (1) tone containers. Guayama Regional Sewage Tratment Plant could have a storage maximun volume of 24,000 pounds distributed in twelve containers. The containers are connected to chlorinators from wich the chlorine flows to the Flow regulator and then it is sent to one (1) contact chamber just before the water is discharged to the sea or send to a local Electric Company to be used in the cooling towers.\n\nWorst-case and Alternative Release Scenarios\n\nThe Worst Case Scenario was determined as "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50563,
      "SummaryText": "indicated in the EPA Wastewater Treatment Plant, as per Appendix F Supplemental Risk Mangement Program Guidance for Wastewater Treatment Plants. This guidance considers the release of the chlorine gas of the entire container (2,000 pounds) during 10 minutes and other specifications related to the weather conditions and a radio of 1.3 miles, for a chlorine concentration equal or higher than 3 ppm, wich is the American Industrial Hygine Association exposure limit above which it is determined human health will be affected. Using tha Landview 6 Simulator and the US Census 2000, it was identified that 657 residents are inside the 1.3 miles radio. No known environmental receptors (state parks, or official designated wildlife preserves) are located within this radio area. The ALOHA Modeling Dispersion Program was used to simulate the gas dispersion.\n\nAlternative Case Scenario: .                                                                                                                                                                                         The more realistic scenario was also simulated as per EPA Wastewater Treatment Plants parameters as a release of the total content of a 2,000 pounds container, but throughout a pipe leak. In the case the end point distance is calculated at 0.1 miles and none public receptors were identified over the most recent map. No know environmental receptors are located within the radio area.\n \n\nGeneral Accidental Release Prevention Program \n\nPRASA is actually in a very aggressive operation to implement a Prevention Plan to ensure the maintenace and mechanical integrity of the facility wich will improve significantly the safety scope of the current prevention requirements plans. Standard Operational Procedures (SOP's) are already in place to comply the OSHA and PROSHO requirements in order to keep all the involved parties aware of the hazardous and risk related to the chlorine. List all SOP'S are indicated in the PSM report and "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50563,
      "SummaryText": "are located in the plant.\n\nEmergency Response Program\n\nPRASA has various SOP's to manage emergency programs associated to a release of the chemical and also related to the emergency actions to be taken before and after hurricanes and other atmospherics events.\n\n\nFive-year Accident History\n\nNo mayor release of chlorine in excess of ten (10) pounds has been reported during the last five years.\n\nPlanned Changes to Improve Safety\n\nPRASA has implemented in Guayama Regional Sewage Treatment Plant, a vacuum operated system to improve the control of the process and the safety of the chlorine  handling and storage. It is still needed to reinforced administrative activities related to equipment operations, PPE in place, employee's training, preventive maintenace and audits. Recommendations were given on that regard on last PHA dated 12/14/2007."
    }
  ]
}