{
  "FacilityID": 50605,
  "FacilityName": "Hillsboro Processing",
  "FacilityStr1": "1801 North Highway 77",
  "FacilityStr2": null,
  "FacilityCity": "Hillsboro",
  "FacilityState": "TX",
  "FacilityZipCode": "76645",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48217",
  "LEPC": "Hill County LEPC",
  "FacilityLatDecDegs": "32.040972",
  "FacilityLongDecDegs": "-097.106778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "cassie_howard2006@yahoo.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Hillsboro Processing",
  "OperatorStr1": "2828 Hood Street #603",
  "OperatorStr2": null,
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75219",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000201195",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-01-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-01-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-01-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-11-07 00:00:00",
  "DeRegistrationEffectiveDate": "2012-11-02 00:00:00",
  "AnniversaryDate": "2013-01-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Process shut down and tanks repurposed at another location",
  "_processes": [
    {
      "ProcessID": 73460,
      "AltID": "Natural Gasoline De-Sulfu",
      "FacilityID": 50605,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 97412,
          "ProcessID": 73460,
          "ChemicalID": 115,
          "Quantity": 635000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 75230,
          "ProcessID": 73460,
          "NAICSCode": "324199",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 50605,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Hill County Emergency Management",
    "CoordinatingAgencyPhone": "2545825313",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50605,
      "SummaryText": "Executive Summary\n\n1.0  Accidental Release Prevention and Response Policies\n\n\nHillsboro Processing is committed to operating its facility in a manner that is safe for its employees, the public, and the environment.  A primary aspect of this commitment is to ensure the safe operation of its equipment and processes.  This commitment is also demonstrated by the resources invested in accident prevention, such as considering safety in the design, installation, operation and maintenance of its processes, as well as, extensive training of its operating personnel. \n\nIn the event of an accidental release, Hillsboro Processing has procedures which are designed to control and contain the release in a manner which will be safe for its employees and will help prevent injury to the public and the environment.  Hillsboro Processing personnel will not, however, respond to emergency situations and have been instructed to leave the facility via emergency evacuation routes in the event of a significant release event or other emergency.  All emergency response situations will be handled through prior coordination between Hillsboro Processing and local emergency response agencies, including but not necessarily limited to, the Hillsboro Fire Department, Hill County Local Emergency Planning Committee (LEPC), and the Hill County Emergency Management Coordinator.\n\n\n2.0  Regulated Substances\n\n\nHillsboro Processing, located in Hillsboro, Texas, is primarily involved in the processing of natural gasoline by removing sulfur.  The facility processes natural gasoline in sufficient quantities to be covered by the Risk Management Program Rule (RMP Rule).  Administrative controls have been implemented which limit the amount of natural gasoline on site to a storage quantity well below the maximum potential of the facility.\n\nThe following lists the process under the RMP Rule and the associated Regulated Substance with its respective maximum quantity:\n\nProcess Description:  Natural Gasoline De-Sulfuriz"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50605,
      "SummaryText": "ation  \nProgram Level:  1\nRegulated Substances: Natural Gasoline is a variable mixture that may have the following 68.130 listed materials at the following maximum concentrations:\n\n  <90% Isopentane (78-78-4)\n  <90% n-Pentane (109-66-0)\n  <90% 1-Pentene (109-67-1)\n  <5% cis-2-Butene (590-18-1)\n  <5% 2-methyl-1-butene (563-46-2)\n  <0.2% Ethyl Mercaptan (75-08-1)\n\nMaximum Quantity Onsite (Natural Gasoline):  = 2 storage tanks\n\n\n3.0  Flammability Assessment Results\n\n\nHillsboro Processing performed an offsite consequence analysis to estimate the potential impact of an accidental release of natural gasoline from their process. The regulated substance was evaluated for a possible worst-case release scenario.  It is important to understand that Hillsboro Processing has invested extensive resources to prevent releases, and the potential for a worst-case release is extremely small.  \n\nThe primary objective of performing the offsite consequence analysis is to determine the distance at which certain effects might occur to the public and/or the environment as a result of an accidental release.  This point is called the endpoint distance.  At distances less than the endpoint distance, the effects would be greater; at distances farther than the endpoint, the effects would be less.\n\nHillsboro Processing completed the Flammability Assessment, and the results have been appropriately communicated to the local emergency response agencies. \n\n\n4.0  Chemical Specific Prevention Steps\n\n\nIn addition to the required prevention program elements, Hillsboro Processing has implemented safety features specific to the substances used at the facility.  The following describe some of these safety features:\n\n*  Specialized maintenance and emergency response coordination, \n \n*  Installation of a dike barrier with a capacity to contain over 14,000 ft3 of material,\n\n*  Preventative maintenance program to prevent releases, and\n \n*  Inspection and maintenance program to identify/repair leaking equipment."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50605,
      "SummaryText": "\n\n\n5.0  Five-Year Accident History\n\n\nHillsboro Processing has had no reportable accidents in the last five years.\n\n\n6.0  Emergency Response Programs\n\n\nHillsboro Processing has implemented an emergency response program, which is in place to protect worker and public safety as well as the environment.  The program consists of procedures for emergency evacuation and for notifying emergency response agencies in the event of a significant release of a regulated substance.  \n\nThe Hillsboro Processing emergency response program includes procedures for:\n\n*  Training employees regarding hazardous substances and limited emergency response,\n\n*  Informing the local LEPC, fire department, office of emergency management, and public about accidental releases that could    reasonably result in offsite consequences, and\n\n*  Employee/contractor evacuation and methods for accounting for personnel after an evacuation.\n\n\n7.0  Planned Changes to Improve Safety\n\n\nHillsboro Processing continuously strives to improve the safety of our processes through incident investigation, process analysis, and employee suggestions.  Engineering and technical personnel stay abreast of technology advancements which may improve the safety of their processes.  \n\nWhen changes occur that affect the facility?s operations or Program 1 status, the RMP will be updated accordingly and proper notifications will be made to coordinated emergency response agencies."
    }
  ]
}