{
  "FacilityID": 50678,
  "FacilityName": "Brenntag Southwest Inc., Houston 1-08 Update",
  "FacilityStr1": "14826 Hooper Road",
  "FacilityStr2": null,
  "FacilityCity": "Houston",
  "FacilityState": "TX",
  "FacilityZipCode": "77047",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-",
  "FacilityLatDecDegs": "29.588611",
  "FacilityLongDecDegs": "-095.406111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "Brenntag.com",
  "FacilityEmailAddress": "ghill@brenntag.com",
  "FacilityDUNS": 117432922,
  "ParentCompanyName": "Brenntag, Inc",
  "Company2Name": null,
  "CompanyDUNS": 92963644,
  "Company2DUNS": 0,
  "OperatorName": "Garry W. Hill",
  "OperatorStr1": "206 East Morrow Road",
  "OperatorStr2": null,
  "OperatorCity": "Sand Springs",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74063",
  "OperatorZipCodeExt": null,
  "RMPContact": "Clay Wade",
  "RMPTitle": "Vice President of Operations",
  "FTE": 25,
  "OtherEPAFacilityID": "TXD062128004",
  "EPAFacilityID": "100000042884",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-11-27 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-01-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-01-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-01-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-12-04 00:00:00",
  "DeRegistrationEffectiveDate": "2018-11-28 00:00:00",
  "AnniversaryDate": "2013-01-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 29.59106,
  "FRS_Long": -95.40526,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility has been shutdown. Brenntag does not operate a facility at this address",
  "_processes": [
    {
      "ProcessID": 73543,
      "AltID": "Repack Store Handle",
      "FacilityID": 50678,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 75313,
          "ProcessID": 73543,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 97509,
          "ProcessID": 73543,
          "ChemicalID": 31,
          "Quantity": 100000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 31,
            "ChemicalName": "Cyclohexylamine  [Cyclohexanamine]",
            "CASNumber": "108-91-8",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 597509,
          "ProcessID": 73543,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 73544,
      "AltID": "Store & Handle",
      "FacilityID": 50678,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 75314,
          "ProcessID": 73544,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 97510,
          "ProcessID": 73544,
          "ChemicalID": 55,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 597510,
          "ProcessID": 73544,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 73545,
      "AltID": "Storage & Handling",
      "FacilityID": 50678,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 75315,
          "ProcessID": 73545,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 97511,
          "ProcessID": 73545,
          "ChemicalID": 57,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 597511,
          "ProcessID": 73545,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50678,
      "SummaryText": "INTRODUCTION\n\nBrenntag Southwest, Inc., is a chemical distribution company headquartered in Longview, Texas with Corporate Regulatory Offices in the Tulsa, Oklahoma area (Sand Springs, OK), which has several branches located in Kansas, Oklahoma, Texas, Louisiana, and Alabama.  Brenntag Southwest participates in the Responsible Distribution Process program of the National Association of Chemical Distributors (NACD). The Community Outreach and Emergency Response Plan of Responsible Distribution Process bring chemical distribution plants and local communities together through communications and cooperative emergency planning.  The company is an ISO-9002 certified company with Health, Safety, and Environmental policies and procedures in place, which are designed to prevent emergencies such as fires, explosions and accidental chemical releases. \n\nBrenntag Southwest is a Business Unit of Brenntag, Inc., which serves customers worldwide with products, chemicals, and advanced materials. The company ranks among the top chemical distribution firms in North America. It is the worldwide policy of Brenntag to design, blend and distribute its products and to handle materials throughout their life cycle in a manner that protects the environment and safeguards employees, customers and the public from unacceptable risk. \n\nPLANT DESCRIPTION\n\nThe Brenntag Southwest facility is located in the southern part of the State of Texas, in the city of Pearland.  The company employs around 25 full-time employees who carry out distribution activities that include the storing and handling of Hydrofluoric Acid 70% and Ammonia Solution 30% and the repackaging, storage and handling of Cyclohexylamine all in compliance with the Prevention Program Level 2.  The Environmental Protection Agency (EPA) considers this product hazardous.  The facility provides this and other quality products to customers thorough out the southern part of the U.S.\n\nPRODUCTS\n\nHydrofluoric Acid is used to etch glass and as an "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50678,
      "SummaryText": "ingredient in cleaning compounds among other uses.  Ammonia solutions are commonly used as cleaning compounds, emissions reducing agents, and in the treatment of water.  Cyclohexylamine is commonly used as a corrosion inhibitor in boiler systems.  The same properties that make these chemicals valuable as a commodity also make it necessary to observe certain safety precautions when handling to reduce the threat to nearby members of our community as well as to the employees of the company.  It is our policy to adhere to all applicable Federal, State and Local regulations. \n\nACCIDENTAL RELEASE & EMERGENCY RESPONSE POLICIES\n\nBrenntag Southwest owns emergency equipment that aids in the ability to stop leaks from containers of these products, and maintains employees who are trained in the use of this equipment.  Along with these internal programs, Brenntag also maintains agreements with area emergency response companies.  \n\nThe Emergency Programs in place at the facility include Emergency Actions, Fire Prevention Plan, Emergency Response Plan, and a Transportation Emergency Plan.  These plans require the facility to maintain an open door policy with local fire departments and other emergency groups in the area, and to invite emergency responders from both the public and private sectors to tour the facility annually in order to gain knowledge of the physical setup of the plant.  This information becomes very valuable during an emergency incident.  These plans also direct the facility to maintain a working relationship with area clinics and hospitals in order to be prepared during emergency events of any kind.   \n\nACCIDENT PREVENTION PROGRAM & CHEMICAL SPECIFIC ACCIDENT PREVENTION PROGRAM\n\nBrenntag Southwest, Inc., maintains Health, Safety and Environmental policies for Risk Management, Training, Product Stewardship, Community Outreach, Hazard Communication, and Process Safety Management among others.  These policies require careful review of the hazards and the safeguards "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50678,
      "SummaryText": "that must be implemented to prevent releases of regulated chemicals.  Brenntag also adheres to container specifications, inspections, and testing requirements of laws in-acted by the Department of Transportation.  In conjunction with these programs, as a member of the NACD, the company complies with the Responsible Distribution Process, Building and Fire Codes all of which have aided the company in designing and operating a safe plant.  These programs help to ensure that the possibility of a release of this magnitude would never occur at the facility.  \n\nFIVE-YEAR ACCIDENTAL RELEASE HISTORY\n\nThe Brenntag Southwest Houston branch has never experienced a release of any magnitude with these products that caused the facility to implement evacuation measures. \n\nEMERGENCY RESPONSE PROGRAM\n\nThis facility has emergency plans, which are coordinated with local fire departments and the Local Emergency Planning Committee (LEPC), and are based upon information from the manufacturers of these products.  The emergency response plans for all company facilities include procedures for notification of any potentially affected neighbors, the local fire authority, and federal, state, and local agencies among other requirements.\n\nSUMMARY\n\nIn order to continue to improve upon its safety record, Brenntag Southwest requires all of its facilities to conduct incident investigations, safety compliance audits, continuous training of normal, and emergency procedures, and community outreach actions which include: educating and training neighbors, customers, fire departments, and emergency response teams.  These policies coupled with improvements that have originated from internal programs such as the Employee Suggestion Program and from external sources such as industry associations aid the company in its continuous effort to enhance the safe handling and storage of hazardous products."
    }
  ]
}