{
  "FacilityID": 5081,
  "FacilityName": "Vertex Chemical Corporation Dupo, IL",
  "FacilityStr1": "3101 Carondelet Road",
  "FacilityStr2": null,
  "FacilityCity": "Dupo",
  "FacilityState": "IL",
  "FacilityZipCode": "62239",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17163",
  "LEPC": "St. Clair County LEPC",
  "FacilityLatDecDegs": "38.523583",
  "FacilityLongDecDegs": "-90.212083",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "vertexchem@worldnet.att.net",
  "FacilityDUNS": 6271886,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Vertex Chemical Corporation",
  "OperatorStr1": "9909 Clayton Road, Suite 219",
  "OperatorStr2": null,
  "OperatorCity": "St. Louis",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "63124",
  "OperatorZipCodeExt": "1120",
  "RMPContact": "Jim Koch",
  "RMPTitle": "Plant Manager",
  "FTE": 15,
  "OtherEPAFacilityID": "62239VRTXCEASTC",
  "EPAFacilityID": "100000060961",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-17 00:00:00",
  "SafetyInspectionBy": "Federal Railroad Administration",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 38.52358,
  "FRS_Long": -90.21208,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5968,
      "AltID": "Bleach Manufacture",
      "FacilityID": 5081,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 6113,
          "ProcessID": 5968,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6480,
          "ProcessID": 5968,
          "ChemicalID": 62,
          "Quantity": 650200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506480,
          "ProcessID": 5968,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5081,
      "SummaryText": "Executive Summary\n\n1.  Accidental release prevention and emergency response policies\n\nIn this distribution facility we handle chlorine, which is considered hazardous by EPA.  The same properties that make chlorine valuable as a commodity also make it necessary to observe certain safety precautions in handling chlorine to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as that of our co-workers, and to reduce the threat to nearby members of the community.  It is our policy to adhere to all applicable Federal and State rules and regulations.  Safety depends upon the manner in which we handle chlorine, the safety devices inherent in the design of this facility, the safe handling procedures that we use, and the training of our personnel.\n\nOur emergency response program is based upon the Chlorine Institute's Pamphlet 64, Emergency Response plans for Chlorine Facilities.  The emergency response plan includes procedures for notification of the local fire authority and notification of any potentially affected neighbors.\n\n2.  The stationary source and regulated substances handled\n\nThe primary purpose of this facility is to manufacture sodium hypochlorite for customers.  Chlorine is received by rail car.  It is then piped directly into the manufacturing of sodium hypochlorite.  This facility has equipment for unloading rail cars.  Access to the site is restricted to authorized facility employees, authorized management personnel and authorized contractors.  The regulated substance handled at this distribution facility is chlorine.  The total inventory of chlorine stored at this plant is 540,000 pounds. \n\n3.  The worst-case release scenario and the alternative release scenario, including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nWorst-Case Scenario:  Failure of a 90-ton railroad car of chlorine would release 180,000 pounds of chlorine.  It is assumed that the entire contents are"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5081,
      "SummaryText": " released as liquid/vapor, which is heavier than air.  The distance to the endpoint of 0.0087 mg/L (3ppm) is 25 miles.\n\nAlternative Release Scenario:  Overchlorinating a manufacturing batch of sodium hypochlorite would release a maximum of 5700 pounds of chlorine as a vapor, which is heavier than air.  The distance to the endpoint of 0.0087 mg/L (3ppm) is 5.2 miles.\n\n4.  The general accidental release prevention program and the specific prevention steps\n\nThis distribution facility complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  This facility is operated in accordance with recommendations from the Chlorine Institute.  \n\n5.  Five-year accident history\n\nVertex Chemical Corporation has three facilities which manufacture sodium hypochlorite using chlorine.  None of these facilities has experienced a reportable spill of chlorine nor any off-site consequences.   \n\nAt all Vertex sites the following process controls and safety measures have been installed:\n\n     1)  Oxidation reduction probes which measure and report the actual progress of the product during\n          process are installed in all process tanks.  This equipment shuts down the process and \n          automatically closes the chlorine car before an overchlorination can take place.  History and\n          experience all show conclusively that overchlorination is the most likely realistic source of\n          chlorine release in a bleach plant.\n\n     2)  Chlorine sensors and automatic alarms and railcar shutoffs have been installed at the chlorine\n           car sites and in the plants.\n\n     3)  All Vertex operations personnel who handle chlorine are trained to emergency response    \n          \"Incident Command\" level within one year of employment.\n\n     4)  Procedures have been developed over the fifty-year history of Vertex in bleach manufacture\n          to minimize the possibility of accidental chlorine release.\n\n6.  The emergency response program\n\nTh"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5081,
      "SummaryText": "is facility's emergency response program is based upon the Chlorine Institute's Pamphlet 64, Emergency Response Plans for Chlorine Facilities.  We have hosted meetings at our facility annually, to which the Local Emergency Planning Committee Chairman, Police and Fire Departments have been invited/attended for Haz Mat education/tour.  Vertex programs have been discussed.  Representatives of the Dupo and East Carondelet Fire Department visited the facility on January 13, 1999.\n\n7.  Planned changes to improve safety\n\nThis facility was constructed in 1967, with the most recent upgrade in 1998 and is in compliance with Chlorine Institute guidelines.  We continue to participate in the Chlorine Institute programs, and continue to improve our operations in accordance with Responsible Care (TM) guidelines."
    }
  ]
}