{
  "FacilityID": 50830,
  "FacilityName": "North Water Plant",
  "FacilityStr1": "1603 Johnson Street",
  "FacilityStr2": null,
  "FacilityCity": "Columbus",
  "FacilityState": "MS",
  "FacilityZipCode": "39701",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28087",
  "LEPC": "Lowndes County LEPC",
  "FacilityLatDecDegs": "33.513333",
  "FacilityLongDecDegs": "-088.396111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Columbus Light and Water Department",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Columbus Light and Water Department",
  "OperatorStr1": "420 Fourth Avenue South",
  "OperatorStr2": null,
  "OperatorCity": "Columbus",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39703",
  "OperatorZipCodeExt": "0949",
  "RMPContact": "Todd Gale",
  "RMPTitle": "General Manager",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000045104",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-07-24 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-02-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-02-05 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-01-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2010-11-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 33.51333,
  "FRS_Long": -88.39611,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 73795,
      "AltID": "Chlorination Process",
      "FacilityID": 50830,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 75567,
          "ProcessID": 73795,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 97818,
          "ProcessID": 73795,
          "ChemicalID": 62,
          "Quantity": 20900.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 597818,
          "ProcessID": 73795,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50830,
      "SummaryText": "The North Water Treatment Plant has been successfully providing water to the community of Columbus, Mississippi for over 4 decades. Located on Johnson Road in northeast Columbus, the plant lies along the western bank of the Luxapallila River. On average the plant treats 4.5 million gallons of groundwater per day and has the capacity to treat over 6 million gallons per day. The Plant boasts of a flawless safety record with no accidents to report over the history of the facility. This flawless safety record can be attributed to the awareness and conscientiousness of the administration and staff.\n\nTo further improve the overall safety of the plant, A Risk Management Plan has been developed for chlorine, a hazardous chemical used in the treatment process. When dealing with hazardous chemicals, it is imperative to take all necessary precautions to protect the safety of the employees and the surrounding community. The North Water Plant has accomplished this through constant employee safety training, the use of proper methods and equipment for handling chlorine, and the preparation of emergency response procedures.\n\nChlorine is an essential chemical in the treatment of drinking water. It is a strong disinfectant and is used in the treatment process to eliminate any pathogenic organisms in the final supply. The chlorine at the North Plant is stored on-site in one-ton cylinders and 150-pound cylinders inside the chlorination building, located near the center of the facility. A maximum inventory of 20,900 pounds can be found at the plant at one time. The chlorination building serves to supply, meter, and apply the chlorine to the final water stream.\n\nChlorine is listed by the EPA as an extremely hazardous substance (EHS). It has a characteristic penetrating odor and is greenish yellow in the gas phase and clear amber under pressure in the liquid phase. Chlorine gas is primarily a respiratory irritant, while liquid chlorine will cause burning to the eyes and skin. Yet, with th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50830,
      "SummaryText": "e proper equipment and proper handling of this chemical, the hazards can be controlled.\n\nA part of the Risk Management Plan is the prevention program. This program covers safety information, a review of potential hazards, operating procedures, employee training, and maintenance of equipment. It is essential to have up-to-date and complete information available on these topics to protect the employees and the surrounding community by eliminating possible hazardous situations. The North Water Treatment Plant keeps current material safety data sheets on chlorine available to the staff at all times. There are also equipment specifications and the appropriate codes and standards used to operate the process available in the main building.\n\nA hazard review of the chlorination process was conducted on September 26, 2003. The purpose of the hazard review is to identify all hazards associated with the chemical and the process, opportunities for equipment malfunction or human error, safeguards in place, and detection or monitoring equipment in place or needed. Possible hazards identified include toxic releases, overpressurization of a cylinder, and equipment failure. Safeguards in place to protect against these hazards include vent lines, manual shutoff valves, fire resistant walls, and the fact that the cylinders are stored inside a building. Emergency air supply is also available for employees in the case of a release. Leak detectors are provided in each of the chlorine process rooms and will trigger audible and visible alarms outside the chlorination building and in the operator?s room located in the main building.\n\n\nOperating procedures are available to all employees in the Operation and Maintenance Manuals, which are located in the operator?s room of the main office building. These procedures cover normal and emergency operations of all the chlorination equipment and include specific steps to be carried out in the case of a release. All operators working in the plant have"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50830,
      "SummaryText": " been properly trained on the plant operations and emergency procedures. Classroom and on-the-job training is conducted monthly to refresh employees on safe handling procedures. There are also plant operators certified to use self-contained breathing apparatuses (SCBA?s), and training is provided on SCBA?s quarterly. Routine maintenance of the equipment is conducted by trained operators. An outside contractor is brought in annually to service the chlorination equipment.\n\nDue to the safety procedures discussed above and the adherence to these procedures by the plant operators, the North Water Plant has never had an accidental release. Although it is unlikely that the plant will have an accidental release in the future, emergency response plans are in place in the event one does occur. The Plant has coordinated with the Lowndes County Local Emergency Planning Committee (LEPC) to be included in the community emergency response plan. By being included in this plan, the LEPC will respond to a potential release at the facility. In addition to this, the plant has also set-up written procedures to be carried out by employees in the event of a release. These procedures outline safe handling procedures for the leaking containers and require immediate notification to the emergency response agency. The Plant has also been furnished with the Chlorine Handling Manual published by Wallace & Tiernan that explains personal safety procedures to be carried out during an emergency release. This emergency response plan will help the North Water Treatment Plant carry on its tradition of maintaining a flawless safety record."
    }
  ]
}