{
  "FacilityID": 51029,
  "FacilityName": "OMNOVA Solutions Inc. - Calhoun Latex Plant",
  "FacilityStr1": "1601 Highway 41 S.W.",
  "FacilityStr2": null,
  "FacilityCity": "Calhoun",
  "FacilityState": "GA",
  "FacilityZipCode": "30701",
  "Facility4DigitZipExt": "3651",
  "FacilityCountyFIPS": "13129",
  "LEPC": "Gordon County LEPC",
  "FacilityLatDecDegs": "34.464722",
  "FacilityLongDecDegs": "-084.935000",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.omnova.com",
  "FacilityEmailAddress": "john.finn@omnova.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "OMNOVA Solutions Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "OMNOVA Solutions Inc.",
  "OperatorStr1": "175 Ghent Road",
  "OperatorStr2": null,
  "OperatorCity": "Fairlawn",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44333",
  "OperatorZipCodeExt": "3300",
  "FTE": 67,
  "OtherEPAFacilityID": "30701THGDY1601H",
  "EPAFacilityID": "100000051463",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-14 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-02-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-02-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-02-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2016-07-19 00:00:00",
  "DeRegistrationEffectiveDate": "2016-06-06 00:00:00",
  "AnniversaryDate": "2009-06-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 34.464722,
  "FRS_Long": -84.935,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "C03",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 74105,
      "AltID": "Latex Manufacturing",
      "FacilityID": 51029,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 98218,
          "ProcessID": 74105,
          "ChemicalID": 57,
          "Quantity": 35000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 98219,
          "ProcessID": 74105,
          "ChemicalID": 120,
          "Quantity": 259000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 98220,
          "ProcessID": 74105,
          "ChemicalID": 155,
          "Quantity": 220000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 79655,
              "ProcessChemicalID": 98220,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 79656,
              "ProcessChemicalID": 98220,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 79657,
              "ProcessChemicalID": 98220,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 79658,
              "ProcessChemicalID": 98220,
              "ChemicalID": 120
            },
            {
              "FlamMixChemID": 79659,
              "ProcessChemicalID": 98220,
              "ChemicalID": 121
            },
            {
              "FlamMixChemID": 79660,
              "ProcessChemicalID": 98220,
              "ChemicalID": 135
            },
            {
              "FlamMixChemID": 79661,
              "ProcessChemicalID": 98220,
              "ChemicalID": 142
            },
            {
              "FlamMixChemID": 79662,
              "ProcessChemicalID": 98220,
              "ChemicalID": 145
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 75883,
          "ProcessID": 74105,
          "NAICSCode": "325212",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 43449,
              "Process_NAICS_ID": 75883,
              "SafetyReviewDate": "2004-04-21 00:00:00",
              "PHA_Date": "2004-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-04-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Remote Cameras",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-06-16 00:00:00",
              "TrainingReviewDate": "2003-06-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-04-17 00:00:00",
              "EquipmentInspectionDate": "2002-10-29 00:00:00",
              "EquipmentTested": "Ammonium Hydroxide Storage Tank (F-205)",
              "ChangeMgmtDate": "2003-02-27 00:00:00",
              "ChangeMgmtReviewDate": "2000-10-06 00:00:00",
              "PreStartupReviewDate": "2004-04-28 00:00:00",
              "ComplianceAuditDate": "2003-07-11 00:00:00",
              "AuditCompletionDate": "2005-12-31 00:00:00",
              "IncidentInvestigationDate": "2004-04-14 00:00:00",
              "InvestigationChangeDate": "2004-05-31 00:00:00",
              "ParticipationPlansReviewDate": "2003-05-29 00:00:00",
              "HotWorkPermitReviewDate": "2003-05-15 00:00:00",
              "ContractorSafetyReviewDate": "2004-01-31 00:00:00",
              "ContractorSafetyEvalDate": "2003-04-28 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 63228,
                  "PreventionProgram3ID": 43449,
                  "ProcessChemicalID": 98218
                },
                {
                  "PrimaryKey": 63229,
                  "PreventionProgram3ID": 43449,
                  "ProcessChemicalID": 98219
                },
                {
                  "PrimaryKey": 63230,
                  "PreventionProgram3ID": 43449,
                  "ProcessChemicalID": 98220
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 51029,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2002-06-14 00:00:00",
    "ERTrainingDate": "2002-04-23 00:00:00",
    "CoordinatingAgencyName": "Gordon County Fire Department",
    "CoordinatingAgencyPhone": "7066298851",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 51029,
      "SummaryText": "This document was prepared as part of the Risk Management Program (RMP) of the Calhoun Latex Plant, Performance Chemicals Division of OMNOVA Solutions Inc.  The RMP conforms to the legal requirements established by the U.S. Environmental Protection Agency (EPA).  The purpose of the RMP plan is to:\n\nO Describe existing safety systems at the Calhoun Plant designed to protect employees, community, environment, and process.\nO Share information with the community about Calhoun Plant operations including steps taken to minimize risk from regulated substances.\nO Comply with the applicable portions of 40 CFR Part 68 section 112®.\n\nThe following executive summary presents an overview of the Calhoun Latex Plant's accident prevention and emergency response programs.\n\n\nOMNOVA's COMMITMENT TO SAFETY:\n\nOMNOVA and its Calhoun facility are and always have been committed to safe operations as a number one priority. All employees at the Calhoun Plant are given the training, tools, and empowerment to perform their part of the operation in a safe manner.  Strict operational controls are in place to ensure safety from the conceptual stage through product development, manufacturing, and delivery to customers.  The Calhoun facility has a staff of safety and environmental professionals, engineers, and security personnel to assure implementation of, and ongoing commitment to, the highest standards of safe process management.  This experience and professional competency has resulted in many years of safe operations consistently exceeding industry averages.\n\n\nDESCRIPTION OF REGULATED PROCESS:\n\nThe Calhoun Latex Plant produces Styrene/Butadiene and Styrene/Butadiene/Vinyl Pyridine latices for the carpet and tire industries.  Our finished products are classified as non-hazardous and are in the form of a milky white liquid.\n\nOMNOVA's Calhoun facility has one regulated toxic material on site, 28% Ammonium Hydroxide Solution.  EPA regulations require one Worst Case Scenario to represent all regula"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 51029,
      "SummaryText": "ted toxic materials.\n\nOMNOVA's Calhoun facility has one regulated flammable material on site, 1,3-Butadiene.  EPA regulations require one Worst Case Scenario to represent all regulated flammable materials.\n\n\nFIVE YEAR ACCIDENT HISTORY:\n\nThe EPA regulations require regulated facilities to provide information about all accidents in the last 5 years involving an RMP regulated substance if the accident resulted in: (1) death, injury according to the RMP definition, or significant property damage on site; or, (2) known deaths, injuries, property or environmental damage off site.\n\nThe Calhoun facility has had no accidents meeting the regulatory definition described above in the past five (5) years.\n\n\n HAZARD ASSESSMENT:\n\nAs part of the EPA regulations, and Process Safety Management requirements of the Occupational Safety and Health Administration (OSHA), the Calhoun facility is required to conduct hazard assessments of the regulated process.  EPA regulations specifically require offsite consequence analyses in the form of Worst Case Scenarios and Alternative Release Scenarios for certain regulated substances.\n\nOMNOVA is concerned that these Worst Case Scenarios required to be disclosed under the regulations may overstate the risk of a worst case release.  For example, the EPA published lookup tables do not take any local physical conditions into account.  The Georgia Environmental Protection Division (GEPD) has highly recommended the use of the EPA published lookup tables and the use of the EPA software RMPCOMP for completion of Worst Case Scenarios for facilities in Georgia, and OMNOVA has complied with this recommendation.  However, this recommendation does not allow for more accurate calculations for release scenarios based upon recognized risk analysis techniques, or models, which are allowed by the federal regulation.  Both the lookup tables and models can still result in highly improbable and in some cases physically impossible risk scenarios.  For example, neithe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 51029,
      "SummaryText": "r lookup tables nor models allow consideration of existing active safety devices such as sprinkler systems that can reduce the severity of an accidental release.\n\nOMNOVA has also prepared Alternative Release Scenarios which it believes are more accurate predictions of potential accidental releases from the Calhoun facility.  Alternative Release Scenarios are by definition more likely to occur than Worst Case Scenarios but are still very improbable due to engineering and administrative controls at the Calhoun facility.\n\n\nWORST CASE AND ALTERNATE RELEASE SCENARIOS:\n\nEPA regulations require facilities to develop one Worst Case Scenario to represent all toxic substances and one Worst Case Scenario to represent all flammable substances from a list of regulated materials.  Additional Worst Case Scenarios are required if different public receptors (off site residences, businesses or community buildings within a possible impact radius) could be affected by the release of another regulated material.  OMNOVA is not subject to this additional requirement.\n\nIn addition, EPA regulations require facilites to develop one Alternate Release Scenario to represent all toxic substances and one Alternate Release Scenario to represent all flammable substances.  \n\nDue to Homeland Security issues, the off-site consequence analysis descriptions for both the worst case scenarios and alternate release scenarios have been removed from the Executive Summary section of this RMP submittal.  This revision is consistent with the requirements of 40 CFR 68.155, as amended April 9, 2004, 69 FR 18819.\n\nIn addition, the Calhoun facility does not believe that either of the worst case scenarios presented in the RMP are likely and may not be possible due to the conservative assumptions required by the regulation.  For example, the atmospheric conditions used to develop the lookup tables are unlikely, if not impossible.  Such as, the temperature used must equal the highest area temperature in the last 3 yea"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 51029,
      "SummaryText": "rs, usually occurring in the afternoon, and the wind must be very low with very stable air, usually occurring shortly after midnight.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM:\n\nOMNOVA's Calhoun facility began a formal Process Safety Management Program in 1992 when OSHA promulgated 29 CFR 1910.119.  Process Safety Management acting in concert with effective engineering design, Employee Safety Programs, EPA's RMP, and Emergency Response Programs make up the Calhoun facility's Accidental Release Prevention Program.\n\nWhen examining the Worst Case and Alternative Release Scenarios, it is important to keep in mind that OMNOVA has numerous preventative measures in place at its Calhoun facility to effectively prevent these situations.  These measures, most of which were not taken into consideration under the EPA regulations include leak detection systems, continuous monitoring and automated controls, automatic shutdowns, deluge water systems, flammable vapor sensors for early detection, secondary containment dikes, and employees specially trained in handling chemicals and emergency response methods.\n\n\n\n EMERGENCY RESPONSE PLAN:\n\nOMNOVA's overall safety efforts at Calhoun consist of measures to prevent the release of hazardous material, as well as programs to mitigate the effects if a release should occur.  The Calhoun facility has a trained and equipped team of volunteer emergency responders capable of handling most foreseeable emergency situations.  Importantly, coordination with local safety forces is a key element of the emergency response planning process.  Specific plans are in place to respond to chemical emergencies within the facility.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\nIntrinsic safety is a key element in the design of all process equipment at OMNOVA's Calhoun facility.  All covered process equipment design and modification is subject to formal Hazards Analysis Procedures.  During a hazard analysis, recommendations are made for the improvement of the process."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 51029,
      "SummaryText": "Application of new design principals to existing equipment is also an important element of continuous process safety improvement.  In addition, formal accident and incident investigation procedures are in place so that causes of even the smallest failures are identified and corrected.\n\nOne of the more recent planned changes to improve plant safety is the electrical wiring upgrade project.  This significant capital project began in the year 2002 and will continue into the year 2005.  This project involves upgrading all of the electrical wiring throughout the entire facility.  This wiring upgrade will maintain and improve reliability for all electrical systems at the facility which will benefit the process and safety systems.  Another significant project, scheduled for completion this year, with positive safety benefits is the replacement of the facility's chiller system.\n\nIn addition, over the past five (5) years, several other implemented projects have resulted in increasing the plant's safety through equipment improvements and upgrades.  The following will list some of the more significant recent projects:\n\n       -    Ammonium Hydroxide Charge System Upgrade \n       -    Electrical Transformer Replacement \n       -    Fire Protection Diesel Engine Replacement \n       -    Replacement and Rebuilding of Butadiene Compressors and Butadiene Pump Seal and Piping System Upgrades"
    }
  ]
}