{
  "FacilityID": 5102,
  "FacilityName": "D'Arrigo Brothers Company",
  "FacilityStr1": "11000 Blackie Road",
  "FacilityStr2": null,
  "FacilityCity": "Castroville",
  "FacilityState": "CA",
  "FacilityZipCode": "95012",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": null,
  "FacilityLatDecDegs": "36.757917",
  "FacilityLongDecDegs": "-121.744528",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 22011291,
  "ParentCompanyName": "n/a",
  "Company2Name": "n/a",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "John D'Arrigo",
  "OperatorStr1": "P.O.Box 1245",
  "OperatorStr2": null,
  "OperatorCity": "Castroville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95012",
  "OperatorZipCodeExt": null,
  "RMPContact": "John D'Arrigo",
  "RMPTitle": "President",
  "FTE": 120,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000063414",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-09 00:00:00",
  "SafetyInspectionBy": "Fireman's Fund Insurance Co.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-02-15 00:00:00",
  "DeRegistrationEffectiveDate": "2006-12-18 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 36.75756,
  "FRS_Long": -121.74686,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5994,
      "AltID": "Ammonia",
      "FacilityID": 5102,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 6140,
          "ProcessID": 5994,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        },
        {
          "Process_NAICS_ID": 6141,
          "ProcessID": 5994,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6516,
          "ProcessID": 5994,
          "ChemicalID": 56,
          "Quantity": 19600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506516,
          "ProcessID": 5994,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5102,
      "SummaryText": "SCOPE\nThe EPA RMP regulation requires that an Executive Summary be provided as part of the registration submitted to the EPA.  The following areas are addressed in this summary:\nAccidental Release Prevention and Emergency Response Policies\nStationary Source Activities and Regulated Substances Handled\nWorst-Case and Alternative-Case Release Scenarios\nPrevention Program\nFive-Year Accident History\nEmergency Response Program\nPlanned Changes to Improve Safety\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nD'Arrigo is committed to complying with all of the regulatory requirements of the EPA Risk Management Program and the California Accidental Release Prevention Program.  D'Arrigo has developed their Risk Management Plan / Process Safety Management (RMP/PSM) Manual to document D'Arrigo policies addressing the implementation of these regulations.  The PSM sections pertain to the prevention of accidental releases and include the Process Hazard Analysis study and procedures for operating, training, maintenance and others. The RMP sections pertain to management systems and emergency response and include the Hazard Assessment (Offsite Consequence Analysis) Report.\n\n\nSTATIONARY SOURCE ACTIVITIES AND REGULATED SUBSTANCES HANDLED\nThe D'Arrigo Castroville facility provides product cooling and short-term storage for fresh vegetables.  D'Arrigo processes some of the vegetables for the \"fresh cut market\".  This processing includes cooling, cleaning, cutting and packaging vegetables. \nThe facility is located in an industrial area of Castroville, which is bordered by residential areas.\nAmmonia is used as the refrigerant in the Main Refrigeration System (\"System\").  This is a direct, mechanical refrigeration system, which was built in 1985 and expanded in 1994 and 1998. The System contains 19,600 pounds of ammonia. \nThe two largest vessels and most of the ammonia equipment are housed inside buildings. The remaining equipment and piping associated with the System is eith"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5102,
      "SummaryText": "er under roofed areas or on the roof.  The entire facility is fenced and gated.\n\n\nWORST-CASE SCENARIO ANALYSIS\nThe regulation requires that the Worst-Case Release Scenario use the ammonia quantity in the largest vessel or pipe. Administrative controls were considered in determining the largest quantity.  The High Pressure Receiver (HPR) and Suction Accumulator (SA-1) are the two largest vessels (or pipes) in D'Arrigo's Main Refrigeration System.  \nSA-1 is slightly larger than the HPR; however, the maximum quantity in SA-1 is limited by two administrative controls (e.g., safeties).  First, the mechanical float (High Level Alarm) on SA-1 issues an alarm to the operator.  The operator takes corrective actions (e.g., close liquid supply valves) and begins to troubleshoot the reasons for the high level.\nAs a back-up, a second mechanical float (High Level Shutdown) stops compressors (the driving force). \nConclusion:  Use the HPR vessel quantity of 13,343 pounds based on the vessel being 100% full.\nFor modeling the Worst-Case Scenario, the EPA RMP*Comp Version 1.06 computer program  was used.  The engine room which houses the HPR provides passive mitigation (reduces the release rate).  RMP*Comp provided the following definition of  the \"release in enclosed space, in direct contact with outside air\" mitigation:\n\"An enclosed space in direct contact with outside air would be a building or shed with openings to the outside (as opposed to a room inside a building or a very airtight building.)\"\nThe Worst-Case Scenario resulted in a hazard distance of 1 mile and the toxic endpoint of 200 PPM.  Within this distance, there are approximately 3,880 people plus one (1) school, one (1) child daycare and major industrial buildings.\nNOTE: It is important to consider that the Worst-Case Scenario is extremely unlikely to occur since this scenario does not consider any safety features of the system  - either in design or operation.  The scenario parameters are established by the regulation "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5102,
      "SummaryText": "and provide uniformity for dialog between the industry, community and regulatory agencies.\n\n\nALTERNATE-CASE RELEASE SCENARIO ANALYSIS\nThe Alternate-Case Scenario selected was an oil draining accident at the SA-1 (suction accumulator) in Engine Room #1.  The regulation allows the facility to select the Alternate-Case Scenario.  In selecting the scenario, the Process Hazard Analysis was considered.  Of the potential \"causes of deviation\",  the oil draining scenario was selected because it would require human error and no active mitigation measures are currently in place for this scenario as described below:\n\nAn operator begins to drain oil at SA-1 without first checking the ammonia level (visual sight glass).  The vessel is assumed to have a liquid level just below the High-Level Alarm float.  After opening the >\" globe valve to drain oil into a bucket, the operator leaves the engine room, which is against D'Arrigo policy.  Once the oil drains, the liquid ammonia in SA-1 drains out. \n\nFor modeling of the Alternate-Case Scenario, this analysis used a program approved by the EPA, ALOHA .\nThe engine room which houses the HPR provides passive mitigation (reduces the release rate).  However, ALOHA does not consider whether a release occurs inside or outside.  The hazard distance is therefore overestimated (the distance is longer than it should be).\nThe Alternate-Case Scenario resulted in a 6,010 pound release with a hazard distance of 154 yards and the toxic endpoint of 200 PPM.  Within this distance, there are approximately 31 people. \nNOTE: To reduce and minimize the possibility of this scenario occurring, D'Arrigo will be installing an oil pot (ASME vessel) at SA-1 to eliminate direct oil draining as described.  Oil would gravity drain from SA-1 to the oil pot.  When oil draining is required, the operator would close valves to isolate the oil pot from SA-1.  Then, the operator would open the oil pot drain valve to drain oil.  \nThe maximum release would be reduced to abo"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5102,
      "SummaryText": "ut 60 pounds of ammonia (if the oil pot at 100% full of ammonia).\n As part of the Management of Change, D'Arrigo will provide operator training on this procedure for the new oil pot. \n\n\nPREVENTION PROGRAM\n\nD'Arrigo's Prevention Program is described in the RMP/PSM Manual.  The RMP Prevention Program is equivalent to OSHA's Process Safety Management Program (PSM).  The Prevention Program implemented by D'Arrigo is essential to help prevent releases and to minimize the effects if a release does occur.\nKey objectives of D'Arrigo Prevention Program are briefly described below:\n\n1. Maintain current and complete refrigeration system technical information. (Addressed under the Process Safety Information chapter)\n2. Thorough team evaluation of the refrigeration system.  The evaluation considers a number of potential problems including: mechanical problems, human errors, and external events (e.g., earthquakes).  All safety recommendations developed by the team are reviewed and addressed by D'Arrigo.  (Addressed under Process Hazard Analysis chapter.)\n3. Written procedures and policies that establishes how the refrigeration system should be operated and maintained and how to investigate accidental releases. (Addressed under Operating Procedures, Mechanical Integrity, and Incident Investigation chapters.)\n4. Certification of refrigeration operators to safely operate the refrigeration system.  D'Arrigo certifies operators following completion of operator  training and D'Arrigo's confirmation of the operator's ability apply what they have learned.  (Addressed under Training chapter.)\n5. Employee involvement in the Prevention Program.  This is addressed on two levels.  First, refrigeration equipment operators participate in the planning and evaluation of the Prevention Programs (e.g., Process Hazard Analysis study team, writing and/or reviewing operating procedures, Incident Investigation team, etc.).  This involvement encourages ownership of the Prevention Program and positively "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5102,
      "SummaryText": "affects the operators' day-to-day activities.  \nSecond, all D'Arrigo employees (direct hires and contract) at this facility receive ammonia awareness training.  Additionally, they have access to the RMP/PSM information.  These activities improve the overall safety of the employees. (Both levels are addressed under Employee Participation chapter)\n6. Implementation of additional measures when changes (procedural or mechanical).  These measures begin before any changes are made and may include a Process Hazard Analysis, operator training, and Process Safety Information updates plus other measures required by D'Arrigo's Management of Change Procedure.  \nIf a mechanical change is required, D'Arrigo has  a procedure for selecting a contractor based on the company's experience and safety history. Additionally, if welding, grinding, or other \"Hot Work\" occurs close to the refrigeration system, a D'Arrigo Hot Work permit is required.  The purpose of  the permit and the associated Hot Work procedure is to minimize the possible of a fire. \nFollowing completion of a mechanical change, a pre-startup safety review is required before the system can be started .  This review is based on the procedures and forms recommended by IIAR (International Institute of Ammonia refrigeration). (These areas are addressed under Management of Change, Contractor Qualifications, Hot Work Permit, and Pre-Start-up Safety Review chapters.)\n7. Verification of D'Arrigo's compliance with the RMP/PSM program.  This self-audit process is an important tool to confirm whether each of the elements in the Prevention Program  (and the Risk Management Program) have been implemented and properly documented by D'Arrigo personnel.  D'Arrigo has established a Management System procedure to address any shortcomings, which the audit may find. (Addressed under Compliance Audit chapter.)   \n8. Minimize employee injury and illness.  (Addressed under Illness and Injury Prevention Program chapter.)\n\n\nFIVE-YEAR ACCIDENT HIS"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5102,
      "SummaryText": "TORY\nD'Arrigo had no reportable accidental ammonia releases in the last five years.\n\n  \nEMERGENCY RESPONSE PROGRAM\nD'Arrigo's Emergency Response Program is described in their Business /Emergency Response Plan for the Castroville facility.\nThis plan includes procedures for evacuations, notifying responders and governmental agencies.  The plan also includes first aid procedures for immediate care and instructions for follow-up medical care when necessary.   The plan addresses training requirements for employees including production employees, supervisors, managers, and operators.  Evacuation drills are an important part of the training. \nUnder D'Arrigo's Emergency Response policy, D'Arrigo employees who have been trained as \"First Responders\" may respond to small releases that can be handled without entering the danger area.  For all other releases, D'Arrigo will evacuate and rely on off-site responders (e.g., the fire department).\n\n \nPLANNED CHANGES TO IMPROVE SAFETY\nThe Process Hazard Analysis (PHA) study team developed recommendations to improve safety and to reduce the possibility of a release.\nKey recommendations identified during study included;\n' Improve the attic space ventilation, access, and lighting.\n' Develop more written policies and procedures.\n' Pipe pressure relief vents (PRV) to  ammonia diffusion tanks (existing or new)  to minimize the effect of a PRV release.\n' Add oil pots for safer oil draining.\nD'Arrigo has reviewed and decided to implement all of these measures.  Implementation of the measures has begun according to the schedule set by D'Arrigo."
    }
  ]
}