{
  "FacilityID": 51170,
  "FacilityName": "Linda County Water District",
  "FacilityStr1": "909 Myrna Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Marysville",
  "FacilityState": "CA",
  "FacilityZipCode": "95901",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06115",
  "LEPC": "Region III LEPC",
  "FacilityLatDecDegs": "39.095556",
  "FacilityLongDecDegs": "-121.584167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 11816782,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Linda County Water District",
  "OperatorStr1": "1280 Scales Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Marysville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95901",
  "OperatorZipCodeExt": null,
  "RMPContact": "Douglas Lofton",
  "RMPTitle": "Manager",
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000200472",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-04-13 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-03-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-03-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-03-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-03-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 74343,
      "AltID": "Wastewater treatment",
      "FacilityID": 51170,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 76126,
          "ProcessID": 74343,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 98624,
          "ProcessID": 74343,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 98625,
          "ProcessID": 74343,
          "ChemicalID": 49,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 598624,
          "ProcessID": 74343,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 598625,
          "ProcessID": 74343,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 51170,
      "SummaryText": "INTRODUCTION\nThis is a Risk Management Program (RMP) plan for the Linda County Water District?s (LCWD) wastewater Treatment Plant (WWTP) and drinking water well sites located within the LCWD service area. This Plan was prepared in accordance with the Federal Risk Management Plan [Clean Air Act 112(r)] and California Accidental Release Prevention (CALARP ? Title 19, Division 2, Chapter 4.5) Program requirements.\nThe WWTP chlorine systems are subject to the federal RMP program because of the quantity stored. The sulfur dioxide at the WWTP and chlorine at well sires are are subject to the requirements of CALARP Programs due the quantity of chlorine used and stored. This combined plan meets the requirements of CALARP and federal RMP.\nFACILITY DESCRIPTIONS\nAt the LCWD WWTP, located at 909 Myrna Avenue in Yuba County, California (Figure ES-1), chlorine is stored in up to eight one-ton cylinders in a building that has leak detectors and an automatic ventilations system with an air scrubber. Up to four one-ton cylinders of sulfur dioxide are stored in a separate room that has leak detection and self closing doors and ventilation shut off.\nThe three LCWD well sites that have chlorine are located throughout the LCWD service area. At each well site, chorine is stored in up to six 150-pound cylinders, except for Well 14, where up to 14 150-pound cylinders are stored.\nREGULATED SUBSTANCES\nThe LCWD well sites store and use the regulated substance of anhydrous chlorine (CAS# 7782-50-5). The regulated substances at the WWTP are anhydrous chlorine and anhydrous sulfur dioxide (CAS # 7446-09-5).\nFEDERAL RMP, CALARP AND OSHA PSM APPLICABILITY\nThe Federal Risk Management Program (RMP) program and California Accidental Release Prevention (CalARP) program require facilities that handle regulated substances on the federal extremely hazardous substances list (or the state list of regulated substances), in quantities greater than federal or state threshold quantities, to submit a RMP plan. "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 51170,
      "SummaryText": "The chlorine quantities at the well sites and the sulfur dioxide at the WWTP exceed the CalARP threshold quantities. Therefore, an Accidental Release Prevention Plan is required for the CalARP program. Also, the quantity of chlorine and sulfur dioxide at the WWTP exceeds the Federal RMP threshold quantity, resulting in the need to submit a RMP for the Federal RMP program.\nThe CalARP thresholds for chlorine and sulfur dioxide are 100 pounds and 500 pounds, respectively. The chemicals are subject to CalARP requirements until it is injected into water (reducing the concentration to below 1 percent). LCWD stores a range of one to six 150-pound cylinders of gaseous chlorine at each well. The CALARP threshold for sulfur dioxide is 500 pounds.\nBased on accident history and quantities, the chlorine storage and feed systems at the well sites and the sulfur dioxide qualify for Program 2 Prevention Programs.\nThe federal Occupational Safety & Health Administration (OSHA) Process Safety Management (PSM) standards apply, which puts most of the facilities into the program level 3 category. To simplify this document, all facilities have Program Level 3 required information. \n\nACCIDENTAL RELEASES DURING PAST 5 YEARS\nLCWD has not had any releases during the past five years that resulted in deaths, injuries or significant property damage on site, or known off site deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\nACCIDENTAL RELEASE PREVENTION PROGRAM\nLCWD has developed an accidental release prevention program to minimize the potential for an accidental release. The prevention program includes the following elements:\n?    Continuation of the employee participation program to ensure that all personnel working with chlorine and sulfur dioxide are aware of the CalARP program and relevant Process Safety information, and are actively consulted regarding safety issues.\n?    Process Hazard Review to identify, evaluate and control risks associated with proc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 51170,
      "SummaryText": "ess hazards and the regulated substances. \n?    Maintenance of updated, accurate and written standard operating procedures. All procedures must be reviewed and certified annually.\n?    Initial safety training and three-year refresher training for all operators and maintenance staff working with covered processes.\n?    Procedures to ensure that all contractors receive the same level of safety training that LCWD provides for its own employees for working on or around the covered processes.\n?    Review of the design of all equipment and controls for the chlorine and sulfur dioxide systems to ensure they are properly designed and installed.\n?    Rigorous safety reviews conducted prior to system startup, if any equipment or operations are modified.\n?    Regular inspection of all equipment, monitoring systems and controls, with stringent documentation of all inspections.\n?    Prompt corrective action for any non-conforming items identified by the regular inspections.\n?    Stringent investigation of any incidents that have the potential to have caused chlorine or sulfur dioxide releases.\n?    Development of Emergency Response Plans for chlorine and sulfur dioxide.\n?    Audits of the RMP program every 3 years.\nEMERGENCY RESPONSE PROCEDURES\nLCWD staff utilizes the Emergency Response Plans to provide step-by-step procedures for emergency response in the unlikely event of an accidental release. The key elements of the Emergency Response Plan are as follows:\n?    All LCWD staff members that work with chlorine or sulfur dioxide are trained in emergency response procedures.\n?    Guidelines for leak/spill confirmation, classification and remediation, and evacuation are provided.\n?    Important emergency contact numbers are listed.\n?    The chlorine and sulfur dioxide storage facilities are equipped with electronic gas detectors. The gas detectors have visual and audible alarms and alert LCWD when the preset amount of gas is detected. The WWTP chlorine facility has a scrubber that automatically starts when a specified leve"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 51170,
      "SummaryText": "l of gas is detected. \n?    In the event of a large release, LCWD would immediately contact the Fire Department. The Fire Department would conduct emergency response and repair the leak. LCWD has staff trained to handle the remediation of minor leaks/spills.\nHYPOTHETICAL ACCIDENTAL RELEASE SCENARIOS\nThe Risk Management Plan must assess the downwind impacts of hypothetical accidental releases. EPA requires facilities to model the distance that a plume of released gas would travel before it dispersed to an ambient concentration equal to the ?Toxic Endpoint Concentration.? The Toxic Endpoint Concentrations for various compounds were specified by EPA, and are generally concentrations that would cause no physical harm but could interfere with people?s ability to leave the area. The Toxic Endpoint Concentrations for the RMP chemicals at the facility are 0.0087 milligrams per liter (mg/l) of chlorine in air and 0.0078 mg/l of sulfur dioxide in air. In accordance with EPA?s rule, hypothetical accidental release scenarios were developed for both chlorine and sulfur dioxide. \nSAFETY IMPROVEMENTS\nLCWD will continue to improve safety by continually updating process safety information, providing employee training, encouraging employee participation and incorporating system improvements identified during scheduled hazard reviews. Additional safety improvements will be incorporated into the design for the WWTP plant expansion."
    }
  ]
}