{
  "FacilityID": 51182,
  "FacilityName": "Henningsen Cold Storage Co.Twin Falls Mfg.",
  "FacilityStr1": "432 South Park",
  "FacilityStr2": null,
  "FacilityCity": "Twin Falls",
  "FacilityState": "ID",
  "FacilityZipCode": "83301",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16083",
  "LEPC": "Twin Falls County LEPC",
  "FacilityLatDecDegs": "42.552310",
  "FacilityLongDecDegs": "-114.486050",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.henningsen.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Henningsen Cold Storage Co.",
  "Company2Name": null,
  "CompanyDUNS": 7873243,
  "Company2DUNS": 0,
  "OperatorName": "Henningsen Cold Storage Co.",
  "OperatorStr1": "21435 NW Cherry Lane",
  "OperatorStr2": null,
  "OperatorCity": "Hillsboro",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97124",
  "OperatorZipCodeExt": "6630",
  "RMPContact": "Paul Henningsen",
  "RMPTitle": "VP Engineering Corp. Development",
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000201961",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-10-18 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-03-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-03-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-03-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-07-03 00:00:00",
  "DeRegistrationEffectiveDate": "2017-06-13 00:00:00",
  "AnniversaryDate": "2013-03-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 74359,
      "AltID": "Refrigeration Warehouse",
      "FacilityID": 51182,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 76144,
          "ProcessID": 74359,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 98646,
          "ProcessID": 74359,
          "ChemicalID": 56,
          "Quantity": 10300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 598646,
          "ProcessID": 74359,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 51182,
      "SummaryText": "RISK MANAGEMENT PROGRAM-ACCIDENTAL RELEASE PREVENTION PROGRAM\nHenningsen Cold Storage Co. (HCS) Twin Falls, Id, Manufacturing (MFG) facility is a public refrigerated warehouse. The facility maintains a freezer storage area of approximately 6 million cubic ft. which is used to store perishable products.  Freezer storage areas at the facility operate at 0?F or below.  The facility has approximately six truck loading and unloading spots and four railcar spots as well as an additional four railcar siding to aid in the transportation of products.  In order to maintain desired temperatures, a mechanical refrigeration system using anhydrous ammonia as a refrigerant is employed.  The refrigeration system is a closed loop system.  The ammonia is not used or mixed in any manner with other chemical processes.\n\nFACILITY CONSTRUCTION: The facility was designed and constructed in accordance with various Mechanical and Building Codes in effect at the time of construction.  These codes and guidelines outline requirements for the safe operation of ammonia refrigeration systems.\n\nSAFETY FEATURES:  The ammonia refrigeration system has many safety features.  Safeties include but are not limited to pressure relief valves, stop valves, ammonia detectors, a computerized refrigeration monitoring and control system, as well as trained and experienced operators.  Much of the safety associated with the system, is also inherent in the policies and procedures that govern the operation of the system.  For example, the facility operates in accordance with OSHA?s Process Safety Management (PSM) standard (Process Safety Management of Highly Hazardous Chemicals, 29 CFR 1910.119) and EPA's Risk Management Program (RMP, 40 CFR Part 68). \n\nMANAGEMENT?S COMMITMENT TO SAFETY:  Management takes safety very seriously and mandates that the facility maintain a safe working environment for employees, visitors, neighbors, and products at all times.  Employees are trained on all safety issues relative to their "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 51182,
      "SummaryText": "duties and tasks and are made aware of all required regulated safety programs.  \n\nA Safety Committee has been established at the facility.  Committee members are hourly employees, supervisors and/or management. The primary responsibility of the Safety Committee is to meet, discuss and address safety issues.  The Committee also may conduct a safety walk-through at various times to look for possible unsafe conditions or procedures that may exist in and around the facility.  \n\nManagement is committed to providing the necessary resources to ensure that all elements within the regulations are adhered to.\n\nMANAGEMENT SYSTEM:  A Management System has been developed and implemented to ensure that each element within PSM and RMP regulations are properly addressed.  Each person outlined in the ?Responsibilities? section of the Management System is assigned various tasks and/or components of the regulations and is expected to aid in the development and implementation of the components as a whole.  \nThe group works as a team to ensure that not only all elements are met but also to ensure that:  (1) Employees participate in the development and implementation of the programs (2) Employees aid in gathering Process Safety Information, (3) Operating procedures are developed, implemented and certified annually pertaining to the refrigeration system. (4) Safe Work practices are enforced, (5) Proper personnel serve as members of the Process Hazard Analysis (PHA) team and that all recommendations from the PHA are addressed in a timely manner. (6)  Affected employees are properly trained as well as those whose jobs working on or near the refrigeration system are appropriately trained, (7) Contractors are qualified to work on or near the refrigeration system and are informed on potential health and safety risks associated with the system,  (8) Hot Work Permits are properly filled out and all persons affected by the hot work are aware of potential hazards, (9) Compliance Audits are perform"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 51182,
      "SummaryText": "ed and recommendations from the audits are assigned to proper personnel, and are addressed in a timely manner., (10)  Management of Change and Pre-Startup Safety Reviews are filled out and reviewed prior to conducting the change on the system and prior to placing ammonia into the system, (11)  All employees are trained on all elements of the Emergency Action Plan and that the plan is reviewed and certified at least annually, (12) Mechanical Integrity Inspections and tests are performed to ensure that the ammonia equipment is properly operating.  All deficiencies are noted and addressed in a timely manner.  (13) Incident Investigations are performed on accidental ammonia releases as well as near-misses.  Investigations are utilized to improve employee actions during an emergency. \n\nFIVE YEAR ACCIDENT HISTORY:  There have been no reportable ammonia related accidents, incidents or releases at the facility during 2002 - 2007.  \n\nEMERGENCY ACTION PROGRAM:  The facility has established an Emergency Action Plan. The Plan explains what actions employees, contractor employees, and visitors are to take in the event of an emergency which include steps to take in the event of a fire, earthquake, tornado, etc. \nThe Emergency Action Plan states that all employees shall: \n1) Notify a supervisor or main office personnel to begin the facility evacuation by activating the public announcement (PA) system.\n2) Notify the appropriate emergency responders. \n3)  Notify on-site contractors or visitors to evacuate the building. \n4) Assist in a safe and orderly evacuation. \n5) Gather and remain at the designated assembly area(s) for a head count.  \n\nIn the event of an ammonia release, employees are instructed to follow the steps as noted above.  Maintenance employees that have been properly trained on the usage of the hand-held ammonia detector may use it, along with the proper PPE, and the ?buddy system? in an attempt to locate the ammonia leak.  In the event that readings on the detector re"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 51182,
      "SummaryText": "ach 300 parts per million (ppm) employees are instructed to evacuate immediately to the designated assembly area, report all findings to Supervisors and/or Management and wait for further instruction.    \n\nThe Emergency Action Plan is reviewed and updated at least once per year. \n\nPREVENTION PROGRAM 3:  \n1. Employee Participation:  Employees such as the Chief Engineer, Assistant Engineer, Engineering Supervisors and Management are actively involved in the development and implementation of PSM and RMP programs.  Employees aid in gathering Process Safety Information, development and implementation of Operating Procedures, are members of the Process Hazard Analysis (PHA), aiding in the completion of recommendations from both PHA and Compliance Audits, screening process for hiring Contractors, \n\n2. Process Safety Information: Piping and Instrumentation Diagrams (P&ID) have been developed where all piping and major components of the ammonia refrigeration system have been noted and assigned an identifier. Information has been gathered to enable employees to identify and understand the potential hazards of the system. The process safety information includes the Material Safety Data Sheet (MSDS) for anhydrous ammonia.  An ammonia inventory is collected and retained in the PSI Library.  Relief Valves are identified and labeled.  Equipment within the system is operated within the good engineering practices.  \n\n3. Process Hazard Analysis: A formal study of the ammonia refrigeration system with Management, Safety, and Maintenance personnel was conducted using the HAZOP method to evaluate the potential hazards of the system.  A recommendation summary is used to track completion of all recommendations. \n\n4. Operating Procedures: Written standard operating procedures (SOPs) have been developed and implemented to ensure safe operation of the refrigeration system.  SOPs are used when training and are annually certified by the Chief Engineer.   \n\n5. Training: All ammonia refrigeratio"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 51182,
      "SummaryText": "n maintenance employees, Chief Engineers and Assistant Engineers are trained on all aspects of the ammonia system.  Each Engineer is encouraged to attend various types of training relative to the ammonia system and/or their respective duties and tasks.  \n\n6. Contractors: Contractors are screened and evaluated prior to performing work-on or near the ammonia refrigeration system. Contractors are trained on the safety and hazards of the system and are required to meet with the Chief Engineer prior to working on the system.  A training session is held to ensure that all aspects of safety have been addressed.  All documentation of training is retained.  \n\n7. Pre-Startup Safety Review (PSSR):  A PSSR includes policy and procedures as well as a checklist to ensure that all documents relating to the PSSR are collected, reviewed and retained.  Each Engineer is trained on the PSSR.     \n\n8. Mechanical Integrity: A Mechanical Integrity policy and procedures have been implemented at this facility.  Mechanical Integrity Inspections are performed annually.  Engineers conduct daily walk-through inspections, maintain system log sheets, generate preventative maintenance work orders, and conduct periodic vibration, oil and thermal imaging analyses of system components.  \n\n9. Hot Work Permits: A Hot Work Permit program is in place at this facility which requires Hot Work Permit?s to be completed prior to working on or near the process. \n\n10. Management of Change (MOC):  A MOC system is implemented.  MOC?s are planned, tracked, and reviewed using the Management of Change policies and procedures, as well as utilizing the requirement documentation and forms. \n\n11. Incident Investigation: All incidents and near-misses are investigated, reviewed, and documented using an incident investigation form.  Deficiencies are noted in the de-briefing and are addressed in a timely manner.\n\n12. Emergency Planning and Response: The facility does not respond to ammonia releases, therefore they do not ha"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 51182,
      "SummaryText": "ve an Emergency Response Plan\n\n13. Compliance Audits: Audits are conducted every three years to ensure that all elements within the scope of PSM and RMP are adhered to.  \n\n14. Five-Year Accident History:  No ammonia related incidents have occurred at this facility in the past five years. Accidents are reported immediately.  \n\n15. Description of plans to improve safety:  Continued safety education is paramount to HCS core values.  Engineers are mandated to attend safety training annually.  If the facility expands, Management ensures that all equipment will be rated and constructed for proper usage using good engineering practices and applicable codes.  Elements within PSM and RMP will be addressed in a timely fashion and all employees whose jobs are affected by any improvement will be properly trained."
    }
  ]
}