{
  "FacilityID": 5120,
  "FacilityName": "American Anglian Buffalo Water Treatment Plant",
  "FacilityStr1": "2 Porter Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Buffalo",
  "FacilityState": "NY",
  "FacilityZipCode": "14201",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36029",
  "LEPC": "Erie County LEPC",
  "FacilityLatDecDegs": "42.896472",
  "FacilityLongDecDegs": "-78.901278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "JCAMPOLONG@AAET.COM",
  "FacilityDUNS": 0,
  "ParentCompanyName": "American Water Works Company, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "AmericanAnglian",
  "OperatorStr1": "2 Porter Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Buffalo",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14201",
  "OperatorZipCodeExt": null,
  "FTE": 42,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000065546",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-12-17 00:00:00",
  "SafetyInspectionBy": "PESH",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 42.89716,
  "FRS_Long": -78.89965,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6017,
      "AltID": "Chlorination",
      "FacilityID": 5120,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 6544,
          "ProcessID": 6017,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6164,
          "ProcessID": 6017,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2561,
              "Process_NAICS_ID": 6164,
              "SafetyReviewDate": "1999-05-01 00:00:00",
              "PHA_Date": "1999-06-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-06-21 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-01 00:00:00",
              "TrainingReviewDate": "1999-06-21 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-21 00:00:00",
              "EquipmentInspectionDate": "1999-06-21 00:00:00",
              "EquipmentTested": "Flexible connectors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-21 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-21 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-21 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-21 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "American Anglian Buffalo Water Treatment Facility's chlorination system contains equipment to minimize the frequency, potential, and severity of a chlorine release.  The chlorination system has the following safeguards:  chlorine sensors that activate an alarm system when the ambient chlorine levels exceed 10 parts per million and automatically activates the chlorine feed room's exhaust fan to vent the chlorine gas to the scrubber room for neutralization,  periodic leak and pressure testing, periodic visual inspections, vacuum regulator, pressure relief valves, fusible plugs on the one-ton containers for pressure relief, trunnions for one-ton container storage, automatic switchover system, chlorine gas filters, liquid chlorine expansion chambers, chlorine pressurereducing valves, flow control valves, pressure gauges, residual chlorine analyzer, high and low water temperature switches on the vaporizers that activate an alarm, low pressure switches that activate the automatic switchover system, emergency back-up power, low water level alarm and low water level cutoff switch on the vaporizers, water temperature control thermostat on the vaporizers, cathodic protection on the vaporizers, ejector check valve, manual rate valve, gas flowmeter, differential pressure regulator, and vacuum switches.\n\nThe administrative controls for the chlorination system are:  preventative maintenance procedures and records, standard operating procedures that include daily inspections of process parameters, process safety information tracking logs, management of change procedures, annual emergency evacuation drills, emergency action plan, hot work permits, knowledgeable contractors performing service, extensive training for all employees, process hazard analysis to determine the measures that are taken to mitigate a potential release, incident investigation procedures, compliance audits, and pre-startup safety checks.",
              "_chemicals": [
                {
                  "PrimaryKey": 2887,
                  "PreventionProgram3ID": 2561,
                  "ProcessChemicalID": 6544
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5120,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "City of Buffalo HAZMAT Team",
    "CoordinatingAgencyPhone": "7168515333",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5120,
      "SummaryText": "American Anglian Buffalo Water Treatment Plant utilizes chlorine to disinfect raw water for the purpose of providing a potable water source to the City of Buffalo.  The chlorination system is designed to provide a metered flow of chlorine from six, one-ton containers equipped with automatic switchover equipment.  There are normally twelve, one-ton containers on site (approximately 24,000 pounds of chlorine) at the facility.  Flow from the one-ton containers is directed through flexible tubing into a hard piping system.  The system operates under a positive pressure flow and can be isolated at three points.  The three points are the container valves, the header valves, and the vaporizer valves.  Under normal condtions, the chlorination system draws from the six one-ton containers simultaneously through a main header system.  There are two scales, each containing six, one-ton containers on trunnions, and the automatic switchover system controls the scale from which chlorine is drawn.\n\nAmerican Anglian Buffalo Water Treatment Plant endeavors to eliminate accidents and health hazards to its employees, customers, and the community by providing employees educational training, safe working conditions, and the means to increase awareness of potential dangers both on and off the job. American Anglian Buffalo Water Treatment Plant's objective is to prevent unwanted releases of chlorine into locations that could potentially expose employees and the community to serious hazards.  An effective program requires a systematic approach to evaluating the entire system.  Workplace and process safety are major concerns to management and employees alike.  The prevention and mitigation of unwanted releases of chlorine into locations that could expose employees and residents to serious hazards is of primary concern.   \n\nAmerican Anglian Buffalo Water Treatment Plant has developed this program in accordance with OSHA Title 29 CFR 1910.119, and the USEPA Title 40 CFR Part 68.  The program i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5120,
      "SummaryText": "s designed to inform all employees of the hazards of chlorine, procedures for the safe use of chlorine, and the steps taken for the safety of employees in the event of a release or spill (i.e., emergency action plan, management of change procedures, preventative maintenance program, employee training, etc.).  In addition, American Anglian Buffalo Water Treatment Plant has generated an emergency preparedness plan and a chemical emergency management plan for response procedures to chlorine releases and has coordinated it with the City of Buffalo Fire Department.  The American Anglian Buffalo Water Treatment Plant has experienced and well trained operators that have worked extensively with the chlorination system.  Training of employees is well documented and implemented at the facility.\n\nAmerican Anglian Buffalo Water Treatment Plant has performed a worst case release scenario and an alternative release scenario to determine the potential impact of a chlorine release on the surrounding community.  The worst case release scenario would impact approximately a 1.3 mile radius from the facility and the alternative release scenario would impact approximately a 0.7 mile radius from the facility.  Therefore, each scenario has a potential offsite impact.  The worst case release scenario looked at a potential release from a one-ton container that contains approximately 2,000 pounds of chlorine.  The alternative release scenario dealt with a potential release from the hydrostatic rupture of the flexible connector to the one-ton container.  USEPA's RMP Guidance for Waste Water Treatment Plant Reference Tables and Equations were used in determining the worst case and alternative release scenarios offsite impacts.  A release of either nature is unlikely due to the following:  standard operating procedures for connecting and disconnecting the one-ton containers, a preventative maintenance program that addresses the inspection and replacement of the flexible connector on a periodic "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5120,
      "SummaryText": "basis, the one-ton containers are maintained at an ambient temperature of approximately 72 degrees Fahrenheit, emergency action plan, chemical emergency management plan, the operators are extensively trained and the operators knowlege is verified through written tests, the facility has a scrubber system for the neutralization of a chlorine gas release, and there are valves which isolate each one-ton container and minimize the amount of chlorine that could be released.\n\nAmerican Anglian Buffalo Water Treatment Plant has had no accidental releases of chlorine in the past five years.  \n\nAmerican Anglian Buffalo Water Treatment Plant has developed an emergency action plan in compliance with OSHA 29 CFR 1910.119 (n), OSHA 29 CFR 1910.38, and USEPA 40 CFR 68.90.  American Anglian Buffalo Water Treatment Plant has coordinated all emergency response activities with the City of Buffalo HAZMAT Team and Fire Department and the City of Buffalo HAZMAT will perform all HAZMAT activities at the facility.  In addition, American Anglian Buffalo Water Treatment Plant also has coordinated with the Erie County HAZMAT team to assist the City of Buffalo HAZMAT team during emergency responses.  The emergency action plan establishes the procedures necessary to follow in case of a chlorine release as well as the order of notification for off-site responders.  Employees will receive the training required to recoginize a chlorine release and to intiate the emergency action plan procedures by notifying the proper authorities.  Table top emergency drills and evacuation drills are conducted periodically that simulate potential emergency conditions.  American Anglian Buffalo Water Treatment Plant's emergency action plan includes:  pre-emergency planning and coordination with outside parties (e.g., the City of Buffalo HAZMAT team), drills and preparedness acitivities to respond to a potential chlorine release, employees roles, lines of authority, training and communication, emergency recognition a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5120,
      "SummaryText": "nd prevention, safe distances and places of refuge, site security and control, evacuation routes and procedures, emergency medical treatment and first aid, emergency alerting and response procedures, critique of response and follow-up reports to improve the efficiency and execution of the emergency action plan, and emergency response equipment maintained at the facility (e.g., Chlorine Institute Emergency Kit \"B\" for use by the City of Buffalo HAZMAT Team (if necessary))."
    }
  ]
}