{
  "FacilityID": 51215,
  "FacilityName": "Yuba City Water Treatment Plant",
  "FacilityStr1": "701 Northgate Dr.",
  "FacilityStr2": null,
  "FacilityCity": "Yuba City",
  "FacilityState": "CA",
  "FacilityZipCode": "95991",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06101",
  "LEPC": null,
  "FacilityLatDecDegs": "39.160556",
  "FacilityLongDecDegs": "-121.624528",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "John Westhouse",
  "OperatorStr1": "701 Northgate Dr.",
  "OperatorStr2": null,
  "OperatorCity": "Yuba City",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95991",
  "OperatorZipCodeExt": null,
  "FTE": 15,
  "OtherEPAFacilityID": "Cal921653966",
  "EPAFacilityID": "100000140171",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-03-18 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-17 16:57:43",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-03-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-03-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 39.160556,
  "FRS_Long": -121.624528,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C01",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 74438,
      "AltID": null,
      "FacilityID": 51215,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 98769,
          "ProcessID": 74438,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 76232,
          "ProcessID": 74438,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 43697,
              "Process_NAICS_ID": 76232,
              "SafetyReviewDate": "2009-06-01 00:00:00",
              "PHA_Date": "2009-05-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-05-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-06-01 00:00:00",
              "TrainingReviewDate": "2009-05-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-06-01 00:00:00",
              "EquipmentInspectionDate": "2009-05-15 00:00:00",
              "EquipmentTested": "Auto Shut Off System & Scrubber",
              "ChangeMgmtDate": "2000-12-01 00:00:00",
              "ChangeMgmtReviewDate": "2009-06-01 00:00:00",
              "PreStartupReviewDate": "2009-06-01 00:00:00",
              "ComplianceAuditDate": "2009-06-17 00:00:00",
              "AuditCompletionDate": "2008-03-14 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-06-01 00:00:00",
              "HotWorkPermitReviewDate": "2008-04-24 00:00:00",
              "ContractorSafetyReviewDate": "2009-06-01 00:00:00",
              "ContractorSafetyEvalDate": "2009-06-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 63578,
                  "PreventionProgram3ID": 43697,
                  "ProcessChemicalID": 98769
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 51215,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-06-01 00:00:00",
    "ERTrainingDate": "2007-12-17 00:00:00",
    "CoordinatingAgencyName": "Yuba City Fire Department",
    "CoordinatingAgencyPhone": "5308224690",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 51215,
      "SummaryText": "Federal Environmental Protection Agency - Risk Management Plan (RMP)\nCalifornia Accidental Release Plan (Cal/ARP)\nYuba City Water Treatment Plant\n\nINTRODUCTION\n\nThe Yuba City Water Treatment Plant (YCWTP) is owned and operated by the City of Yuba City, Sutter County, California.  The plant is staffed by approximately 13 regular employees.  This plant is located north of Yuba City adjacent to the Feather River.  There are some residences and commercial/industrial occupancies nearby.  The facility treats water from the Feather River.  The water plant has a capacity of 42MGD.  The City has one regulated acutely hazardous material on site Â¿ chlorine.   \n\nThese EPA Risk Management Plan (RMP) Support Documents satisfy the requirements of 40 CFR 68.  \n\nMANAGEMENT SYSTEM\n\nThe WTP accidental release prevention policy involves an approach that integrates technologies, procedures, and management practices.  The facility adheres to all applicable procedures of the federal EPA Risk Management Program (EPA-RMP).  The emergency response policy involves the preparation of response plans, which are tailored to this plant and to the emergency response of the community and local responding agencies.  It is in compliance with the EPA Emergency Response Program requirements.\n\nThe accidental release prevention program (ARP) is in compliance with the federal and State OSHA Process Safety Management (PSM) rule and is based upon the following key elements:\nÂ¿\tA high level of training for the facility state certified plant operators.\nÂ¿\tA preventive maintenance program with strict adherence.\nÂ¿\tUse of state of the art process and safety equipment to control and neutralize any accidental release of chemical.\nÂ¿\tThe use of an accurate and effective operating procedure written with participation of the operators.\nÂ¿\tPerformance of hazard review of equipment and procedures.\nÂ¿\tAssignment of the plant supervisor with overall responsibility of the RMP and Cal/ARP\nÂ¿\tImplementation of an auditing"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 51215,
      "SummaryText": "and inspection program under the direction of the water treatment plant supervisor.\n\nThese policies and procedures are described in the Yuba City Water Treatment Plant Process Safety Management Plan.  This plan, as required by State and local regulatory agencies, also contains information and procedures relating to chlorine processing equipment, handling, leak response and repair procedures, education and safety training.  It contains a Process Hazard Analysis (PHA) and various report forms.\n\n\n\n\n\nRISK MANAGEMENT PROGRAM - PREVENTION PROGRAM DESCRIPTION\n\nThe Yuba City Water Treatment Plant accidental release prevention program involves a unified approach that integrates technologies, policy, and management practices.  It is in compliance with all EPA Prevention Program Requirements.\n\n1.\tProcess Safety Information Â¿ Yuba City WTP has developed and maintains written safety information about the chlorination process and the technology of process equipment used.  The operation of this facility adheres to the guidelines of the Chlorine Institute and to the OSHA regulations regarding Process Safety Management.\n2.\tProcess Hazard Analysis (PHA) Â¿ A PHA has been conducted appropriate to the complexity of the chlorination process that identified, evaluated, and controlled potential hazards using the Â¿What-If ChecklistÂ¿ and Â¿Hazard Review ChecklistsÂ¿ processes.  These processes include the analysis of hazards due to equipment malfunction and human error.  It describes steps used to detect and monitor releases.  This PHA will be updated every five years and the Yuba City WTP will conduct reviews whenever major changes occur to the process.\n3.\tOperating Procedures Â¿ The WTP has prepared written procedures that provide clear instructions for the safe operational activities associated with the process.  These procedures are included in the facility operations manual and the Process Safety Management manual.  The manual includes procedures for operation of all phases of the p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 51215,
      "SummaryText": "rocesses, and normal and emergency shutdown of the process.  \n4.\tEmployee Training: - All existing and newly assigned employees are trained and tested competent in all operation procedures.  Training documentation is maintained on all applicable employees.                                                               5.\tMechanical Integrity Â¿ The WTP has a preventive maintenance program that insures the mechanical integrity of its chlorination processing equipment, which includes periodic inspection, testing and an annual overhaul of critical processing equipment.\n6.\tManagement of Change - WTP has implemented written procedures to manage changes (except changes in-kind) to process chemical technology, equipment and procedures.  Employees affected by a change in a process are informed of and trained in the change prior to start up of the process or affected part of the process.  Safety information and operation procedures are updated accordingly.\n7.\tPre-Startup Review Â¿ Written procedures have been developed to allow operators to perform a pre-startup safety review for new and modified chlorination equipment, or where modification to the process is significant enough to require a change in the process safety information.\n8.\tCompliance Audits Â¿ Compliance audits will be performed every three years to verify that the procedures and practices are adequate and are being followed.  Water treatment plant supervisors will perform the audit.  A report will be developed and deficiencies will be corrected.  The two most recent audits will be kept.\n9.\tIncident Investigation Â¿ The Yuba City WTP will investigate any incident, which results or could result in a catastrophic release of chlorine gas.  The investigation will be conducted within 48 hours of the incident.  All key factors will be addressed and recommendations for correction will result.  Affected personnel will review the findings of the investigation.  The report will be kept for 5 years.\n10.\tEmployee Participatio"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 51215,
      "SummaryText": "n Â¿ Managers and operators of Yuba City WTP participated in the process hazard analysis.  The PHA has been made available to all affected employees and is kept at the plant.\n11.\tHot Work Permit Â¿ A hot work permit process has been developed and implemented for hot work operations conducted on or near the chlorination process.  The permit documents the fire and accident prevention requirements and is implemented prior to beginning any hot work operations.  The permit is kept on file until the completion of any hot work.\n12.\tContractors Â¿ Contractors working on or near the PSM process at the water treatment plant are required to comply with the regulatory provisions of the OSHA process safety management standard.  A procedure has been developed to address the following: contractor safety program; informing contractor employees of the hazards on the site; review of the emergency evacuation plans; record contractor meetings of the plans; and require contractors to train their employees on the hazards of the process. \n13.\tInjury and Illness Prevention Program Â¿ The Yuba City WTP has an active IIPP meeting the requirements of Cal/OSHA Section 3203 that addresses the following;\nÂ¿\tAssignment of safety responsibilities\nÂ¿\tPrograms designed to gain employee involvement such as safety reward and recognition, safety suggestion incentives, and safety rule infraction disciplinary programs.\nÂ¿\tAn active safety training program\nÂ¿\tA hazard identification and corrective action program.\nÂ¿\tIncident and Accident investigation process.\nÂ¿\tSafety committee made up of union and management personnel.\n\n\nEMERGENCY RESPONSE PROGRAM \n\nYuba City WTP has developed and implemented an emergency response program. The emergency response program includes interaction and communication with local and state response agencies.  The Sutter County Department of Environmental Health, as part of their business plan program, is notified immediately if there is a hazardous material release.  The Yuba Cit"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 51215,
      "SummaryText": "y Fire Department will be the incident commander in the case of a chlorine release and will coordinate evacuation procedures in a worst-case scenario.  The California State Office of Emergency Services and Sutter County Office of Emergency Services are also notified in a worst-case scenario.  The WTPÂ¿s chlorine manufacturer is also notified.\n\nA copy of the emergency response plan is maintained in the Yuba City WTP OperatorÂ¿s Room.\n\nFIVE YEAR ACCIDENT HISTORY\n\nNo accidental chlorine releases have occurred at this facility.  Accident definitions and accident investigation procedures are provided in the Process Safety Management Plan.\n\nPLANNED CHANGES\n\nThere are no planned changes to the regulated process."
    }
  ]
}