{
  "FacilityID": 51473,
  "FacilityName": "Burgess Norton Manufacturing Company - Plant 2",
  "FacilityStr1": "500 Western Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Geneva",
  "FacilityState": "IL",
  "FacilityZipCode": "60134",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17089",
  "LEPC": "Kane County LEPC",
  "FacilityLatDecDegs": "41.882222",
  "FacilityLongDecDegs": "-088.322778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.burgessnorton.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 144915790,
  "ParentCompanyName": "Burgess Norton Manufacturing Company",
  "Company2Name": null,
  "CompanyDUNS": 144915790,
  "Company2DUNS": null,
  "OperatorName": "Burgess Norton Manuf. Co. - Plant 2",
  "OperatorStr1": "500 Western Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Geneva",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60134",
  "OperatorZipCodeExt": null,
  "FTE": 175,
  "OtherEPAFacilityID": "60134BRGSSSOUTH",
  "EPAFacilityID": "100000202354",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-09-01 00:00:00",
  "SafetyInspectionBy": "Illinois State Fire Marshal Office",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-04-14 00:00:00",
  "ErrorReportDate": "2008-04-14 00:00:00",
  "ReceiptDate": "2008-04-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-04-09 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": "2017-12-07 00:00:00",
  "DeRegistrationEffectiveDate": "2017-12-01 00:00:00",
  "AnniversaryDate": "2013-04-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 41.88224,
  "FRS_Long": -88.32268,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 74792,
      "AltID": "Anhydrous Ammonia Storage",
      "FacilityID": 51473,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 99180,
          "ProcessID": 74792,
          "ChemicalID": 56,
          "Quantity": 51400.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 76598,
          "ProcessID": 74792,
          "NAICSCode": "332117",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 43911,
              "Process_NAICS_ID": 76598,
              "SafetyReviewDate": "2008-01-21 00:00:00",
              "PHA_Date": "2007-10-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2008-07-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-01-30 00:00:00",
              "TrainingReviewDate": "2008-01-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-01-30 00:00:00",
              "EquipmentInspectionDate": "2008-03-03 00:00:00",
              "EquipmentTested": "Visual inspection of anhyrdous ammonia storage tank",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2008-01-30 00:00:00",
              "PreStartupReviewDate": "2008-02-07 00:00:00",
              "ComplianceAuditDate": "2008-02-07 00:00:00",
              "AuditCompletionDate": "2008-05-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2008-02-07 00:00:00",
              "HotWorkPermitReviewDate": "2008-02-07 00:00:00",
              "ContractorSafetyReviewDate": "2008-02-07 00:00:00",
              "ContractorSafetyEvalDate": "2008-02-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 63843,
                  "PreventionProgram3ID": 43911,
                  "ProcessChemicalID": 99180
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 51473,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Geneva Fire Department",
    "CoordinatingAgencyPhone": "6302322530",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 51473,
      "SummaryText": ". Normal shutdown\n6. Start-up following a turnaround or after an emergency shutdown\n7. Operating limits\n8. Safety and health considerations\n9. Safety systems\n\nThese procedures are to be used as a reference by experienced TI operators and affected facility employees and provide a basis for consistent training of new operators. The procedures are to be periodically reviewed and certified as accurate.\n\nTraining\nA comprehensive employee training program has been developed for all TI and affected facility employees involved in process operations. TI and affected facility employees receive annual refresher training concerning operating procedures. All training is documented including the identity of the employee, date of training and method used to verify employees understand training.\n\nMechanical Integrity\nPractices and written procedures have been prepared to ensure the anhydrous ammonia system including all its components is operating properly. The practices/procedures include the performance of mechanical system inspections and tests to ensure proper equipment operation and the performance of preventive maintenance. Inspection and test findings are documented and reported to designated management personnel and corrective measures are implemented, as required, to address any identified issues in a timely manner. Maintenance personnel receive training on process operations, equipment and systems maintenance procedures, emergency response, and work practice safety to ensure that jobs are performed in a safe and consistent manner.\n\nManagement of Change\nA written procedure for managing changes to the anhydrous ammonia system including process chemicals, technology, equipment, procedures and changes to the facility that affect the anhydrous ammonia system has been prepared. Management of Change procedures address the following issues prior to any change made to the anhydrous ammonia system:\n\n1. Technical basis for the proposed change\n2. Impact of change on safety and health"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 51473,
      "SummaryText": "mmediately evacuate the affected area and notify the following parties at the provided numbers:\n\n1. Jurisdictional Emergency Response Team (911)\n2. State Emergency Response Committee (1-800-782-7860)\n3. Kane County LEPC (1-630-232-5985)\n\nA Management Representative must meet the first responders when they first arrive to provide key process information. A meeting point should be provided during the 911 phone call. \n\nCoordinating emergency response efforts also includes providing the fire department with site diagrams and hazardous material information, meeting with fire department personnel to discuss facility operations/processes, and periodic on-site inspections by fire department personnel.\n\nWorst-Case and Alternative Release Scenarios\nWhile a worst-case release is not expected to occur, as required by the regulation, worst-case and alternative release scenarios were evaluated to estimate the potential offsite consequences to the public or the environment from the potential accidental release of anhydrous ammonia. The toxic endpoint concentration for anhydrous ammonia is 200ppm or 0.14 mg/L. \n\nThe worst-case and alternative release scenarios were determined using current RMP*CompTM computer software developed by the National Oceanographic and Atmospheric Administration (NOAA) and U.S.EPA. RMP*CompTM performs calculations described in the RMP Offsite Consequence Analysis Guidance document published by U.S.EPA.\n\nDistances to the toxic endpoint, defined by U.S.EPA as the maximum airborne concentration below which it is believed that nearly all individuals can be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms that could impair an individual¿s ability to take protection action, were estimated for worst-case and alternative case release scenarios. The worst-case release is defined as the instantaneous release of the entire contents of the anhydrous ammonia system. The alternative release is defined"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 51473,
      "SummaryText": "as a release that has potential off-site impacts.\n\nWorst-Case Release Scenario\nUsing U.S.EPA¿s RMP*CompTM to determine the worst-case scenario, the calculated toxic vapor endpoint distance was based on the loss of the entire contents of the anhydrous ammonia storage tank over a ten minute time period, 51,400 pounds. The worst-case release toxic endpoint distance is estimated to be 1.2 miles. The worst-case dispersion parameters are atmospheric stability class F and 1.5 meters per second wind speed.\n\nAlternative Release Scenario\nUsing U.S.EPA¿s RMP*CompTM to determine the alternative release scenario, the calculated toxic vapor endpoint distance was based on a toxic vapor release caused by a pipe tearing apart from the anhydrous ammonia tank system. Based on a tank hole 4-square inches in size, the alternative release over a ten minute time period was 3,060 pounds. The alternative release toxic endpoint distance is estimated to be 0.6 miles. The alternative release dispersion parameters are atmospheric stability class D and 3.0 meters per second wind speed.\n\nPlanned Changes to Improve Safety\nThe safety improvement program includes internal safety audits, which are performed on a regulatr basis. RMP updates are required every 5 years or within 6 months following a revised Hazard Review, Offsite Consequence Analysis, or Program designation. Compliance Audits are required every 3 years. Hazard Reviews require updating at least once every 5 years. Any Incident Investigation Summaries shall be retained for 5 years."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 51473,
      "SummaryText": "Accidental Release Prevention & Emergency Response Policies\nThe Burgess Norton Manufacturing Company (BN) facility located at 500 Western Avenue in Geneva, Illinois (the facility) , is a manufacturer of precision powder metal products for the automotive and outdoor power equipment industries. The Facility is committed to operating in a manner that is safe for site personnel, the community, contractors and the environment. To meet this commitment, systems have been established to help ensure safe operation of the processes of this Facility. One component of these systems is the Risk Management Program (RMP) that has been established and implemented to assist in managing the risks involved with the storage and use of anhydrous ammonia, the only hazardous substance stored and used at the Facility that is regulated pursuant to Title 40, Code of Federal Regulations, Section 68 (40 CFR 68).\n\nAnhydrous ammonia is used in heat treating operations at the Facility. Anhydrous ammonia is stored in a liquid state in one pressurized 10,000-gallon aboveground storage tank (AST) that holds up to 51,400 pounds of anhydrous ammonia. The pressurized anhydrous ammonia AST is located outside along the west boundary of the Facility property. Ancillary piping connects the anhydrous ammonia AST to a dissociator unit located inside the production building to generate hydrogen and nitrogen used the powdered metal heat treat process equipment. The ancillary piping between the anhydrous ammonia AST and dissociator unit contains less than 1 pound of anhydrous ammonia. Including AST and ancillary piping storage quantities, a maximum of 51,400 pounds of anhydrous ammonia is stored on-site. The RMP applies to facilities that operate a process which involves a chemical stored onsite at or above specified threshold quantities (TQ) listed in 40 CFR 68.130. Anhydrous ammonia (CAS 7664-41-7) is listed with a threshold quantity of 10,000 pounds under 40 CFR 68.130. Therefore, pursuant to 40 CFR 68, the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 51473,
      "SummaryText": "facility is required to implement a RMP because anhydrous ammonia is stored on-site in quantities equal to or greater than the 10,000-pound RMP TQ listed for anhydrous ammonia in 40 CFR 68.130.\n\nThe facility is subject to RMP Program 3 requirements. Pursuant to 40 CFR 68.10(d)(2), RMP Program 3 requirements apply to facilities that are subject to Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) requirements outlined under 29 CFR 1910.119. The PSM standard applies to facilities that operate a process which involves a chemical stored onsite at or above specified threshold quantities listed in 29 CFR 1910.119, Appendix A. Anhydrous ammonia is listed with a threshold quantity of 10,000 pounds under Appendix A. Therefore, because anhydrous ammonia is stored at the facility in quantities greater than 10,000 pounds and is used as a gas in the heat treat process, the facility is subject to PSM and RMP Program 3 requirements.\n\nStationary Source & Regulated Substance Handled\nThe facility is a stationary source that stores and uses anhydrous ammonia (CAS No. 7664-41-7), a regulated substance (40 CFR 68.130, Table 3). Anhydrous ammonia is piped in a gaseous state to a dissociator unit where it is broken down to its elemental components, hydrogen and nitrogen, and used in the metal heat treat operations at the facility. Tanner Industries, Inc. (TI) owns the anhydrous ammonia AST system including the tank and outlet valves. BN is responsible for maintaining the pipe delivery system connecting the AST system to the dissociator unit and the production area. TI performs all maintenance activities on the AST system, not including surface painting. BN leases the tank and purchases anhydrous ammonia on a regular basis from TI. Consequently, TI is responsible for the safe operation and maintenance of the AST system and is also obligated to maintain compliance with environmental and safety requirements that apply to the AST system. The potential hazard"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 51473,
      "SummaryText": "s associated with liquid and vapor forms of anhydrous ammonia include corrosivity, severe chemical burns and frostbite to the skin, eyes, respiratory tract and mucous membranes, suffocation and high pressure release.\n\nGeneral Accidental Release Prevention Program & Chemical-Specific Prevention Steps\nComprehensive accidental release prevention and emergency response programs that address the Facility are established. It is the facility¿s policy to adhere to all applicable federal, state, and local rules and regulations. The facility is committed to the safety of workers, contractors, the public, as well as to the preservation of the environment. Additionally, measures necessary to prevent foreseeable releases of the substances regulated by 40 CFR 68 will be implemented. The measures include:\n\n¿ Employee training in accidental release prevention and emergency response programs/measures\n¿ Establishment of safety programs for Facility operations, design, and maintenance of the anhydrous ammonia system\n¿ Establishment of a hazard assessment process\n\nIn the event of an accidental release of the regulated substance, all efforts will be made to minimize and control the release to ensure worker safety and prevent injury to the public or damage to the environment. The facility is also committed to working with the local emergency planning committee (LEPC) and local fire department to ensure all emergency notification and response measures are effectively planned and executed.\n\nBoth active and passive mitigation systems have been developed and implemented at the facility to reduce the potential for adverse impacts to human health and the environment. The anhydrous ammonia storage system controls include the following AST safety measures:\n\n¿ 24-hour electronic monitoring system that relays AST operating data to TI\n¿ Three-way safety valve\n¿ Pressure relief safety valves\n¿ Tank grounding\n¿ Inventory control\n¿ Preventive maintenance program implemented by TI\n¿ Anhydrous ammonia s"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 51473,
      "SummaryText": "ystem operations training for TI & BN employees\n¿ Routine tank inspections performed by Facility personnel and TI truck drivers.\n\nTI and BN personnel responsible for handling anhydrous ammonia at the facility are instructed in the following areas:\n\n¿ Basic chemical properties and product hazards\n¿ Equipment start-up, normal operation and maintenance\n¿ Emergency/evacuation procedures\n¿ Personal safety\n¿ Product handling\n¿ Hazardous Waste Operations and Emergency Response\n\nAdditionally, TI anhydrous ammonia delivery tank truck drivers are trained in the following areas:\n\n¿ U.S. Department of Transportation and hazardous materials (HAZMAT) regulations\n¿ Vehicle operations, personal safety, product handling, AST visual inspection, and defensive driving\n\nThe RMP Accidental Prevention Program includes the following areas:\n\nProcess Safety Information\nWritten process safety information has been prepared to identify and understand hazards associated with anhydrous ammonia and provide an explanation of the anhydrous ammonia storage system technology and equipment. The process safety information includes chemical properties and associated hazards, chemical inventories, and system equipment design/configuration information and diagrams.\n\nProcess Hazard Analysis\nA process hazard analysis has been conducted to help identify and control recognized hazards associated with the anhydrous ammonia system. Within this program, the anhydrous ammonia system is systematically examined to recognize hazards and to verify that adequate controls are in place to manage these hazards. The process hazard analysis program is to be reviewed and updated every five (5) years, as required.\n\nOperating Procedures\nWritten operating procedures have been prepared that provide clear instructions for safely operating the anhydrous ammonia system. The system operating procedures address the following areas:\n\n1. Initial startup\n2. Normal operations\n3. Temporary operations \n4. Emergency shutdown and operation\n5"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 51473,
      "SummaryText": "3. Modifications to operating procedures\n4. Necessary time period for the change\n5. Authorization requirements for the change\n\nEmployees involved with the anhydrous ammonia system will receive training as necessary prior to the change made to the system. The RMP will also be updated and revised as necessary when changes to the system occur.\n\nPre-startup Review\nA written procedure concerning pre-startup reviews for the anhydrous ammonia system has been prepared to address safety issues if the system is modified to the extent that changes are required to be made to process safety information. Pre-startup review procedures confirm the following objectives are achieved prior to modification of the anhydrous ammonia system:\n\n1. Construction and equipment are in accordance with design specifications\n2. Adequate safety, operating, maintenance and emergency procedures are in place\n3. Applicable employee training has been completed\n4. Management of Change procedures are followed as necessary\n\nCompliance Audits\nA written procedure for conducting RMP compliance audits has been prepared. The facility will undergo a compliance audit of the accident prevention and emergency response programs to ensure adequate implementation of the programs every three years. Audit findings and recommendations are to be provided to management personnel for review and implementation of corrective measures, as required. Any corrective measures to be implemented will be tracked by facility personnel until completion.\n\nIncident Investigation \nA written procedure addressing incident investigations has been prepared. All incidents that result in, or could reasonably have resulted in, a catastrophic release of anhydrous ammonia resulting in major property damage, environmental impact, or personal injury are promptly investigated to determine the cause of the incident, evaluate response measures, and prevent future recurrence. An investigation team is to be assembled to document the investigation and it"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 51473,
      "SummaryText": "s findings and recommendations. The results of any incident investigation are provided to management personnel for review and implementation, as determined. All actions taken in response to the investigation findings/recommendation are tracked until completion including any reengineering of the anhydrous ammonia system and/or employee task reviews. Incident investigation reports will be retained for a minimum of five years.\n\nEmployee Participation\nA written procedure that addresses consulting employees on the conduct and development of process hazard analyses and the development of other elements of process safety management has been prepared. Employees associated with the anhydrous ammonia system are provided access to process hazard analyses and all other information required under RMP requirements.\n\nHot Work Permit\nA written hot work procedure has been prepared for all hot work operations performed at the facility, including the anhydrous ammonia system. All hot work permits will comply with fire prevention and protection standards outlined in 29 CFR 1910.252(a), indicate the date(s) hot work is to occur and identify the object on which hot work is to be performed. \n\nContractors\nA written procedure outlining the responsibilities of the anhydrous ammonia system contract employees has been prepared. Responsibilities addressed in the contractors procedure include:\n\n1. Contractor safety performance records and programs\n2. Potential release hazards associated with anhydrous ammonia system and contractor work\n3. Arrangements for emergency response agencies\n4. Facility entrance, presence and exit practices for contractors\n5. Contractor safety training\n\nFive-Year Accident History\nA reportable accident involving the anhydrous ammonia system has never occurred at the facility.\n\nEmergency Response Program\nIn the event of an anhydrous ammonia release from the anhydrous ammonia system or any other environmental, health and safety emergency, TI and/or facility employees will i"
    }
  ]
}