{
  "FacilityID": 51472,
  "FacilityName": "Duncan Compressor Station",
  "FacilityStr1": ".4 Miles South of County Road 438",
  "FacilityStr2": null,
  "FacilityCity": "Henderson",
  "FacilityState": "TX",
  "FacilityZipCode": "75654",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48401",
  "LEPC": "Rusk County LEPC",
  "FacilityLatDecDegs": "32.094170",
  "FacilityLongDecDegs": "-094.817170",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.m2midstream.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "M2 Fairplay, LLC",
  "Company2Name": null,
  "CompanyDUNS": 809071074,
  "Company2DUNS": 0,
  "OperatorName": "M2 Fairplay, LLC",
  "OperatorStr1": "1099 Main Avenue, Suite 210",
  "OperatorStr2": null,
  "OperatorCity": "Durango",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "81301",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000202345",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-04-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-04-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-04-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-02-20 00:00:00",
  "DeRegistrationEffectiveDate": "2020-02-14 00:00:00",
  "AnniversaryDate": "2013-04-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 74791,
      "AltID": "Gas & Liquid Processing",
      "FacilityID": 51472,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 99179,
          "ProcessID": 74791,
          "ChemicalID": 155,
          "Quantity": 168000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 80270,
              "ProcessChemicalID": 99179,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 80271,
              "ProcessChemicalID": 99179,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 80272,
              "ProcessChemicalID": 99179,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 80273,
              "ProcessChemicalID": 99179,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 80274,
              "ProcessChemicalID": 99179,
              "ChemicalID": 118
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 76597,
          "ProcessID": 74791,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 51472,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2008-01-25 00:00:00",
    "ERTrainingDate": "2008-01-25 00:00:00",
    "CoordinatingAgencyName": "Rusk County LEPC",
    "CoordinatingAgencyPhone": "9036570326",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 51472,
      "SummaryText": "M2 Fairplay, LLC\nDuncan Compressor Station\nExecutive Summary for RMP Submit\n\n\nACCIDENT RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe Duncan Compressor Station has management commitment to worker and public safety.  The commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, trained personnel will respond to control and contain the release.\n\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe primary purpose of the Duncan Compressor Station is to compress, dehydrate and remove natural gas liquids from wet natural gas that is gathered from gas producers in the area.  The Station consists of refrigeration and treating processes and compressors driven by internal combustion engines.  Once at the Station, the incoming natural gas is sent through processes consisting of separation, dehydration, refrigeration, and compression.  The treated gas is compressed to pipeline pressure and dehydrated through a Triethylene Glycol dehydration process.  The residue gas leaves the facility via pipeline while the remaining natural gas liquids (NGL's) are stored in a pressurized bullet tank. The NGLs leave the plant via tank trucks.  As a result of these operations, several EPA regulated flammable substances are processed, recovered, and stored at the facility.  The flammable substance inventory quantity provided in Section 1.17 of the RMP is a conservative estimate of the amount of regulated flammable substance that is present in the Station at any one time.  Although there are plans to add additional equipment, the actual inventory within the Station should not change significantly.  This station is un-manned however, it is visited on a daily basis.\n\n\nGENERAL ACCIDENT RELEASE PREVENTION PR"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 51472,
      "SummaryText": "OGRAM\n\nAn accidental release prevention program is in place at the Duncan Compressor Station.  The Duncan Compressor Station has been classified as a Program 1 because no public receptors have been identified within a calculated radius of exposure.  The location is visited daily by Operation Personnel who receive extensive Environmental, Health & Safety Training.  Over pressure and high level alarms are in place with shutdown controls for abnormal conditions.  System volumes and pressures are monitored through a Supervisory Control and Data Acquisition System (SCADA)\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe Duncan Compressor Station is a new station effective 04/01/08 and therefore has experienced NO reportable process accidents in the past 5 years.  \n\n\nEMERGENCY RESPONSE PROGRAM\n\nThe Duncan Compressor Station maintains a written emergency response plan, which is in place to protect worker and public safety as well as the environment.  The plan consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post incident cleanup and decontamination requirements.  \n\nIn addition, the Station has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.\n\nThe emergency response plan is updated when necessary based on modifications made to Station processes or other Station facilities. \n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nBecause M2 Fairplay recently built the Duncan "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 51472,
      "SummaryText": "Compressor Station, there are numerous plans in place to implement and improve safety and environmental programs.  An environmental, health, and safety (EH&S) training plan has been established and will be fully implemented in 2008.  Emergency drills will be conducted to improve personnel awareness and response."
    }
  ]
}