{
  "FacilityID": 5152,
  "FacilityName": "PACIFIC POLYMERS INTERNATIONAL, INC.",
  "FacilityStr1": "12271 MONARCH STREET",
  "FacilityStr2": null,
  "FacilityCity": "GARDEN GROVE",
  "FacilityState": "CA",
  "FacilityZipCode": "92841",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06059",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.783889",
  "FacilityLongDecDegs": "-118.009222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "AO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.PacPoly.Com",
  "FacilityEmailAddress": "PacPoly@AOL.COM",
  "FacilityDUNS": 56588403,
  "ParentCompanyName": "AS ABOVE",
  "Company2Name": "AS ABOVE",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "CORNELIUS CLAUS",
  "OperatorStr1": "12271 MONARCH STREET",
  "OperatorStr2": null,
  "OperatorCity": "GARDEN GROVE",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92841",
  "OperatorZipCodeExt": null,
  "RMPContact": "SKIP BRABENDER",
  "RMPTitle": "PLANT MANAGER",
  "FTE": 45,
  "OtherEPAFacilityID": "CAD056588403",
  "EPAFacilityID": "100000063307",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-01 00:00:00",
  "SafetyInspectionBy": "Garden Grove Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.78483,
  "FRS_Long": -118.00585,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6060,
      "AltID": null,
      "FacilityID": 5152,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 6207,
          "ProcessID": 6060,
          "NAICSCode": "32551",
          "_desc": {
            "NAICS_CODE": "32551",
            "NAICS_DESCRIPTION": "Paint and Coating Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 6208,
          "ProcessID": 6060,
          "NAICSCode": "32599",
          "_desc": {
            "NAICS_CODE": "32599",
            "NAICS_DESCRIPTION": "All Other Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6587,
          "ProcessID": 6060,
          "ChemicalID": 77,
          "Quantity": 42000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 77,
            "ChemicalName": "Toluene diisocyanate (unspecified isomer)  [Benzene, 1,3-diisocyanatomethyl-]",
            "CASNumber": "26471-62-5",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506587,
          "ProcessID": 6060,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5152,
      "SummaryText": "\nPacific Polymers International, Inc. is located at 12271 Monarch Street, Garden Grove, California. The company is a proven leader in the waterproofing, protective coating and sealant industry. Since its establishment in 1972, Pacific Polymers International, Inc. has consistently improved in technology research, development, and manufacturing to provide contracting professionals the quality, durability, and ease of application demanded by the construction industry.\n\nPacific Polymers International, Inc. provides architectural, technical, and field support in many citie/states throughout the United States of America. Pacific Polymers International, Inc. products are available nationally and internationally through authorized distributors.\n\nPacific Polymers International, Inc. products are based on Polyurethane, Polyurea, Epoxy, Polysulfide and Latex Polymers. This RMP program is based upon the concept that health, safety and environmental issues must be considered in all parts of the the raw material usage, in this case Toluene Diisocyanate. The company has developed programs and procedures to ensure the appropriate information is available and has been provided to those handling the raw material. Pacific Polymers International, Inc. is committed to assisting its customers in transporting, handling, application and disposing of the Finish Products containing Toluene Diisocyanate reacted Polymers.\n\nIn selecting raw materials for new and existing products, Pacific Polymers International, Inc. considers the potential environmental impact of the materials at research, manufacturing and application sites, their impact on the community. Pacific Polymers International, Inc. is committed to supply information to transporters and customers. Such information includes regulatory information in the form of labels and Material Safety Data Sheet.\n\nInformation which may affect the process or final product is reviewed. Such reviews may include product specifications or process modifi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5152,
      "SummaryText": "cations that may affect environmental and safety concerns, product quality and properties. The companys' manufacturing sites observe applicable product, safety, environmental regulations with proper guidelines.\n\nThis RMP program developed is for Toluene Diisocyanate listed as Toxic Reportable Material. The program includes: a) The company's Information (Registration), b) Toxic Worst Case , c) Alternate Releases, d) Written Prevention Program that includes Check List and Process Hazard Analysis and e) Emergency Response Program. \n\nPacific Polymers International, Inc. have prevented any accident release for Toluene Diisocyanate as well other Toxic / Non-Toxic raw materials.\n\nFor the worst-case scenario, Pacific Polymers used the OCA RMP Comp. software program to determine the endpoint distance. The maximum amount of TDI carried by Pacific Polymers is 42000 pounds. Based on this, the endpoint determined by the RMP Comp program is 0.4 miles. The residential population in the 0.4 mile radial area has been estimated to be 1000. The endpoint barely touches the schools. This schools shall be notified with the help of administrative agency.\n\nThe alternate scenario, was determined using RMP COMP program. The endpoint was determined to be 0.1 mile radial distance. Within this area, there no are schools nor residence.\n\nPacific Polymers has written the prevention program as per OSHA rules and regulation. The program includes 1) Spill Prevention, 2) Spill Containment, 3) First Aid, 4) Protective Equipment and Clothing, 5) Hazardous Communication, 6) Evacuation Procedures, 7) Operating Procedure.\n\nThe emergency program has been wriiten. The program includes the responsibilities of the leaders and supervisors as well the employees, notification to the administrative agency (Garden Grove Fire Department) and public,  and coordination with the agency.\n\nPacific Polymers conducted the hazard analysis and have made following recommendation to improve safety:\n1) Build a dike in the stora"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5152,
      "SummaryText": "ge area as well the mixing room. The mixing room area is 7100 sq. ft. The dike height shall be at least 3 inches. This will contain the amount of TDI stored in the building and prevent from draining outside in the open space.\n2)  Have a thorough maintenance program of the mixing and storing equipments.\n3) Pacific Polymers have requested BASF Corporation (Vendor) to provide training as well monitor the work area. The request has been granted and BASF is scheduled to come down on July 12th, 1999. This will help the company improve safety enviroment even better by getting additional suggestions and recommendations.\n4) The employees shall be trained again with this new RMP program on TDI handling as well as other raw materials.\n5) Additional improvement of safety has been recommended by installing scrubbing unit such as Charcoal Filters, considering a contingency kit at various locations, regular maintenance of leaks, direct pipeline to other mixers/blenders/ and polymer manufacturing reactors.\n6) A respiratory fit test is being arranged for all the employees."
    }
  ]
}