{
  "FacilityID": 51610,
  "FacilityName": "Sachs Chemical, Inc.",
  "FacilityStr1": "P.R. Road 175, Km. 0.02, Lot 18",
  "FacilityStr2": "Río Cañas Industrial Ward",
  "FacilityCity": "Caguas",
  "FacilityState": "PR",
  "FacilityZipCode": "00725",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "72025",
  "LEPC": "HUMACAO LEPC",
  "FacilityLatDecDegs": "18.298333",
  "FacilityLongDecDegs": "-066.055000",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 174050419,
  "ParentCompanyName": "Not applicable",
  "Company2Name": "Not applicable",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Sachs Chemical, Inc.",
  "OperatorStr1": "P.O. Box 191670",
  "OperatorStr2": null,
  "OperatorCity": "San Juan",
  "OperatorStateFIPS": "PR",
  "OperatorZipCode": "00919",
  "OperatorZipCodeExt": "1670",
  "FTE": 16,
  "OtherEPAFacilityID": "00725SCHSCRD175",
  "EPAFacilityID": "100000202559",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-11-14 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-05-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-05-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-05-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-05-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 18.294349,
  "FRS_Long": -66.05422,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 74967,
      "AltID": "HCl Containers Storage",
      "FacilityID": 51610,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 99444,
          "ProcessID": 74967,
          "ChemicalID": 53,
          "Quantity": 60600.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 76778,
          "ProcessID": 74967,
          "NAICSCode": "42469",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 27435,
              "Process_NAICS_ID": 76778,
              "SafetyReviewDate": "2008-05-01 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "local engineering standards  (see comments)",
              "FR_Comments": "P.R. College of Engineers & Surveyors & P.R. Regulations & Permits Administration (ARPE)",
              "HazardReviewDate": "2008-05-01 00:00:00",
              "ChangeCompletionDate": "2008-06-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "regular container inspections",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-05-01 00:00:00",
              "TrainingReviewDate": "2008-05-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-04-15 00:00:00",
              "EquipmentInspectionDate": "2008-05-01 00:00:00",
              "EquipmentTested": "Two (2) forklifts",
              "ComplianceAuditDate": "2008-05-01 00:00:00",
              "AuditCompletionDate": "2008-06-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2008-05-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 28661,
                  "PreventionProgram2ID": 27435,
                  "ProcessChemicalID": 99444
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 51610,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2007-06-12 00:00:00",
    "ERTrainingDate": "2008-04-12 00:00:00",
    "CoordinatingAgencyName": "Junta de Calidad Ambiental",
    "CoordinatingAgencyPhone": "7878524670",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 51610,
      "SummaryText": "A) ACCIDENTAL RELEASE PREVENTION & EMERGENCY RESPONSE POLICIES\r\n\r\nBasic operational policies at SACHS are geared to emergencies prevention because of their potential impact.  Some of the essential characteristics of SACHS?s Accidental Release Prevention and Emergency Response Policy are the following:\r\n\r\n* Facilities must be maintained and operated to minimize the possibility of a fire, explosion, or any unplanned sudden or non-sudden release of oil, hazardous materials, hazardous wastes, or hazardous solid waste constituents into air, soil, or water which could threaten human health or the environment.\r\n* Use only accepted engineering practices in the design of new facilities.\r\n* Provide continuous operator training.\r\n* Authorize valves operation and piping work only to trained personnel.\r\n* Whenever feasible, bulk oil and hazardous materials tanks/containers shall be enclosed within fenced areas or closed buildings; all gates shall be either guarded or locked.\r\n* Twenty-four (24) hours of constant monitoring by operating personnel shall be provided, including areas not in operation.\r\n* Adequate lighting shall be provided for night monitoring of plant areas.\r\n* An active Preventive Maintenance Program shall be always in place with expeditious repair of potential leak or overflow points.\r\n* A rapid communication system shall be always available for emergency communications (via telephone, radio, and other methods).\r\n* Whenever feasible, automatic liquid-level measurement devices shall be provided at tanks.\r\n* Mechanical integrity tests shall be performed on the tank storage facilities.\r\n* Inspections should be regularly conducted at the areas with release potential, and for assessing the available personnel protective equipment and the emergency response equipment.\r\n* Whenever feasible, the areas with a reasonable release potential shall be provided with adequate alert signs legible from distance.  Also, the areas shall be properly diked to contain releases wheneve"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 51610,
      "SummaryText": "r the conditions of the area allow so.\r\n* Sand or sorbent material shall be made available in sufficient amounts at numerous portions of the site.\r\n* All employees shall be active in the prevention of emergencies/releases and notify any emergency situation to his/her supervisor.  Also, all employees shall act as ?initial responders? in an emergency incident within the capabilities of each one and without compromising their safety.\r\n* SACHS immediately informs the Local Emergency Planning Committee of any changes at the site which may be relevant to emergency planning, as well as any information necessary for development or implementation of local emergency plans [40 CFR 355.30(d)].\r\n\r\nThe General Duty Clause [Section 112(r)(1) of the Clean Air Act] requires facilities to manage their facilities in a safe manner which prevents and abates accidental air releases; SACHS adopts the General Duty Clause as one of its most important incident prevention policies.\r\n\r\n\r\n\r\n\r\nB) DESCRIPTION OF STATIONARY SOURCE & REGULATED SUBSTANCES\r\n\r\nSACHS is a facility engaged exclusively in the distribution and sale of oils/chemicals [North American Industry Classification System (NAICS) Code # 42469].  No manufacturing operations occur at SACHS.       The SACHS?s warehousing, shipping, and distribution facility is located within a lot of approximately 7,925 square meters.     The site is within an industrially-zoned region. The facility is bordered by Servimetal, Inc. to the north; an unnamed creek to the south; a vegetation-covered area to the east; and an abandoned warehouse (property of Steel and Pipes, Inc.) to the west.\r\n\r\nThe facility consists of a reinforced concrete building (of approximately 50,000 square feet), which provides for adequate protection against weather and vandalism.  The building shelters properly (i.e., within concrete roof, walls, and floor) the following: office/administration areas, warehousing areas (for the storage of oils/chemicals in non-bulk containers), c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 51610,
      "SummaryText": "nalyses.  Since there are no meteorological monitoring stations near SACHS, the default meteorology/values provided by RMP-Comp? were utilized for both the worst-case/alternative OCAs.  Only the following information/values were input into RMP-Comp?: area setting (i.e., urban), release quantity, and ambient/liquid temperatures. No passive or active mitigation measures were considered (neither in the worst case OCA nor in the alternative OCA).\r\n\r\nFor the estimate of the population affected within the estimated release-impacted zones (another requirement of the hazard assessment), the LandView 6? software of the U.S. Census was utilized.  For the determination of offsite impacts to the environment, a review of the USGS 7?? topographic quadrangle for Aguas Buenas was used, together with a physical reconnaissance of the areas in the immediate vicinity of the site (i.e., at the release impact zones estimated by the OCAs).\r\n\r\nFor the worst-case release scenario, SACHS considered four (4) 55-gallon containers of the regulated substance [i.e., the four (4) containers stored within a pallet] to be involved in the worst-case release.   This corresponds to an estimated quantity of 2,184 pounds of the regulated substance involved in the release; the release was assumed to occur at ground level and within an elapsed period of ten (10) minutes.  The analysis indicate that, under worst-case release scenario conditions, the regulated substance could travel 1.6 miles before dispersing enough to no longer pose a hazard to the public.  The affected population estimate was 12,769 persons.\r\n\r\nFor the alternative release scenario, SACHS considered one (1) 55-gallon container of the regulated substance to be involved in the alternative release.   This corresponds to an estimated quantity of 546 pounds of the regulated substance involved in the release; the release was assumed to occur at ground level and within an elapsed period of ten (10) minutes.  The analysis indicate that, under alte"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 51610,
      "SummaryText": "afeteria, a dock for unloading/loading non-bulk containers into transportation trucks, a ?break-bulk? area in which tank trucks are unloaded into non-bulk containers, an area used to transfer chemicals among non-bulk containers, and a fire pump (powered by diesel fuel and used exclusively in emergency events).   An Electricity Generation Unit (EGU) is located outside of the building (i.e., at the southwestern corner of the site), which provides power to the facility in the eventuality of failure at the P.R. Electric Power Authority (PREPA) electrical power system. \r\n\r\nSACHS is a facility with relative minor hazards. There is no underground storage on site; however, the facility has a below-ground sanitary wastewater treatment system.\r\n\r\nRegarding regulated substances and processes subject to 40 CFR 68, there is only one (1) regulated substance and one (1) regulated process at SACHS:  storage in 55-gallon containers of hydrochloric acid (concentration 37% or greater).   This single-regulated process is subject to Program 2 Prevention Program elements.\r\n\r\nC) HAZARD ASSESSMENT SUMMARY\r\n\r\nThis section discusses the hazard assessment performed for the following regulated substance that triggered its corresponding regulatory threshold of 40 CFR 68.130 at SACHS: hydrochloric acid (concentration 37% or greater).  The hazard assessment was oriented toward analyzing the consequences of worst-case/alternative release scenarios for the previously mentioned regulated substance [the analyses of these two (2) scenarios are hereinafter called as Offsite Consequence Analyses or ?OCAs?]. Each of the analyses include a determination of the area surrounding the facility impacted by the scenario (assumed to be a circular-shaped area), the offsite impacts to the population, and the offsite impacts to the environment.  \r\n\r\nOCAs (for worst-case/alternative release scenarios at SACHS, respectively) were conducted using RMP-Comp? (version 1.07), a software developed by EPA for this type of a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 51610,
      "SummaryText": "rnative release scenario conditions, the regulated substance could travel 0.3 miles before dispersing enough to no longer pose a hazard to the public. The affected population estimate was 288 persons.\r\n\r\nThe following receptors were identified within the worst-case/accidental release scenario impact zones: residences, industries, commercial buildings, offices, and schools.  No environmental receptors (as defined in 40 CFR 68.3) were identified.\r\n\r\nD) PREVENTION PROGRAM DESCRIPTION\r\n\r\nThe Program 2 Prevention Program elements of 40 CFR 68 were developed and implemented by SACHS as part of SACHS?s Occupational Health & Safety programs.   This section provides the details of such prevention program.   Highlights of SACHS?s Program 2 Prevention Program are provided hereinafter:\r\n> SACHS maintains updated safety information (MSDS, equipment manuals, safe process conditions, codes and standards used to develop the process, etc.) for its only-regulated process at the facility [storage in containers of hydrochloric acid (concentration 37% or greater)].\r\n> SACHS has a strong management system to oversee the effective implementation of its Program 2 Prevention Program.\r\n> There are effective controls to minimize the possibility of a release from the regulated process/substance (including physical measures, administrative/procedural controls, preventive/reactive maintenance, and trained staff).\r\n> Safeguards for unplanned events (electricity generation unit for power failures, containers are not stored in racks to avoid hydrogen gas generation from contact of released hydrochloric acid with metals, and others).\r\n> Release abatement equipment is readily-available.\r\n\r\nE) FIVE-YEAR ACCIDENT HISTORY\r\n\r\n?68.42(a) requires to facilities affected by 40 CFR 68 include in the five-year accident history all accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in pl"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 51610,
      "SummaryText": "ace, property damage, or environmental damage. No accidental releases have occurred at SACHS with the previously mentioned characteristics within the five (5) years period prior to the submittal of this RMP. \r\n\r\nF) EMERGENCY RESPONSE PROGRAM DESCRIPTION\r\n\r\nSACHS has developed an Integrated Contingency Plan (ICP) based upon the guidelines of the National Response Team (NRT); these guidelines are spelled out in 61 FR 28641-28664. The ICP has been coordinated with the Local Emergency Planning Committee (LEPC) emergency response plan.  SACHS?s ICP is designed to minimize hazards to human health and the environment from contingencies such as medical emergencies, chemical/waste/oil releases (including releases of regulated substances), fires/explosions, natural disasters, general threats, biological agent threats, and air pollution emergency episodes of CAA?s criteria pollutants at SACHS.  The ICP, in turn, constitutes the Emergency Response Plan for releases of regulated substances, as required by SACHS?s Risk Management Program.    \r\n\r\nG) PLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThe compliance audit conducted at Sachs Chemical, Inc. for overseeing compliance with 40 CFR 68 Program 2 Prevention Program elements identified the following change to improve the safety of the only-regulated process at the facility [storage in containers of hydrochloric acid (concentration 37% or greater)]: provide secondary containment to the containers.  Sachs Chemical, Inc. will implement this process change on or prior June 30th, 2008.\r\n\r\nEXECUTIVE SUMMARY ? RISK MANAGEMENT PLAN -                 SACHS CHEMICAL INC. ? CAGUAS, PUERTO RICO\r\n\r\n\r\n1"
    }
  ]
}