{
  "FacilityID": 51687,
  "FacilityName": "Plumrose USA, Inc. -  Booneville Facility",
  "FacilityStr1": "101 East Veterans Drive",
  "FacilityStr2": "P.O. Box 970",
  "FacilityCity": "Booneville",
  "FacilityState": "MS",
  "FacilityZipCode": "38829",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28117",
  "LEPC": "Prentiss County LEPC",
  "FacilityLatDecDegs": "34.668333",
  "FacilityLongDecDegs": "-088.555000",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G3",
  "LatLongDescription": "PG",
  "FacilityURL": "www.plumroseusa.com",
  "FacilityEmailAddress": "mhall@plumroseusa.com",
  "FacilityDUNS": 805802485,
  "ParentCompanyName": "Plumrose USA, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Plumrose USA, Inc.",
  "OperatorStr1": "P.O. Box 1066",
  "OperatorStr2": "7 Lexington Avenue North",
  "OperatorCity": "East Brunswick",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08816",
  "OperatorZipCodeExt": null,
  "FTE": 425,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000117429",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-01-24 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-05-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-05-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-05-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 34.668333,
  "FRS_Long": -88.555,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C06",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 75064,
      "AltID": "1",
      "FacilityID": 51687,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 99559,
          "ProcessID": 75064,
          "ChemicalID": 56,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 76877,
          "ProcessID": 75064,
          "NAICSCode": "31199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 44064,
              "Process_NAICS_ID": 76877,
              "SafetyReviewDate": "2007-12-18 00:00:00",
              "PHA_Date": "2006-02-06 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2006-10-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2007-12-18 00:00:00",
              "TrainingReviewDate": "2008-02-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-02-22 00:00:00",
              "EquipmentInspectionDate": "2008-03-20 00:00:00",
              "EquipmentTested": "Receivers, Compressors, Piping, Valves, Accumulators, Condensor Towers",
              "ChangeMgmtDate": "2007-07-26 00:00:00",
              "ChangeMgmtReviewDate": "2007-07-26 00:00:00",
              "PreStartupReviewDate": "2007-08-04 00:00:00",
              "ComplianceAuditDate": "2007-12-18 00:00:00",
              "AuditCompletionDate": "2008-02-28 00:00:00",
              "IncidentInvestigationDate": "1999-11-09 00:00:00",
              "InvestigationChangeDate": "1999-11-13 00:00:00",
              "ParticipationPlansReviewDate": "2007-12-18 00:00:00",
              "HotWorkPermitReviewDate": "2007-07-19 00:00:00",
              "ContractorSafetyReviewDate": "2007-08-04 00:00:00",
              "ContractorSafetyEvalDate": "2007-07-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 64079,
                  "PreventionProgram3ID": 44064,
                  "ProcessChemicalID": 99559
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 51687,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2007-09-10 00:00:00",
    "ERTrainingDate": "2007-10-31 00:00:00",
    "CoordinatingAgencyName": "Prentiss County LEPC",
    "CoordinatingAgencyPhone": "6627205000",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 51687,
      "SummaryText": "Executive Summary\n\nRMP Report For Plumrose, Inc.\n\nExecutive Summary\n\n§68.155\n(a)Accidental Release Prevention & Emergency Response Policies\n\nPlumrose USA, Inc. (Plumrose USA) is committed to protecting facility personnel, the public, and the environment from any workplace and accidental release hazards. Appropriate responses to release of Ammonia (anhydrous) are documented in the Risk Management Program (RMP) document. Safety, environmental protection, and risk management programs will be fully implemented by Plumrose USA personnel and contractors and are coordinated with community emergency responders for emergency planning and response efforts. \n\n(b)Stationary Source and Regulated Substance Handled\n\nPlumrose USA provides employment for approximately 425 workers in Booneville, Mississippi. This facility is a meat processing plant owned by Danish Crown, Randers, Denmark. The corporate headquarters are at Plumrose USA, Inc., P. O. Box 1066, East Brunswick, New Jersey 08816.\n\nAfter reviewing the facility operations and the RMP regulations, it was determined that the entire facility is considered one process. Plumrose USA receives meat products that have been processed off-site and slices the products for packaging. From the time the meat products are received and throughout the processes conducted, the facility maintains a cool temperature utilizing an Ammonia (anhydrous) refrigeration process. Based on the facility processes and applicable regulations, it was determined that the facility is subject to Program 3 of the RMP regulation.\n\n(c)General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nProcess Safety Information ¿ Plumrose USA will complete a compilation of written process safety information to be used in conducting the process hazard analysis (PHA). The PHA will be conducted using the process safety information gathered in order to identify and understand the hazards posed by the Ammonia refrigeration process. This process safety"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 51687,
      "SummaryText": "information will include information pertaining to the hazards of Ammonia (anhydrous), information pertaining to the technology of the Ammonia refrigeration process, and information pertaining to the equipment utilized in the Ammonia refrigeration process. \n\nProcess Hazard Analysis ¿ Plumrose USA will update and revalidate the PHA as necessary and at least every five (5) years. The PHA will be conducted using the methodology specified in 40 CFR 68.67, and will be performed by a team with expertise in engineering and process operations, including at least one employee who has expertise in the Ammonia refrigeration process, and at least one member knowledgeable in the specific PHA methodology used. A system will be established to promptly address the team¿s findings and recommendations; assure that the recommendations are resolved in a timely manner and that the resolution is documented; document what actions are to be completed; complete actions as soon as possible; develop a written schedule of when these actions are to be completed; and communicate the actions to operating, maintenance and other employees whose work assignments are in the process and who may be affected by the recommendations or actions. \n\nOperating Procedures ¿ Plumrose USA will develop and implement written operating procedures to provide clear instructions for safely conducting activities at each operation where Ammonia (anhydrous) is utilized. These written operating procedures will be consistent with the process safety information and address steps for each operating phase, operating limitations, safety and health considerations, and safety systems and their functions. These operating procedures will be readily accessible to employees who work in or maintain the Ammonia refrigeration process. These operating procedures will be reviewed as often as necessary to assure that they reflect current operating practice, including changes that result from changes in process chemicals, technology, and"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 51687,
      "SummaryText": "equipment, and changes to the facility. Plumrose USA will certify annually that these operating procedures are current and accurate. Plumrose USA will develop and implement safe work practices to provide for the control of hazards during operations such as lockout/tagout; confined space entry; opening process equipment or piping; and control entrance into the Plumrose USA facility by maintenance, contractor, laboratory, or other support personnel. These safe work practices apply to employees and contractor employees.\n\nTraining ¿ Plumrose USA provides training for each employee associated with the Ammonia refrigeration process. This training includes an overview of the process and operating procedures as outlined by 40 CFR 68.54. Refresher training is provided at least every three (3) years and more often if necessary. Plumrose USA documents and maintains records of the employee, the date of training, and the means used to verify that the employee understood the training. \n\nMechanical Integrity ¿ Plumrose USA has the following written documents and programs to maintain the on-going integrity of the equipment used in the Ammonia refrigeration process (i.e., storage tanks, piping systems, etc); additionally, inspections, testing, equipment deficiencies, and quality assurance are addressed:\n\nMechanical Integrity Study of Process Equipment\nPreventative Maintenance Program\n\nEach person who has responsibilities to perform maintenance on the ammonia process components receives training at least every three (3) years and more often if necessary.\n\nManagement of Change ¿ Plumrose USA will establish and implement written procedures to manage changes to process chemicals, technology, equipment, and procedures; and, changes to Plumrose USA that affect the Ammonia refrigeration process. These procedures assure that appropriate considerations are addressed prior to any change. Employees involved in operating a process and maintenance and contract employees whose job tasks will be a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 51687,
      "SummaryText": "ffected by a change in the process are informed of, and trained in, the change prior to startup of the process or affected part of the process. If a change results in a change in the process safety information, such information will be updated accordingly. If a change in the process results in a change in the operation procedures or practices, such procedures or practices will be updated accordingly. \n\nPre-startup Review ¿ Plumrose USA will perform a pre-startup review according to 40 CFR 68.77 when the modification is significant enough to require a change in the process safety information. \n\nCompliance Audits ¿ Plumrose USA will certify that they have evaluated compliance with the provisions of 40 CFR, Part 68 at least every three years to verify that procedures developed under 40 CFR, Part 68 are adequate and are being followed. The compliance audit will be conducted by at least one person knowledgeable in the Ammonia refrigeration process. A report of the findings of the audit will be developed, and Plumrose USA will promptly determine and document an appropriate response to each of the findings of the compliance audit, and document that deficiencies have been corrected. Records of the two (2) most recent compliance audit reports will be maintained. \n\nIncident Investigation ¿ Plumrose USA will investigate each incident, which results in, or could reasonably result in a catastrophic release of Ammonia (anhydrous). Incident investigations will be initiated as promptly as possible, but no later than 48 hours following the incident. The incident investigation team will consist of at least one person knowledgeable in the process involved, including a contract employee if the incident involved work of the contractor, and other persons with appropriate knowledge and experience to thoroughly investigate and analyze the incident. A report will be prepared at the conclusion of the investigation, and Plumrose USA has a system to promptly address and resolve the incident an"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 51687,
      "SummaryText": "d report findings and recommendations. Resolutions and corrective actions will be documented. Reports are reviewed with all affected personnel whose job tasks are relevant to the incident findings including contract employees where applicable. Incident investigations reports will be retained for five years. \n\nEmployee Participation ¿ Plumrose USA will develop a written plan of action regarding the implementation of employee participation. The facility will consult with employees on the conduct and development of process hazards analyses and on the development of the other elements of process management. Plumrose USA will provide employees access to process hazard analyses and to all other information required to be developed under 40 CFR, Part 68.\n\nHot Work Permit ¿ Plumrose USA will issue a hot work permit for hot work operations conducted on or near the Ammonia refrigeration process.\n\nContractors ¿ Plumrose USA, when selecting a contractor, will obtain and evaluate information regarding the contract owner or operator¿s safety performance and programs. Plumrose USA will inform the contract owner or operator of the known potential toxic release hazards related to the contractor¿s work and the Ammonia refrigeration process. Plumrose USA will explain to the contract owner or operator, the applicable provisions of the Emergency Response Program. Plumrose USA will develop and implement safe work practices consistent with 40 CFR 68.69 (d), to control the entrance, presence, and exit of the contract owner or operator and contract employees in the Ammonia refrigeration process areas. Plumrose USA will periodically evaluate the performance of the contract owner or operator in fulfilling their obligations as specified below.\n\nContract owners or operators will assure that each contract employee is trained in the work practices necessary to safely perform his/her job. Contract owners or operators will assure that each contract employee is instructed in the known potential toxi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 51687,
      "SummaryText": "c release hazards related to his/her job and the Ammonia refrigeration process, and the applicable provisions of the emergency action plan. Contract owners and operators will document that each contract employee has received and understood the training required. Contract owners and operators will be required to have records of the identity of the contract employee, the date of training, and the means used to verify that the employee understood the training. The contract owner or operator will assure that each contract employee follows the safety rules of Plumrose USA, including the safe work practices required by 40 CFR 68.69 (d). The contract owner or operator will advise Plumrose USA of any unique hazards presented by the contract owner or operator¿s work, or of any hazards found by the contract owner or operator¿s work. \n\n(d)Five-year Accident History\n\nUnder the EPA RMP regulations, an accidental release is defined as a release of a regulated substance that ¿resulted in deaths, injuries, or significant property damage, or environmental damage.¿ Within the past five (5) years, Plumrose USA has not had any accidents that meet these requirements. \n\n(e)Emergency Response Program\n\nPlumrose USA will develop and implement an emergency response program for the purpose of protecting public health and the environment. This program includes the following elements:\n\n1)An emergency response plan, which is maintained onsite and contains at least the following elements:\n  a.Procedures for informing the public and local emergency response agencies about accidental releases;\n  b.Documentation of proper first-aid and emergency medical treatment necessary to treat accidental human exposures; and \n  c.Procedures and measures for emergency response after an accidental release of Ammonia (anhydrous)\n2)Procedures for the use of emergency response equipment and for its inspection, testing, and maintenance; \n3)Training for all employees in relevant procedures; and \n4)Procedures to review"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 51687,
      "SummaryText": "and update, as appropriate, the emergency response plan to reflect changes at Plumrose USA and  ensure that employees are informed of changes.\n\n(f)Planned Changes to Improve Safety\n\nIn an attempt to insure a continual improvement in the facility worker protection and release prevention programs, training concerning this safety and environmental program and others will be conducted annually. This training requires the attendance of all personnel whose job is related to the Ammonia (anhydrous) refrigeration process. Additionally, audits will be performed as specified in the RMPlan, which requires Plumrose USA to assess areas of the RMPlan that may need to be changed or improved."
    }
  ]
}