{
  "FacilityID": 51772,
  "FacilityName": "Sunmet Packing and Cold Storage",
  "FacilityStr1": "32324 Famoso Road",
  "FacilityStr2": null,
  "FacilityCity": "McFarland",
  "FacilityState": "CA",
  "FacilityZipCode": "93250",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": null,
  "FacilityLatDecDegs": "35.603584",
  "FacilityLongDecDegs": "-119.193161",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Joe Buentello",
  "OperatorStr1": "32324 Famoso Road",
  "OperatorStr2": null,
  "OperatorCity": "McFarland",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93250",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000202746",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Program 3",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-05-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-05-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-05-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-05-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 35.602403,
  "FRS_Long": -119.194644,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 75161,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 51772,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 99658,
          "ProcessID": 75161,
          "ChemicalID": 56,
          "Quantity": 13200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 76974,
          "ProcessID": 75161,
          "NAICSCode": "111332",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 44095,
              "Process_NAICS_ID": 76974,
              "SafetyReviewDate": "2008-03-24 00:00:00",
              "PHA_Date": "2009-03-24 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2008-03-24 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Ammonia Adsorption Tank",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-04-29 00:00:00",
              "TrainingReviewDate": "2008-03-24 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-03-24 00:00:00",
              "EquipmentInspectionDate": "2008-03-17 00:00:00",
              "EquipmentTested": "Screw Compressor",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2008-03-24 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2008-03-24 00:00:00",
              "HotWorkPermitReviewDate": "2008-03-24 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2008-03-24 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 64112,
                  "PreventionProgram3ID": 44095,
                  "ProcessChemicalID": 99658
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 51772,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-04-29 00:00:00",
    "ERTrainingDate": "2008-03-24 00:00:00",
    "CoordinatingAgencyName": "Fire Department",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "IIAR Standard"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 51772,
      "SummaryText": "he facility was built in 1994 by professional refrigeration engineers in accordance with industry standards at the time.  It was also built in compliance with the Uniform Mechanical Code and Uniform Building Code applicable at the time of construction. The system contains numerous safety devices including sensors which stop the compressors if temperatures or pressures exceed or drop below established limits, and safety relief valves which vent ammonia gas to a water diffusion tank if the pressure in the system exceeds their set point.  In addition, ammonia detectors are located throughout the facility, and will shut down equipment if ammonia is detected.  Lastly, an emergency ¿dump box¿ contains switches and valves to turn off equipment and vent ammonia if necessary.\n\nThe ammonia system at this facility consists of vessels which are interconnected, or which are co-located such that a release of ammonia could impact the ability to operate vessels that are not directly connected.  Therefore, the facility is treated as a single process.\n3.\tGENERAL ACCIDENT RELEASE & AMMONIA SPECIFIC PREVENTION STEPS\nThe ammonia refrigeration systems at the  Sunmet Packing and Cold Storage facility are an integral part of the overall business.   The system contains a total charge of approximately 13,200 lbs. It is extremely important that it is maintained and operated in a safe and efficient manner.  Management is committed to making sure that all employees are made aware of the potential danger of an ammonia leak.  Sunmet Packing and Cold Storage has also conducted an off-site impact analysis of worst-case and alternate-case release scenarios for the purposes of informing the public in the event of an accidental release.  The results of this analysis are reported in the body of the program.\n\nOur refrigeration personnel monitor the ammonia refrigeration system/process and keep an active journal of all procedures and transactions that pertain to ammonia.  \n\nWe inform our employees of the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 51772,
      "SummaryText": "dangers of an accidental release of ammonia in pre-season safety meetings.  New employees are made aware of the potential risk of ammonia in an employee orientation meeting.  During these meetings we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\n4.\tFIVE YEAR ACCIDENT HISTORY\nSunmet Packing and Cold Storage has not had any reportable accidents within the last five years.\n5.\tEMERGENCY ACTION PLAN\nThis facility¿s emergency response program is based on the Cal/OSHA requirements for Emergency Action Plans (in California CCR Title 8, Section 3220, ¿Emergency Action Plans.¿  Federally, Title 29 CFR 1910.38 and 1910.119), HAZWOPER (standard (in California CCR Title 8, Section 5192, ¿Hazardous Waste Operations and Emergency Response,¿ and Title 29 CFR 1910.120). \n\nStrategically, we will respond ¿minimally¿ to a release.  Under this plan we will call emergency personel and evacuate the facility. All response activities would be done in coordination with the local fire department and the Kern County Fire Department and the Hazardous Materials Response Team.\n\nEvery year at the beginning of the season we review with our employees our evacuation procedures in the event of an emergency, including an ammonia release. \n6.\tPLANNED CHANGES TO IMPROVE SAFETY\nOur company has an outstanding safety record, one that we are quite proud of.  Many policies and procedures have been implemented to promote overall plant, worker and public safety.  Nevertheless, Sunmet Packing and Cold Storage continually strives to improve in all areas, including safety.  Preparation of this Risk & Process Safety Management Program has been the primary recent improvement, and implementation of the program is our plan for improved safety in the near future.\n\nThe Risk & Process Safety Management Program has been written so that program elements are aligned with Sunmet Packing and Cold Storage business practices rather than the order presented in the law.  Thus, Saf"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 51772,
      "SummaryText": "e Operating Procedures are grouped together for the benefit of our system operator.  Safe Operating Policies are grouped together so that appropriate office staff may administer them.  The Emergency Action Plan is now separated out and distributed widely through the plant for easy reference.  \n\nThe Risk & Process Safety Management Program documentation forms and company policy forms pertaining to employee, contractor, and community safety have been carefully reviewed so as to prevent unnecessary complexity and redundancy.  Our operator assisted in the writing of Standard Operating Procedures, and they are presented in a format that is easy to use.  \n\nFor the future, Sunmet Packing and Cold Storage now thinks of the Risk & Process Safety Management Program as a ¿living document¿.  It is an interactive framework that guides safe action for Sunmet Packing and Cold Storage employees, but allows for feedback and continual improvement.  Through the Risk & Process Safety Management Program Sunmet Packing and Cold Storage will continue to profit while maintaining overall plant, worker and public safety."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 51772,
      "SummaryText": "Preface ¿ Executive Summary\n\nfor\n\nSunmet Packing and Cold Storage\n32324 Famoso Road\nMcFarland, CA 93250\nTel. (661) 393-0920\nFax. (661) 393-2418\n\nApril 24, 2008\n \nTable of Contents for Preface ¿ Executive Summary\n\n1.\tTHE  SUNMET PACKING AND COLD STORAGE, RISK & PROCESS SAFETY MANAGEMENT PROGRAM\t1\n2.\tDESCRIPTION OF AMMONIA SYSTEM\t1\n3.\tGENERAL ACCIDENT RELEASE & AMMONIA SPECIFIC PREVENTION STEPS\t2\n4.\tFIVE YEAR ACCIDENT HISTORY\t3\n5.\tEMERGENCY ACTION PLAN\t3\n6.\tPLANNED CHANGES TO IMPROVE SAFETY\t3\nAPPENDIX A: RMP*SUBMIT PRINTOUT\nAPPENDIX B: LETTERS OF CERTIFICATION\n\n \n¿Living Document¿ Approach To Regulatory Compliance\n\nThis program is intended to meet the spirit and intent of the California Accidental Release Prevention Program (CalARP), CCR Title 19, Chapter 4.5 and the California Process Safety Management Program, CCR Title 8, Section 5189 as enforced by the local Certified Unified Program Agency and the Fed/EPA.  \n\nThis program is intended to be a ¿living document.¿  As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible. To accomplish this elements have been organized in a way that is consistent with the corporate organization, how frequently different elements are accessed, and who needs to refer to the program.  The order of elements within this organization is not the same as they are listed in the regulations, and in some cases portions of elements may be found in more than one location.   \n1.\tTHE  SUNMET PACKING AND COLD STORAGE, RISK & PROCESS SAFETY MANAGEMENT PROGRAM\nThis is to inform all interested persons, including employees, that Sunmet Packing and Cold Storage has updated their unified Risk & Process Safety Management Program.  The program is in compliance with California¿s Accidental Release Prevention (CalARP) Program (in California CCR Title 19, Chapter 4.5 Program Level 3 Elements.  At the Federal level, Title 40 CFR Part 68, and California OSHA¿s ¿Process Safety Management (PSM) of A"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 51772,
      "SummaryText": "cutely Hazardous Materials¿ standard (in California CCR Title 8, Section 5189, ¿Process Safety Management of Acutely Hazardous Materials,¿ and Federally Title 29 Code of Federal Regulations (CFR) 1910.119).  This program has been prepared to address the risks involved with the presence of anhydrous ammonia in an amount in excess of 10,000 lbs., which is contained in our refrigeration system. \n\nOur program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of anhydrous ammonia. Overall, the program is designed to prevent accidental fatalities, injuries and illnesses and avoid physical property damage.\n\nOur company has an exemplary safety record, one that we are quite proud of. Our company has many policies and procedures in place to promote overall plant, worker and public safety.  We have: (1) prepared a unified program based on the PSM plan to meet CalARP obligations as well; (2) reorganized the program so that it meshes more closely with general Sunmet Packing and Cold Storage business practices; and (3) reviewed plan documentation forms and responsibilities.  The unified Risk & Process Safety Management Plan sets forth rules, procedures and practices that will help our employees protect themselves and our neighbors.\n2.\tDESCRIPTION OF AMMONIA SYSTEM\nThe Sunmet Packing and Cold Storage facility is a commercial cold storage facility for fresh produce.  The facility has an ammonia system that provides refrigeration capacity to multiple cold rooms.  Four (4) rooms are designated as ¿precooling¿ rooms, while three (3) others are cold storage rooms.  The precooling rooms are equipped with ¿bunker style¿ evaporator coils and the storage rooms are equipped with ceiling suspended coils that contain chilled liquid ammonia.   A computer system provides substantial control and alarm capability.  \n\nThe storage rooms utilize a pumped liquid recirculator system wher"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 51772,
      "SummaryText": "e high pressure liquid from the high pressure receivers is piped to a liquid recirculator through a liquid feed solenoid valve and an expansion valve.  From there, low pressure liquid is pumped to each cold room, where it passes through a solenoid valve, hand expansion valve and into evaporator coils.  Low temperature liquid circulates through the evaporator coils.  Low pressure and temperature gas and overfeed liquid passes through regulators and is returned to the liquid recirculator.  The residual liquid is separated from the gas in the accumulator and the suction gas is piped to two reciprocating and two screw compressors which elevate the temperature and pressure of the gas.  The high pressure discharge from the compressors is sent to a water cooled evaporative condenser where the high pressure ammonia gas is liquified and returned to the high pressure receiver. Some of the high pressure liquid from the receivers is injected into the oil cooler on the screw compressor.  Excess liquid from the liquid recirculator is pumped to a tranfer vessel where the liquid tranfers into the high pressue receiver by gravity.  The system uses hot ammonia gas to defrost the coils.  A portion of the high pressure discharge from the compressors is piped to each cold room, where it passes through a solenoid valve and into the coil.  There are two high pressure receivers, however, they are piped together so that they act in concert.   \n\nThe precooler rooms utilize a gravity flooded system where high pressure liquid from the high pressure receivers is piped to the precooler rooms, where it passes through an expansion valve into a low pressure accumulator vessels mounted behind the bunker wall.  Low temperature liquid circulates by thermal convection through the bunker coils coils.  Low pressure and temperature gas collects in the accumulator vessel, and passes through a pressure regulator into a suction line.  The suction line returns the gas to the compressors in the engine room.\n\nT"
    }
  ]
}