{
  "FacilityID": 51910,
  "FacilityName": "Boyd Lake Water Treatment Plant",
  "FacilityStr1": "3119 E.Eisenhower Blvd",
  "FacilityStr2": null,
  "FacilityCity": "Loveland",
  "FacilityState": "CO",
  "FacilityZipCode": "80537",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08069",
  "LEPC": "Larimer County LEPC",
  "FacilityLatDecDegs": "40.409722",
  "FacilityLongDecDegs": "-105.031667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "P2",
  "LatLongDescription": "PC",
  "FacilityURL": "www.greeleygov.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Greeley, Colorado",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Greeley Water and Sewer Dep",
  "OperatorStr1": "1100 10th Street",
  "OperatorStr2": null,
  "OperatorCity": "Greeley",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80631",
  "OperatorZipCodeExt": "3803",
  "RMPContact": "Edward F. Young",
  "RMPTitle": "Water Plant Superintendent",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000092534",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-06-10 00:00:00",
  "SafetyInspectionBy": "Loveland Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-06-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-06-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-06-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-06-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 40.40733,
  "FRS_Long": -105.03572,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "304",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 75402,
      "AltID": null,
      "FacilityID": 51910,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 77218,
          "ProcessID": 75402,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 99991,
          "ProcessID": 75402,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 599991,
          "ProcessID": 75402,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 51910,
      "SummaryText": "\n40 CFR 68.155 Executive Summary (Rev. 6/08))\n\n\na) The City of Greeley Boyd Lake Water Treatment Plant (\"WTP.\") accidental release program prevention policy addresses the chlorine that the facility uses for drinking water disinfection purposes.  The policy combines advanced technology, standardized operating procedures, personnel training requirements and a top-down management commitment to safe chlorine handling procedures.  The facility emergency response policy involves utilization of, and coordination with, off-site responders to address potential chlorine-related incidents.\n\nB) The Boyd Lake WTP is located two miles west of  Interstate highway 25 on U.S. highway 34 in Loveland, Colorado.  This peaking plant typically operates from April through October of each year (24 hours/day May through September).  When operating, the plant is manned by Colorado certified Plant Operators.  Up to five one-ton containers (10,000 lbs.) are maintained during operations in a dedicated chlorination room.  One container (2,000 lbs.) is kept on site November through March, as the plant functions as back-up to the City of Greeley Bellvue WTP during this period.\n\nC) The plant performed the required off-site consequence analysis (\"OCA\") for the agency-defined \"worst-case\" and \"alternative\" release scenarios.  The plant utilized the OCA guidance for chlorine published by the United States Environmental Protection Agency (\"EPA\") in the Risk Management Program Guidance for Wastewater Treatment Plants (40 CFR Part 68).\n\nThe worst-case scenario must assume the catastrophic release over ten minutes of the entire contents of a full one-ton container of chlorine, certain atmospheric conditions and the failure of all active mitigation systems.  As permitted by the guidelines, the facility assumed the chlorine room would provide a degree of passive mitigation by slowing the release of chlorine gas to the atmosphere.  Applying the guidance, and assuming an unobstructed (\"rural\") landscape, the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 51910,
      "SummaryText": "plant determined that the defined worst-case release scenario would have an off-site endpoint of 2.2 miles. (The toxic endpoint is identified as the maximum concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.)\n\nThe facility is also supposed to identify an alternative release scenario that is more likely to occur than the worst-case scenario, but still result in an off-site toxic endpoint.  The plant utilized a scenario involving the rupture of 5/16 inch tubing releasing chlorine gas at a rate of 15 pounds per minute.  Assuming that the chlorine scrubber unit would mitigate one ton of gas the plant determined the alternative release scenario would have no off-site consequences.\n\nD) The Boyd Lake WTP Accidental Release Prevention Program is based on the following elements:\n\nAdvanced process and safety equipment;\nA chlorine gas detector in the chlorine room that triggers audible alarms and a chlorine scrubber system at concentrations greater than 3 parts per million. The alarms consists of a local alarm on the detector, the plant SCADA computer system and a beacon and klaxon horn on the scrubber;\nA sprinkler system to cool the chlorine containers in the event of a fire;\nStandardized operating procedures;\nTraining of operators and maintenance personnel in the chlorine process;\nPreventive maintenance program for chlorine process equipment and safety equipment;\nPeriodic hazard review of chlorine process equipment and procedures;\nAuditing and inspection program;\nInvestigation program (which will investigate future incidents that could reasonably result in a chlorine release); and\nPersonal protective equipment, including breathing apparatus for routine container changeouts.\n\ne) No accidental releases of chlorine have occurred at the Boyd Lake WTP in the past five"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 51910,
      "SummaryText": " years.\n\nf) The Boyd Lake WTP Emergency Response program utilizes local Hazardous Response personnel to respond to emergencies at the plant.  The program has been reviewed by the Larimer County Office of Emergency Management and coordinated with the Loveland Fire and Rescue Department.  All personnel will review these procedures on an annual basis."
    }
  ]
}