{
  "FacilityID": 5194,
  "FacilityName": "Reservoir 2",
  "FacilityStr1": "21133 U.S. Highway 19 North",
  "FacilityStr2": null,
  "FacilityCity": "Clearwater",
  "FacilityState": "FL",
  "FacilityZipCode": "34619",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12103",
  "LEPC": null,
  "FacilityLatDecDegs": "27.966944",
  "FacilityLongDecDegs": "-82.729444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Clearwater",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Claude Howell, City of Clearwater",
  "OperatorStr1": "1650 North Arcturas Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Clearwater",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33765",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000063673",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2002-06-13 00:00:00",
  "DeRegistrationEffectiveDate": "2002-05-06 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 27.964107,
  "FRS_Long": -82.729618,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6128,
      "AltID": "Disinfection",
      "FacilityID": 5194,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 6663,
          "ProcessID": 6128,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6278,
          "ProcessID": 6128,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2626,
              "Process_NAICS_ID": 6278,
              "SafetyReviewDate": "1998-09-01 00:00:00",
              "PHA_Date": "1998-01-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-01-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "leak detectors",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-09-01 00:00:00",
              "TrainingReviewDate": "1998-09-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-09-01 00:00:00",
              "EquipmentInspectionDate": "1998-06-01 00:00:00",
              "EquipmentTested": "chlorination (disinfection) system",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1998-09-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2001-10-01 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-09-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-09-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1998-09-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2964,
                  "PreventionProgram3ID": 2626,
                  "ProcessChemicalID": 6663
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5194,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-09-01 00:00:00",
    "ERTrainingDate": "1999-06-30 00:00:00",
    "CoordinatingAgencyName": "Clearwater Fire & rescue Department",
    "CoordinatingAgencyPhone": "7275624334",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5194,
      "SummaryText": "1.0 EXECUTIVE SUMMARY\n\n1.1 ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICY SUMMARY\n\nThe City of Clearwater (the City) operates three water treatment plants  (the Facilities) throughout the City of Clearwater, Pinellas County, Florida. \nThe City is committed to operating these and its other facilities in a manner that is protective of the health and safety of City and Contractor employees, the public, and the environment.  In addition, the City is committed to operating these and its other facilities in full compliance with all applicable Occupational Safety and Health Administration (OSHA) and Environmental Protection Agency (EPA) regulatory requirements.\n\nTo ensure that the Facilities are operated in a safe manner and in compliance with applicable OSHA and EPA regulations relevant to accidental release prevention, the City has developed a combined Risk Management Plan (RMP) for the three Facilities.  Because of the similarities in the operation, a single RMP has been prepared to present common elements and procedures applicable to all three Facilities.  This approach will result in improved usefulness of the plan and streamline future updates and modifications.  \n\nAmong the important components of this RMP are the City's system of policies and procedures for operation and maintenance of the regulated processes, and the City's Emergency Response Plan (ERP) specific to each Facility.  \n\nThe City has designated its Public Utilities Coordinator for Water Supply as the individual with primary responsibility and accountability for seeing that this RMP and its associated components accurately reflect actual conditions and that the RMP is fully implemented at each Facilitiy.   \n\n\n1.2 STATIONARY SOURCE DESCRIPTION\n\nThe City's WTP Facilities are designed for the treatment of potable water prior to distribution through Clearwater's public water supply system. Among the various processes that comprise the overall treatment operation is disinfection, to remove poten"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5194,
      "SummaryText": "tially harmful biological contaminants.  This process is essential to the overall performance of water treatment.  \n\nThe Facilities use chlorine for water disinfection.  Chlorine is delivered to the Facilities and stored in one-ton containers as a liquid under pressure.  Within the container, chlorine gas is present in the head space.  When a container is placed in use, chlorine gas is drawn off the head space for use in the process, and additional liquid volatilizes within the container.  \n\nAs part of the chlorination process, several containers are simultaneously connected to a split manifold configuration that has two banks of containers.  Only one bank of chlorine containers is active at any given time.  The other bank of containers remains in a stand-by mode such that when the active containers are empty, the stand-by containers can be brought on line without interruption to the disinfection process.  Additional one-ton containers are stored on trunnions adjacent to the process so that they are readily available as replacements for empty containers.  The maximum intended inventory of chlorine at each Facility varies.  Based on the need for uninterrupted water treatment, the critical importance of the disinfection process, and the anticipated flow rates through the Facilities, the quantities of chlorine at each facility are considered to be the minimum feasible inventories.   \n\n\n1.3 WORST CASE AND ALTERNATIVE CASE RELEASE SCENARIOS\n\nThe worst case release scenario at each Facility involves a release of 2,000 lb of chlorine over a period of ten minutes.  This is the quantity of a full ton container (which is the largest single vessel associated with the process) and the time period for release required by the regulatory definition of the worst case scenario.  There are presently no chlorine system passive mitigation measures in place at the Facilities that would limit the quantity of the release as defined by the regulatory requirements.\n\nIn addition to assuming"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5194,
      "SummaryText": "a release of the total quantity of chlorine in a full ton container, the worst case scenario included other worst case assumptions, such as a low wind speed (1.5 meters per second (m/s)), a highly stable Class F atmosphere, and the maximum ambient temperature over a three year period (100oF).  These worst case assumptions contributed to a highly conservative, large distance to the chlorine toxic endpoint of 0.0087 milligrams per liter (mg/L), or 3 parts per million (ppm), as defined by the regulations.  Under these worst case conditions, the toxic endpoint for chlorine was determined using the DEGADIS model with DEGATEC interface for each Facility.  \n\nUsing the methodology prescribed in the regulations results in potential impacts to public receptors, including a potentially impacted residential population for each Facility.  There were no known environmental receptors, such as wildlife refuges, within this area for any Facility.  \n\nIt is important to recognize that the regulations require the identification of the potentially impacted population using a circle with a radius that is the maximum distance to the toxic endpoint.  In actuality, the released gas would most likely take the form of an elongated plume, impacting the population within only a portion of the circle located in the downwind direction from the source.  The size of the actual impacted population would therefore likely be only a fraction (estimated to be on the order of 20%) of the potentially impacted population identified in the worst case release scenario analysis. \n\nIt is also important to note that the toxic endpoint of 3 ppm used to determine the maximum distance from the source for estimating potential impacts is at the low end of the 3 ppm to 5 ppm range likely to cause mild health effects comprising a slight irritation of the nose and upper respiratory tract, and not more serious health consequences or death. \n\nA more realistic, alternative release scenario was also examined for each Facil"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5194,
      "SummaryText": "ity.  This scenario is summarized below.\n\n A container is damaged such that the valve breaks resulting in the release of the contents of a half full container of chlorine over a 30 minute period.  Realistic ambient conditions comprising a 3.0 meters per second (m/s) wind speed, Class D atmospheric stability, and 73oF temperature were used.  The distance to the toxic endpoint for chlorine was determined using the DEGADIS model and DEGATEC interface for each Facility.  The potentially impacted population also was determined.  Potential public receptors were located within the endpoint radius for each Facility, but there were no identified environmental receptors.\n\n\n1.4 ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe Facilities have an accidental release prevention program that is based upon a foundation of employee awareness and proactive system maintenance.  This program is documented in the RMP.  The effectiveness of this program, which meets or exceeds all requirements of applicable RMP regulations, is evident by the fact that the Facilities have had no significant releases of chlorine in the five years prior to the date of this Plan.\n\n\n1.5 FIVE-YEAR ACCIDENT HISTORY\n\nThere have been no accidental releases at the Facilities in the five years prior to the date of this Plan that resulted in injuries or death to Facility or Contractor employees onsite or the off-site public, or damage to potential environmental receptors.  \n\n\n1.6 EMERGENCY RESPONSE PROGRAM\n\nEach Facility has an Emergency Response Plan (ERP) that defines the sequence of actions to be taken by Facility employees in the event of an accidental release of chlorine.  These ERPs have been communicated to the Clearwater Fire and Rescue Department (CFRD) and the Local Emergency Planning Committee (LEPC).  It is the City's policy with regard to emergency response that its personnel are trained to the First Responder Awareness Level.  These are individuals who are likely to witness or discover a hazardous substance r"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5194,
      "SummaryText": "elease and who have been trained to initiate an emergency response sequence by notifying the proper authorities of the release.  They would take no further action beyond notifying the authorities of the release.  Thus, it is the City's policy for employees to call 911 in the event of a release emergency and allow the local Hazardous Materials (HazMat) Response Team to mitigate the release conditions.  The CFRD is presently responsible for determining when evacuation of off-site areas is necessary, and for public notification.\n\n\n1.7 PLANNED CHANGES TO IMPROVE SAFETY\n\nThis RMP incorporates a number of modifications to Facility procedures designed to improve employee safety awareness, enhance safe operations and maintenance of the chlorine systems, reduce the potential for accidental releases to occur, and increase the speed and effectiveness of the Facility's response should a release occur."
    }
  ]
}