{
  "FacilityID": 51950,
  "FacilityName": "Apex Generating Station",
  "FacilityStr1": "15555 Apex Power Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Las Vegas",
  "FacilityState": "NV",
  "FacilityZipCode": "89165",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32003",
  "LEPC": "Clark County LEPC",
  "FacilityLatDecDegs": "36.411389",
  "FacilityLongDecDegs": "-114.959720",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Las Vegas Power Company LLC",
  "Company2Name": "Broadway Gen. Funding LLC",
  "CompanyDUNS": 801357471,
  "Company2DUNS": 801357471,
  "OperatorName": "Las Vegas Power Company LLC",
  "OperatorStr1": "P.O. Box 34089",
  "OperatorStr2": null,
  "OperatorCity": "Las Vegas",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89133",
  "OperatorZipCodeExt": null,
  "FTE": 27,
  "OtherEPAFacilityID": "NVR000076620",
  "EPAFacilityID": "100000181625",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "1520",
  "SafetyInspectionDate": "2006-02-24 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2010-06-08 12:32:25",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-06-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 36.4163,
  "FRS_Long": -114.9607,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "0.1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 75447,
      "AltID": "Anhydrous ammonia for SCR",
      "FacilityID": 51950,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 100046,
          "ProcessID": 75447,
          "ChemicalID": 56,
          "Quantity": 57953.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 77263,
          "ProcessID": 75447,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 44282,
              "Process_NAICS_ID": 77263,
              "SafetyReviewDate": "2008-03-25 00:00:00",
              "PHA_Date": "2009-06-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2008-03-18 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Secondary containment area and sump.",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-03-26 00:00:00",
              "TrainingReviewDate": "2009-03-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-03-25 00:00:00",
              "EquipmentInspectionDate": "2007-03-27 00:00:00",
              "EquipmentTested": "Ammonia Tank, Ammonia Flow Skids 1A null",
              "ChangeMgmtDate": "2008-03-17 00:00:00",
              "ChangeMgmtReviewDate": "2008-03-25 00:00:00",
              "PreStartupReviewDate": "2003-02-28 00:00:00",
              "ComplianceAuditDate": "2009-03-13 00:00:00",
              "AuditCompletionDate": "2009-07-14 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2008-03-25 00:00:00",
              "HotWorkPermitReviewDate": "2008-01-30 00:00:00",
              "ContractorSafetyReviewDate": "2007-08-24 00:00:00",
              "ContractorSafetyEvalDate": "2008-01-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 64387,
                  "PreventionProgram3ID": 44282,
                  "ProcessChemicalID": 100046
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 51950,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-03-31 00:00:00",
    "ERTrainingDate": "2008-12-18 00:00:00",
    "CoordinatingAgencyName": "Clark County Fire Department",
    "CoordinatingAgencyPhone": "7024557311",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 51950,
      "SummaryText": "ssurization from ambient temperatures or exposure to fire.   \n\n  8. Pressure Relief Valves. The anhydrous ammonia process incorporates four (4) pressure relief valves.  They include two (2) 100% capacity pressure safety valves on the tank, one (1) pressure relief valve on the tank level gage, and one (1) pressure relief valve on the liquid in piping.\n\n  9. Containment Area. The storage tank and unloading area are both situated inside a secondary containment that consists of a drive and concrete pad that slopes into a covered sump. The sump capacity is 18,233 gallons.\n\nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps \n\nApex Generating Station has a complete accidental release prevention program in compliance with Federal Process Safety Management (PSM) and State Chemical Accident Prevention Program (CAPP) requirements.  The Apex Generating Station accidental release prevention program is based on the following key elements:\n\n  1. Detailed management system and clear levels of responsibilities and team member roles.\n\n  2. Comprehensive safety process information that is readily available to staff, emergency responders, and contractors.\n\n  3. Comprehensive preventive maintenance program.\n\n  4. A process hazard analysis of equipment and procedures with operation and maintenance staff participation and review.\n\n  5. Use of state-of-the-art process and safety equipment.\n\n  6. Use of accurate and effective operating procedures, written with operations and maintenance staff participation.\n\n  7. High level of training of operators and maintenance staff.\n\n  8. Implementation of an incident investigation, inspection, and auditing program using qualified staff.\n\nProcess and Chemical Safety Information\n\nComprehensive chemical data have been assembled to include regulatory reporting and action thresholds, health hazards, and chemical exposure limitations, as well as detailed physical properties of anhydrous ammonia.  This information was"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 51950,
      "SummaryText": "tion sets minimum contractor safety performance requirements for work in process areas, holds contractor safety briefings before allowing them near or in the process area, controls access to the process areas, and evaluates the contractor's performance.\n\nPre-Startup Safety Review and Mechanical Integrity Program\n\nApex Generating Station ensures that a pre-startup safety review is completed for any new regulated process at the plant, or for significant modifications to an existing covered process that requires a change in the process safety information.  Apex Generating Station maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  We believe that this program is the primary line of defense against a release.  The maintenance staff addresses equipment testing and inspection, and preventative maintenance schedules.  Our mechanical integrity program includes the following:\n\n  1. Written procedures for maintaining mechanical integrity through inspection and testing of process equipment, based on instructions of equipment vendors, industry codes, and prior operating experience\n\n  2. Implementation of written procedures by performing inspections and tests on process equipment at specified intervals\n\n  3. Training of maintenance personnel in safe work practices such as lockout/tagout, line or equipment opening, and avoidance and correction of unsafe conditions\n\n  4. Procedures specifying orientation training requirements for contract maintenance employees, as well as requiring contractors to use plant-developed maintenance procedures for process areas\n\nHot Work Permits and Management of Change \n\nApex Generating Station requires employees and contractors to employ safe work practices when performing 'hot work' in, on, or around the regulated processes.  Apex Generating Station uses a comprehensive permitting and training program to ensure hot work is conducted safely.  Apex Gen"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 51950,
      "SummaryText": "erating Station provides a system and approach to maintain and implement management of changes or modifications to equipment, procedures, chemicals, and processing conditions.  This system allows our employees to identify and review safety hazards or provide additional safety, process, or chemical information before the proposed change is implemented.\n\nInternal Compliance Audits\n\nInternal compliance audits are conducted every 3 years to verify compliance with the programs and procedures contained in the RMP.  Apex Generating Station assembles an audit team that includes personnel knowledgeable in the Risk Management Program rule and in the regulatory process.  This team evaluates whether the prevention program satisfies the requirements of the RMP rule and whether the prevention program is sufficient to help ensure safe operation.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n\nIncident Investigation\n\nApex Generating Station investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment, so that similar accidents can be prevented.  Apex Generating Station trains employees to identify and report any incident that requires investigation.  An investigation team is assembled and the investigation is initiated within 48 hours of any incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.  Information found during the investigation is reviewed by appropriate staff and is added to, or used to revise operating and maintenance procedures.  Information from audits and any resulting changes in operating procedures are passed onto the training unit for their inclusion in existing training programs, if warranted, to prevent a future event.\n\nFive-Year Accident History Summary\n\nRMP regulations require reporting the 5-year accident hist"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 51950,
      "SummaryText": "onia system.  Procedures include startup, shutdown, and normal, alternate, and emergency operation.  Also included are maintenance and troubleshooting procedures, including consequences of deviation and steps to avoid or correct deviations.  Apex Generating Station will update procedures whenever a change occurs that alters the steps needed to operate safely.  Operating procedures will be developed and implemented prior to any new process equipment coming on line or a changed process starting up.\n\nOperations and Maintenance Training Program\n\nEach Apex Generating Station employee presently involved in operating or maintaining the ammonia process is trained in an overview of the process and applicable operating and maintenance procedures.  Training helps employees understand the nature and cause of problems arising from operations involving ammonia, and increases employee awareness of hazards.  Apex Generating Station's training program includes both initial and refresher training that covers:  (1) a general overview of the processes, (2) the properties and hazards of the substances in the process, and (3) a detailed review of the process operating procedures and safe work practices.  Written self-evaluations are used to verify that an employee understands the training material before the process work can be resumed. \n\nTraining documentation includes:  date of most recent review or revision to the training program, type of training required and the type of competency testing used to ensure staff understands the training.  Ongoing employee training records are maintained.  \n\nContractors\n\nThe Apex Generating Station has procedures and policies in place that ensure that only contractors with good safety programs are selected to perform work on and around the ammonia process.  Contractors are properly informed of the hazards, access limitations to these process areas, and emergency response procedures, and are prepared to safely complete the work.  The Apex Generating Sta"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 51950,
      "SummaryText": "compiled from numerous sources and is intended to be a one-stop source for the reader seeking data about these substances.  This information includes ammonia background information, material safety data sheets (MSDS), and ammonia reaction chemistry.\n\nEquipment safety information has been compiled on the ammonia process.  Details include maximum intended inventory, safe upper and lower operating temperatures and pressures, and codes and standards used to design, build, and operate the process.  \n\nProcess and chemical safety information is maintained at the facility in a designated process safety information binder, and is also included in all process operation and maintenance procedures.  The facility performs periodic scheduled reviews of the risk management program and process safety management plan to update chemical and safety information if there is a major change that would make existing information inaccurate.\n\nProcess Hazard Analysis \n\nIn February 2003, a detailed process hazard analysis (PHA) was developed for the anhydrous ammonia system with plant operations and maintenance, engineering, and management staff.  The PHA technique used was What If Analysis/Checklist Method, one of EPA's recommended approaches.  In March 2008, the 5-year update for the PHA was performed with a team that meets the RMP and CAPP experience and capability requirements.  The action items that resulted were administrative in nature and staff are working to implement them as soon as possible.  Completion of each action item will be documented.\n\nOperating Procedures\n\nApex Generating Station maintains up-to-date, accurate, written operating procedures that give clear instructions for the ammonia process.  Apex Generating Station ensures effective operating practices by combining them with operating and maintenance training programs.  Standard operating procedures (SOPs) provide system descriptions, specifications, equipment inspection requirements, and operating procedures for the amm"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 51950,
      "SummaryText": "ory of the covered processes.  The details of accidental releases are required for accidents that have caused at least one of the following:\n\n  1. Onsite deaths, injuries, or significant property damage\n\n  2. Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place\n\nApex Generating Station has not had an accident related to the covered process in the previous 5 years.\n\nEmergency Response Program Summary\n\nApex Generating Station has established a written emergency response plan that is followed by the employees to help safely control accidental releases of hazardous substances.  This program has been coordinated with the Clark County Fire Department, the City of Las Vegas Fire Department, and Office of Emergency Management, members of the Local Emergency Response Planning Committee (LEPC).  This program includes emergency evacuation routes, required emergency notifications, and staff responsibilities in the event of an emergency.  Emergency procedures are also reviewed once per year. \n\nPlan To Abate Hazards\n\nDuring the process hazard analyses, additional risk reduction measures were recommended to improve safety, minimize the likelihood and mitigate the effects of an ammonia release at the Apex Generating Station.  A table was used as a  plan to abate hazards identified in the process hazard analysis.  The table includes a description or cause of the hazard, the consequences of the hazard, recommended risk reduction measures, proposed action items to implement the recommendations, a scheduled implementation date, and an actual implementation date.  The table also describes action items for the development of the prevention program and emergency response elements."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 51950,
      "SummaryText": "ronmental stewardship, and we approach the environment with the same innovation, integrity, and drive for tangible results that characterize all other aspects of our business.  In conducting our business, we define environmental stewardship through the following principles:\n\nThe WGCS Health, Safety & Environmental (HSE) Mission Statement states that management is committed to utilize safe and environmentally sound practices at all WGCS Operated facilities to ensure the safety and health of all personnel and the protection of the environment. \n\nHealth, Safety & Environmental Policy\n\nWood Group Contractual Solutions, Inc. gives the highest priority to safety, health, and the environment. A good HSE program contributes significantly to our long-term business success and requires the participation and commitment of all employees. We are committed to:\n  1. Attaining the highest achievable standards of occupational safety and health while protecting the environment.\n  2. Ensuring that safe working conditions are provided and that safe and environmentally sound work practices are followed by employees at all work locations.\n  3. Managing safety, health, and environmental issues with the same priority as our other business activities.\n  4. Complying with local, state, and federal laws and regulations and industry standards relating to occupational safety and health of personnel and the protection of the environment.\n  5. Identifying and correcting safety, health, and environmental hazards.\n  6. Maintaining emergency response procedures to minimize injury or damage to health and loss of property.\n  7. Including the workforce in safety, training, and communication issues.\n  8. Effectively monitoring and reviewing our performance regarding safety, health, and the environment. \n\n\nGeneral Facility and Regulated Substances Information\n\nThe Apex Generating Station is located at 15555 Apex Power Parkway in Las Vegas, Nevada, approximately one mile west of U.S. Hwy 93 and approximat"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 51950,
      "SummaryText": "ely 4.8 miles northwest of the intersection of Highway 93 and Interstate 15. The site is located in Clark County about 20 miles northeast of Las Vegas.  Las Vegas Power Company, LLC, owns the 90-acre site which is within Section 5, Township 18 South, Range 63 East.  Except for a power plant on adjacent property to the south, the site is surrounded by undeveloped industrial zoned properties.  Federal lands managed by the Bureau of Land Management are present to the west of the property boundary.  Further west of the federal lands is the Desert National Wildlife Range. The facility currently stores anhydrous ammonia, a regulated toxic substance under RMP and CAPP regulations, in a steel bulk storage tank.  \n\nAmmonia is required to be used at the Apex Generating Station as Best Available Control Technology (BACT) for the reduction of nitrogen oxides (nitric oxide and nitrogen dioxide) created during the combustion of natural gas and exhausted from the two Combustion Turbine Generators (CTG) and two HRSG duct burners.  Ammonia vapor is drawn from the top of the storage tank and diluted with air, and injected into the two SCR units to reduce the NOx emissions.\n\nAnhydrous ammonia is stored in a 15,228-gallon capacity storage tank.  Because the storage tank is restricted from being filled to more than 80 percent, the maximum inventory of the anhydrous ammonia at the Apex Generating Station is 12,182 gallons or approximately 62,130 pounds.  The safety systems for the ammonia process include the following:\n\n  1. Excess flow valves.  Excess flow check valves protect against tank failure by shutting off flow in the event of a downstream leak.  \n\n  2. Ammonia detectors.  Four permanently mounted ammonia detectors are located at the ammonia storage tank and both flow control skids have a permanently mounted ammonia detector and local alarm horn. The detectors will activate a local alarm horn and an audible and visual signal on the fire alarm panel in the Control Room.  The fire"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 51950,
      "SummaryText": "Executive Summary\n\nIntroduction\n\nChemicals are widely used in industry, in the home, and in the environment.  They are transported on roads, water, and railways.  The Apex Generating Station uses chemicals as a necessary part of reducing the emissions of nitrogen oxides to the atmosphere.  Storing a large quantity of ammonia can be a hazard if it is not handled properly.  As the company responsible for operating Apex Generating Station, owned by Las Vegas Power Company, LLC , Wood Group Contractual Solutions, Inc. (WGCS) takes its safety obligations in storing and using ammonia as seriously as we take controlling emissions from the power plant.  The following document describes what could happen if there were to be an accident, the steps we take every day to ensure a safely operating plant, and what to do in the event of an emergency.\n\nThis document complies with the EPA Risk Management Program under Section 112 (r) of the Clean Air Act (CAA) Amendments of 1990, 40 Code of Federal Regulations (CFR) Part 68, and the Chemical Accident Prevention Program (CAPP) Program under Nevada Administrative Code 459.952.  This document summarizes our existing health and safety programs, our internal management response procedures, and ongoing actions that are designed to prevent or minimize impacts of accidental releases of ammonia to the environment.  Apex Generating Station has prepared an emergency action plan to handle any potential accidental releases.\n\nAccidental Release Prevention and Emergency Response Policies\n\nAs a leading competitive energy provider in the Las Vegas Valley, Las Vegas Power Company generates the energy that creates opportunity --- improving the quality of life and supporting economic development in the community we serve.  In carrying out this important societal function, we continually strive to achieve the appropriate balance of supplying dependable, low-cost energy in an environmentally responsible manner. Our core values drive our commitment to envi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 51950,
      "SummaryText": "alarm panel sends a signal to the local fire department.\n\n  3. Firewater System.  The site has a full service Fire Protection System.  The function of the system is to detect and suppress fires or potential fires and annunciate each occurrence, as well as provide mitigation of an ammonia release from or adjacent to the ammonia storage tank.\n\n  4. Audible and Visual Alarms. \n\n     a. Evacuation Signal: If evacuation of the plant is necessary, the Control Room Operator will make a public address system announcement. \n     b. Ammonia Release Alarm:  Ammonia leak detectors located at the storage tank and flow control skids sound a local alarm and an alarm in the Control Room and Administration Building hallway when ammonia is detected in the air at a concentration of 25 PPM  or above.  The local ammonia alarm consists of a steady siren sound. \n     c. Fire Alarm:  Smoke detectors and pull stations are located through the occupied buildings at the Apex Generating Station that activate the fire alarm.  The alarm consists of a high-pitched beep and strobe light.  The alarm sounds only in the building(s) where the smoke detector or pull station were activated.\n\n  5. Public Address System.  A public address system is installed and is capable of transmitting voice announcements to speakers located at strategic locations throughout the plant, as well as each telephone connected to the communication network.  Access to the system is available from each telephone connected to the communication network.\n\n  6. Emergency Shower and Eyewash. An emergency eyewash and shower station is provided at the truck unloading station near the ammonia storage tank and at each of flow control skids.  \n\n  7. Spray System.  A dual-purpose deluge spray system is installed over the ammonia storage tank and its appurtenances.  The spray system provides a means of controlling and mitigating unauthorized discharges, and it will also provide an emergency means of cooling the tank in the event of overpre"
    }
  ]
}