{
  "FacilityID": 52107,
  "FacilityName": "Quality Pork International, Inc.",
  "FacilityStr1": "10404 F Plaza",
  "FacilityStr2": null,
  "FacilityCity": "Omaha",
  "FacilityState": "NE",
  "FacilityZipCode": "68127",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31055",
  "LEPC": "Douglas County LEPC",
  "FacilityLatDecDegs": "41.220000",
  "FacilityLongDecDegs": "-096.076667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 102296985,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Alan Larson-Plant Engineer",
  "OperatorStr1": "10404 F Plaza",
  "OperatorStr2": null,
  "OperatorCity": "Omaha",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68127",
  "OperatorZipCodeExt": null,
  "RMPContact": "Don Birkentall",
  "RMPTitle": "Safety Director",
  "FTE": 325,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000203148",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-03-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-07-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-07-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-07-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 75760,
      "AltID": null,
      "FacilityID": 52107,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 77583,
          "ProcessID": 75760,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 100445,
          "ProcessID": 75760,
          "ChemicalID": 56,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 600445,
          "ProcessID": 75760,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52107,
      "SummaryText": "Quality Pork International, Inc.\nRisk Management Plan\n \nExecutive Summary\n\n\n1. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAt Quality Pork International, Inc., we utilize anhydrous ammonia which is considered hazardous by the Environmental Protection Agency (EPA). The properties which make ammonia valuable as a refrigerant also necessitate certain safety precautions. Quality Pork International strives to protect all its valuable resources and assets - both personnel and property. We live and have families in this community. We want to prevent exposure to all our personnel as well as nearby members of our community, existing natural resources, and the surrounding environment. It is our policy to comply with Federal, State, and Local regulations. Through continual, accurate training and various safety devices and procedures, we work to minimize potential releases.\n\nOur emergency response program has specific procedures for accidental releases of anhydrous ammonia as well as other emergencies. We work in conjunction with the Omaha Fire Department and the Local Emergency Planning Committee to prepare for necessary notification of all affected neighbors.\n\n\n2. OUR FACILITY AND THE REGULATED SUBSTANCE HANDLED\n\nQuality Pork International, Inc (QPI) is a privately owned pork de-boning facility.  We utilize anhydrous ammonia as the primary means for refrigeration, cooling and freezing. A nationally recognized, reputable and professional ammonia delivery company is used to fill our main receiver tanks. Steel piping then carries the ammonia to the needed refrigeration, cooling or freezing units. Access to the site is restricted to facility employees, authorized management personnel and authorized contractors.\n\nThe regulated substance used at QPI is anhydrous ammonia (NH3). We currently have 16,000 pounds of NH3 at our facility. \n\n\n3. GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\nOn February 24, 1992, the U.S. Department"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52107,
      "SummaryText": " of Labor, Occupational Health and Safety Administration (OSHA) issued the Process Safety Management of Highly Hazardous Chemicals, final rule, 29 CFR 1910.119.  QPI falls under and complies with the PSM standard.  It has been estimated that nearly 25,000 work sites and three million employees are covered under this standard.\n\nThe PSM regulation became effective on May 26, 1992, except for requirements listed under the Process Safety Information paragraph and the Process Hazard Analysis paragraph which were phased in the following five years.\n\nThe standard for process safety management of highly hazardous chemicals is designed to guide facilities in the safe management of processes that use highly hazardous chemicals.  It is a management standard, meaning that it sets performance requirements for management programs, rather than prescribing specific methods that must used to control the hazardous chemicals.  The requirements are intended to prevent or reduce the risk of major industrial incidents that might expose employees to the hazards of toxicity, fire, or explosion.\n\nQPI?s ammonia refrigeration system design and construction is based upon proven and accepted engineering design practices. The system was designed and constructed to meet the Uniform Building Code, Uniform Mechanical Code, Uniform Fire Code, ANSI/ASHRAE Standard 15, and the National Electrical Code. Shut-off valves are strategically located throughout the refrigeration system to allow emergency shut-off, periodic maintenance and repair. Depending on location and use in the system, pressure vessels are ASME rated and fitted with either a single or dual safety relief valve as required by ASME.\n\n\n4. FIVE-YEAR ACCIDENT HISTORY\n\nTo date, there have been no reportable releases at this facility. \n\n\n5. THE EMERGENCY RESPONSE PROGRAM\n\nIn the event of an accidental release of ammonia, the Omaha Fire Department and HAZMAT team would be called.  Our employees would evacuate the facility and meet at the Northwe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52107,
      "SummaryText": "st corner of the property.  We perform a practice evacuation annually.  Tier II forms which describe our facility?s hazardous chemicals are filed with the Nebraska DEQ annually.  Additional copies are sent to the local emergency planning committee and the Omaha Fire Department.\n\n\n6. PLANNED CHANGES TO IMPROVE SAFETY\n\nQPI trains and tests all refrigeration technicians. Our preventative maintenance program is above standard and our Process Safety Management Program (PSM) is reviewed annually and updated periodically.  We take advantage of new technologies when safer, more efficient, and more economical alternatives are available."
    }
  ]
}