{
  "FacilityID": 5240,
  "FacilityName": "Rosemount Wastewater Treatment Plant",
  "FacilityStr1": "4005 140th St. E",
  "FacilityStr2": null,
  "FacilityCity": "Rosemount",
  "FacilityState": "MN",
  "FacilityZipCode": "55068",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27037",
  "LEPC": "Minnesota LEPCs",
  "FacilityLatDecDegs": "44.748222",
  "FacilityLongDecDegs": "-93.022639",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.metrocouncil.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Metropolitan Council",
  "Company2Name": null,
  "CompanyDUNS": 30018576,
  "Company2DUNS": null,
  "OperatorName": "Metropolitan Council",
  "OperatorStr1": "2540 W. 197th St",
  "OperatorStr2": null,
  "OperatorCity": "Farmington",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55024",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": "MND981947849",
  "EPAFacilityID": "100000066233",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-06-15 00:00:00",
  "DeRegistrationEffectiveDate": "2006-05-26 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 44.747222,
  "FRS_Long": -93.024167,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) PRECISE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6180,
      "AltID": null,
      "FacilityID": 5240,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 6715,
          "ProcessID": 6180,
          "ChemicalID": 62,
          "Quantity": 4750.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6330,
          "ProcessID": 6180,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2658,
              "Process_NAICS_ID": 6330,
              "SafetyReviewDate": "1999-06-15 00:00:00",
              "PHA_Date": "1999-09-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-09-18 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-15 00:00:00",
              "TrainingReviewDate": "1999-06-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-15 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "Leak detectors and alarm.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-15 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1997-03-13 00:00:00",
              "AuditCompletionDate": "1997-05-23 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-15 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-15 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-06-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2996,
                  "PreventionProgram3ID": 2658,
                  "ProcessChemicalID": 6715
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5240,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-15 00:00:00",
    "ERTrainingDate": "1998-11-04 00:00:00",
    "CoordinatingAgencyName": "Rosemount Fire Department",
    "CoordinatingAgencyPhone": "6514233444",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 5240,
      "SummaryText": "rio indicate that the scenario has an off site impact that extends to a 0.1-mile radius.\nPrevention Program\nThe Prevention Program consists of 12 elements designed to improve the system safety and decrease the likelihood of a release.\nEmployee Participation \nThe participation of the Rosemount Plant staff in preparing the RMP/PSM program was critical to the program's successful implementation. Employee participation is valuable because it increases the safety awareness of the staff and it allows the staff's experience in operating and maintaining the processes to be incorporated into the plan.\nRosemount Plant staff participated in the development of the Prevention Program through a series of meetings and workshops. Another way that the Rosemount Plant staff participated in the development of the RMP/PSM was the Process Hazard Analysis that is described below. All staff receive RMP/PSM awareness training that instruct them on how the RMP/PSM requirements may impact their jobs.  Staff who operate and maintain the RMP/PSM processes are trained in how to safely maintain and operate the processes.\nProcess Safety Information\nThe RMP/PSM regulations require that information concerning process chemicals, technology, and equipment be compiled as part of the RMP program. Emergency response planners can use such information to develop training programs and procedures, or as a general resource. The information is also supplied to contractors who will work in the chlorine process area as part of the requirements outlined in the Contractors element of this program. All the required process safety information was compiled as stated in the RMP regulations. The information meets and in many cases exceeds the minimum required by the regulations.\nProcess Hazard Analysis\nA process hazard analysis (PHA) was conducted systematically to evaluate potential causes and consequences of accidental releases. This information was used by Rosemount Plant staff to improve safety and reduce the like"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 5240,
      "SummaryText": "ss prior to the pre-startup safety review. The purpose of the pre-startup safety review is to ensure that the facility is ready to operate new and modified regulated processes safely. \nTo initiate the pre-startup safety review, all updated elements of the RMP/PSM plan are assembled for review. This includes all process safety information, process hazard analysis, operating procedures, employee training and mechanical integrity. A pre-startup safety review team completes a pre-startup checklist. The pre-startup safety review team should complete and sign a Pre-startup Safety Review Form. This form documents the process, and helps ensure that the review has been properly performed. The Pre-startup Safety Review Form must be authorized before startup.\nMechanical Integrity\nAn effective mechanical integrity program is one of the primary lines of defense against an accidental release. The mechanical integrity program also addresses equipment testing and inspection, preventative maintenance schedules, and personnel training. The intent is to ensure that equipment used to process, store, or handle chlorine is maintained and installed to minimize the risk of releases.\nThe Rosemount Plant maintenance staff use a computerized maintenance management system to store equipment information, generate and prioritize work orders, schedule preventative maintenance (PM), provide safety procedures for work orders, and maintain an inventory of parts and materials. In addition to preventative maintenance, the plant staff performs corrective maintenance in the event of equipment malfunction or breakdown. Work orders indicate what safety precautions must be followed including whether lockout/tagout or confined space entry provisions are applicable. The staff that perform maintenance tasks are all trained as part of the RMP/PSM program.\nHot Work Permits\nRMP/PSM regulations require employees and contractors to employ safe work practices when performing hot work in, on, or around the chlorin"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5240,
      "SummaryText": "Assessment\nA Hazard Assessment was performed to determine the effects a release would have on the public surrounding the facility. The distance a set endpoint concentration of the chlorine gas would travel must be determined. In addition, an estimate of the population that could be affected by a release of chlorine was determined, and sensitive receptors such as hospitals, schools, and nursing homes were identified. The Hazard Assessment considers two release scenarios-a worst case and an alternative case. \nWorst-Case Scenario\nThe regulations require the development of a worst-case release scenario based on conservative assumptions. For example, the Rosemount Plant is required to assume that the entire contents of the largest single container of chlorine will be released in 10 minutes. This is an extremely unlikely occurrence since the physical properties of chlorine would cause a freeze and thaw cycle to occur at the leak, which would slow the release. In addition, only passive mitigation methods such as buildings or dikes can be considered when determining the distance the release could travel. Passive mitigation, as defined, requires no mechanical, electrical, or human input. However, in many scenarios mitigating the release by isolating the process could reduce the amount released. In addition, the worst-case scenario requires that very stable atmospheric conditions be assumed which results in a large area of impact. These conservative assumptions were set by EPA to ensure public notification and ensure that local emergency response planning takes into account the greatest possible impacted area surrounding the release point.\nThe scenario used for chlorine at the Rosemount Plant is the rupture of a 1-ton chlorine container, resulting in a release of 2,000 pounds of chlorine over a 10-minute duration.  The released liquid is assumed to quickly volatilize and to disperse as a vapor cloud. The hazard assessment requires that the toxic endpoint or distance f"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 5240,
      "SummaryText": "Executive Summary\nIntroduction \nChemicals are widely used in industry, in the home, and in the environment.  They are transported on roads, water, and railways.  The Metropolitan Council's Rosemount Wastewater Treatment Plant stores chemicals that it uses in its daily operations. The facility currently uses chlorine stored in up to two 1-ton containers and five 150-pound cylinders.  Chlorine is used to disinfect the treated wastewater prior to discharge into the river. The natural world contains more than 1,500 chlorine-containing compounds.  Chlorine is also used to purify our drinking water, disinfect our swimming pools and protect human health through the destruction of disease-causing organisms. The World Health Organization estimates that 25,000 children who die daily could be saved through the use of an effective water disinfection agent such as chlorine.\nChlorine is non-explosive and non-flammable. However, it does support combustion under some circumstances.  Chlorine is a respiratory irritant, and exposure through inhalation or eye or skin contact can be hazardous.  As a precaution, the Rosemount Plant has special safety systems that are an integral part of the chlorine system.\nWe take our safety obligations in storing and using chemicals as seriously as we take providing the environment with safe disinfected water.  The following document describes the steps we take everyday to ensure a safely operating plant, what could happen if there was an accidental release of a chemical stored on site, and what to do in event of an emergency.  \nAccidental Release Prevention and Emergency Response Policies\nThis document complies with the U.S. Environmental Protection Agency's (EPA's) Risk Management Program, codified under Section 112 (r) of the Clean Air Act (CAA) Amendments of 1990, 40 Code of Federal Regulations (CFR) Part 68.  The Risk Management Program requires facilities that use certain substances above certain quantity thresholds to develop a plan to reduce"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5240,
      "SummaryText": "the likelihood of an accidental release of the substances to the atmosphere and reduce the likelihood of serious harm to the public and the environment. This plan is referred to the Risk Management Plan (RMP).\nChlorine is stored in quantities above the regulatory thresholds at which a RMP is required.  This RMP document summarizes our existing safety systems, policies, procedures, and on-going actions that are designed to prevent or minimize impacts of accidental releases of chlorine to the environment. The Rosemount Plant has a detailed and comprehensive emergency response plan to handle any potential accidental releases.  To date, we have had an excellent record in preventing accidents from occurring. No chlorine releases causing a safety or health hazard affecting the surrounding community have occurred at the Rosemount Plant since the use of chlorine began.\nUnderstanding the Chemicals Used at the Rosemount Plant\nThe Rosemount Plant, operating since the 1973, is located at 4005 140th Street East in Rosemount, Minnesota.  Wastewater from Rosemount is treated at the plant and discharged into the Mississippi River.  The wastewater treatment process includes aeration and clarification in ponds followed by chlorine disinfection before final discharge.  The Rosemount Plant treats approximately 0.6 million gallons of wastewater per day. The plant has a chlorination system that uses chlorine gas fed from 1-ton chlorine containers or 150-pound cylinders.\nA chlorine distributor delivers the 1-ton chorine containers and 150-pound cylinders to the plant.  Gaseous chlorine is withdrawn directly from the containers and delivered to the wastewater chlorination process.  The Rosemount Plant uses state-of-the-art process equipment to maximize the safety for plant staff and the community at large.  Some of the specific features are as follows.  Chlorine leak detectors continuously monitor for leaks in the bulk storage area and in the chlorination room.  Leak alarms activate an aud"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5240,
      "SummaryText": "rom the point of release to a location at which the chemical concentration equals or exceeds a certain concentration must be determined. The distance to the toxic endpoint was estimated using the EPA-approved DEGADIS BreezeHaz(tm) DEGADIS+ 2.0 gas dispersion model. That concentration is defined as the maximum airborne concentration below which individuals could be exposed for up to 1 hour without experiencing or developing irreversible or other serious health effects, or symptoms that could impair an individual's ability to take protective action. \nIn practice this type of total release of a bulk tank would be unlikely and probably never occur during the lifetime of the plant. The results of the dispersion modeling analysis for the chlorine worst-case release scenario indicate that the scenario has an offsite impact that extends to a 1.7-mile radius. \nAlternative Scenario\nThe RMP rule also requires that at least one alternative release scenario be evaluated for chlorine. The alternative scenarios reflect a type of release that is more likely to occur compared to the worst-case scenario. Unlike the worst-case scenario, the alternative release scenario may consider active mitigation such as shutoff valves and a more realistic release quantity and release rate. Active mitigation is defined as requiring mechanical, electrical, or human input. Lastly, it assumes local, typical meteorology, which is more realistic than the conservative meteorological conditions that must be assumed for the worst-case scenario. The scenario used for chlorine was the failure of a vacuum regulator resulting in a release of chlorine gas through a safety relief valve.  Under this scenario, the amount of chlorine released was calculated to be 100 pounds. The same modeling approach was used as for the worst-case release scenario, except meteorological conditions were adjusted to more likely local conditions. The results of the dispersion modeling analysis for the alternative case release scena"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 5240,
      "SummaryText": "lihood and potential consequences of an accidental release. Equipment, instrumentation, utilities, human actions, and external factors that might affect the process were the focus of the PHAs that were performed for the chlorine process.\nThe chlorine PHA was conducted by an interdisciplinary team of plant staff familiar with process operation and maintenance. The PHA was done using a combination of What-If and Checklist methods. Based on the results of the PHAs, numerous changes in operating, maintenance, and other process safety management procedures that would improve the overall safety of the plant were identified. Several changes have been adopted by the plant and incorporated as part of the overall RMP/PSM program. Other improvements and process modifications to reduce or eliminate potential hazards are scheduled to be implemented or incorporated.\nOperating Procedures\nOperating procedures for the chlorine process have been developed as part of the RPM/PSM plan. Written operating procedures assure continuous, efficient, and safe operation of the facility. The goal of the operating procedures is to provide clear instructions to safely operate the process. Operating procedures are also used to train new employees and to provide refresher training for existing staff.\nThe detailed operating procedures include chlorine loading and unloading, startup, shutdown and normal operating procedures. The procedures describe how the system should be operated in order to minimize the chances of an accidental release. The procedures also emphasize safety considerations during operation and address potential hazardous situations that could occur and how to correct them.\nTraining\nAn effective RMP/PSM training program can significantly reduce the potential for accidental release incidents. Employees involved in operating or maintaining the chlorine process must receive training that includes applicable operating and maintenance procedures and an overview of the process. Trainin"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 5240,
      "SummaryText": "g must emphasize safety and health hazards and safe work practices.\nRosemount Plant staff receive initial training on the operations and maintenance of the chlorine process, an overview of each of the RMP/PSM plan elements, and the procedures that must be followed to comply with the requirements of the RMP/PSM plan. In addition to RMP/PSM plan training, select staff have been trained to respond to an accidental release. Refresher process operation training must be provided at least every 3 years. Refresher training for emergency response is conducted annually.\nContractors\nThe Rosemount Plant must make contractors aware of the known hazards of the chlorine process related to the contractors' work. In addition, the plant must make contractors aware of the applicable elements of its emergency response plan. The Rosemount Plant must evaluate contractors' safety programs and select only those that can perform work on or adjacent to the chlorine process without compromising the safety and health of employees at the facility or the surrounding public. \nBefore allowing a contractor to work on or adjacent to the chlorine process, the plant must obtain and evaluate information regarding the contractor's safety performance and programs. When a contract involving work on or adjacent to the chlorine process is to be bid, the bidding procedures must ensure that contractor safety management requirements are met. If a contractor is to work in or adjacent to any hazardous chemical, a safety briefing, to make the contractor aware of the plant's RMP/PSM plan requirements, must be conducted before work begins. \nPre-startup Review\nA pre-startup safety review must be conducted for any new process that uses a regulated substance under RMP, or for significant modifications to the existing chlorine process that necessitate a change in the process safety information. No new or significantly modified process will start up and no acutely hazardous chemicals will be introduced into such a proce"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5240,
      "SummaryText": "ible alarm throughout the plant and flashing orange lights on the building.  The alarms also sound at the central and local control panels.  Leak alarms are tested weekly. \nOther system alarms include low vacuum at the chlorinator.  This alarm sounds at the chlorine central and local control panels.  Vacuum regulators are mounted directly on the 1-ton chlorine containers and 150-pound cylinders so that all gaseous chlorine piping operates under vacuum.  If a leak were to occur in the gas piping, outside air would be drawn into the piping rather than chlorine gas being forced out of the piping. \nThe chlorine storage area and chlorination room is enclosed in a building.  Both areas are equipped with an automatic ventilation system that operates when the chlorine leak detector detects chlorine.  Emergency showers and eye wash stations are also provided along with smoke alarms. \nThe Rosemount Plant's water discharge permit issued by the Minnesota Pollution Control Agency (MPCA) only requires disinfection from March 1 through October 31.  During the rest of the year chlorine usage is significantly reduced and a complete preventative maintenance program is administered on all chlorine piping and equipment.\nRMP Requirements\nThe RMP consists of three major parts. The first part is the Hazard Assessment. The Hazard Assessment is done to determine the potential effects that a release of a regulated substance could have on the public surrounding the facility. The second part is a Prevention Program that consists of 12 elements designed to improve the system safety and decrease the likelihood of a release. The third part is the Emergency Response Program, which develops a plan for dealing with a release in the unlikely event that one would occur. Because the regulations are very similar, the Prevention Program and the Emergency Response Program also serve as the OSHA Process Safety Management (PSM) plan, and this document is therefore is referred to as the RMP/PSM plan.\nHazard"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 5240,
      "SummaryText": "dit and document the corrective actions and the dates by which they must be taken.\nEmergency Response Program\nThe Emergency Response Program develops a plan for dealing with a release.  OSHA Process Safety Management regulation 29 CFR 1910.119(n) and EPA RMP regulation 40 CFR 68 Subpart E require that an Accidental Release Emergency Response Plan be prepared. The plan must be prepared in accordance with the provisions of another overlapping OSHA regulation-Employee Emergency Plans (29 CFR 1910.38(a)). In addition, provisions of the OSHA hazardous waste and emergency response standard, 29 CFR 1910.120 (q), must also be considered. The Emergency Planning and Response Plan described in this section complies with the requirements of 40 CFR 68.95, 29 CFR 1910.38(a), and 29 CFR 1910.120(q). \nThe Emergency Planning and Response plan provides specific emergency response procedures for accidental releases of chlorine. The emergency response procedures cover a release from the initial alarm stage through either leak stoppage or assistance from an outside hazardous materials response team.  As part of the emergency response procedures there are plans for victim rescue, leak investigation, and communication with additional support agencies. The Emergency Planning and Response plan also indicates the level of training needed to carryout the emergency response procedures. \nInformation regarding self-contained breathing apparatus is also provided in the Emergency Planning and Response plan. It also addresses plant site communication, emergency response equipment, first aid and medical treatment, medical surveillance and consultation, and emergency response drills.\n\nThe Rosemount Plant personnel have been in contact with emergency personnel in the surrounding jurisdictions. These individuals are aware of the chemicals stored and used on site, and have included this information when developing emergency plans for areas impacted off site.\nIn conclusion, the Rosemount Plant has taken"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 5240,
      "SummaryText": "all necessary steps to prevent the release of hazardous chemicals that may harm facility staff or the surrounding public. \nROSEMOUNT WASTEWATER TREATMENT PLANT\t\nEXECUTIVE SUMMARY\tRISK MANAGEMENT PROGRAM\n\n\n\n\n06/17/99\tES-8\n\n06/17/99\tES-1"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 5240,
      "SummaryText": "e process. To ensure that hot work is done safely, a Hot Work Permit Program has been developed that requires a permit to be issued before hot work is performed. Hot work is defined as the use of oxyacetylene torches, welding equipment, grinders, cutting, brazing, or similar flame- or spark-producing operations.\nThe process of completing the hot work permit makes it necessary to identify the hazard, recognize what safeguards are appropriate, and then initiate the safeguards necessary to ensure a fire-safe workplace. Following the standards outline in this section aid in complying with the OSHA Hot Work Regulations (29 CFR 1910.252(a)).\nManagement of Change\nA system for the proper management of changes and modifications to equipment, procedures, chemicals, and processing conditions is required under the RMP/PSM. Modifications to the chlorine system will be reviewed before they are implemented to determine if the modification would compromise system safety. An effective change management system will help minimize the chance for an accidental release.\nIf a modification covered under RMP/PSM is made, its effects must be addressed, employees must be informed, and the written operating procedures must be updated. The intent is to require that all modifications to equipment, procedures, and processing conditions other than replacement in kind be managed by identifying and reviewing them before implementation. A Management of Change Committee that consists of plant engineering, operations, and/or maintenance staff is formed to evaluate any modifications that are covered under the RMP/PSM. The committee will complete a Management of Change Form that must be reviewed and authorized prior to initiation of a covered change.\nIncident Investigation\nEach incident that resulted in or could reasonably have resulted in a catastrophic release of chlorine must be investigated. A process to identify the underlying causes of incidents and to implement procedures for preventing similar"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 5240,
      "SummaryText": "events has been developed. To investigate an incident, facility management will establish an investigation team. As part of the investigation, the investigation team will prepare an incident report to recommend system changes.\nThe investigation team should ask questions such as what equipment failed, which behavior failed, and which material leaked, reacted, or exploded. As part of the incident review, staff actions that may have contributed to the incident will also be reviewed. A determination will be made as to whether it is necessary to institute additional training for the employees to prevent the incident from occurring in the future. On the incident report form, the plant management identifies which of the recommended system changes are approved for implementation. The incident investigation report and any changes resulting from the report will be reviewed with all staff members who operate and maintain the applicable system. \nCompliance Audit\nThe Rosemount Plant is required to complete a compliance audit for the RMP/PSM program. The primary goals of conducting an internal compliance audit are to gather sufficient data to verify compliance with RMP/PSM requirements and good process safety practices, identify process safety deficiencies and develop corrective actions, and to increase safety awareness among plant staff.\nThe compliance audit methodology is modeled after OSHA's guidelines for conducting regulatory PSM compliance audits: Compliance Guidelines and Enforcement Procedures, OSHA Instruction CPL 2-2.45A (September 28, 1995). An internal compliance audit must be conducted at the plant at least once every 3 years for the chlorine process. A team that includes at least one person knowledgeable in the covered processes and an audit leader knowledgeable in RMP/PSM requirements and audit techniques will conduct the audits. Plant management and the audit team will promptly determine an appropriate corrective action for each deficiency identified during the au"
    }
  ]
}