{
  "FacilityID": 52530,
  "FacilityName": "Butte Farm Supply Inc.",
  "FacilityStr1": "48256 St Hwy 12",
  "FacilityStr2": null,
  "FacilityCity": "Butte",
  "FacilityState": "NE",
  "FacilityZipCode": "68722",
  "Facility4DigitZipExt": "0257",
  "FacilityCountyFIPS": "31015",
  "LEPC": "Boyd County LEPC",
  "FacilityLatDecDegs": "42.910278",
  "FacilityLongDecDegs": "-098.808056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "None",
  "Company2Name": "None",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Butte Farm Supply, Inc.",
  "OperatorStr1": "48256 St Hwy 12",
  "OperatorStr2": null,
  "OperatorCity": "Butte",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68722",
  "OperatorZipCodeExt": "0257",
  "RMPContact": "Doug Sextro",
  "RMPTitle": "VP/General Manager",
  "FTE": 0,
  "OtherEPAFacilityID": "None",
  "EPAFacilityID": "100000096219",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-08-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-09-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-09-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-09-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-09-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 42.91028,
  "FRS_Long": -98.80806,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 76449,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 52530,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 78291,
          "ProcessID": 76449,
          "NAICSCode": "49313",
          "_desc": {
            "NAICS_CODE": "49313",
            "NAICS_DESCRIPTION": "Farm Product Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 101280,
          "ProcessID": 76449,
          "ChemicalID": 56,
          "Quantity": 51000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 601280,
          "ProcessID": 76449,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52530,
      "SummaryText": "\n\n\nButte Farm Supply Inc.\n\nP0 Box 257\n\nButte NE 68722\n\nRisk Management Plan - Executive Summary\n\n\n\nFACILITY POLICY:\n\n\n\nThe owners, management, and employees operating at our facility are committed to the prevention of any accidental release of hazardous chemicals transported or stored on our location. In the event that as accidental release should occur, we are prepared to work with our Local Fire Dept, Emergency Response Personnel, and other appropriate authorities deemed applicable depending on the specific incident, to best mitigate any release and to minimize the impact of the release to people and the environment.\n\n\n\nFACILITY INFORMATION:\n\n\n\nThe primary activity of our company is \"NAICS code 49313, Farm product storage and warehousing facility\", however, we are also engaged in providing \"agricultural inputs\" that include the receiving, storage, and reloading of Anhydrous Ammonia fro delivery to farmers in our area. This product is subject to the EPA Risk Management Program and is the subject of this plan. Only the facility used for this product will be included in this report.\n\nAnhydrous Ammonia is received, stored, and distributed for direct application to farm fields during the early spring and late fall months. During the balance of the year, inventories will be storage only, with little if any product transfer taking place. The maximum quantity stored has been listed earlier in the RMP and will not be disclosed in this summary. Maximum quantity handled at a given time will be the unloading of a semi-trailer tank.\n\nThe facility is operated on an \"as needed\" basis with staff present only during the receiving and reloading of product for delivery. Annual hours for these do not meet the 2080 hour requirement to qualify as a \"full time Employee\" on site, therefore item number 1.11 is zero. Our facility has adequate lighting, and is inspected at various times day and night during use, and throughout the \"off season\".\n\n\n\nWORST-CASE RELEASE SCENARIO:\n\n\n\nThe worst-c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52530,
      "SummaryText": "ase release scenario would be the release of the total contents of our largest Anhydrous Ammonia tank, released as a gas over 10 minutes. The maximum quantity released has been identified in this program and would effect some residential population.\n\n\n\nALTERNATIVE RELEASE SCENARIO:\n\n\n\nWe have not had an actual release of Anhydrous Ammonia during the last 5 years at the site so we believe the most likely release would be caused by a break in a transfer hose. Transfer hoses are protected by manual, self-closing excess flow, and \"pull away\" values so our alternative release scenario is based on the loss of contents from the largest hose used for unloading the transportation tanks.\n\n\n\nACCIDENTAL RELEASE PROGRAM:\n\n\n\nFor Anhydrous Ammonia our accidental release program is based on guidelines found in the American National Standards Institute Inc. (ANSI) \"Safety Requirements for the Storage and Handling of Anhydrous Ammonia\" and the Occupational Safety and Health Administration (OSHA) standard 29CFR 1910.111 \"Storage and Handling of Anhydrous Ammonia\".  Additionally, we conduct employee training on the safe handling, transportation and distribution of Anhydrous Ammonia and have installed safety equipment including but not limited to Excess Flow values, Breakaway couplers at risers, Emergency shut-off values and Lock-outs to prevent tampering when the site is unattended. We maintain routine contract with our local fire department and emergency response personnel and have provided and/or participated in safety training exercises on Anhydrous Ammonia.\n\n\n\nFIVE YEAR ACCIDENT HISTORY:\n\n\n\nWe have not had a release on Anhydrous Ammonia within the past five years that has caused death, injury, or significant property damage at the facility. To our knowledge, we have not caused any offsite death, injury, evacuation, sheltering in place, property damage or environmental damage.\n\n\n\nEMERGENCY RESPONSE PROGRAM:\n\n\n\nThis facility is included in the Written Community Emergency Response Pla"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52530,
      "SummaryText": "n as prepared by the Local Emergency Planning Committee and the Nebraska Emergency Management Agency (NEMA). We also include these materials in our own Emergency Action Plan in accordance with OSHA 29 CFR 1910.38. We have provided State and Local authorities all Community Right-to-Know information requested s well as that required under SARA Title III (EPRA). Our written employee safety programs include pre-emergency planning and employee training in accordance with OSHA standards, and are offered for review at any time by our Local Emergency Planning Committee to ensure that they conform to the community plan. We actively encourage participation I our Anhydrous Ammonia training program by the local fire department, local emergency response team, hazardous materials responders, community planners, etc. that may be expected to respond to an incident at our site.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\n\n\nSafety improvement is an on-going process at our facility. Periodic evaluations are performed to assess the maintenance of safe conditions. There are no additional specific recommendations for implementation at this time.\n\n\n\nADDITIONAL INFORMATION:\n\n\n\nFor additional information, response to questions, facility tours, or comments, please contact Doug Sextro at 402-775-2239. He will be happy to assist you and answer all your questions.\n\n"
    }
  ]
}