{
  "FacilityID": 52568,
  "FacilityName": "Utah Olympic Park",
  "FacilityStr1": "3000 Bear Hollow Drive",
  "FacilityStr2": "P.O. Box 980337",
  "FacilityCity": "Park City",
  "FacilityState": "UT",
  "FacilityZipCode": "84098",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49043",
  "LEPC": "Summit County LEPC",
  "FacilityLatDecDegs": "40.714944",
  "FacilityLongDecDegs": "-111.602361",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 38123415,
  "ParentCompanyName": "Utah Atletic Foundation",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Utah Athletic Foundation",
  "OperatorStr1": "3000 Bear Hollow Drive",
  "OperatorStr2": "P.O. Box 980337",
  "OperatorCity": "Park City",
  "OperatorStateFIPS": "UT",
  "OperatorZipCode": "84098",
  "OperatorZipCodeExt": null,
  "FTE": 75,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000074947",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-11-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-09-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-09-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-09-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-09-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 40.714944,
  "FRS_Long": -111.602361,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 76559,
      "AltID": "Ammonia for refrigeration",
      "FacilityID": 52568,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 101441,
          "ProcessID": 76559,
          "ChemicalID": 56,
          "Quantity": 118000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 78405,
          "ProcessID": 76559,
          "NAICSCode": "71121",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 45073,
              "Process_NAICS_ID": 78405,
              "SafetyReviewDate": "2006-10-06 00:00:00",
              "PHA_Date": "2003-08-19 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-05-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Automated stop valves on Lower section of Track. Located at the top of the lower zone on the mid and upper zone supply lines and return line.",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Installation of automatic stop valves located at the top of the upper zone on the mid and upper supply lines as well as the return line.",
              "OpProceduresReviewDate": "2006-10-06 00:00:00",
              "TrainingReviewDate": "2006-10-06 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Discussion and video",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2006-10-06 00:00:00",
              "EquipmentInspectionDate": "2006-10-20 00:00:00",
              "EquipmentTested": "Compressors, ammonia sensors, evaporative condensors, high and low level vessel cut out, automatic valve actuator panel, expansion valves, supply valves, return valves, evaporator piping and insulatio",
              "ChangeMgmtDate": "2004-01-05 00:00:00",
              "ChangeMgmtReviewDate": "2006-10-06 00:00:00",
              "PreStartupReviewDate": "2006-10-19 00:00:00",
              "ComplianceAuditDate": "2006-10-20 00:00:00",
              "AuditCompletionDate": "2007-04-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2006-10-06 00:00:00",
              "HotWorkPermitReviewDate": "2006-10-06 00:00:00",
              "ContractorSafetyReviewDate": "2006-10-06 00:00:00",
              "ContractorSafetyEvalDate": "2006-10-06 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 65379,
                  "PreventionProgram3ID": 45073,
                  "ProcessChemicalID": 101441
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 52568,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2006-10-06 00:00:00",
    "ERTrainingDate": "2006-07-13 00:00:00",
    "CoordinatingAgencyName": "Park City Fire Department",
    "CoordinatingAgencyPhone": "4356496706",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 52568,
      "SummaryText": "Cache National Forest.\n\nThe alternate-case release scenario for the ammonia system at the UOP assumes a release of ammonia from the liquid return line from a condenser. Equation (3) in Chapter 4 of EPA¿s RMP Guidance for Ammonia Refrigeration was used to calculate the release rate for a release of 200 psig ammonia from a ½¿ diameter hole. This calculation assumes a ground level release with more typical meteorological conditions of ¿D¿ atmospheric stability (moderately stable), 3 m/s wind speed, urban topography, and appropriate ambient temperature and humidity values. The calculated release rate was used in Equation (B-4) of Chapter 4 of EPA¿s RMP Guidance for Ammonia Refrigeration to calculate the distance to the toxic endpoint. The alternative release scenario creates the potential to affect residential areas and public recreation areas (i.e., the UOP); however, there are no other public or environmental receptors located with in this radius of the system."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 52568,
      "SummaryText": "EXECUTIVE SUMMARY ¿ RMP PROGRAM\n\nThe Utah Olympic Park (hereinafter ¿UOP¿), a wholly owned operating unit of the Utah Athletic Foundation (hereinafter ¿UAF¿), is home to the bobsled/luge track as well as the 90-meter and 120-meter Nordic ski jumps from the 2002 Winter Olympic Games. The UAF operates the UOP venue year round; however the refrigeration system for the sliding activities is not operated during the off-season (April to October). The UOP employs over 75 staff. The UOP relies on Mother Nature and some snow making equipment to keep snow on the ski jumps. However, the UOP relies on a state of the art ammonia refrigeration system to keep ice on the track. The system has a maximum refrigeration charge exceeding 10,000 pounds  of anhydrous ammonia, and as such , the UOP is subject to EPA regulation under 40 CFR 68, Accidental Release Risk Management of Highly Hazardous Chemicals.  \n\nPursuant to the Risk Management Plan (RMP) regulations (40 CFR 68) and the Process Safety Management (PSM) standard (29 CFR 1910.119), the UOP has developed a comprehensive PSM written program to protect UOP employees and the surrounding Park City, Utah community from exposure to ammonia. The facility completes Pre-Startup Safety Review through checklist analyses prior to the beginning of each Sliding Season. The Facility used the industry standard What-if?/Checklist Analysis developed through the International Institute for Ammonia Refrigeration to conduct a process hazards analysis (PHA) of the track ammonia refrigeration system in September 2000 and was reviewed and updated in August 2003.\n\nThe UAF is committed to the safe operation of the ammonia refrigeration system at the UOP. The UAF¿s implementation of the revised PSM program includes employee education in the hazards of ammonia and measures that can be used to reduce employee and community exposure to accidental releases of ammonia. The PSM includes preventative maintenance programs (mechanical integrity) for the ammonia sy"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52568,
      "SummaryText": "stem that incorporates inspections of the system in accordance with IIAR Bulletin 110, the recognized standard of equipment inspection within the ammonia refrigeration industry, as well as tests of system components in accordance with component manufacturers¿ recommendations. \n\nThe PSM program includes programs for pre-startup safety reviews and management of change (MOC) to the refrigeration system. The program also includes specific requirements for safe work practices (such as safe approaches to welding and similar hot work) and safety requirements for contractors who may be hired to do work on the refrigeration system. The PSM program also includes a program for the evaluation of contractors¿ qualifications.\n\nCompliance audits of the PSM program were conducted in September 1999, July 2001 and October 2006. In addition, the facility was subject to a Chemical Safety Audit (CSA) complete by a team consisting of representatives of U.S. EPA, OSHA and Utah OSHA. Recommendations from the various audits have been evaluated and addressed.\n\nThe PSM written program incorporates the comprehensive emergency response plan for the UOP and places special emphasis on handling accidental releases of hazardous chemicals and coordination of emergency response with local fire departments and other emergency response organizations. The response plan details the emergency response structure and includes personnel responsibilities and procedures within that structure. In addition, the plan includes procedures for notification of local agencies in the event of an incident, facility evacuation and decontamination. Finally the plan discusses emergency preparedness and planning, including facility plans for conducting emergency response team training and drills.\n\nThe UOP has not experienced a release of ammonia involving consequences that affected residents or the environment. However, as part of the RMP requirements, a review of the potential offsite consequences of the accidental worst c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52568,
      "SummaryText": "ase and alternative case releases of ammonia from the refrigeration system was conducted. Although such releases are highly unlikely, the RMP regulation requires these scenario reviews.\n\nFor a toxic substance, such as ammonia, that is a gas at ambient temperature and pressure, the RMP rule requires that the worst-case release scenario assume that the entire contents of the single largest vessel or pipe containing the substance (whichever contains a larger amount) is released over a ten-minute period to form a vapor cloud. A vapor cloud of a toxic substance is assumed to disperse with meteorological conditions of ¿F¿ atmospheric stability and a wind speed of 1.5 m/s; atmospheric stability is broken down into six conditions, ¿A¿ being least stable and ¿F¿ being most stable. The offsite consequences analysis must estimate the distance to an endpoint, as defined in the rule for toxic substances. The toxic endpoint for ammonia is 0.14 mg/L (200 ppm). EPA acknowledges that the required assumptions for a worst-case scenario analysis are very conservative.\n\nThe worst-case scenario for ammonia at the UOP, therefore, involves the release of the entire inventory of the low pressure receiver (the largest ammonia-containing vessel on site); no active or passive mitigation was considered. The distance to endpoint is estimated using Equation (B-2) in Chapter 4 of EPA¿s RMP Guidance for Ammonia Refrigeration. This equation assumes a ground-level outdoor release, with the meteorological conditions specified in the regulation of ¿F¿ atmospheric stability, 1.5 meters/second wind speed, urban topography, and appropriate ambient temperature and humidity values. Based on this estimation, the worst case toxic endpoint extends outside the boundaries of the UOP. Public receptors located within the affected radius include schools, commercial/industrial areas, public recreation areas, and residential areas. Environmental receptors identified within this region include portions of the Wasatch-"
    }
  ]
}