{
  "FacilityID": 52623,
  "FacilityName": "Cypress Creek Wastewater Treatment Plant",
  "FacilityStr1": "201 Seven Mile Island Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Florence",
  "FacilityState": "AL",
  "FacilityZipCode": "35630",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01077",
  "LEPC": "Lauderdale County LEPC",
  "FacilityLatDecDegs": "34.784167",
  "FacilityLongDecDegs": "-087.701389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "C2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.florenceutilities.com",
  "FacilityEmailAddress": "mdoyle@florenceal.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Florence Wastewater Depart.",
  "OperatorStr1": "P.O. Box 1023",
  "OperatorStr2": null,
  "OperatorCity": "Florence",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35630",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Hipps",
  "RMPTitle": "Plant Superintendent",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000006352",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-09-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-09-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-09-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-09-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 34.79833,
  "FRS_Long": -87.70039,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 76636,
      "AltID": "Wastewater Treatment",
      "FacilityID": 52623,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 78483,
          "ProcessID": 76636,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 101527,
          "ProcessID": 76636,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 601527,
          "ProcessID": 76636,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52623,
      "SummaryText": "CYPRESS CREEK WASTEWATER TREATMENT PLANT \n\n\n\nEXECUTIVE SUMMARY FOR CHLORINATION PROCESS \n\n\n\n1. Accidental Release Prevention and Emergency Response Policies \n\nThe Cypress Creek Wastewater Treatment Plant is strongly committed to \n\nemployee, public and environmental safety. This commitment is inherent to a \n\ncomprehensive accidental release prevention program in place that integrates areas such \n\nas design, installation, management practices, operating procedures, maintenance, and \n\nemployee training associated with the chlorination process at our facility. The \n\nchlorination system at our plant is designed to meet industry standards and is well \n\nmaintained. Appropriate controls and alarms are also in place to prevent possible \n\nreleases of chlorine. Furthermore, all applicable procedures of the U.S. Environmental \n\nProtection Agency (EPA) Prevention Program Level 2 are adhered to. \n\n\n\nIn the event an accidental release does occur, our facility is coordinated with the \n\nLauderdale County Emergency Management Agency, local fire and police departments, \n\nas well as, Harcross Chemicals in Muscle Shoals, Alabama. These institutions provide \n\nhighly trained emergency response personnel to control and mitigate effects of the \n\nrelease. \n\n\n\n2. Our Facility and the Regulated Substances Handled \n\nOur facility is a publicly owned wastewater treatment plant. Our primary \n\nactivity is treating municipal wastewater from the City of Florence, AL for discharge \n\ninto the Tennessee River. We have one regulated substance, Chlorine. Chlorine is \n\nused for disinfecting the wastewater and to aid in plant operation. The maximum \n\ninventory of Chlorine at our facility is 16,000 pounds. \n\n\n\n3. The Worst Case Release Scenario and the Alternative Release Scenario \n\nTwo possible chlorine release scenarios, a ?worst case release? and ?alternative \n\nscenario? were analyzed in accordance with EPA?s RMP regulations. To perform the \n\nrequired scenario analyses for our facility, we used reference "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52623,
      "SummaryText": "tables for the Area \n\nLocations of Hazardous Atmospheres [ALOHA(R)] model provided by the American \n\nWater Works Association (AWWA). The following paragraphs provide details of the \n\nchosen scenarios. \n\n\n\nThe worst case scenario, as required by EPA, assumes the maximum quantity \n\nof chlorine in the largest vessel is released as a gas over ten minutes due to an \n\nunspecified failure. Our largest vessel is a ton (2,000 pounds) container. Neither \n\npassive nor active mitigation was considered. At class F atmospheric stability, a 1.5 \n\nm/s windspeed, and a temperature of 101F, a maximum distance of 3.04 miles is \n\nobtained corresponding to a toxic endpoint of 0.0087 mg/L. The potentially affected \n\nresidential population was estimated to be approximately 22,851. Several public \n\nreceptors and one environmental receptor, the Seven Mile Island Wildlife Refuge, were \n\nidentified in the toxic endpoint area. \n\n\n\nPage 1 of 4 \n\n\n\n\n\n\nThe alternative release scenario assumes the chlorine release is less severe and is \n\nmore likely to occur than the worst case release scenario. The scenario chosen involves \n\na tubing failure, bad connection, or valve failure resulting in the release of gas through \n\nthe 5/16 diameter valve body opening. The total quantity released is 317 pounds with \n\nan average release rate of 5.28 pounds per minute and a maximum sustained release \n\nrate of 10.5 pounds per minute. At class D atmospheric stability, a 3.0 m/s windspeed, \n\nand a temperature of 101F, a maximum distance of 0.57 miles is obtained \n\ncorresponding to a toxic endpoint of 0.0087 mg/L. The potentially affected residential \n\npopulation was estimated at 2305. A few public receptors and one environmental \n\nreceptor, the Seven Mile Island Wildlife Refuge, were identified in the toxic endpoint \n\narea. \n\n\n\n4. The General Accidental Release Prevention Program and the Chemical-Specific \n\nPrevention Steps. \n\nOur facility has taken all the necessary steps to comply with the accidental \n\nrelease pr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52623,
      "SummaryText": "evention requirements set out under 40 CFR part 68 of the EPA regulations. \n\nThe following sections briefly describe the elements of the release prevention program \n\nthat is in place at our facility. \n\n\n\n Safety Information \n\n\n\nOur facility maintains a record of safety information that describes the chemical \n\n\n\nhazards, operating parameters and equipment designs associated with the chlorine \n\n\n\nprocess. \n\n\n\n Hazard Analysis \n\n\n\nOur facility conducts a comprehensive overview and analysis of our chlorination \n\nsystem to ensure that the associated hazards are identified and controlled efficiently. \n\nThe methodology used to carry out this analysis is a hazard review checklist specifically \n\ndesigned for water plants. This checklist was designed to meet the requirements of The \n\nChlorine Manual published by The Chlorine Institute. The analyses are performed by \n\nqualified personnel and are revalidated at regular intervals. Any findings related to the \n\nhazard analysis are addressed in a timely manner.\n\n\n\n Operating Procedures \n\n\n\nFor the purposes of safely conducting activities within our chlorination process, \n\nour facility maintains written operating procedures. These procedures address various \n\nmodes of operation such as initial startup, normal operations, temporary operations, \n\nemergency shutdown, emergency operations, normal shutdown, and startup after a \n\nchange. The information is regularly reviewed and is readily accessible to operators \n\ninvolved in the chlorination process. \n\n\n\nPage 2 of 4 \n\n\n\n\n\n\n Training \n\n\n\nOur facility has a comprehensive training program in place to ensure that \n\nemployees who are operating the chlorine process are competent in the operating \n\nprocedures associated with the process. Refresher training is provided at least every \n\nthree years in accordance with EPA?s RMP regulations and more frequently as needed. \n\n\n\nMaintenance \n\n\n\nOur facility has established routine maintenance checks on the chlorine process \n\nequipment to ensure prop"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 52623,
      "SummaryText": "er operations. Process equipment examined by these checks \n\nincludes among others, ton containers, piping, chlorinators, vent systems, rotometers, \n\nand ejectors. Maintenance operations are carried out by qualified personnel with \n\nprevious training in maintenance practices. Any equipment deficiencies identified by \n\nthe maintenance checks are corrected in a safe and timely manner. \n\n\n\n Compliance Audits \n\n\n\nOur facility conducts audits on a regular basis to determine whether the \n\nprovisions set out under the RMP rule are being implemented. In accordance with \n\nEPA?s RMP regulations we perform these audits at least every three years. Any \n\ncorrective actions resulting from these audits are completed in safe and timely manner. \n\n\n\n Incident Investigation \n\n\n\nOur facility promptly investigates any incident which resulted in, or could \n\nreasonably result in a catastrophic release of a regulated substance. These \n\ninvestigations provide valuable information for assessing all possible causes of the \n\nincident ranging from human error to equipment failure. In addition, possible \n\ncorrective actions are identified to prevent the accident from recurring. All reports are \n\nretained for a minimum of five years as required by EPA?s RMP regulations. \n\n\n\n5. Five Year Accident History \n\nOur facility takes pride in doing everything possible to prevent accidental \n\nreleases and has had an excellent record of preventing accidental releases over the last \n\nfive years. Due to our stringent release prevention policies, there has been no \n\naccidental release during this period. \n\n\n\n6. Emergency Response \n\nIn the event of an accidental release of chlorine, we at the City of Florence, \n\nAlabama, Water & Wastewater Department have opted not to implement an Emergency \n\nResponse Program. Instead, in accordance with RMP regulations, we have included \n\nour facility in the community emergency response plan and have the appropriate \n\nprocedures in place to notify emergency responders when there"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 52623,
      "SummaryText": " is a need to respond. \n\n\n\nPage 3 of 4\n\n\n\n\n\n\n7. Planned Changes to Improve Safety \n\nAs a result of preparing this Risk Management Plan, our facility will take the \n\nextra step to ensure all employees continually receive the appropriate training required \n\nto safely operate the chlorination system. In addition, we will install more labels on the \n\nchlorination equipment to make each component more easily identifiable for the \n\noperator and emergency responders. \n\n\n\nPage 4 of 4 \n\n\n\n\n\n\n"
    }
  ]
}