{
  "FacilityID": 52639,
  "FacilityName": "Stampede Meat, Inc.",
  "FacilityStr1": "7351 South 78th Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Bridgeview",
  "FacilityState": "IL",
  "FacilityZipCode": "60455",
  "Facility4DigitZipExt": "1185",
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "41.757667",
  "FacilityLongDecDegs": "-087.814528",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.stampedemeat.com",
  "FacilityEmailAddress": "stampedemt@aol.com",
  "FacilityDUNS": 879375590,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Edward J. Ligas",
  "OperatorStr1": "7351 South 78th Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Bridgeview",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60455",
  "OperatorZipCodeExt": "1185",
  "FTE": 400,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000183632",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-06-02 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-09-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-09-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-09-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-09-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 41.75767,
  "FRS_Long": -87.81453,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-BLOCK FACE",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 76654,
      "AltID": null,
      "FacilityID": 52639,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 101550,
          "ProcessID": 76654,
          "ChemicalID": 56,
          "Quantity": 20800.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 78501,
          "ProcessID": 76654,
          "NAICSCode": "311612",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 45129,
              "Process_NAICS_ID": 78501,
              "SafetyReviewDate": "2008-08-12 00:00:00",
              "PHA_Date": "2008-08-12 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-08-12 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2007-08-06 00:00:00",
              "TrainingReviewDate": "2008-06-06 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-08-06 00:00:00",
              "EquipmentInspectionDate": "2008-07-21 00:00:00",
              "EquipmentTested": "All compressors",
              "ChangeMgmtDate": "2008-04-07 00:00:00",
              "ChangeMgmtReviewDate": "2007-06-28 00:00:00",
              "PreStartupReviewDate": "2008-05-21 00:00:00",
              "ComplianceAuditDate": "2007-06-28 00:00:00",
              "AuditCompletionDate": "2008-11-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-06-28 00:00:00",
              "HotWorkPermitReviewDate": "2008-06-03 00:00:00",
              "ContractorSafetyReviewDate": "2007-06-28 00:00:00",
              "ContractorSafetyEvalDate": "2007-06-28 00:00:00",
              "CBI_Flag": 0,
              "Description": "Ammonia refrigeration system is used to cool meat products and processing area.  This RMP is for a grassroots plant that began operations in September 2003.  Coordination with the Cook County Local Emergency Planning Committee was conducted via the original RMP on August 21, 2003.  Stampede Meat, Inc has implemented a \"stand off\" Emergency Action Plan and has notified the appropriate authorities for response in the event of an emergency.  However, ammonia refrigeration operators attend annual HAZWOPER training in order to attain an education level adequate to enable employees to provide technical assistance to emergency crews in the event of an emergency.",
              "_chemicals": [
                {
                  "PrimaryKey": 65441,
                  "PreventionProgram3ID": 45129,
                  "ProcessChemicalID": 101550
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 52639,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2008-06-28 00:00:00",
    "ERTrainingDate": "2007-06-15 00:00:00",
    "CoordinatingAgencyName": "Cook County LEPC",
    "CoordinatingAgencyPhone": "8154785608",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52639,
      "SummaryText": "Stampede Meat, Inc. (Stampede) operates a meat processing and storage facility in Bridgeview, Illinois.\n\nLike most large food processing plants, Stampede uses anhydrous ammonia in the refrigeration system.  Ammonia is the best refrigerant available for use.  Because of the moderate toxicity and slight flammability, ammonia is considered a hazardous material.\n\nStampede is committed to maintaining a safe manufacturing operation for it's employees and surrounding community.  The refrigeration system complies with local building and fire codes, as well as industry consensus codes and standards where appropriate.  Finally, to comply with requirements of the Occupational Safety and Health Administration (OSHA) and the United States Environmental Protection Agency (USEPA) Stampede has developed a Process Safety Management (PSM) program and Risk Management Program (RMP) to ensure safe operation of the ammonia refrigeration system.\n\nIt is Stampede's priority to prevent accidental releases of hazardous materials rather than responding to emergencies.  The PSM/RM program includes the following elements:\n- Employee Participation: Stampede Meat, Inc. has updated a site-specific employee participation plan that ensures employees and their representatives are consulted when conducting and developing process hazard analyses and other information required to be developed under the PSM/RMP regulation.  In addition, the employee participation program will ensure employees and their representatives have access to process hazard analyses and all other information required to be developed under PSM/RMP.  Additionally, refrigeration operators are involved in monthly PSM meetings.\n- Process Safety Information:  Stampede Meat, Inc. maintains a site-specific PSI program that ensures information pertaining to the hazards, technology, and equipment of the process are properly developed and maintained. Process safety information for the ammonia process has been compiled and was last reviewed an"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52639,
      "SummaryText": "d updated as of August 12, 2008. \n- Process Hazard Analysis:  Stampede Meat, Inc. has updated a site-specific PHA program that ensures a PHA is conducted initially, at a minimum of every five (5) years, and whenever a change is significant enough to require a change in PSI.  In addition, this program ensures PHAs are conducted in accordance with OSHA and EPA regulations and ensures findings and recommendations of PHAs are properly documented. Stampede Meat, Inc. conducted a thorough, initial, PHA study for the refrigeration system during August 2003 and a revalidation during August 2008.\n- Standard Operating Procedures:  Stampede Meat, Inc. has updated a site-specific procedure that ensures operating procedures provide clear instruction for different phases of process operations and ensures they are properly maintained.  Stampede Meat, Inc. updated standard operating procedures for the refrigeration system during July and August 2007.  Annually, the operating procedures are reviewed and certified as accurate.\n- Mechanical Integrity:  Stampede Meat, Inc. has updated a site-specific mechanical integrity procedure that ensures written preventative maintenance procedures are developed and maintained, preventative maintenance tests and inspections are properly documented, and employees maintaining the process receive adequate training.  Stampede Meat, Inc. formalized maintenance procedures for the refrigeration system during July and August 2007.\n- Management of Change:  Stampede Meat, Inc. has updated a site-specific management of change procedure that ensures changes (except for replacement in kind) to the ammonia process, such as additions of new equipment or changes in operating, maintenance, or other procedures are documented.\n- Training:  Stampede Meat, Inc. has updated a site-specific training procedure that ensures employees operating the ammonia process have the knowledge to safely operate the process, are aware of the potential hazards of the process, and under"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52639,
      "SummaryText": "stand the causes of process problems.\n- Pre-Startup Safety Review:  Stampede Meat, Inc. has updated a site-specific pre-startup safety review procedure that ensures a safety review is performed when modifications to the ammonia process are significant enough to require a change in PSI.\n- Contractor Qualifications:  Stampede Meat, Inc. has updated a site-specific contractor qualification procedure that ensures all contract employers? safety performance and programs are evaluated, a contract employee injury and illness log is maintained, information of potential hazards are communicated between Stampede Meat, Inc. and the contract employer, and required training and information is communicated, such as the provisions of the emergency response plan and control over entrance into process areas.\n- Hot Work Permit:  Stampede Meat, Inc. has updated a best management practice for hot work.  Stampede Meat, Inc. updated their hot work permit procedures for the refrigeration system during June 2008.\n- Incident Investigation:  Stampede Meat, Inc. has updated a site-specific incident investigation procedure that ensures each incident that either results in a release or could have resulted in a release of anhydrous ammonia is investigated, within 48 hours, by a team of at least one person knowledgeable in the process.  This procedure will also make provisions to ensure a report is prepared at the conclusion of the investigation and findings are promptly addressed.\n- Emergency Response: Stampede Meat, Inc. has developed an Emergency Response Plan (ERP) to ensure that in the event of an emergency the facility personnel are aware of the appropriate actions to take and authorities to contact in order to mitigate the effects of a release. \n- Compliance Audits:  Stampede Meat, Inc. has updated a site-specific compliance audit program that ensures compliance audits are conducted at a minimum of every three years to verify that Stampede Meat, Inc. PSM/RMP practices and procedures are ade"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 52639,
      "SummaryText": "quate and are being followed.  An initial compliance audit was conducted on June 28, 2007.\n- Trade Secrets:  A program has been developed for use in the event of trade secret information arising.\n- Management System:  An overall management system has been developed to monitor the ongoing progress of the PSM/RM program.\n\nPer EPA requirements, Stampede has analyzed \"worst-case\" and \"alternative\" hypothetical ammonia release scenarios and their consequences, details of which appear in other portions of this risk management plan.  The methodology used to evaluate these accidents is prescribed by regulation and makes no effort to estimate the likelihood or \"risk\" of these incidents.\n\nThe \"worst-case\" release scenario involves loss of the contents of the high pressure receiver over a ten minute period.  As required, this scenario has offsite impact, or a 200 parts per million (ppm) concentration 1.0 mile beyond the property line.\n\nThe \"alternative\" scenario involves lifting of a pressure relief valve, which is a safety device provided on all pressure vessels to prevent accidents such as the one specified in the \"worst-case\" scenario.The alternative scenario also has offsite impact 0.1 mile beyond the property line.  Stampede estimates that the release would end after thirty minutes, a plausible time period considering the ammonia detectors, alarms, and monitoring equipment installed at the facility.\n\nStampede used the EPAs RMP*Comp program the estimate hazards.\n\nThe facility has not experienced accidental releases since construction was completed in 2003.\n\nThrough the PSM/RM program, Stampede systematically reviews potential changes to improve the safe operation of the ammonia refrigeration system.  Stampede is currently working to resolve recommendations and findings raised in the latest PHA."
    }
  ]
}