{
  "FacilityID": 52666,
  "FacilityName": "POET Biorefining - Fostoria",
  "FacilityStr1": "2111 Sandusky Street",
  "FacilityStr2": null,
  "FacilityCity": "Fostoria",
  "FacilityState": "OH",
  "FacilityZipCode": "44830",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39147",
  "LEPC": "Seneca County LEPC",
  "FacilityLatDecDegs": "41.174917",
  "FacilityLongDecDegs": "-083.378806",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.poetenergy.com",
  "FacilityEmailAddress": "fostoria@poetenergy.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "POET Biorefining - Fostoria",
  "OperatorStr1": "2111 Sandusky Street",
  "OperatorStr2": null,
  "OperatorCity": "Fostoria",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44830",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gary Livecchi",
  "RMPTitle": "Plant Engineer",
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000204021",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-10-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-10-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-09-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-09-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "24",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 76685,
      "AltID": "Denaturant System",
      "FacilityID": 52666,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 78532,
          "ProcessID": 76685,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 101584,
          "ProcessID": 76685,
          "ChemicalID": 125,
          "Quantity": 1701000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 601584,
          "ProcessID": 76685,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52666,
      "SummaryText": "Facility Description\nThe POET Biorefining-Fostoria facility is located approximately 1.5 miles northeast of Fostoria, Ohio.  POET Biorefining-Fostoria's main product is denatured ethanol for use as motor vehicle fuel.  Production at the facility was initiated in late September 2008.  POET Biorefining-Fostoria produces ethanol using the dry mill method.  Corn meal is mixed with water and a digestive enzyme to produce starch, which is cooked and liquefied.  The resulting mash is cooled and a secondary enzyme is added to convert the liquefied starch to fermentable sugars.  Yeast is added to the mash to ferment the sugars to ethanol.\n\nThe fermented mash (beer) contains about 10% alcohol and is distilled, then passed through a dehydration system to produce 200-proof anhydrous ethanol.  After final dehydration, the ethanol is collected in two 2,000,000-gallon storage tanks prior to mixing with a denaturant (natural gas condensate, NGC) to make the ethanol unfit for human consumption, per federal and state requirements.  The NGC denaturant is stored (primarily) in Tank No. 805, which has a capacity of 126,900 gallons (approximately 799,000 pounds), and potentially in Tank No. 802, which has a capacity of 270,000 gallons (approximately 1,701,000 pounds).  NGC is blended in-line with the ethanol and transferred to vehicles for transport off-site.  The denatured ethanol is shipped from the facility in tank trucks and rail cars.\n\nChemicals Regulated Under EPA?s Chemical Accident Prevention Program\nThe NGC denaturant is the only CAPP/RMP regulated chemical which exceeds the CAPP quantity thresholds for applicability of the regulation.  The CAPP/RMP regulated process consists of the NGC denaturant storage tanks and the associated blending/transfer equipment and piping.  The denaturant is added to the ethanol to a concentration of 2% to 5%.  The greatest CAPP regulated quantity of denaturant in a tank, vessel or piping system is the quantity in the denaturant storage tanks, locat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52666,
      "SummaryText": "ed in the center containment area of the tank farm.  \n\nAccidental Release Prevention and Emergency Response Policy\nPOET Biorefining-Fostoria is committed to the protection of it employees, the surrounding community and the environment from hazardous substances used in the ethanol fuel production process.  In the event of an emergency, POET Biorefining-Fostoria?s Emergency Coordinator will direct internal response activities to the extent they are within the qualifications and capabilities of company personnel, taking reasonable precautions to prevent or minimize the extent of release or the co-mingling of materials.  There is no facility emergency response team.  Employees within their designated work areas will respond to small releases, if such response does not pose a danger to their health or safety.  In the event of a larger release, it is the policy of POET Biorefining-Fostoria to notify the Fostoria Fire Department and evacuate all employees at the facility.\n\nAccidental Release Prevention Program, and Chemical-Specific Prevention Steps\nPOET Biorefining-Fostoria is committed to protection of the environment through the combined use of inspection, maintenance, employee training and response preparation.  Public access to the facility from the highway is restricted by a gate.  Much of the property is fenced, limiting vehicle access.  The plant is fully lighted. Personnel are typically on-site 24 hours a day, 7 days a week.  There is a multi-camera video surveillance system installed at the property, and a general computer based alarm system.   The alarm system includes monitoring of the storage tanks and denaturant blending system (level control and overfill monitors).  The alarm system is monitored in the control room for abnormal conditions, which trigger visual control panel alarm lights and audible alarms.  All of the facility storage tanks have secondary storage containment and are included in the facility Spill Prevention Control and Countermeasure (SPCC) "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52666,
      "SummaryText": "Plan.\n\nFive-Year Accident History\nThe facility has an excellent record with regard to minimizing recordable and reportable accidents.  There have been no accidents since startup of the facility which require inclusion in the five-year accident history required by Subpart B of the CAPP/RMP regulation. \n\nPlanned Changes to Improve Safety\nPOET Biorefining-Fostoria?s management team is committed to an on-going system of reviewing changes in available technologies and any previous plant incidents to identify opportunities to improve plant safety.  Computer based maintenance software (Maximo) will be implemented which includes automatic scheduling and work order generation for all preventative maintenance inspections and tests.  The facility plans to implement a Maximo module to automatically input safety program information/requirements (e.g., confined space entry, lockout-tagout, personal protection equipment) on all maintenance work orders."
    }
  ]
}