{
  "FacilityID": 52956,
  "FacilityName": "Hot Spring Power Co, LLC",
  "FacilityStr1": "410 Henderson Road",
  "FacilityStr2": null,
  "FacilityCity": "Malvern",
  "FacilityState": "AR",
  "FacilityZipCode": "72104",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05059",
  "LEPC": null,
  "FacilityLatDecDegs": "34.430000",
  "FacilityLongDecDegs": "-092.831944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": "http://gdfsuezna.com",
  "FacilityEmailAddress": "john.morgan@gdfsuezna.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "GDF Suez Energy North America",
  "Company2Name": null,
  "CompanyDUNS": 54447164,
  "Company2DUNS": null,
  "OperatorName": "Hot Spring Power Co. LLC",
  "OperatorStr1": "410 Henderson Road",
  "OperatorStr2": null,
  "OperatorCity": "Malvern",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72104",
  "OperatorZipCodeExt": null,
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000183393",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "1987-AOP-R2",
  "SafetyInspectionDate": "2008-08-21 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-12-30 13:01:48",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-11-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-11-07 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-11-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 34.429361,
  "FRS_Long": -92.830944,
  "FRS_Description": null,
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 77171,
      "AltID": "Aq. Ammonia Storage Tanks",
      "FacilityID": 52956,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 102331,
          "ProcessID": 77171,
          "ChemicalID": 57,
          "Quantity": 51000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 79026,
          "ProcessID": 77171,
          "NAICSCode": "22111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 52956,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2007-09-18 00:00:00",
    "ERTrainingDate": "2008-05-13 00:00:00",
    "CoordinatingAgencyName": "Hot Spring Co. Dept.  Em.  Managemt",
    "CoordinatingAgencyPhone": "5013374811",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52956,
      "SummaryText": "BACKGROUND\nHot Spring Power Company LLC owns and operates the Hot Spring Power facility in Malvern, Hot Spring County, Arkansas.  The facility consists of two natural gas fired combustion turbines with heat recovery steam generators each equipped with duct burners, coupled with a single steam turbine and associated equipment.  The facility began construction in early 2002 and began commercial operation in 2006.\n\nPROGRAM APPLICABILITY\nThe EPA Risk Management Program (RMP) is part of the Clean Air Act and applies to processes storing a specified chemical above a threshold quantity.  The chemicals and threshold quantities are specified in Title 40 of the Code of Federal Regulations (CFR), Part 68.  One such chemical and threshold is ammonia (stored in a 20 weight percent or stronger concentration) in excess of 20,000 pounds.  To minimize the formation of oxides of nitrogen (NOx), Hot Spring Power includes a Selective Catalytic Reduction (SCR) pollution control system.  The SCR system uses 30 weight percent aqueous ammonia, stored in two 23,000 gallon tanks, which equates to approximately 51,000 lbs of ammonia per tank.  \n\nHAZARD ASSESSMENT\nThe RMP requires the facility to evaluate the potential impact zone for accidents involving the aqueous ammonia for a worst-case release.  This worst-case release is highly improbable since it involves the combination of a certain set of weather conditions (dawn after a clear, still night) for a large release of the chemical without any employee intervention.  The weather conditions result in the vapor plume from the release staying highly concentrated and narrow.  \n\nThe result of the Hazard Assessment is a ¿zone of influence¿ which, for toxics, is a distance at which the air concentration of the chemical is at the EPA concentration limit.  Nearly all individuals (including sensitive persons such as people with asthma) could be exposed to the EPA limit for up to one hour without irreversible or other serious health effects.  EPA stat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52956,
      "SummaryText": "es the following about the EPA toxics limit (endpoint) and the worst-case analysis:\n \n¿Because the assumptions required for the worst-case analysis are very conservative, the results likely will be very conservative.  The endpoints specified for the regulated toxic substances are intended to be protective of the general public.  These [toxic] endpoints are concentrations below which it is believed nearly all individuals could be exposed for one-half to one hour without any serious health effects.  In addition, the worst-case analysis is carried out using very conservative assumptions about weather and release conditions.  The distance to the endpoint estimated under worst-case conditions should not be considered a zone in which the public would likely be in danger; instead, it is intended to provide an estimate of the maximum possible area that might be affected in the unlikely event of catastrophic conditions.  ¿EPA intends the estimated distances to provide a basis for a discussion among the regulated community, emergency responders, and the public, rather than a basis for any specific actions.¿  \n\nA release from one of the full, independent, identical storage tanks has been identified as the worst-case release and was considered in the Hazard Assessment.  Each storage tank is surrounded by a partitioned dike, which would fully contain a spill from a single tank, thereby reducing the evaporation rate (and thus, the impact area) of the spill.\n \nThe impact distance from the worst-case scenario has been estimated using the equations and tables in EPA¿s Risk Management Program Guidance for Offsite Consequence Analysis (OCA Guidance), and with EPA¿s SCREEN3 model.  The impact distance from the OCA Guidance tables and equations shows a distance of 0.4 miles while the more refined SCREEN3 model results in an impact distance of 0.29 miles.  Both of these results are less than the 0.50 mile distance to the nearest public receptor (the nearest environmental receptor is grea"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52956,
      "SummaryText": "ter than 0.50 miles from the facility).  However, the impact distance does extend beyond the facility property. \n\nACCIDENT HISTORY AND RESPONSE COORDINATION\nSince the ammonia storage is a new process, there is no accident history for the site; however, the site has coordinated its emergency response procedures with local responders.\n \nPROGRAM CLASSIFICATION\nCurrently, Hot Spring Power meets the three criteria for a Program 1 process.  \n1.  The potential worst-case scenario endpoint does not impact offsite receptors;\n2.  There have been no ammonia accidents with offsite impact; and\n3.  Emergency response has been coordinated with local providers.\n\nIn the unlikely event that a public receptor moves within the 0.29 mile radius of the impact area, the aqueous ammonia storage process at Hot Spring Power would change the classification under RMP from Program 1 to Program 2, requiring submittal of an updated Risk Management Plan.  \n\nACCIDENT PREVENTION ACTIVITIES\nTo prevent future potential ammonia accidents with offsite impacts, Hot Spring Power has undertaken prevention activities.  \n1.  The facility utilizes an extensive, interconnected alarm system to monitor the tanks;\n2.  Access to the site is restricted via guard gates to authorized personnel;  \n3.  All facility personnel are trained on safe work practices and the proper procedures to be followed should a leak or spill occur;\n4.  Spills are contained in the dike, minimizing the impact distance;\n5.  The tanks and unloading areas are situated away from the main process area, such that if an accident were to occur, the area of highest impact would generally be away from employees; and\n6.  Tanks are inspected to ensure their integrity. \n\nHot Spring Power is proactive in efforts to prevent any incident from occurring.  This information is required to be reported in the RMP; however, the facility makes every attempt to prevent, rather than react to situations which may possibly occur."
    }
  ]
}