{
  "FacilityID": 5300,
  "FacilityName": "Hill Brothers Chemical Co. - Salt Lake City",
  "FacilityStr1": "75 North 640 West Street",
  "FacilityStr2": null,
  "FacilityCity": "North Salt Lake",
  "FacilityState": "UT",
  "FacilityZipCode": "84054",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49011",
  "LEPC": "Davis County LEPC",
  "FacilityLatDecDegs": "40.844167",
  "FacilityLongDecDegs": "-111.926111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.hillbrothers.com",
  "FacilityEmailAddress": "hillchem@hillbrothers.com",
  "FacilityDUNS": 56599178,
  "ParentCompanyName": "Hill Brothers Chemical Co.",
  "Company2Name": null,
  "CompanyDUNS": 56599178,
  "Company2DUNS": 0,
  "OperatorName": "Hill Brothers Chemical Co.",
  "OperatorStr1": "1675 North Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Orange",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92867",
  "OperatorZipCodeExt": "3499",
  "RMPContact": "Richard G. Hill",
  "RMPTitle": "Process Safety Coordinator",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000067009",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-02-20 00:00:00",
  "DeRegistrationEffectiveDate": "2019-12-20 00:00:00",
  "AnniversaryDate": "2004-06-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 40.84432,
  "FRS_Long": -111.92628,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6254,
      "AltID": "Warehouse 2",
      "FacilityID": 5300,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 6409,
          "ProcessID": 6254,
          "NAICSCode": "42269",
          "_desc": {
            "NAICS_CODE": "42269",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6802,
          "ProcessID": 6254,
          "ChemicalID": 62,
          "Quantity": 24500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 6803,
          "ProcessID": 6254,
          "ChemicalID": 56,
          "Quantity": 21800.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506802,
          "ProcessID": 6254,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506803,
          "ProcessID": 6254,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5300,
      "SummaryText": "Hill Brothers Chemical Company (HBCC) developed this document to meet Risk Management Plan (RMP) requirements for its facility at 75 North 640 West, Salt Lake City, Utah.  Federal Program 3 requirements apply to storage and distribution of chlorine and anhydrous ammonia cylinders.\n\nThis RMP was prepared in accordance with:\n7 US Environmental Protection Agency (USEPA) requirements in 40 Code of Federal Regulations (CFR) Part 68\n7 OSHA Process Safety Management (PSM) requirements in 29 CFR 1910.119\n\nHBCC prepared this RMP in conjunction with EMCON in Irvine, California.  Technical documentation for the off-site consequence analyses, process safety information and required procedures and records are retained on file at HBCC's facility in Salt Lake City and at its corporate offices at 1675 North Main Street, Orange, California 92867.\n\n\nHBCC Accidental Release Prevention & Emergency Response Policies\n\nHBCC's policy is to conduct all operations in a safe and conscientious manner to prevent accidental releases of any hazardous material, including substances regulated through the Federal Accidental Release Prevention Program.  HBCC trains its operators at this facility to properly handle and store hazardous materials to minimize the possibility of adversely affecting its worker's health, the workplace, the public, and the environment. \n\nHBCC's emergency response policy is contained in its current written Hazardous Materials Business Plan.  HBCC considers the Salt Lake facility to be a \"non-responding\" facility under 40 CFR 68.90.  A designated Emergency Coordinator (EC) and an alternate EC initiate emergency notifications and evacuations.  All employees are trained in their appropriate role in emergency response and proper procedures for awareness level response.  The Salt Lake facility is initiating a highly cooperative relationship with the South Davis Fire Department to ensure a full understanding of normal storage practices and emergency response and evacuation procedur"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5300,
      "SummaryText": "es related to regulated substances.  The Fire Department, located within 1/2 mile of the facility, is used for initial emergency response.  HBCC contracts with a qualified hazardous materials management company for secondary response and proper disposition of hazardous materials and wastes generated during an incident. \n\n\nGeneral Description of Stationary Source and Regulated Substances\n\nHBCC's Salt Lake facility is situated within a commercial/industrial area.  A residential area is located within 1/2 mile west of Interstate 15. The site covers approximately 6,250 square feet and contains offices, a warehouse, and above ground storage tanks for substances not regulated under the RMP program.  Covered processes include unloading, loading and storing pre-packaged chemicals for resale to commercial accounts.  No manufacturing is performed at this facility.  Repackaging of non-regulated substances occurs outside of the warehouse.  The facility was constructed in 1997.  The NAICS code for this facility is 42269, Other Chemicals and Allied Products Wholesalers.\n\nPre-packaged anhydrous ammonia and chlorine containers are stored indoors at designated locations.  The cylinders are stored upright, with cylinder caps and storage tags in place.  One-hundred fifty (150) pound cylinders of both chemicals are chained to a wall at opposite ends of the warehouse.  One-ton containers of chlorine are blocked in place in the warehouse.  Anhydrous ammonia skids have flat bases and require no restraints.  All containers meet DOT specifications and the supplier maintains them in proper condition.  \n\nAnhydrous ammonia and chlorine are inorganic toxic gases liquified under pressure and stored at ambient temperature at the Salt Lake facility.  Anhydrous ammonia is a stable, colorless gas or liquid with an extremely pungent odor.  Chlorine is a stable greenish-yellow gas or clear, amber-colored liquid with a suffocating, pungent, irritating odor.  The National Fire Protection Association ran"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5300,
      "SummaryText": "ks the health hazards of both substances as high.  Anhydrous ammonia has a very high autoignition temperature and is difficult to ignite.  Chlorine is non-flammable but many metals ignite in the presence of chlorine.  Nonetheless, both substances should be stored away from heat and ignition sources.\n\n\nOff-Site Consequence Analyses Results\n\nHBCC assessed the quantity of regulated substances in the warehouse process by reviewing storage capacities, production information, and Tier 2 reports submitted annually under the Emergency Planning and Community Right-to-Know Act (EPCRA). Next, release scenarios were identified that reach a toxic endpoint.  An endpoint is a concentration of the regulated substance listed by the Federal government to establish population zones that would be vulnerable to impacts from an accidental release of the substance.  HBCC used USEPA's RMP*Comp model as the method for determining distance to an endpoint and, in the worst-case scenario, for identifying which release from the facility would result in the greatest distance to a receptor.  The model results in very conservative distances to endpoints.\n\n\nWorst-Case Release Scenario\n\nThe worst-case release scenario uses the largest quantity of a regulated substance from a single vessel failure that results in the greatest distance to a toxic endpoint.  As a result, HBCC selected a release of the chlorine gas from a one-ton container as its worst-case, using the required default values for release duration, wind speed, and atmospheric stability class.  \n\nThe scenario is based on the release of chlorine due to a faulty fusible plug.  Fusible plugs are incorporated into the valve assemblies on chlorine pressure containers.  The purpose of fusible plugs is to protect containers from being overpressurized. Fusible plugs are designed to release if the temperature of a container reaches 158 degrees Fahrenheit in accordance with DOT requirements.\n\nScenario: A faulty fusible plug fails on a chlorine one-t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5300,
      "SummaryText": "on container resulting in complete evacuation of the tank.  The release occurs in an enclosed space, but no other cylinders are affected.  Release time is 10 minutes.  Urban topography was selected on the model.  RMP*Comp calculates the distance to the toxic endpoint as 0.9 miles.  Sensitive public receptors occur within this distance as noted in RMPSubmit and in the RMP Public Document.\n\n\nAlternative Release Scenario for Chlorine Cylinder\n\nAlternative release scenarios are more credible scenarios that could result in a release affecting endpoints off-site.  The alternative release scenario for chlorine was identified after conducting the Process Hazard Assessment (PHA) for this RMP.\n\nScenario:  The valve on a 150-pound chlorine cylinder does not seat properly and leaks while in storage at the warehouse.  There is no passive mitigation available, however, based on the behavior of chlorine, the release is expected to occur in a multi-stage pattern.  This release scenario affects no other cylinders.  HBCC personnel will evacuate and notify the South Davis Fire Department and its qualified hazardous materials management contractor upon discovery of any chlorine release.  Response time is assumed to be 30 minutes.  Urban topography is selected in the model.  RMP*Comp standard wind speed and temperatures are applied.  RMP*Comp calculates the distance to the toxic endpoint as <0.1 miles.  Commercial and industrial facilities occur within this distance, but no sensitive receptors are expected to be affected.\n\n\nAlternative Release Scenario for Anhydrous Ammonia\n\nScenario:  HBCC notices the smell of ammonia as they unload a cylinder from a trailer.  HBCC checks the cylinders and notices that a valve is not seated properly on one cylinder.  Two trained personnel are present.  HBCC opens the valve, allows ammonia gas to blow out for a few seconds, and then cinches it down tightly.  This release scenario affects no other cylinders.  The South Davis Fire Department is contacted "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5300,
      "SummaryText": "for communications about the release.  The release duration is from 30 seconds to two minutes.  RMP*Comp standard wind speed, temperature, and urban topography are selected in the model.  RMP*Comp calculates the distance to the endpoint as 0.1 miles.  Commercial and industrial facilities occur within this distance but no sensitive receptors are expected to be affected.\n\n\nSummary of the General Accidental Release Prevention Program & Chemical Specific Prevention Steps\n\nHBCC's release prevention program complies with Federal RMP and PSM requirements.  Because the regulated substances are pre-packaged and remain in original containers at all times under normal operations, HBCC's prevention program emphasizes thorough training for its employees in hazard communication; proper handling, transfer, and storage methods; and awareness level emergency response.  HBCC's standard operating procedures include routine observation of container integrity during loading and unloading of these cylinders.  For example, two people are always present during loading and unloading to ensure safe container handling using forklifts or hand trucks.  Cylinders, skids and one-ton containers are stored with valve caps or covers in place, and strapped, blocked, or chained in accordance with OSHA requirements for compressed gases.  Containers are all DOT compliant and they are maintained during every refill by HBCC's Phoenix, Arizona or San Jose, California facilities.\n\nSections 7.8a, 7.8b, and 7.10a of RMP*Submit require that the date of the most recent change that triggered management of change procedures, the date of the most recent review of management of change procedures, and the date of the most recent compliance audit be supplied, in their respective locations.  A default date was used because the procedures are currently not applicable to the facility.\n\n\nSummary of 5-Year Accident History\n\nOn the basis of a review with the HBCC PHA team during preparation of this RMP, there have been no "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5300,
      "SummaryText": "accidents or accidental releases involving anhydrous ammonia or chlorine.  Anyhydrous operations began when the facility opened in 1997.  Chlorine warehouse operations began in 1999 and have proceeded without incident as well.\n\n\nSummary of the Emergency Response Program\n\nHBCC's Salt Lake City facility has a written Hazardous Materials Business Plan (Emergency Response Plan).  The plan will be tested through simulated spill/leak/fire emergency response situations at least 3 to 4 times per year.  The plan designates an Emergency Coordinator (EC) and an alternate.  All employees receive awareness-level emergency response training, first aid, and hazard communication training.  Emergency response training occured within the past year but date could not be verified.  Training documentation improvements are recommended as a result of this RMP.\n\nImmediately after suspecting or discovering a release of chlorine, HBCC personnel are instructed to notify the North Salt Lake Fire Department for initial response and evacuate the facility to a staging location in the yard. Response time for these parties is estimated to be 10 minutes, although, 30 minutes to one hour may be required to safely control a chlorine release.  UNDER NO CIRCUMSTANCES will HBCC personnel attempt to control a leaking chlorine cylinder.  No chlorine releases have occurred at the facility.\n\nAnhydrous ammonia releases are detected through the human sense of smell.  Upon detecting a leak, HBCC's EC determines if the leaking cylinder can be promptly and safely controlled.  The EC will also assess whether anhydrous ammonia leaks have the potential to threaten human health or the environment off-site before attempting to control the leak.  HBCC personnel only take initial, reasonable steps to stop minor leaks from anhydrous ammonia cylinders at the facility.  To date, no such leaks have occurred.  Estimated response time is 30 seconds to 2 minutes from detection.  In any event, HBCC will contact the North Salt L"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 5300,
      "SummaryText": "ake Fire Department for response. \n\nDuring off-hours, HBCC's central alarm system sends a call to an off-site security company in the event of a fire.  The security company notifies both HBCC and/or the Fire Department that a release may have occurred.  Estimated response time from the Fire Department is 10 minutes.  Response time for HBCC personnel during off-hours is estimated to be 30 to 90 minutes.\n\nHBCC contracts with the TW Company, a qualified hazardous materials management company, to provide any secondary response or proper abatement and disposition of hazardous materials and wastes generated in a release.  The TW Company is located within 1/4 mile of the Salt Lake facility.\n\nThe facility is believed to be included in the written community emergency respopnse plan and was noted as so in Section 9.1a of RMP*Submit, but this could not be verified by the local community.\n\n\nPlanned Changes to Improve Safety\n\nHBBC has made a number of changes to improve safety at the North Salt Lake facility during this RMP process.  The changes primarily include detailed reviews and documentation of formal operating, maintenance, and emergency response procedures to address comments and recommended actions identified through the Process Hazard Assessment conducted for this RMP.  Planned changes include increased formal coordination with the local Fire Department; quarterly drills to test the emergency response plan as it relates to chlorine and anhydrous ammonia; improved training documentation; updating agreements with suppliers to consult on the mechanical integrity of chlorine and anhydrous ammonia containers in the event of damage or leaks; identification of another designated storage location for one-ton containers away from anhydrous calcium chloride and the fire suppression system controls; and evaluation of controls to the warehouse drainage system to prevent releases from inadvertently exiting the building and depositing in a rain water detention basin."
    }
  ]
}