{
  "FacilityID": 5303,
  "FacilityName": "Hill Brothers Chemical Co. - Los Angeles",
  "FacilityStr1": "2159 Bay Street",
  "FacilityStr2": null,
  "FacilityCity": "Los Angeles",
  "FacilityState": "CA",
  "FacilityZipCode": "90021",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.031389",
  "FacilityLongDecDegs": "-118.228611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.hillbrothers.com",
  "FacilityEmailAddress": "hillchem@hillbrothers.com",
  "FacilityDUNS": 56599178,
  "ParentCompanyName": "Hill Brothers Chemical Co.",
  "Company2Name": null,
  "CompanyDUNS": 56599178,
  "Company2DUNS": null,
  "OperatorName": "Hill Brothers Chemical Co.",
  "OperatorStr1": "1675 North Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Orange",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92867",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000067296",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2005-07-01 00:00:00",
  "DeRegistrationEffectiveDate": "2005-06-20 00:00:00",
  "AnniversaryDate": "2004-06-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 34.031389,
  "FRS_Long": -118.228611,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6257,
      "AltID": "Aqua Ammonia Manufacture",
      "FacilityID": 5303,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 6806,
          "ProcessID": 6257,
          "ChemicalID": 56,
          "Quantity": 91050.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 6807,
          "ProcessID": 6257,
          "ChemicalID": 57,
          "Quantity": 78650.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6412,
          "ProcessID": 6257,
          "NAICSCode": "325998",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2708,
              "Process_NAICS_ID": 6412,
              "SafetyReviewDate": "1999-05-04 00:00:00",
              "PHA_Date": "1999-05-04 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-06-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Liquid level and pressure gauges, Remote-operated solenoid valve",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Document procedures",
              "OpProceduresReviewDate": "1999-05-25 00:00:00",
              "TrainingReviewDate": "1999-05-04 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Safety meetings",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-04 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "Condition of tanks, piping systems, and pressure relief valves (checked daily)",
              "ChangeMgmtDate": "1999-05-04 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-25 00:00:00",
              "PreStartupReviewDate": "1999-05-25 00:00:00",
              "ComplianceAuditDate": "1999-05-04 00:00:00",
              "AuditCompletionDate": "1999-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-25 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-25 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-05 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3056,
                  "PreventionProgram3ID": 2708,
                  "ProcessChemicalID": 6806
                },
                {
                  "PrimaryKey": 3057,
                  "PreventionProgram3ID": 2708,
                  "ProcessChemicalID": 6807
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5303,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-05 00:00:00",
    "ERTrainingDate": "1998-06-21 00:00:00",
    "CoordinatingAgencyName": "City of Los Angeles Fire Department",
    "CoordinatingAgencyPhone": "2134858658",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5303,
      "SummaryText": "Hill Brothers Chemical Company (HBCC) developed this document to meet the requirements for a Program 3, Risk Management Plan (RMP) under the Accidental Release Prevention Program, Clean Air Act Amendments of 1990 for the following process at its facility on 2159 Bay Street, Los Angeles, California: Aqueous Ammonia Manufacturing and Storage.\n\nThis RMP was prepared in accordance with the following Federal and State requirements:\n7 US Environmental Protection Agency (USEPA) requirements in 40 Code of Federal Regulations (CFR) Part 68\n7 OSHA Process Safety Management (PSM) requirements in 29 CFR 1910.119\n7 California Accidental Release Prevention Program (CalARP) requirements in Title 19, California Code of Regulations (CCR), Division 2, Chapter 4.5. \n\nHBCC prepared this RMP in conjunction with EMCON located in Irvine, California.  HBCC closely coordinated the development of this document with the California Administering Agency (AA) for the Los Angeles plant, the Los Angeles City Fire Department.  On the basis of discussions with the AA, Hill Brothers updated and augmented its Risk Management and Prevention Program (RMPP) document prepared in 1996 to meet RMP requirements.  \n\nThis RMP is submitted to both the AA and the USEPA, however, external events analyses related to seismic activity are only required by CalARP and are not submitted to the USEPA.  Technical documentation for the off-site consequence analyses, seismic analyses and updates, the update of the Process Hazard Assessment, and required procedures and records are retained on file at HBCC\u0012s facility in Los Angeles and corporate offices at 1675 North Main Street, Orange, California 92867.\n\n\nHBCC Accidental Release Prevention & Emergency Response Policies\n\nHBCC\u0012s policy is to conduct all operations in a safe and conscientious manner to prevent accidental releases of any hazardous material, including substances regulated through the Federal Accidental Release Prevention Program and CalARP.  HBCC trains is empl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5303,
      "SummaryText": "lant uses commercial grade anhydrous ammonia to manufacture aqueous ammonia (ammonium hydroxide) in grades ranging from 20% and 30% for distribution to HBCC\u0012s customers.  HBCC has identified a single covered process at this plant because all tanks are interconnected.  Tankers off-loading raw materials or manufactured product are also interconnected with this process during off-loading activities.  The NAICS code for this process is 325998 \u0016 All Other Miscellaneous Chemical Products.  \n\nAnhydrous ammonia is an inorganic toxic gas liquefied under pressure and stored at ambient temperature at the LA plant.  Aqueous ammonia is stored as a liquid at ambient pressure and temperature.  It is a stable, colorless gas or liquid with an extremely pungent odor.  It is a strong irritant to eyes, skin, mucous membranes, and the respiratory system.  The National Fire Protection Association ranks the health hazards of ammonia as high.  Both anhydrous ammonia and aqueous ammonia have very high auto-ignition temperatures and are difficult to ignite.  Nonetheless, heat and ignition sources should be avoided.  \n\n\nOff-Site Consequence Analyses Results\n\nHBCC assessed the quantity of regulated substances in the processes by reviewing storage capacities, production information, and Tier 2 reports submitted annually under the Emergency Planning and Community Right-to-Know Act (EPCRA). Next, release scenarios were identified that reach a toxic endpoint off-site.  An endpoint is a concentration of the regulated substance listed by the Federal government to establish population zones that would be vulnerable to impacts from an accidental release of the substance.  HBCC used USEPA\u0012s RMP*Comp model as the method for determining distance to an endpoint and, in the worst-case scenario, for identifying which release from the facility would result in the greatest distance to a receptor.  The model results in very conservative distances to endpoints.\n\nWorst-Case Release Scenario\n\nThe worst-case relea"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5303,
      "SummaryText": "se scenario uses the largest quantity of a regulated substance from a single vessel failure that results in the greatest distance to a toxic endpoint.  As a result, HBCC selected a release of the anhydrous ammonia bulk storage tank as its worst-case, using the required default values for release duration, wind speed, and atmospheric stability class. \n\nScenario:  Anhydrous Ammonia (gas) release from bulk storage tank with no passive mitigation.  Release time is 10 minutes to evacuate all tank contents.  Urban topography was selected on the model.  RMP*Comp calculates the distance to a toxic endpoint as 3.4 miles.  Sensitive public receptors occur within this distance as noted in RMPSubmit and in the RMP Public Document.\n\nAlternative Release Scenario for Anhydrous Ammonia\n\nAlternative release scenarios are more credible scenarios that could result in a release affecting endpoints off-site.  The alternative release scenario for anhydrous ammonia was identified after conducting the Process Hazard Assessment (PHA) for this RMP.\n\nScenario:  A release of Anhydrous Ammonia results from a rupture of the 2-inch hose used to fill the bulk storage tank.  No passive mitigation is in place but operators shut down manual valve within one minute.  Active mitigation is estimated to reduce the release rate by 25%.  Urban topography was selected on the model.  RMP*Comp computes the distance to the toxic endpoint as 0.3 miles.  Sensitive public receptors occur within this distance as noted in RMPSubmit and in the RMP Public Document.\n\nAlternative Release Scenario for Aqueous Ammonia\n\nScenario:  A release of Aqueous Ammonia results from a rupture of the 2-inch hose used to off-load 30% solution from the bulk storage tank to a tanker truck.  No passive mitigation is in place but operators shut down manual valve within one minute.  Active mitigation is estimated to reduce the release rate by 25%.  Urban topography was selected on the model.  RMP*Comp computes the distance to the toxic end"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5303,
      "SummaryText": "oyees at this facility to properly handle and store hazardous materials to minimize the possibility of adversely affecting its worker's health, the workplace, the public, and the environment.  HBCC's Accidental Release Prevention policy is implemented through the management system contained in its RMP.\n\nHBCC\u0012s emergency response policy is contained in its current written Hazardous Materials Business Plan.  HBCC considers the Los Angeles plant to be a non-responding facility under 40 CFR 68.90 and Section 2765.1 of CalARP.  A designated Emergency Coordinator (EC) and an alternate EC initiate emergency notifications and evacuations.  All employees are trained in their appropriate role in emergency response and proper procedures for awareness level response.  The Los Angeles plant maintains a cooperative relationship with the Fire Department to ensure a full understanding of normal storage practices and emergency response and evacuation procedures related to regulated substances.  The Fire Department, located within a 1/2 mile, is used for initial emergency response.  HBCC contracts with a qualified hazardous materials management company for secondary response and proper disposition of hazardous materials and wastes generated during an incident. \n\n\nGeneral Description of Stationary Source and Regulated Substances\n\nThe current aqueous ammonia manufacturing operation at the Los Angeles plant was fabricated in 1968.  Anhydrous ammonia and aqueous ammonia are the two regulated substances managed at this plant and covered by the Federal Accidental Release Prevention Program and CalARP.  The plant is bounded on the north by Bay Street, on the east by an Amtrak service yard and several freeways, on the south by commercial and light industrial facilities.  The area immediately surrounding the Los Angeles plant is zoned for light manufacturing, mercantile, warehousing, and distribution. . A Site Map used in the RMP development process appears as Figure 1-1.\n\nThe Los Angeles p"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5303,
      "SummaryText": "point as 0.1 miles.  Sensitive public receptors occur within this distance as noted in RMPSubmit and in the RMP Public Document.\n\n\nSummary of the General Accidental Release Prevention Program & Chemical Specific Prevention Steps\n\nHBCC's release prevention program complies with Federal ARP, CalARP and PSM requirements.  HBCC's prevention program emphasizes risk management thorough use of equipment rated for ammonia service; training for its employees in hazard communication; proper operating procedures for the manufacture of aqueous ammonia; pressure and temperature limits for process equipment and storage tanks; implementation of programs to maintain the mechanical integrity of equipment; internal auditing and inspection programs; procedures to address change within the parameters of this RMP; and awareness level emergency response.  \n\nHBCC's standard operating procedures include routine observation of equipment condition during daily start-up procedures, production procedures, and daily shutdown procedures.  Two trained operators are always present during bulk tank filling and off-loading to ensure the safe movement of trucks on the property and the integrity of hoses used for filling.  HBCC operators are always present during production of aqueous ammonia to observe pressure and temperature gauges on tanks and pipes and to be alert for any releases of pressure relief valves installed on tanks or hydrostats on piping systems.  \n\nHBCC trains their operators carefully before allowing them to take the lead in aqueous ammonia production operations.  A key training method for process operations involves on-the-job supervision over extended time periods, using repeated demonstration of correct process steps in accordance with written procedures.  HBCC's Branch Manager for the Los Angeles Plant has worked at the facility for over 30 years and has substantial experience in dealing with anhydrous and aqueous ammonia safely.\n\n\nSummary of 5-Year Accident History\n\nOn the basis"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5303,
      "SummaryText": "of a review with the HBCC process hazard assessment team during preparation of this RMP, there have been no accidents or accidental releases involving the regulated substances in the last five years at the Los Angeles plant.\n\n\nSummary of the Emergency Response Program\n\nHBCC's Los Angeles facility has a written Hazardous Materials Business Plan (Emergency Response Plan).  The plan will be tested through simulated spill/leak/fire emergency response situations at least 3 to 4 times per year.  The plan designates an Emergency Coordinator (EC) and an alternate.  All employees receive awareness-level emergency response training, first aid, and hazard communication training.  Emergency response training was completed within the last year.\n\nHBCC's plan calls for its personnel be alert for releases and other emergencies, notify the Fire Department for response, and evacuate the facility.\n\nAnhydrous and aqueous ammonia releases are detected through the human sense of smell.  HBCC will immediately contact the Fire Department for response upon detecting a release.  The EC, in conjunction with the Fire Department, will determine whether the release can be promptly and safely controlled and whether off-site populations will be affected. HBCC personnel are instructed to take only safe and reasonable steps to stop minor leaks from ammonia pipes or tanks at the facility.  No such leaks have occurred in more than 6 years.  Estimated response time is approximately 10 to 30 minutes from detection. \n\nIn off-hours, HBCC's central alarm system sends a call to an off-site security company.  The Security Company notifies both HBCC and/or the Fire Department that a release may have occurred.  Estimated response time from the Fire Department is 10 to 30 minutes.  Response time for HBCC personnel during off-hours is estimated to be 30 to 90 minutes.  \n\nHBCC contracts with Premiere Chemical Management (1-888-429-8281) for secondary response and proper disposition of hazardous materials and was"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 5303,
      "SummaryText": "tes generated during an incident.  \n\nThe facility is believed to be included in the written community emergency response plan and was noted as so in Section 9.1a of RMP*Submit, but this could be verified by the local community.\n\n\nPlanned Changes to Improve Safety\n\nHBBC has made a number of changes to improve safety at the Los Angeles facility during this RMP process.  The changes primarily include detailed reviews and updates of formal operating, maintenance, and emergency response procedures to address comments and recommended actions identified through the Process Hazard Assessment conducted for this RMP.  \n\nPlanned changes within the next year include: increasing formal coordination with the Los Angeles Fire Department; completing emergency response training in accordance with the recently revised plan; improving overall training documentation; conducting quarterly drills to test the emergency response plan as it relates to anhydrous and aqueous ammonia; establishing a schedule for implementation of mechanical integrity testing for bulk storage tanks and piping systems; reviewing the effectiveness of the deluge system installed at the plant; replacing or repairing the steel base plate supporting the reactor vessel; and establishing a repainting schedule to reduce corrosion on pipe lines."
    }
  ]
}