{
  "FacilityID": 53081,
  "FacilityName": "Nebraska Energy L.L.C.",
  "FacilityStr1": "1205 South O Road",
  "FacilityStr2": null,
  "FacilityCity": "Aurora",
  "FacilityState": "NE",
  "FacilityZipCode": "68818",
  "Facility4DigitZipExt": "5304",
  "FacilityCountyFIPS": "31081",
  "LEPC": "Hamilton County LEPC",
  "FacilityLatDecDegs": "40.867306",
  "FacilityLongDecDegs": "-098.038722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.aventinerei.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 835393398,
  "ParentCompanyName": "Aventine Renewable Energy Holdings, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 929922839,
  "Company2DUNS": null,
  "OperatorName": "Nebraska Energy L.L.C.",
  "OperatorStr1": "1205 South O Road",
  "OperatorStr2": null,
  "OperatorCity": "Aurora",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68818",
  "OperatorZipCodeExt": "5304",
  "FTE": 42,
  "OtherEPAFacilityID": "Air 59052",
  "EPAFacilityID": "100000184686",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "59052",
  "SafetyInspectionDate": "2008-11-05 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "2008 resubmittal",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-11-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-12-04 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-12-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2021-02-17 00:00:00",
  "DeRegistrationEffectiveDate": "2021-01-22 00:00:00",
  "AnniversaryDate": "2013-12-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 40.867306,
  "FRS_Long": -98.038722,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 77370,
      "AltID": "Natural Gasoline",
      "FacilityID": 53081,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 102701,
          "ProcessID": 77370,
          "ChemicalID": 155,
          "Quantity": 715000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 84928,
              "ProcessChemicalID": 102701,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 84929,
              "ProcessChemicalID": 102701,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 79234,
          "ProcessID": 77370,
          "NAICSCode": "325193",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 45597,
              "Process_NAICS_ID": 79234,
              "SafetyReviewDate": "2008-10-14 00:00:00",
              "PHA_Date": "2012-08-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2011-05-09 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Electrical area classification",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Loading process flare system",
              "OpProceduresReviewDate": "2012-05-07 00:00:00",
              "TrainingReviewDate": "2008-09-30 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer based training",
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-10-14 00:00:00",
              "EquipmentInspectionDate": "2008-10-03 00:00:00",
              "EquipmentTested": "BC Reboiler Recirc Pump East P-0511B",
              "ChangeMgmtDate": "2008-08-15 00:00:00",
              "ChangeMgmtReviewDate": "2008-10-14 00:00:00",
              "PreStartupReviewDate": "2008-05-12 00:00:00",
              "ComplianceAuditDate": "2011-12-07 00:00:00",
              "AuditCompletionDate": "2012-08-31 00:00:00",
              "IncidentInvestigationDate": "2008-10-01 00:00:00",
              "InvestigationChangeDate": "2008-10-01 00:00:00",
              "ParticipationPlansReviewDate": "2008-10-14 00:00:00",
              "HotWorkPermitReviewDate": "2008-10-14 00:00:00",
              "ContractorSafetyReviewDate": "2008-10-14 00:00:00",
              "ContractorSafetyEvalDate": "2008-10-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 66211,
                  "PreventionProgram3ID": 45597,
                  "ProcessChemicalID": 102701
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 53081,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Aurora Rural Fire District",
    "CoordinatingAgencyPhone": "4026943855",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 53081,
      "SummaryText": "conduct process hazard analysis on the existing process or a proposed modification to a process.\r\n\r\nNebraska Energy LLC process safety information is maintained and is available to all affected employees. \r\n \r\nPROCESS HAZARD ANALYSIS (PHA)\r\n \r\nNebraska Energy is committed to performing a detailed hazard analysis of each covered process to identify, evaluate, and control hazards involved in the processes.  Each process is systematically examined to identify potential hazards controls in place to manage these hazards, and recommend additional controls, as appropriate.\r\n \r\nNebraska Energy LLC uses the hazard and operability (HAZOP) and check list PHA methodologies, which are conducted using a team of people who have operating and maintenance experience as well as engineering expertise.  The team identifies and evaluates potential hazards of the process as well as accident prevention and mitigation measures, and makes suggestions for additional prevention and / or mitigation measures. \r\n \r\nNebraska Energy LLC periodically updates and revalidates the hazard analysis results.  As a minimum these periodic reviews are conducted every 5 years as long as the process is operating.\r\n\r\nPHA finding and recommendations and the resolution of thereof are documented.  Nebraska Energy LLC has implemented a system to address and resolve all PHA findings and recommendations in a timely manner through a written schedule.  All PHA findings and recommendation resolutions are communicated to all effected employees.  All recommendations must be resolved by management.\r\n\r\nOPERATING PROCEDURES\r\n \r\nThe policy of Nebraska Energy is to ensure that all operations covered under PSM have detailed procedures to cover each step of the process to assure that a ready and up to date reference is available and to form a foundation for needed employee training.  Operating procedures are readily accessible to employees who work in or maintain a process.\r\n\r\nNebraska Energy LLC operating procedures are revie"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 53081,
      "SummaryText": "DESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\r\n\r\nNebraska Energy LLC, located in Aurora, Nebraska, U.S.A., operates processes to produce ethyl alcohol which is denatured with natural gasoline.  Natural gasoline contains regulated substances isopentane and pentane.  Denatured ethyl alcohol is stored on site, and then shipped to customers.\r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM \r\n \r\nThe following is a summary of the accidental release prevention program in place at Nebraska Energy LLC.  Because a process at the facility that is regulated by the Environmental Protection Agency's (EPA's) risk management program (RMP) regulation is also subject to the Occupational Safety and Health Administration's (OSHA's) process safety management (PSM) standard, this summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accidental release prevention program.\r\n \r\nEMPLOYEE PARTICIPATION\r\n \r\nInvolvement and participation by all employees and their representatives is an important aspect of Nebraska Energy's PSM / RMP program.  Nebraska Energy LLC employee involvement in the PSM / RMP programs will ensure that all perspectives are considered and that the best ideas are implemented. In addition, all Nebraska Energy LLC employees have the right, and the responsibility, to participate in the development of PSM activities.\r\n\r\nPROCESS SAFETY INFORMATION\r\n \r\nNebraska Energy LLC has compiled written process safety information for all PSM covered processes.  The process safety information includes the hazards of chemicals used or produced in the process, process technology information, and process equipment data.  The process safety information is updated whenever process changes are made.\r\n\r\nAccurate and complete process safety information enables Nebraska Energy LLC employees involved in operating and maintaining the plant to identify and understand the hazards of the process.  Process safety information is used to"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 53081,
      "SummaryText": "wed as often as necessary to ensure that they reflect current operating practices, including changes in process chemicals, technology, equipment and facilities. To guard against outdated or inaccurate operating procedures, Nebraska Energy LLC certifies and documents annually that these operating procedures are current and accurate.\r\n\r\nNebraska Energy LLC written procedures address the following phases of operation including: a) initial startup procedures; b) normal operating procedures; c) temporary operations; d) emergency shutdown procedures; e) emergency operations; f) normal shutdown; g) startup after a turnaround or emergency shutdown; h) operating limits; i) safety and health considerations; and j) safety systems.\r\n \r\nTRAINING\r\n \r\nNebraska Energy believes that the implementation of an effective training program is one of the most important steps that an employer can take to enhance employee safety. Nebraska Energy LLC requires that each employee presently involved in operating a process or a newly assigned process must be trained in an overview of the process and in its operating procedures.  This training is done on initial hiring, when there are any changes in Nebraska Energy LLC operations and at least every three (3) years.  Nebraska Energy LLC training includes emphasis on the specific safety and health hazards of the process, emergency operations including shutdown, and other safe work practices that apply to the employee's job tasks.\r\n\r\nNebraska Energy LLC periodically evaluates training programs to see if the necessary skills, knowledge, and routines are being properly understood and implemented by their trained employees.\r\n \r\nCONTRACTORS\r\n \r\nNebraska Energy LLC uses contractors to supplement its workforce during periods of additional maintenance or construction activities.  Because some contractors work on or near PSM covered process equipment, the facility has procedures in place to ensure that contractors are qualified to perform the work and are in"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 53081,
      "SummaryText": "ance materials, spare parts, and equipment are suitable for the application for which they will be used.\r\n \r\nSAFE WORK PRACTICES\r\n \r\nNebraska Energy LLC has developed and implemented safe work practices to provide for the control of hazards during work activities such as lockout/tagout; confined space entry; opening process equipment or piping; and control over entrance into a facility by maintenance, contractor, laboratory, or other support personnel. These safe work practices apply both to employees and to contractor employees.\r\n \r\nMANAGEMENT OF CHANGE\r\n \r\nNebraska Energy requires that a Management of Change (MOC) be performed for any modification to equipment, procedures, raw materials, and process conditions of a PSM covered process.\r\n\r\nThe Nebraska Energy LLC Management of Change program ensures that modifications to the process are reviewed before installation to ensure that no unforeseen hazards are introduced.  The modification is also reviewed after installation, but before startup, to ensure that the installation met all safety and design requirements.  The MOC process also requires that equipment records, process safety information, operator training, and operating procedures are updated when changes in the process occur.\r\n\r\nACCIDENT HISTORY\r\n\r\nNebraska Energy has not experienced an accident involving RMP regulated substances within the last 5-years. \r\n\r\nINCIDENT INVESTIGATION\r\n \r\nNebraska Energy requires any incidents that resulted in a release of a highly hazardous chemical, or near misses, must be investigated.  The incident investigation will be started as soon as possible, but no later than 48 hours following the incident.  A team consisting of at least one person knowledgeable in the process will investigate the incident. The Process Incident Investigation Teams gather, examine, and report the facts pertaining to each process incident.  Nebraska Energy LLC has established a system to promptly address and resolve the reported incident investigation f"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 53081,
      "SummaryText": "formed of the potential hazards.\r\n\r\nNebraska Energy LLC provides contractors with a site specific orientation that includes; a process overview, information about safety and health hazards, emergency response plan requirements, and safe work practices prior to their beginning work.\r\n\r\nNebraska Energy LLC evaluates contractor safety programs and performance during the selection of a contractor and throughout the contractors work activities.  Nebraska Energy LLC Facility personnel periodically monitor contractor performance with regard to their safety obligations.\r\n\r\nPRE-STARTUP SAFETY REVIEWS (PSSR's)\r\n \r\nNebraska Energy LLC requires a pre-startup safety review (PSSR) to be performed and documented for any physical modification in the PSM covered processes.  Additionally, any new units added at Nebraska Energy LLC which is considered PSM covered processes will also require a PSSR to be performed and documented.\r\n\r\nMECHANICAL INTEGRITY\r\n \r\nNebraska Energy LLC believes it is important to maintain the mechanical integrity of critical process equipment to ensure it is designed and installed correctly and operates properly. Inspections and testing are performed on process equipment, using procedures that follow the manufacturer¿s recommendations, and recognized and generally accepted good engineering practices.  Each inspection and test on process equipment is documented, identifying the date, the name of the person who performed the inspection or test, the serial number or other identifier of the equipment, a description of the inspection or test performed, and the results.\r\n\r\nNebraska Energy ensures that equipment deficiencies outside of the acceptable limits are corrected before further use or in a safe and timely manner when necessary means are taken to provide safe operation.  Nebraska Energy will ensure that new or modified plants and equipment are fabricated, and installed properly and consistent with design specifications.  Nebraska Energy will ensure that mainten"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 53081,
      "SummaryText": "Nebraska Energy LLC processes.  The emergency action plan changes are administered through the MOC process, which includes informing and/or training affected personnel in the changes.\r\n \r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n \r\nNebraska Energy LLC resolves all findings and recommendations from PHA's and compliance audits, some of which result in modifications to the process."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 53081,
      "SummaryText": "indings and recommendations.  Nebraska Energy LLC then implements appropriate preventative measures to reduce the potential for future recurrence of similar process incidents.  All affected Nebraska Energy LLC personnel and contractors review the completed incident investigation reports.\r\n\r\nCOMPLIANCE AUDITS\r\n \r\nNebraska Energy LLC will certify compliance with the provisions of PSM and RMP at least every three (3) years through the completion of compliance audits.  The compliance audits will verify that the procedures and practices developed under the standard are adequate and are being implemented.  Nebraska Energy LLC compliance audits are conducted by at least one person knowledgeable in the process.  A report of the findings of the audit and recommendations are developed and documented noting findings and recommendations that require resolution.\r\n\r\n The two most recent compliance audit reports are maintained in the PSM filing system.  \r\n \r\nEMERGENCY ACTION PLAN INFORMATION\r\n \r\nNebraska Energy LLC maintains a written emergency action plan, which is in place to help protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency actions, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public, if a release occurs, and post incident cleanup and decontamination requirements.  In addition, Nebraska Energy LLC has procedures that address maintenance, inspection, and testing of its emergency action plan.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  When necessary, the emergency action plan is updated based on modifications made to"
    }
  ]
}