{
  "FacilityID": 53132,
  "FacilityName": "Ten Mile Water Treatment Plant",
  "FacilityStr1": "1115 Rimini Road",
  "FacilityStr2": null,
  "FacilityCity": "Helena",
  "FacilityState": "MT",
  "FacilityZipCode": "59601",
  "Facility4DigitZipExt": "9624",
  "FacilityCountyFIPS": "30049",
  "LEPC": "Lewis & Clark County LEPC",
  "FacilityLatDecDegs": "46.571917",
  "FacilityLongDecDegs": "-112.215194",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.ci.helena.mt.us",
  "FacilityEmailAddress": "dclark@ci.helena.mt.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Helena",
  "Company2Name": "Public Works, Water Department",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Helena",
  "OperatorStr1": "1115 Rimini Road",
  "OperatorStr2": null,
  "OperatorCity": "Helena",
  "OperatorStateFIPS": "MT",
  "OperatorZipCode": "59601",
  "OperatorZipCodeExt": "9624",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000014646",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-11-29 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-12-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-12-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-12-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-01-29 00:00:00",
  "DeRegistrationEffectiveDate": "2019-01-04 00:00:00",
  "AnniversaryDate": "2013-12-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 46.57321,
  "FRS_Long": -112.21809,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "0.5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 77453,
      "AltID": "Chlorine",
      "FacilityID": 53132,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 102901,
          "ProcessID": 77453,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 79318,
          "ProcessID": 77453,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 45657,
              "Process_NAICS_ID": 79318,
              "SafetyReviewDate": "2008-10-17 00:00:00",
              "PHA_Date": "2008-05-13 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2008-09-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Process operates under vacuum",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Leak Alarms, Process Operates Under Pressure",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Label valves, revise SOPs, update recordkeeping",
              "OpProceduresReviewDate": "2008-10-17 00:00:00",
              "TrainingReviewDate": "2008-10-17 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Conferences",
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-10-17 00:00:00",
              "EquipmentInspectionDate": "2007-11-29 00:00:00",
              "EquipmentTested": "Auto shut off valves",
              "ChangeMgmtDate": "2007-11-29 00:00:00",
              "ChangeMgmtReviewDate": "2008-10-17 00:00:00",
              "PreStartupReviewDate": "2005-11-01 00:00:00",
              "ComplianceAuditDate": "2007-11-29 00:00:00",
              "AuditCompletionDate": "2008-10-17 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2008-10-17 00:00:00",
              "HotWorkPermitReviewDate": "2008-10-17 00:00:00",
              "ContractorSafetyReviewDate": "2008-10-17 00:00:00",
              "ContractorSafetyEvalDate": "2005-11-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "This process involves receiving, storing, and dispensing chlorine from high pressure cylinders, where it is liquified, to a metered feed system where it is diluted and introduced into the city water supply to provide disinfection. The storage and chlorination areas are continuously monitored for chlorine leaks. Emergency repair kits are kept nearby and safety procedures are in place for normal operations as well as repair and emergency scenarios.",
              "_chemicals": [
                {
                  "PrimaryKey": 66382,
                  "PreventionProgram3ID": 45657,
                  "ProcessChemicalID": 102901
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 53132,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2008-10-17 00:00:00",
    "ERTrainingDate": "2004-03-15 00:00:00",
    "CoordinatingAgencyName": "Lewis and Clark County LEPC",
    "CoordinatingAgencyPhone": "4064478285",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 53132,
      "SummaryText": "\n1.0 EXECUTIVE SUMMARY\n\n\n\n1.1 Introduction\n\n\n\nThe goal of the City of Helena Water Division (HWD) is to ensure customer satisfaction by consistently delivering high quality water today and in the future.\n\n\n\nHWD serves more than 29,000 customers with approximately 9,300 service taps including 155 fire lines with an annual average of 5.5 million gallons of water per day. The total annual gallonage from all sources for 2006 was 2.01 billion gallons with a peak day of 14.5 million gallons.  One source of this water supply is the Ten Mile Water Treatment Plant (TMWTP) west of Helena at 1115 Rimini Road.  TMWTP is in operation year-round.  Other water treatment facilities operate only during the summer months for peak demands and include the Missouri River Water Treatment Plant (MRWTP) and the Eureka well and pump station.  TMWTP is maintained, evaluated and upgraded to stay abreast of advancements in technology, health science and governmental regulations.\n\n\n\nThe Helena water distribution system consists of six finished water storage reservoirs (Malben, Winne, Hale, Upper Hale, Woolston, and Knob Hill) and five pumping stations (Forest Estates, Hale, Eureka, Dahlhausen, and Reeders Village) linked together with 185 miles of water transmission and distribution pipelines.  The Chessman (530 MG) and the Scott (195 MG) reservoirs in the Ten Mile Watershed also provide additional water for TMWTP during low flows.  These reservoirs are filled with spring run-off water.\n\n\n\nIn 2005 and 2006, a security improvement project was completed, with fencing, alarm, and access entry systems that provide better protection to the water supply and treatment infrastructure. Negotiation and renewal of a 40-year contract with the US Bureau of Reclamation for purchase of Missouri River water from the Canyon Ferry Reservoir was finalized assuring an adequate supply of raw water through 2044 with the ability to renew the contract indefinitely. Also, the City completed a comprehensive Water Facili"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 53132,
      "SummaryText": "ties Plan Update that defines needed improvements and capital expenditures for the next several years. \n\n\n\nIn 2007, the City completed a major upgrade to the Missouri River Treatment Plant to improve reliability, maintain regulatory compliance and meet future growth needs. As part of that upgrade, MRWTP was converted to use bleach as the disinfecting agent in place of chlorine.  As a result, MRWTP was delisted from the Chemical Accident Prevention Provisions and the Risk Management program in May of 2008.  \n\n\n\n1.2 Facility and Regulated Substances\n\n\n\nTMWTP is a local government owned and operated facility for the production of potable water for the City of Helena.  The only regulated substance present in reportable quantities under the Chemical Accident Prevention Provisions found at Title 40 Part 68 of the Code of Federal Regulations (40 CFR 68) is chlorine.  Two to eight tons of chlorine are stored at this facility in 150-pound and one-ton cylinders for a total of 16,000 pounds.  The cylinders contain liquid chlorine under pressure.  No more than two one-ton cylinders are on line at any one time.  One cylinder is in actual use and the other is in standby mode.  \n\n\n\n1.3 Accidental Release Prevention and Emergency Response Policies\n\n\n\nThe on-line tanks have tank-mounted isolated regulators called Chlorine Pressure Reducing Valves (CPRVs) that reduce the chlorine pressure to a vacuum state. Chlorine feed lines supply chlorine below atmospheric pressure.  Should a leak develop, the feeders would be unable to supply enough vacuum to continue the release of chlorine and the feed would stop at the CPRV attached to the tank.  No flammable substances or other restricted items are stored in the chlorine tank room.  The room has a chlorine detector connected to an alarm panel, annunciator horn, computer, and autodialer.  All unacknowledged alarms initiate the autodialer, which calls all on-duty and off-duty personnel until the alarm is acknowledged.  If the alarm conditions "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 53132,
      "SummaryText": "continue to exist after an hour, the autodialer again starts calling operators.  All alarms and the autodialer are on batteries, uninterruptible power supplies and a backup electrical generator.\n\n\n\n1.4 Accident Release Prevention Program and Chemical Specific Prevention Steps\n\n\n\nEPA has determined that the TMWTP is subject to the RMP Level 3 Prevention Program.  This prevention program is specifically intended for facilities with the NAICS codes listed at 40 CFR 68.10(d)(1), or those processes subject to the OSHA Process Safety Management (PSM) standard found at 29 CFR 1910.119.  The NAICS for water supply and irrigation systems is not listed.  The staff at TMWTP comprises municipal government employees, who are not subject to OHSA rules.  However, the potentially large amount of chlorine on site makes the Level 3/PSM standard an appropriate prevention program for TMWTP.\n\n\n\nThe safe handling of chlorine is accomplished by maintaining the system under negative atmospheric pressure and by allowing only well trained operators to work with the chlorine handling system.  Cylinders with exceptionally difficult or tight valves are rejected and returned to the supplier.  Regular maintenance is performed on all chlorination equipment (CPRVs, lines, and feeders) and safety equipment (i.e., self-contained breathing apparatus) in accordance with computer-generated work orders.\n\n\n\nSelf-contained breathing apparatus (SCBA) and air tanks are kept in a separate adjacent room along with emergency oxygen.  These items are wall-mounted with quick release brackets.\n\n\n\nOperators are trained in proper leak detection and correction.  It is standard operating procedure to have two operators present for tank changes, repairs, and any work on the CPRVs.  A third operator is notified of any leaks and told to notify emergency responders if communication is lost for more than 20 minutes.  An emergency repair kit is stored in a designated and labeled space near to, but outside of, the chlorine s"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 53132,
      "SummaryText": "torage and chlorinator rooms.\n\n\n\n1.5 Five Year Accident History\n\n\n\nTMWTP has an excellent record of preventing significant accidental releases over the past five years.  As determined by the RMP program, during this period, there have been no recordable accidental releases of chlorine that have resulted in deaths, injuries, or significant property damage on site or any know offsite deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.  Safety practices and operating procedures in place at TMWTP have produced this enviable safety record.\n\n\n\n1.6 Emergency Response Program\n\n\n\nTMWTP uses the procedures in the Site Emergency Action Plan Ten Mile Water Treatment Plant (EAP) for general emergency responses.  The plan addresses many different emergency situations and includes procedures for general hazardous materials incidents.  The manual was written specifically for the plant in 1994, is reviewed annually, and is updated as required to reflect any pertinent changes that would require a modified emergency response.  The most recent revisions were made in 2005.  \n\n\n\nTo ensure proper functioning, emergency response equipment is inspected and serviced as necessary.  \n\n\n\n1.7 Planned Changes to Improve Chlorine Handling Safety\n\n\n\nTMWTP maintains an ongoing safety program to minimize accidental releases of chlorine. This program includes employee training, preventive maintenance, lockout/tagout procedures, vessel entry procedures, respirator training, and safe handling/operational procedures for the chlorine handling system.  Safety is a major concern and an ongoing priority at TMWTP.  Improvements in safety are updated in the appropriate documents and implemented on an as-needed basis.  \n\n\n\nTo enhance safety even further, TMWTP is scheduled for upgrades in the next several years that will replace chlorine with bleach as the disinfecting agent.\n\n\n\n1.0 \n\n2.0 PROGRAM LEVELS AND APPLICABILITY\n\n\n\nSection 112(r) of the Clean Air Act requires th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 53132,
      "SummaryText": "e owners and operators of stationary sources producing, processing, handling or storing extremely hazardous substances to develop an RMP for the facilities when the amount of the substance on site exceeds the threshold quantity. The extremely hazardous substances subject to regulation by the Chemical Accident Prevention Provisions and the preparation of an RMP are listed with their threshold quantities in Tables 1 through 4 in 40 CFR 68.130.  These substances are divided into toxic substances and flammable substances.  \n\n\n\nA careful review of the regulated substances on site at TMWTP found that chlorine is the only listed hazardous substance with the potential to be present in an amount exceeding the threshold quantity (2,500 pounds for chlorine).  The maximum potential chlorine inventory is approximately 16,000 pounds.  The single largest vessel is a one-ton pressurized cylinder.  Smaller 150-pound cylinders are also stored at TMWTP.  There are no flammable substances present at TMWTP in excess of the threshold quantities.\n\n\n\nOnce it has been determined that the stationary source must prepare an RMP for the substance that is regulated, the next step is to determine the appropriate prevention program level for the process in which that substance is found.  Three prevention program levels are specified in the rule.\n\n\n\nProgram Level 1:  Processes with no accidents with specific offsite consequences within the past five years, with no public receptors within the distance to the endpoint from a worst-case release, and where emergency response procedures have been coordinated between the source and the local emergency planning and response organizations are eligible for Level 1.  This level imposes minimal reporting and safety requirements \n\n\n\nProgram Level 2:  Processes that are not eligible for either Program Level 1 or Program Level 3 are subject to Program Level 2, which is a streamlined prevention program.\n\n\n\nProgram Level 3:  Processes that are not eligible for Pro"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 53132,
      "SummaryText": "gram Level 1 and are either subject to the OSHA Process Safety Management (PSM) standard or listed in 40 CFR 68.10 as one of nine specific North American Industry Classification Standard (NAICS) Codes are subject to Program Level 3.  Level 3 processes must meet the OSHA PSM standard.\n\n\n\nBased on the offsite consequences analysis presented in Section 3.0 of this document, there are residences, recreation areas, farm land, and a US highway within the distance to the endpoint for the worst-case scenario.  Even though TMWTP is not an industrial facility and is not subject to OSHA rules, EPA has determined that chlorine handling at TMWTP is a Level 3 process and must meet the OSHA PSM standard.\n\n\n\n\n\n3.0 MANAGEMENT ORGANIZATION\n\n\n\n3.1 Management Organization\n\n\n\nThe City of Helena has established a management system to oversee the implementation of the risk management program elements for TMWTP, as shown in Table 1 below.\n\n\n\nThe overall responsibility for the development, implementation, and integration of the risk management program elements at the water treatment plants rests with the Water Treatment Superintendent.  The responsibilities for the individual water treatment plant rest with the Water Production Supervisor.  Additional staff members at the individual treatment plant may be assigned specific duties.  \n\n\n\nTable 1.    Management System\n\n\n\nRisk Management Program Element\nPerson/Position Assigned Responsibility\nOverall Responsibility of RMP:\nCity of Helena Water Treatment Superintendent\nProcess Safety Information:\nTMWTP Water Production Supervisor\nProcess Hazard Analysis:\nStaff - Steve Lantz\nOperating Procedures:\nTMWTP Water Production Supervisor and All Staff\nTraining:\nTMWTP Water Production Supervisor\nMechanical Integrity:\nTMWTP Water Production Supervisor\nManagement of Change:\nStaff - Ken Clark\nPre-Startup Review:\nTMWTP Water Production Supervisor\nCompliance Audits:\nStaff - Steve Lantz\nIncident Investigation:\nTMWTP Water Production Supervisor and All Staff\nEmploy"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 53132,
      "SummaryText": "ee Participation:\nTMWTP Water Production Supervisor and All Staff\nHot Work Permit\nTMWTP Water Production Supervisor\nContractors:\nStaff - Steve Lantz\nSignage:\nStaff - Juli Muscutt\nEye Wash Station:\nStaff - Steve Lantz\n\n\n3.2 Updates and Corrections\n\n\n\nThe Risk Management Plan is updated and resubmitted at least once every five years from the date of its initial submission (1999) unless there has been a change in the covered processes.  The updated schedule and a list of situations that require an updated RMP are provided at 40 CFR 68.190.  These generally include added amounts of a currently or newly regulated substance, changes to the process that require a revised process hazard analysis or hazard review, or changes to the process that require a revised offsite consequence analysis.  \n\n\n\nIf the facility is no longer subject to the RMP program, the facility submits a de-registration request to EPA within six months of the change.  In addition, corrections are required whenever there is a change in the five-year accident history (within six months of the accident) and when emergency contact information is changed (within one month of the changes becoming effective).\n\n\n\n3.3 Recordkeeping\n\n\n\nRecords supporting the implementation of the elements found in this RMP are maintained for at least five years unless a longer period is specified for PSM standard records.\n\n\n\nAn EPA inspection of the facility may occur at any time.  The inspectors shall have access to the facility, to all supporting records and documentation, and to the area where an accidental release could occur.  \n\n\n\nThe results of such an inspection could be a preliminary determination of necessary revisions to the RMP.  Guidance for the proper response to the requested revisions is provided at 40 CFR 68.220.\n\n\n\n\n\n4.0 HAZARD ASSESSMENT\n\n\n\nIn accordance with 40 CFR 68 Subpart B, the hazard assessment consists of determination of the endpoint for the regulated toxic substance, an offsite consequence analysis for "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 53132,
      "SummaryText": "a worst-case release scenario and for an alternative release scenario.  Offsite impacts to population and to the environment are included.  \n\n\n\nThe offsite consequence analysis must be reviewed and updated at least once every five years and more frequently if changes at the stationary source are expected to alter the distance to the endpoint.  Such update must be completed and the revised RMP submitted within six months of the change.\n\n\n\nThe five-year accident history is also part of the hazard assessment.\n\n\n\n4.1 Offsite Consequence Analysis\n\n\n\n4.1.1 Endpoints\n\n\n\nAs provided in Appendix A to 40 CFR 68, the endpoint for chlorine is 0.0087 milligrams per liter (mg/L), which is based on the Emergency Response Planning Guideline level 2 (ERPG-2) from the American Industrial Hygiene Association (AIHA).  The ERPG values are intended to provide estimates of concentration ranges above which one could reasonably anticipate observing some adverse effects as described as a consequence of exposure to a specific substance.  ERPG-2 is defined as the maximum airborne concentration below which it is believed nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms that could impair their abilities to take protective action.  Both the worst-case scenario and the alternate scenario involve the release of pure chlorine. There are no regulated flammable substances on-site in threshold planning quantities.  \n\n\n\nRMP*Comp, the software provided by EPA was used to conduct the offsite consequence analyses.  The parameters shown in Table 2 were input to RMP*Comp to conduct the analyses.  The estimated distance to the endpoint as determined by RMP*Comp is also shown in Table 2.\n\n\n\n4.1.2 Scenario Descriptions and Parameters\n\n\n\nThe parameters used for the worst-case and the alternative scenarios are shown in Table 2 below.  \n\n\n\nThe worst-case release scenario was assumed to be a catastrophic valve or t"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 53132,
      "SummaryText": "ank failure resulting in the rapid release of the entire contents of the single largest capacity storage vessel on site, under unfavorable meteorological assumptions for dispersion of the gas.  As shown in Table 2, it was assumed that one ton of liquid chlorine escaped from the damaged cylinder in 10 minutes under conditions of low wind speed (1.5 m/s) and stable atmospheric conditions (Class F). This scenario considered that there were no prevention or mitigation techniques, responses or control devices applied to the release or that they failed.  \n\n\n\nThe alternative release scenario assumed that a valve failure or a leak developed while a one-ton tank was being worked on.  This scenario could be a CPRV failure, CPRV-to-tank connection leak, or a tank valve leak. At this point in the process, the chlorine is no longer a liquid, but is in gaseous form.  Some level of mitigation would be likely in such an instance.  It is assumed that the operator would adjust valves to stop the leak or at least control 10 percent of the leak immediately, continuing to reduce the flow to a manageable level allowing for repairs.  This leak was assumed to release gaseous chlorine from either the chlorine storage room or the chlorinator room. Based on the assumptions shown above, RMP*Comp calculated a release rate of 4.44 lbs/minute and an estimated total release of 66.6 pounds.  This scenario is much more likely to occur than the worst-case scenario.  However, due to the safety engineering and administrative controls in place at TMWTP, it is still very unlikely.  \n\n\n\nTable 2.    Offsite Consequence Analyses Parameters\n\n\n\nParameter\nWorst-case Scenario\nAlternate Scenario\nSubstance/End Point\nLiquid chlorine/0.0087 mg/L\nGaseous chlorine/0.0087 mg/L\nLargest Vessel\nOne-ton cylinder\nOne-ton cylinder\nWind Speed/Stability\n1.5 meters/sec; stability class F\n3meters/sec; stability class D\nAmbient Temperature/Humidity\n77?F; 50 percent humidity \n77?F; 50 percent humidity\nHeight of Release\nGround level\n"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 53132,
      "SummaryText": "Roof level\nSurface Roughness1\nUrban\nUrban\nGas Density\nChlorine is a dense gas\nChlorine is a dense gas\nRelease Temperature \n77?F;\n77?F;\nRelease Duration \n10 minutes\n15 minutes\nSize of Release Point2\nNot applicable\n0.5 inch diameter\nRelease Pressure3\nNot applicable\nAmbient\nMitigation\nNone\n10 percent control with valving\nRelease Rate\n200 lbs/minute\n4.44 lbs/minute\nRelease Location\nIn outside air\nEnclosed room in direct contact with outside air\nEstimated Distance to Endpoint\n1.3 miles\n<0.1 mile\n1 Surface roughness is assumed to be Urban based on definition in 40 CFR 68.22(e) and the presence of evergreen forest in the general vicinity of the water treatment plant. \n\n\n\n4.1.3 Offsite Impacts\n\n\n\nUS Census data in the EPA LandView software and the US Geologic Survey MacDonald Pass 7.5 minute quadrangle map were used to estimate the potential impacts on population and on the nearby environment.\n\n\n\n4.2 \n\nFive-Year Accident History\n\n\n\nThere have been no chlorine related accidents at TMWTP in the past five years.  There have been no chlorine related deaths, injuries, or significant property damage onsite.  Nor have there been any known offsite deaths, injuries, evacuations, sheltering in place, property damage or environmental damage due to an accidental chlorine release at TMWTP.\n\n\n\n5.0 LEVEL 3 PREVENTION PROGRAM\n\n\n\nThe Prevention Program/Program 3 has been developed and implemented in accordance with 40 CFR68 Subpart D.  The specific prevention program information is required in 40 CFR 68.175 and details are found in 40 CFR 68.65 through 87.  The requirements of Program 3 are nearly identical to the OSHA Process Safety Management Standard, which is found at 29 CFR 1910.119.  The details, documentation, and records required by Program 3 as it applies to the Ten Mile Water Treatment Plant are included in Appendix A.\n\n\n\nElements of the RMP Prevention Program/Program 3, the OSHA PSM Standard and Appendix A to this document are shown in the table below:\n\n\n\nTable 3.    Prevention Prog"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 53132,
      "SummaryText": "ram 3 Elements\n\n\n\n\n\nProgram Element\nChemical Accident Program Citation\nOSHA Process Safety Management Citation\nAppendix A Citation\nProcess Safety Information\n40 CFR 68.65\n29 CFR 1910.119(d)\nA.1.0\nProcess Hazard Analysis\n40 CFR 68.67\n29 CFR 1910.119(e)\nA.2.0\nOperating Procedures\n40 CFR 68.69\n29 CFR 1910.119(f)\nA.3.0\nTraining\n40 CFR 68.71\n29 CFR 1910.119(g)\nA.4.0\nMechanical Integrity\n40 CFR 68.73\n29 CFR 1910.119(j)\nA.5.0\nManagement of Change\n40 CFR 68.75\n29 CFR 1910.119(l)\nA.6.0\nPre-Startup Review\n40 CFR 68.77\n29 CFR 1910.119(i)\nA.7.0\nCompliance Audits\n40 CFR 68.79\n29 CFR 1910.119(o)\nA.8.0\nIncident Investigation\n40 CFR 68.81\n29 CFR 1910.119(m)\nA.9.0\nEmployee Participation\n40 CFR 68.83\n29 CFR 1910.119(c)\nA.10.0\nHot Work Permits\n40 CFR 68.85\n29 CFR 1910.119(k)\nA.11.0\nContractors\n40 CFR 68.87\n29 CFR 1910.119(h)\nA.12.0\n\n\n\n\n\n\n\n\n6.0 EMERGENCY RESPONSE PROGRAM\n\n\n\nEmergency planning and response information is required by both the Chemical Accident Program and the PSM Standard.  This topic is not included in Program 3 specifically, but is required for Program 3 in Subpart E (40 CFR 68.90 and 95) of the Chemical Accident Prevention Program. The topic is also found at 29 CFR 1910.119(n).  The emergency response information for TMWTP is found in Appendix B to this document.\n\n\n\nTMWTP maintains a written emergency response plan to address the emergency situations that may arise at the facility.  The Site Emergency Action Plan, Ten Mile Water Treatment Plant was developed by Jack Williams in 1994, revised in 1999 by Jack Williams, and revised again in 2005 by Steve Lantz.  This document includes the proper responses for:\n\n\n\nFire or Explosion;\n\nTornado;\n\nHazardous Material Incident;\n\nFlood;\n\nSevere Winter Weather;\n\nBomb Threat;\n\nUtility Emergency;\n\nCivil Disturbance; and\n\nEnemy Attack.\n\n\n\nTo ensure proper functioning emergency response equipment, it is inspected and serviced.  The Site Emergency Action Plan is promptly updated to reflect any pertinent changes taking place within the"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 53132,
      "SummaryText": " process that would require a modified emergency response.\n\n\n\nThe employees at TMWTP do not respond to an accidental release of chlorine other than repair of minor leaks.  In the event of a catastrophic chlorine incident that could affect the public or the environment, TMWTP personnel notify emergency responders.  The proper response actions for evacuation and communication with the local fire department and the public are found in the Hazardous Material Incident Section 11 of the Site Emergency Action Plan which is included in Appendix B.  Appendix B of this document also includes a section entitled Chlorine Exposure Treatment, which provides first aid measures and medical treatment guidance.\n\n\n\nAppendix C to this document contains additional documentation maintained or used by TMWTP as part of their Risk Management program activities.  This documentation and the corresponding records are also found in individual binders that are kept in the control room at TMWTP.\n\n\n\n\n\n\n\n\n\nRisk Management Plan    11    October 08 \n\nTen Mile Water Treatment Plant\n\n\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}