{
  "FacilityID": 53137,
  "FacilityName": "Target FDC 2",
  "FacilityStr1": "2115 Technology Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Cedar Falls",
  "FacilityState": "IA",
  "FacilityZipCode": "50613",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19013",
  "LEPC": "Black Hawk County LEPC",
  "FacilityLatDecDegs": "42.477013",
  "FacilityLongDecDegs": "-092.471367",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.target.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Target Corporation",
  "Company2Name": null,
  "CompanyDUNS": 6961411,
  "Company2DUNS": 0,
  "OperatorName": "Ryan Companies",
  "OperatorStr1": "50 S 10th St., Suite 300",
  "OperatorStr2": null,
  "OperatorCity": "Minneapolis",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55403",
  "OperatorZipCodeExt": null,
  "RMPContact": "Eugene Drinkman",
  "RMPTitle": "Senior Superintendent",
  "FTE": 150,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000204815",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-11-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-12-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-12-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-12-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-12-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 77459,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 53137,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 79324,
          "ProcessID": 77459,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 102907,
          "ProcessID": 77459,
          "ChemicalID": 56,
          "Quantity": 39000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 602907,
          "ProcessID": 77459,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 53137,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe facility uses ammonia as a refrigerant within a closed system.  Ammonia is a hazardous substance that must be handled properly in order to prevent accidental releases and injuries.  It is the policy of the Target FDC 2 facility located in Cedar Falls, Iowa to conduct all operations (including the ammonia refrigeration system) in a safe manner.  This policy extends to all employees and contractors at the facility.  Ryan Companies, in the behalf of the Target Corporation, implements this policy towards chemical and general safety through on-going employee participation, training, written operating procedures, maintenance, inspections, safety committee meetings, and safety reviews/evaluations.  These programs are in effect at the facility to prevent the accidental release of ammonia.  In the event of an ammonia accident, the facility has an Emergency Action Plan to notify the appropriate authorities and safely evacuate the facility.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nTarget FDC 2 is located at 2115 Technology Parkway, in Cedar Falls, Iowa.  The facility is approximately 0.7 miles north of State Route 20.  The area immediately surrounding the facility is rural with a mixture of light commercial and industrial areas.  Construction of the ammonia refrigeration system at the Target FDC 2 facility is scheduled for completion in December 2008.  The ammonia system was constructed in accordance with all applicable federal, state, and local regulations at the time.\n\nThe primary business of the Target FDC 2 facility is to provide refrigeration for the storage and distribution of fresh produce, frozen, and refrigerated foods.  In order to conduct operations, the facility maintains a refrigeration system containing approximately 39,000 pounds of anhydrous ammonia, a regulated substance.  The system, consisting of vessels, piping, valves, and process equipment, cycles ammonia through various physical states"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 53137,
      "SummaryText": " (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for the storage and distribution of fresh produce, frozen, and refrigerated foods.  Typical operating conditions range from approximately 1 psig on the low pressure side of the system to approximately 165 psig on the high side.  \n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nIn order to operate the ammonia refrigeration system, the facility complies with the following risk management regulations:\n\n1) OSHA's Process Safety Management (PSM); and\n2) EPA's Risk Management Program (RMP); \n\nThese regulations impose numerous requirements on the facility to ensure the safety of the public and on-site workers.  The following summarizes the key compliance programs that have been implemented by Ryan Companies to prevent the accidental release of ammonia from the facility.  The Operating Procedures program ensures that the ammonia system is operated in a safe manner.  The Training program ensures that personnel fully understand how to perform their jobs in a safe manner.  The Mechanical Integrity program ensures that the ammonia system is in proper working condition based upon routine testing, inspections, and maintenance according to manufacturer's specifications and industry standards.  The Management of Change program ensures that process modifications are implemented in a safe manner.  The Pre-Startup Safety Review program ensures that adequate safety measures are in place before ammonia is introduced into a process.  The Hot Work Permit program ensures that Ryan Companies employees and contractors perform hot work (e.g. welding) in a safe manner.  The Contractor Safety program ensures that contractors understand the hazards of ammonia and must take specified precautions to safely complete job requirements.\n\nEngineering Controls:\nIt is important to note that the refrigeration system has be"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 53137,
      "SummaryText": "en designed with several safety features to prevent the accidental release of ammonia.  For example, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits.  Also, level indicators, alarms, and switches are installed in key points within the system to monitor the supply of liquid ammonia and to ensure that equipment is not damaged during an upset condition.  The facility has two ammonia sensors located in the Engine Room, one in the Ammonia Dilution Tank vent line, one detector at each Air Door Coil, and one at each evaporator (with the exception of the evaporators located in penthouses, which share one detector). The Manning detectors have the following associated settings and actions: \nWarehouse Area:\n? 35 ppm - audio and visual alarms are activated, and an alarm is sent to the monitoring company.\n? 95 ppm - the liquid feeding the evaporators stops, and the pump out system activates, evacuating ammonia from the units.\nEngine Room:\n? 35 ppm (0-1,000 ppm sensor) and at 300 (0-20,000 ppm sensor) - audio and visual alarms are activated (fire alarm system), and the exhaust fans turn on.  \n? 150 ppm - the ammonia pumps (RP1, RP2, RP3 & RP4) are shut off.\n? 9990 ppm - the emergency stop relay is triggered (Cutting off power to the engine room), and the fire alarm system is alerted (again).\n\nAn off-site alarm company, Target Alarm Center (TAC), monitors the ammonia detection system 24 hours a day.  In the event of a release while the facility is unmanned, the off-site alarm company will notify the Ryan Companies Emergency Coordinator.\n\nFIVE YEAR ACCIDENT HISTORY\n\nSince this is a new facility with startup excepted in December 2008, there is no accident history.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe facility has an Emergency Action Plan (plan) in effect at the facility.  This Plan was designed to meet the following objectives:  \n\n? save lives;\n? minimize and avoid injuries;\n? protect the "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 53137,
      "SummaryText": "environment; and\n? minimize property damage.\n\nSince facility personnel will not respond to an ammonia release at the facility that poses a health or safety threat, the Plan provides the notification procedures and evacuation routes for emergencies that may arise at the facility.  This Plan is reviewed and updated at least once per year to ensure compliance with the PSM and RMP regulations.  Facility personnel receive annual training regarding the emergency evacuation procedures.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazard Analysis, performed on October 23 & 24, 2008, generated mitigation measures (recommendations) to improve safety at the Target FDC 2 facility located in Cedar Falls, Iowa.  The mitigation measures include additional training, key maintenance-related tests/inspection, and enhanced emergency response policies and procedures.  The Ryan Companies safety committee is planning to complete several items, including the recommendations, by December 10, 2008, as a continual effort to provide a safe work environment for their employees."
    }
  ]
}