{
  "FacilityID": 53470,
  "FacilityName": "City of Morgan City Water Plant",
  "FacilityStr1": "1600 Federal Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Morgan City",
  "FacilityState": "LA",
  "FacilityZipCode": "70380",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22101",
  "LEPC": "St. Mary Parish LEPC",
  "FacilityLatDecDegs": "29.707778",
  "FacilityLongDecDegs": "-091.215972",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "LC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Morgan City",
  "OperatorStr1": "PO Box 1218",
  "OperatorStr2": null,
  "OperatorCity": "Morgan City",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70381",
  "OperatorZipCodeExt": null,
  "RMPContact": "Byron Thronson",
  "RMPTitle": "Plant Supervisor",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000162584",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-07-31 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-01-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-01-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-01-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-01-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 29.709,
  "FRS_Long": -91.21238,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 77929,
      "AltID": null,
      "FacilityID": 53470,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 79806,
          "ProcessID": 77929,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 103786,
          "ProcessID": 77929,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 603786,
          "ProcessID": 77929,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 53470,
      "SummaryText": "\nExecutive Summary\n\n\n\nI. Introduction\n\nAs mandated by 40 CFR Part 68 Subchapter C, the Morgan City Water Treatment Plant (MCWTP) is required to have a Risk Management Program, and submit to the EPA a Risk Management Plan.  MCWTP has always had safety practices, proper maintenance, training and emergency preparedness, but this Risk Management Program will bring all of those aspects together into one comprehensive program.  The full text of the EPA RMP regulations is available on the Internet through EPA?s website:  http://yosemite.epa.gov/oswer/ceppoweb.nsf/content/RMPoverview.htm.\n\n\n\n        II.    Registration Information\n\nThis section provides information on MCWTP?s Parent company, location, contacts, and identifying numbers.\n\n\n\nIII. Responsible Employee\n\nByron Thronson, Plant Supervisor, is responsible for implementation of the PMR program.\n\n\n\nIV. Hazard Assessment\n\na. Worst Case Scenario\n\nThe worst-case release scenario would be the explosion or other sudden release of an entire 2000-lb cylinder of chlorine gas.  In this case, the gas would travel about 0.9 miles away from the facility before dispersing enough to no longer pose a health hazard.  The affected population with that radius would be approximately 6000 persons.\n\nb. Alternative Scenario\n\nThe alternative release scenario would be a more likely release event, such as a leak in the regulator hose of a cylinder.  This scenario examines a release of approximately 317-lbs of chlorine gas, which would disperse enough to cease to pose a threat to human health at about 0.1 miles out from the facility.  The affected population is this 0.1-mile radius would be approximately 80 persons. \n\nc. Five year accident History\n\nIn the past five years, there have been no reportable accidents at the MCWTP.  \n\n\n\nV. Accident Prevention Management System\n\na. Safety Information\n\nThis section provides an inventory sheet and MSDS for the covered chemical, chlorine.  Also detailed here are the safety limits for the storage and handlin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 53470,
      "SummaryText": "g of chlorine, and the codes and standards by which the chlorination process and facilities were designed.  There is a form here to detail any major changes in the facility or operation, the year installed, and the codes or standards used.  As of now there have been no major changes in the facility in over 30 years, but this blank form is here for future use.  Information about chlorine process safety, safety equipment and safety procedures is provided here.\n\nb. Hazard Review\n\nThe MCWTP conducts a hazard review every five years, or with each major change, to identify any and all hazards associated with the process.  They look for opportunities for equipment malfunction or human error.  This hazard review also determines the presence or absence of safeguards needed to control the hazards or prevent equipment malfunction or human error.  One of the functions of the hazard review is to identify any steps used or needed to detect or monitor releases.  The purpose of these reviews is to promote constant awareness and to decrease the risk potentials in our facility.  The hazard reviews are to be completed, dated, signed and kept on file.\n\nc. Operating Procedures\n\nThe MCWTP conducts a review of all operating procedures, if necessary, each time a major change occurs and prior to startup of the changed process.  The purpose of the review is to ensure that the operation procedures reflect current operating practice, including changes that result from changes in process chemicals, technology, and equipment, and changes to stationary sources.  This section of the RMP Program manual contains references to help you find all operating procedures used by Morgan City Water, and also contains the specific procedures used by employees.  Operations procedures from the facility?s operations and maintenance manual are located in this section. \n\nd. Training\n\nMorgan City Water provides initial, thorough training for each new employee involved in operating a process.  The training emphasize"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 53470,
      "SummaryText": "s specific safety and health hazards, and includes instruction in how to conduct emergency operations including shutdown.  The training that our employees receive emphasizes safe working practices.  Morgan City Water also conducts refresher training at least every two years for all employees involved with activities in the chlorination practice.  The certifications that our operators receive from the state are stipulated to be valid only as long as the proper refresher training is done.  \n\ne. Maintenance\n\nMorgan City Water?s maintenance program ensures the mechanical integrity of process equipment.  Our maintenance program procedures are in writing.  Training is provided for all employees involved in maintenance activities, and regularly scheduled inspections and testing are performed on process equipment.  The maintenance schedules and procedures from the operations and maintenance manual are found in this section.  Also located in this section is information about the manufacturers of the equipment used in the facility.\n\nf. Compliance Audits\n\nMorgan City Water conducts compliance audits to ensure compliance with the provisions of the risk management program.  These compliance audits are completed once every three years.  This section includes the most recent compliance audit, signed and dated, and a schedule of improvements found necessary in the last compliance audit.  These improvements should be acted upon as soon as practicable.   This section also includes a blank compliance audit.  All compliance audits are completed on time, signed, dated and kept on file.  All out-of-compliance findings are recorded and a schedule of improvements is made and acted upon.\n\ng. Incident Investigations\n\nMorgan City Water conducts thorough incident investigations for any and all incidents that resulted in, or could reasonably have resulted in, a catastrophic release of chlorine.  This section includes records of all incident investigations and a blank incident investigation form"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 53470,
      "SummaryText": " for future use.  These forms are filled out completely, signed, dated, and kept on file.  \n\n\n\nVI. Emergency Response Plan\n\nMorgan City Water does not require a detailed written emergency response plan.  The employees are only expected to respond to incidental releases, and the water plant is included in the City of Morgan City?s Public Services Continuity Plan.  \n\n\n\n    VII.    The Risk Management Plan is a form that describes the Risk Management Program in detail.  This form must be submitted to the EPA, and it should be filled out on the computer and submitted on a floppy disk.  The paper copy of the form is provided here to help with filling out the RMPSubmit on the computer.  A blank copy is provided for future use.  Any time there is a major change in the facility?s regulated processes, the Risk Management Program must be reviewed and updated, and the Risk Management Plan form must be reviewed and resubmitted.  \n\n"
    }
  ]
}