{
  "FacilityID": 53564,
  "FacilityName": "Foothill Water Treatment Plant",
  "FacilityStr1": "9200 Powerhouse Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Newcastle",
  "FacilityState": "CA",
  "FacilityZipCode": "95658",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06061",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "38.863389",
  "FacilityLongDecDegs": "-121.125278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Placer County Water Agency",
  "OperatorStr1": "144 Ferguson Rd.",
  "OperatorStr2": "P O Box 6570",
  "OperatorCity": "Auburn",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95604",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brian Martin",
  "RMPTitle": "Director of Technical Services",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000122663",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-12-01 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-02-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-02-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-01-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-04-30 00:00:00",
  "DeRegistrationEffectiveDate": "2011-12-15 00:00:00",
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 38.86376,
  "FRS_Long": -121.1291,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 78058,
      "AltID": "Disinfection",
      "FacilityID": 53564,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 79939,
          "ProcessID": 78058,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 103933,
          "ProcessID": 78058,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 603933,
          "ProcessID": 78058,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 53564,
      "SummaryText": "Placer County Water Agency has instituted a Risk Management Program for their water treatment facility, Foothill Water Treatment Plant, as required by Federal Accidental Release Prevention (ARP) Program regulations at 40 CFR Part 68.  The Risk Management Program identifies the equipment, procedures, maintenance, inspection, and training associated with Regulated Substances (RS's) handled at this facility in excess of Federal threshold quantities; describes the structured assessment of hazards which was conducted to assess possible effects on employees and offsite public and environmental receptors; provides the results of an offsite consequences analysis; defines a prevention program, emergency response program, and mitigation measures to reduce the probability and magnitude of accidental releases of RS's; and establishes a schedule and responsibilities for implementation of mitigation measures and auditing of program elements.  This Risk Management Plan (RMP) is being filed as required by ARP regulations in order to report the elements of the current Risk Management Program and to describe further measures planned to mitigate or prevent accidental releases of RS's.  \n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nPlacer County Water Agency provides water service to a large portion of west  Placer County.  It operates several water treatment plants.  Its water treatment facility, Foothill Water Treatment Plant, is located at 9200 Powerhouse Rd., Newcastle, CA in Placer County, and uses chlorine, an RS, for disinfection in quantities greater than the Federal threshold quantity for this RS.  The facility is located on the Boardman Canal in a semi-rural area just south of the community of Newcastle.  There are 9 full-time employees at this site. Chlorine is received in ton containers by truck, handled with an electric hoist, and stored on ton container scales and storage trunnions inside the building.  The chlorine is used to control biological growth on the filt"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 53564,
      "SummaryText": "ers and to disinfect the treated water.  Pressurized chlorine gas within a ton container is reduced to vacuum at a vacuum regulator valve mounted on the container gas valve.  The chlorine under vacuum is piped into an adjacent room where it is metered through rate valves and rotameters in chlorinators, and drawn into water solution by the passage of pressurized water through an injector.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIt is the policy of Placer County Water Agency that the receipt, storage and handling of chlorine at its facility be done in a manner which meets regulatory requirements and minimizes the probability and severity of accidental releases of chlorine to the atmosphere, in order to protect the health and safety of its workers, the public, and the environment.  In order to accomplish this goal, Placer County Water Agency has gathered safety information on chlorine and on the process, equipment and procedures involving chlorine; performed a structured assessment of hazards of the process and external events which might affect the process; performed an offsite consequences analysis of defined release scenarios; established a written program for prevention and mitigation of accidental releases; and established a written emergency response program coordinated with emergency response agencies.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAMS\n\nGeneral accidental release prevention programs instituted by Placer County Water Agency are categorized as administrative (management) programs; procedures, training, and engineering controls; and emergency response programs. Placer County Water Agency has instituted a Process Safety Management (PSM) Program meeting OSHA requirements at 29 CFR 1910.119 covering its disinfection process.  This constitutes the general accidental release prevention program for Placer County Water Agency's operations. The program and document mangement procedures included in the PSM Program are used as the manage"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 53564,
      "SummaryText": "ment system for the Risk Management Program.\n\nCHEMICAL-SPECIFIC RELEASE PREVENTION STEPS\n\nRelease prevention steps specific to chlorine have been identified and implemented.  These include, among other things, eliminating the chlorine pressure piping and mounting vacuum regulator valves directly on the container gas valves, installing automatic-closing valve operators, and installing a chlorine leak scrubber.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no accidents involving chlorine at this facility within the past five years resulting in injuries or offsite consequences.\n\nEMERGENCY RESPONSE PROGRAM\n\nPlacer County Water Agency's Emergency Response Program applicable to chlorine has been coordinated with Placer County Department of Environmental Health, the local agency responsible for hazardous materials inventory reporting and release response coordination.  Placer County Water Agency maintains First Responder capability with respect to chlorine releases at its Water Treatment Plants.  The Placer County HazMat Response Team has participated with Placer County Water Agency personnel in response drills.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nAll of the other improvements and mitigation measures identified in the process hazard analysis which Placer County Water Agency committed to accomplish have been completed.  Any other measures identified by employees during workplace hazard surveys, or as a result of audit activities, will be thoroughly reviewed and considered for implementation."
    }
  ]
}