{
  "FacilityID": 53960,
  "FacilityName": "Farmers Cooperative Company - Hinton facility",
  "FacilityStr1": "105 East Main",
  "FacilityStr2": null,
  "FacilityCity": "Hinton",
  "FacilityState": "IA",
  "FacilityZipCode": "51024",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19149",
  "LEPC": "Plymouth County LEPC",
  "FacilityLatDecDegs": "42.627180",
  "FacilityLongDecDegs": "-096.289830",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Farmers Cooperative Company",
  "OperatorStr1": "105 East Main",
  "OperatorStr2": null,
  "OperatorCity": "Hinton",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "51024",
  "OperatorZipCodeExt": null,
  "FTE": 29,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000008911",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-08-07 00:00:00",
  "SafetyInspectionBy": "IDALS",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-03-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-03-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-03-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-03-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 42.62664,
  "FRS_Long": -96.29102,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 78694,
      "AltID": "Anhydrous ammonia storage",
      "FacilityID": 53960,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 104810,
          "ProcessID": 78694,
          "ChemicalID": 56,
          "Quantity": 409500.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 80607,
          "ProcessID": 78694,
          "NAICSCode": "42491",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 28556,
              "Process_NAICS_ID": 80607,
              "SafetyReviewDate": "2008-05-15 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Applicable building, electrical and plumbing codes. This facility complies with the Iowa Fertilizer law.",
              "FR_Comments": "We utilize those portions of these codes which are deemed applicable by the jurisdictional authority",
              "HazardReviewDate": "2008-04-07 00:00:00",
              "ChangeCompletionDate": "2008-06-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Vandalism and train derailment; potential leaking from underground piping; vehicular damage",
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Remote shut-off, automatic by-pass, pull-away protection",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Regular plant inspections / Routine preventive maintenance & repairs",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Routine visual inspections",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Recommendations, if any are made have been and/or arrangements will be made for completion on or before June 30, 2008",
              "OpProceduresReviewDate": "2008-05-15 00:00:00",
              "TrainingReviewDate": "2007-09-07 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-05-15 00:00:00",
              "EquipmentInspectionDate": "2008-03-01 00:00:00",
              "EquipmentTested": "Pumps, pump seals, pipes and plumbing, valves, electrical and safety equipment. The breakaway couplers, pressure relief valves and hoses are also inspected and replaced as necessary.",
              "ComplianceAuditDate": "2008-04-07 00:00:00",
              "AuditCompletionDate": "2008-06-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "The plan is to minimize those hazards to human heaalth and to the environment that are associated with accidental releases of anhydrous ammonia. Employees working at the bulk storage plant make routine observations prior to and during transfer operations of the anhydrous ammonia from the storage vessel(s) to nurse tanks. In so doing, they are able to detect problems before they arise. This routine inspection identifies any external portion of the system which may be under stress or about to fail.Repairs can be made before they become problematic. Employees are annually trained to recognize hazards associated with storage and handling of anhydrous ammonia. In addition to annual training for employees who have been on the job for a number of years, the company conducts training for new hires. This training includes classroom instruction, on-site training at the plant, and follow-up observation to determine the comprehension and understanding of the new hire. Finally, the company routinely invites local fire department personnel to visit the site. In the event that the local fire department requests assistance in training its employees on anhydrous ammonia, the company cooperates fully in their endeavors.",
              "_chemicals": [
                {
                  "PrimaryKey": 29813,
                  "PreventionProgram2ID": 28556,
                  "ProcessChemicalID": 104810
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 53960,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Plymouth County EMA",
    "CoordinatingAgencyPhone": "7125468101",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "Iowa Fertilizer Law"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 53960,
      "SummaryText": "Farmers Cooperative Company - Hinton Facility\n\n1. Accidental Release Prevention and Emergency Response Policies:\n    We at Farmers Cooperative Company in Hinton are strongly committed to employee, public, and environmental safety. This commitment is an inherent part of our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. If such a release does occur, our trained emergency response personnel are at hand to control and mitigate the effects of the release. We also coordinate our response efforts with the Hinton Fire Department which provides additional emergency response expertise.\n\n2. Stationary Source and Regulated Substances Handled:\n    Our facility's primary activities include support services for crop production. We have anhydrous ammonia stored in two (2) interconnected tanks at our facility in Hinton. The maximum amount stored on -site at any point is 409,500 pounds at the maximum fill capacity of 85%.\n\n3. Worst Case Release and Alternative Case Scenarios:\n    We utilize RMP Comp for the worts case and alternative case scenarios of the required off-site consequemce analysis for our facility. The following details these scenarious.\n\n    The worst case release scenario involves a catastrophic release of the entire contents of the interconnected anhydrous ammonia storage tanks in gaseous form over a 10-minute period. At Class F atmospheric stability, 1.5 m/s, and urban topography, the maximum distance to endpoint of 0.14 mg/L is 3.6 miles. The estimated population within the 3.6 mile radius of this facility is 1,407.\n\nThe alternative release scenario involves a release from an anhydrous ammonia product line. The scenario involves the release of  ammonia in a gaseous form over a period of 2 minutes. Under neut"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 53960,
      "SummaryText": "ral weather conditions the maximum distance to toxic endpoint of 0.14 mg/L of ammonia is 0.40 miles. The estimated population within a 0.40 mile radius of the facility is 255.\n\n4. General Accidental Release Prevention Program:\n    Our facility has taken all the necessary steps to comply with the EPA's accidental release prevention requirements as set forth in 40 CFR Part 68.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary facility.\n\nProcess Safety Information: Farmers Cooperative Company maintains a detailed record of safety information that describes the chemical hazards, operating parameters, and equipment designs associated with all processes (Appendix D).\n\nProcess Hazard Analysis: Our facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled effectively. Any findings from the hazard analysis are addressed in a timely fashion.\n\nOperating Procedures: Farmers Cooperative Company has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.\n\nMechanical Integrity: Farmers Cooperative Company conducts documented maintenance checks on process equipment to ensure proper operation. Maintenance checks are conducted by qualified personnel with previous training in maintenance practices. Examples of process equipment that would receive maintenance checks include: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shut down systems, controls, and pumps. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner (Appendix C).\n\nManagement of Change:  Written procedures are in place at Farmers Cooperative Company to manage changes in process chemicals, technology, equipment, and procedures. Process operators, maintenance personnel or other employees wh"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 53960,
      "SummaryText": "ose job tasks are affected by a modification in process conditions are promptly notified of the modification and offered training to deal with it.\n\nPre-startup Reviews:  Farmers Cooperative Company routinely conducts pre-startup safety reviews related to new processes and modifications in established processes. These reviews are conducted to confirm that construction, equipment, and operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits: Farmers Cooperative Company conducts compliance audits on a regular basis to determine whether the plan's provisions, set under the 40 CFR Part 68 are being implemented. Any non-compliance issue discovered during the audit is promptly corrected.\n\nEmployee Participation: Farmers Cooperative Company truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation of the RMP, particularly information resulting from process hazard analyses.\n\n5. Five-Year Accident History:\n    Farmers Cooperative Company has had an excellent record of preventing accidental releases over the last 5 years. Due to our stringent release prevention policies, no accidental release has occurred during this period.\n\n6. Emergency Response Plan:\n    Farmers Cooperative Company maintains a written emergency response plan to deal with the accidental release of hazardous materials. The plan addresses all aspects of emergency response including first aid and medical treatment, evacuations, and notification of local emergency response agencies and the public (Appendix A).\n\nCall list:\n\nJohn Bruening, agronomy manager\n       WORK:     (712) 947-4212\n       Home:       (712) 226-3629\n       Cell:          (712) 212-1538\n\nTerry Van Roekel\n  "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 53960,
      "SummaryText": "      WORK:     (712) 947-4212\n        Home:       (712) 947-2109\n\nJeff Nelson, general manager\n       WORK:      (712) 947-4212\n       Cell:           (712) 251-8501"
    }
  ]
}