{
  "FacilityID": 5397,
  "FacilityName": "Seneca Water Treatment Plant",
  "FacilityStr1": "630 Northampton Road",
  "FacilityStr2": null,
  "FacilityCity": "Seneca",
  "FacilityState": "SC",
  "FacilityZipCode": "29672",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45073",
  "LEPC": "Oconee Emergency Preparedness",
  "FacilityLatDecDegs": "34.86875",
  "FacilityLongDecDegs": "-82.955833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Seneca Light and Water",
  "Company2Name": "NA",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Seneca",
  "OperatorStr1": "P.O. Box 4773",
  "OperatorStr2": "225 EN First Street",
  "OperatorCity": "Seneca",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29679",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": "NA",
  "EPAFacilityID": "100000068525",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-09-05 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-06-12 00:00:00",
  "DeRegistrationEffectiveDate": "2014-05-29 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 34.710174,
  "FRS_Long": -82.955684,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6380,
      "AltID": "Chlorination",
      "FacilityID": 5397,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 6969,
          "ProcessID": 6380,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6535,
          "ProcessID": 6380,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2761,
              "Process_NAICS_ID": 6535,
              "SafetyReviewDate": "1999-01-12 00:00:00",
              "PHA_Date": "1996-10-09 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-07-17 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "rollers under cylinders",
              "OpProceduresReviewDate": "1999-01-12 00:00:00",
              "TrainingReviewDate": "1999-01-12 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-01-12 00:00:00",
              "EquipmentInspectionDate": "1997-01-31 00:00:00",
              "EquipmentTested": "entire process",
              "ChangeMgmtDate": "1998-11-17 00:00:00",
              "ChangeMgmtReviewDate": "1999-01-12 00:00:00",
              "PreStartupReviewDate": "1999-06-16 00:00:00",
              "ComplianceAuditDate": "1999-10-09 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-01-12 00:00:00",
              "HotWorkPermitReviewDate": "1999-01-12 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-01-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3149,
                  "PreventionProgram3ID": 2761,
                  "ProcessChemicalID": 6969
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5397,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-01-12 00:00:00",
    "ERTrainingDate": "1999-06-17 00:00:00",
    "CoordinatingAgencyName": "Seneca Fire Department",
    "CoordinatingAgencyPhone": "8648852738",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5397,
      "SummaryText": "Executive Summary\n\n\nSeneca Light and Water owns and operates the Seneca Water Treatment Plant at 630 Northampton Road in Seneca, South Carolina.  The facility is committed to providing the employees a safe working environment.  To ensure this environment, the Utilities Department has established safe working practices, standard operating procedures, and accident prevention programs.  Management is dedicated to training employees on proper operating procedures, emergency response, and equipment use.  To prevent accidental releases of chemicals, the Department follows all applicable sections of the United States Environmental Protection Agency (EPA) Prevention Program. In the event of a release, the facility has coordinated response procedures with the Seneca Fire Department.   The team is equipped with all items necessary to respond to a chlorine spill or leak. \n\nThe Seneca Water Treatment Plant treats water from Lake Keowee.  The chlorination system, installed at the plant for disinfection purposes, is housed within the main building.  The chlorinators, safety equipment, and instrumentation are located upstairs on the operating floor and the chlorine cylinders are located just below on the ground floor. The plant is equipped to use chlorine from one-ton cylinders under normal operation.  The chlorine is fed as a gas from one-ton cylinders to chlorinators where it then mixes with a stream of water to form a chlorine solution.  One chlorinator is for pre-chlorination of the influent and the other is for post-chlorination of the finished water before distribution.  The Seneca Water Treatment Plant typically has 3 one-ton cylinders on site at a time for a total of 6000 pounds.  Two cylinders are typlically connected at a time with automatic switchover valved.\n\nFor the Process Hazard Analysis, two release scenarios, a \"worst-case release\" and \"alternate release scenario\", were evaluated for impact on the plant and its surroundings.  The worst-case release, as defined by"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5397,
      "SummaryText": "EPA, is the \"greater of the following: (1) For substances in a vessel, the greatest amount held in a single vessel, taking into account administrative controls that limit the maximum quantity; or (2) For substances in pipes, the greatest amount in a pipe, taking into account administrative controls that limit the maximum quantity... as a liquid under pressure, the owner or operator shall assume that the quantity in the vessel or pipe ... is released as a gas over 10 minutes.\"  The alternative scenario is one \"more likely to occur than the worst-case release scenario\".  \n\nThe worst-case scenario for the Seneca Water Treatment Plant evaluated the release of 2,000 pounds of chlorine as a gas within a ten-minute time span.  The release was modeled using the EPA modeling tool, RMP*Comp to determine the distance to toxic endpoint.  The toxic endpoint used by the RMP*Comp program is 0.0087 mg/L (EPRG-2).  This is the maximum airborne concentration of chlorine which is believed nearly all individuals can withstand for one hour without the exposure causing irreversible or other serious side effects or symptoms that might prevent an individual from taking actions to protect themselves from further exposure.  For the chlorine system at the water treatment plant, the release of one ton-cylinder (2000 pounds) would travel 2.2 miles before reaching its toxic endpoint.  This distance accounts for the EPA-mandated meteorological conditions, namely Stability F, wind speed of 1.5 m/sec, highest maximum daily temperature of 116:F and average humidity of 65%.  Approximately 4700 people could be affected by such a release.  Schools, recreation areas, hospitals, and commercial/industrial areas would also be affected.  Lake Keowee would be a major environmental receptor for the worst-case spill.  \n\nThe model used for the alternative case scenario was EPA's RMP Guidance for WWTP Reference Tables since the chlorination processes are very similar.  The alternative release scenario involves a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5397,
      "SummaryText": "vapor release from a 1/2\" fitting on the automatic shutoff valve.  This failure would cause a release rate of 37 pounds per minute according to the model.  The release accounted for a wind speeds of 3.0 m/sec, and Stability Class D in a rural environment.  The resultant distance to toxic endpoint according to Exhibit 4-15 is 0.3 miles.  Approximately 50 residents, a campground and the environmental receptors above would be affected. This scenario is only a guess as to what could happen.  All releases, great or small, should be handled with public safety as priority.\n\nThe installation of chlorine detectors and alarms in conjunction with a trained emergency response team has prepared the Seneca Water Treatment Plant for a chemical release.  The chlorination process is designed to help prevent releases.  Vacuum is used to transfer the chlorine gas through the majority of the piping from the cylinder to the chlorinators.  By using a vacuum process, piping leak releases are greatly reduced.  Shutoffs are in place and emergency repair kits and breathing apparatus are located on site.  Operating procedures stress the dangers of chlorine gas and promote better process management.  A Process Safety Management Plan has been instituted in compliance with EPA and OSHA regulations.  In the event of a release, the response team should be able to evaluate and contain the situation.  The facility has on-site Chlorine Institute Emergency Repair Kits for the chlorine cylinders to aid the team in controlling the release. \n\nThe Seneca Water Treatment Plant follows the EPA guidelines for Risk Management and the guidelines established by OSHA for Process Safety Management.  The two codes require the facility to evaluate the on and off site risks associated with a highly hazardous chemical and ensure that proper precautions and plans are implemented to minimize the impact of such release.  The facility has completed a Process Hazard Analysis to review the causes and effects of a chemical"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5397,
      "SummaryText": "release.  \n\nTo aid in the prevention of a leak, Seneca has established a preventative maintenance program to keep the chlorine equipment in optimum condition. Any equipment not in proper working order is immediately evaluated for repair or replacement.\n\nIn addition to a preventative maintenance program, the facility has established standard operating procedures in conjunction with the Chlorine Institute and manufacturer's recommendations.  Employees are required to follow the standard procedures at the plant, especially near a highly hazardous chemical area.  All employees are trained prior to exposure to equipment and provided refresher training at least every three years.  Chemical awareness is discussed both in training and during safety meetings where employees can discuss any hazards or potential hazards of the chlorine system.\n\nChemical specific prevention steps include the installation of the gas monitors and alarm system.  Self-contained breathing apparatus, gloves, goggles and aprons are available for employees for protection against a chlorine leak.  Automatic and manual shutoff valves are in place as precautionary safety measures.\n\nThe Seneca Water Treatment Plant has had no chlorine releases in the last five years.  \n\nWithin the Process Safety Manual, emergency planning and response procedures are outlined.  These procedures include instructions for different scenarios.  Emergency response efforts will be coordinated with the Seneca Fire Department.  Training programs at the Seneca Treatment Plant involve safe working practices, safety and health hazards and emergency operations.  Only specially trained and equipped personnel (plant personnel, fire department, and compressed gas supplier) should respond.  Strategic gas monitoring (downwind) will dictate response actions to be implemented.  Plant personnel will assist emergency personnel in the evacuation of any community residence anticipated of being affected by a release.\n\nSince chlorination process a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5397,
      "SummaryText": "t the Seneca Water Treatment Plant has been recently updated, as of now, no changes to the process are expected.  Training is the major focus of the facility to improve safety."
    }
  ]
}