{
  "FacilityID": 5407,
  "FacilityName": "The Purolite Company",
  "FacilityStr1": "3620 G Street",
  "FacilityStr2": null,
  "FacilityCity": "Philadelphia",
  "FacilityState": "PA",
  "FacilityZipCode": "19134",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42101",
  "LEPC": "Philadelphia LEPC",
  "FacilityLatDecDegs": "39.995833",
  "FacilityLongDecDegs": "-75.114722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.puroliteusa.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 157300138,
  "ParentCompanyName": "BRO-TECH Corporation",
  "Company2Name": null,
  "CompanyDUNS": 48763031,
  "Company2DUNS": null,
  "OperatorName": "Don Brodie",
  "OperatorStr1": "150 Monument Road",
  "OperatorStr2": null,
  "OperatorCity": "Bala Cynwyd",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19004",
  "OperatorZipCodeExt": null,
  "FTE": 75,
  "OtherEPAFacilityID": "19134PRLTC3620G",
  "EPAFacilityID": "100000067492",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1994-11-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 40.00412,
  "FRS_Long": -75.11386,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6391,
      "AltID": "Oleum",
      "FacilityID": 5407,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 6984,
          "ProcessID": 6391,
          "ChemicalID": 69,
          "Quantity": 125600.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6547,
          "ProcessID": 6391,
          "NAICSCode": "325211",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5407,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-03-01 00:00:00",
    "ERTrainingDate": "1999-03-04 00:00:00",
    "CoordinatingAgencyName": "Philadelphia Off. of Emergency Man.",
    "CoordinatingAgencyPhone": "2155741138",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5407,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAt The Purolite Company (Purolite), we are committed to operating a safe facility.  With the submission of this Risk Management Plan (RMP), Purolite continues to show its commitment to operate the facility and all its processes in a safe, environmentally responsible manner. Emergency response planning and an accidental release prevention program are in place to ensure a safe working environment and with it, protection of the public and the environment outside of the property lines.\n\nFACILITY DESCRIPTION AND SUBSTANCES HANDLED\n\nThe Purolite Company owns and operates a cation exchange resin manufacturing facility in Philadelphia, Pennsylvania.  The facility conducts batch manufacturing operations to produce resin products, primarily for the utilities and sweetening industries.  The various pieces of process equipment used to manufacture these resins include reactors, washers, centrifuges, dryers, and screens.\n\nOut of the 140 substances regulated under the Risk Management Program, oleum is the only one that can be found at the plant over the threshold quantity; the facility has approximately 126,000 pounds of oleum onsite. This Risk Management Plan was developed for the oleum system.  Oleum is stored in an 8,000-gallon storage tank that is located in a diked area inside a building.  Additionally, there is a 1,000-gallon storage tank located above the reactors that is used to store oleum temporarily before it is fed to the process.  The overhead tank is also inside the building, but it is not within a diked area.\n\nWORST-CASE RELEASE SCENARIO AND ALTERNATE RELEASE SCENARIOS\n\nThe U.S. Environmental Protection Agency (EPA) has defined the worst-case accidental release as an instantaneous spill of the greatest amount of oleum in a single vessel (i.e., storage tank) to form a 1 centimeter deep liquid pool, which then evaporates.\n\nThe toxic endpoint for oleum is 0.010 mg/L.  That is the maximum airborne concentrat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5407,
      "SummaryText": "ion below which it is believed that nearly all individuals can be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms that could impair an individual's ability to take protective action.\n\nThe worst-case accident involving Purolite's oleum system would essentially be a release of the contents of the oleum storage tank or the head tank.  The 4-foot-high dike was included in the evaluation as a passive mitigation system for the storage tank.  Additionally, Purolite has implemented an operating procedure to limit the amount of oleum in the head tank to 200 gallons.\n\nFollowing the procedures outlined in the U.S. Environmental Protection Agency's (EPA's) RMP Offsite Consequence Analysis Guidance (May 1996), it has been determined that the worst-case release would not reach offsite endpoints.\n\nThe EPA's RMP*Submit software was used to prepare the RMP.  The software is limited in the number of digits that can be entered.  Fields 2.6 (Release Rate) and 2.7 (Release Duration) under Section 2 do not allow the user to enter values below 0.2 or above 9999.9, respectively, as needed for our facility.  The actual Release Rate for Field 2.5 is 0.088 pounds per minute and the Release Duration is 35,682 minutes.\n\nNo alternate release scenarios were evaluated since even the worst-case accident does not reach an offsite receptor.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe oleum system at Purolite has had no accidents with an off-site impact.\n\nTHE EMERGENCY RESPONSE PROGRAM\n\nPurolite has developed and maintains an Emergency Response Plan (ER Plan).  The ER Plan was developed to ensure fast and efficient response in case of an emergency.\n\nThe ER Plan identifies the emergency response organization, the procedures for notification and  evacuation, and emergency preparedness and planning.\n\nPurolite has coordinated services with a number of government and community agencies which would respond to an emergency.  \n\nPLANNED CHANGES TO IMP"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5407,
      "SummaryText": "ROVE SAFETY\n\nPurolite is committed to maintaining a safe and efficient facility.  We are evaluating process hazards and operating procedures to assure safe operation.  This may result in a change in Program Level, at which time we would revise the RMP.  We will continue to implement changes to improve safety as needed.\n\nMISCELLANEOUS ISSUES\n\nPurolite has applied to the Philadelphia Air Management Services for a Clean Air Act Title V Operating Permit; however, as of the date of the submittal of this RMP, it has not been issued."
    }
  ]
}