{
  "FacilityID": 5419,
  "FacilityName": "TriValley Growers Plant 7",
  "FacilityStr1": "2801 Finch Road",
  "FacilityStr2": null,
  "FacilityCity": "Modesto",
  "FacilityState": "CA",
  "FacilityZipCode": "95354",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06099",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.627194",
  "FacilityLongDecDegs": "-120.947583",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9126079,
  "ParentCompanyName": "TriValley Growers",
  "Company2Name": null,
  "CompanyDUNS": 9126079,
  "Company2DUNS": 0,
  "OperatorName": "Kimball Higgs",
  "OperatorStr1": "P.O. Box 576649",
  "OperatorStr2": null,
  "OperatorCity": "Modesto",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95357",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dave Diehl",
  "RMPTitle": "Environmental Coordinator",
  "FTE": 3500,
  "OtherEPAFacilityID": "CAD981578453",
  "EPAFacilityID": "100000068071",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-08-14 00:00:00",
  "DeRegistrationEffectiveDate": "2018-08-01 00:00:00",
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 37.62573,
  "FRS_Long": -120.94733,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6410,
      "AltID": null,
      "FacilityID": 5419,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 6566,
          "ProcessID": 6410,
          "NAICSCode": "311421",
          "_desc": {
            "NAICS_CODE": "311421",
            "NAICS_DESCRIPTION": "Fruit and Vegetable Canning"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 7003,
          "ProcessID": 6410,
          "ChemicalID": 56,
          "Quantity": 53074.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 507003,
          "ProcessID": 6410,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5419,
      "SummaryText": ".\n\n\n\n\n\n\n    \n\n\n\n\n1.0 Executive Summary\nThis Executive Summary includes a brief summary of the following elements of the Risk Management Plan (RMP) prepared by Tri-Valley Growers (TVG) for Plant 7, 2801 Finch Road, Modesto, California:\n* Accidental release prevention and emergency response policies\n* Stationary source and regulated substances handled\n* Worst-case scenarios and alternative release scenarios including administrative controls and mitigation measures\n* General accidental release prevention program and chemical-specific prevention steps\n* Five-year accident history\n* Emergency response program\n* Planned changes to improve safety\n1.1 Accidental Release Prevention and Emergency Response Policies\nTri-Valley Growers' Plant 7 has the following policies in place to prevent or minimize accidental releases and to respond to emergencies:\n* Designation of a hazard response team including emergency contacts and numbers.\n* A description of the facility, emergency contacts, emergency procedures including chemical-specific procedures, fire inspection program, first-aid procedures, spill response, special fire-fighting procedures, evacuation procedures, and reporting and documentation requirements.  \n* Step-by-step procedures for the following activities involving ammonia:\n- Pre-Start Checklist\n- Pre-Season Inspection Checklist\n- System Start-Up\n- Operation of Ammonia Systems \n- Bleed Down \n- Maintenance of Controls and Instrumentation \n- Valve Repair\n- Repairs to Evaporation Coils, Traps and Tanks \n- Cooling Tower Repairs \n- Circulation Pump Overhauls in Cold Storage \n- Compressor Teardown and Overhaul\n- Shut Down and Winterization of Ammonia Areas\n- Emergency Leak\n* Control measures to be taken in the event of physical contact or airborne exposures.\n* Procedures to ensure the mechanical integrity of systems that handle anhydrous ammonia that include designating responsibility, inspection and testing, deficiency management, and quality assurance.  \n* All anhydrous ammonia"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5419,
      "SummaryText": " used onsite is delivered directly into the TVG receiver by the vendor; there is no other ammonia inventory maintained within the property boundary.\n* All employees involved in receiving, handling, operation or maintenance of ammonia receive initial and annual refresher training.  \n* Contractors who work on or near a process that presents known potential fire, explosive, toxic release or other hazard are informed of such hazards and are required to train their employees to work safely at the facility.  Contractors are required to perform all work in accordance with TVG policy and Cal-OSHA Process Safety Regulation regulations.  Contractors are required to complete a Qualification Questionnaire prior to performing work at TVG.\n* Lock out/tag out and Hot Work policies and procedures.\n* Accident Investigation procedures and documentation.\n1.2    Stationary Source and Regulated Substances\nPlant 7 processes and cans various types of fruit and vegetables (peaches, pears, grapes, fruit cocktail, apricots, and tomatoes).   Plant 7 handles the following substances that are subject to the RMP:\nSubstance\nUse\nMaximum Quantity Onsite\nAnhydrous ammonia\nCooling/Refrigeration\n53,074 pounds\n1.3.    Worst-Case Release Scenarios / Alternative Release Scenarios and Administrative Controls and Mitigation Measures\n1.3.1 Worst-Case Release Scenarios\nAnhydrous Ammonia\nUse of the look-up tables provided in the USEPA Ammonia Guidance Document for the worst-case scenario (20,760 lb. release, 10-minute duration, 1.5 meters per second wind speed, F stability class), assuming an urban environment, indicate a toxic endpoint distance of 1.7 miles.\n1.3.2 Alternative Release Scenarios and Administrative Controls and Mitigation Measures\nIn the implementation of it's Process Safety Management Program for this facility.  TVG has performed \"What If\" analyses using the ARCHIE air dispersion model and evaluated the following scenarios:\n* Human error\n* Vandalism /sabotage\n* Mechanical /electrical failure\n* Physi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5419,
      "SummaryText": "cal damage\n* Natural disaster\n* Fire / explosion.\nThe Alternative Release Scenario (ARS) is the release of ammonia at the high-pressure receiver through a 1/4 inch orifice.  The quantities of ammonia associated with this ARS are not expected to extend beyond the property boundaries given the ARS meteorological conditions recommended in the USEPA Model Risk Management Program and Plan for Ammonia Refrigeration.  The \"What-If\" analyses were last reviewed in 1999.\n1.4    General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\nPlant 7 is in compliance with the OSHA PSM and RMP rules.  Specific steps that are key to the TVG prevention program include:\n* Developing and maintaining written Process Safety Information identifying workplace chemical and process hazards, equipment used in the process, and technology used in the processes.\n* Developing and maintaining Process Hazard Analysis used to identify potential failure scenarios and conditions of the process and facility that could result in the release of ammonia.\n* Developing and maintaining Operating Procedures that are specifically designed to address the handling and maintenance of materials and equipment associated with direct or indirect use of ammonia.\n* Providing and maintaining Training Programs that are specifically designed to address all operational, maintenance, and emergency aspects of processes associated with the ammonia systems.\n* Developing and maintaining a Pre-Start Up Safety Review of equipment and process associated with the ammonia systems.\n* Developing and maintaining a program that ensures the Mechanical Integrity of equipment associated with the ammonia systems.\n* Developing and maintaining a Hot Work Permit system to address any hot work that may directly or indirectly affect the ammonia systems.\n* Establishing and maintaining a Management of Change program to address any equipment or process changes associated with the ammonia systems.\n* Developing and maintaining an"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5419,
      "SummaryText": " Accident Investigation program that addresses all types of incidents (e.g., actual releases, fires, near occurrences, etc.) in a timely manner in an effort to prevent the reoccurrence of such incidents.\n* Maintaining an Emergency Response capability that can address small quantity releases of ammonia and extinguish incipient fires.  Plant 7  has chemical-specific emergency procedures for anhydrous ammonia.\n* Establishing and maintaining a comprehensive Injury/Illness Prevention Program in accordance with State of California OSHA regulations.\n* Ensuring that there is Employee Participation at all levels of the organization (e.g., operators, supervisors, etc.).\n* Establishing an on-going Audit component of the RMP that ensures periodic re-evaluation of TVG's prevention program elements.\n1.5    Five-year Accident History\nPlant 7 has had three minor leaks since 1994.  Most leaks were due to leaking seals, gaskets and valve packings; one shaft seal failure.\nNone of these leaks resulted in injuries, evacuations or off-site impacts.\n1.6    Emergency Response Program (shares resources with Plant 1)\nPlant 7 has an Emergency Response Plan that addresses:\n* Emergency Response Teams, contact names and phone numbers\n* Local and regional emergency contacts and numbers including governmental agencies\n* Chemical-specific procedures for minor and major releases, fire-fighting procedures, first aid and waste disposal.  Includes health and safety data and levels.\n* General safety rules\n* Response procedures for fire, earthquake and medical emergency.\n* Fire inspection program\n* Delegated responsibilities\n* Identification of spill / clean-up contractors\n* Locations of SCBA equipment\n* Policies regarding safety meetings and training\n* Agency reporting requirements.\n1.7    Planned Changes to Improve Safety\nPlanned changes are generally addressed by the facility PSM team.  Any Action Items or recommendations made by the team are documented and subsequently followed up by the various team members."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5419,
      "SummaryText": "  TVG has identified the following opportunities to improve safety:\n* Assign one emergency response team for the three Modesto production facilities.\n* Provide additional operator training\n* Cease use, isolate the crossover lines for the 1996 season, and study potential changes or removal to/of the crossover system between cold storage and pear ripening.\n* Replace the plumbing and insulation in the cold storage room which was damaged by corrosion and install a hot gas defrost system to prevent corrosion in the future.\n* Perform additional operator training.\n* Add a Process Controller to the Cold Room System that will monitor system failures and provide alarm and shutdown.\n\n\n\n\n\n\n\n"
    }
  ]
}