{
  "FacilityID": 54270,
  "FacilityName": "Sheetz, Inc.",
  "FacilityStr1": "242 Sheetz Way",
  "FacilityStr2": null,
  "FacilityCity": "Claysburg",
  "FacilityState": "PA",
  "FacilityZipCode": "16625",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42013",
  "LEPC": "Blair County Emergency Managem",
  "FacilityLatDecDegs": "40.277222",
  "FacilityLongDecDegs": "-078.466111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "ST",
  "FacilityURL": "www.sheetz.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 13818448,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sheetz, Inc.",
  "OperatorStr1": "242 Sheetz Way",
  "OperatorStr2": null,
  "OperatorCity": "Claysburg",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "16625",
  "OperatorZipCodeExt": null,
  "RMPContact": "Matthew Colyer",
  "RMPTitle": "Maintenance Supervisor",
  "FTE": 500,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000176374",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Resubmit 2009",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-05-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-05-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-05-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 40.27722,
  "FRS_Long": -78.46611,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 79235,
      "AltID": "Distribution",
      "FacilityID": 54270,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 81159,
          "ProcessID": 79235,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 105708,
          "ProcessID": 79235,
          "ChemicalID": 56,
          "Quantity": 16078.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 605708,
          "ProcessID": 79235,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 79236,
      "AltID": "SBK",
      "FacilityID": 54270,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 81160,
          "ProcessID": 79236,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 105709,
          "ProcessID": 79236,
          "ChemicalID": 56,
          "Quantity": 9000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 605709,
          "ProcessID": 79236,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54270,
      "SummaryText": "Executive Summary\n\nStationary Source and the Regulated Substances Handled \nSheetz, Inc. is a manufacturing and distribution center.   Anhydrous ammonia is the only regulated substance present at the facilities on the Sheetz property in Claysburg, Pennsylvania.  The entire ammonia inventory is attributed to its use as a refrigerant.\n\nAccidental Release Prevention and Emergency Response Policies \nSheetz, Inc. is committed to employee, public and environmental safety.  Our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, and maintenance demonstrates this commitment, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, our highly trained refrigeration personnel are at hand to control and mitigate the effects of the release.  We are also completely coordinated with local fire department and area hazmat team which provides additional emergency response expertise.\n\nWorst Case Release Scenario and the Alternative Release Scenario\nWorst case and alternate release scenarios were developed using the methodology given in the EPA?s ?Risk Management Program Guidance for Ammonia Refrigeration?.  The details of the chosen scenarios are located within the Risk Management Program that is located on site.\n\nAccidental Release Prevention and the Chemical-Specific Prevention Program\nSheetz, Inc. has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68 of the EPA.  In addition, our facilities are subject to the OSHA PSM standard under 29 CFR 1910.119.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nSheetz, Inc. currently maintains a detailed record of written process safety in"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54270,
      "SummaryText": "formation that describes the chemical hazards, operating parameters and equipment designs associated with all the processes.\n\nProcess Hazard Analysis\nThe methodology used to carry out the analysis is What If Analysis.  The analyses are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of 5 years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered process, Sheetz, Inc. maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is reviewed and is readily accessible to operators involved with the process.\n\nTraining\nSheetz, Inc. has a training program in place to train employees who are operating the process or are associated with the process.  Refresher training will be provided at least every three (3) years and more frequently as needed.\n\nMechanical Integrity\nSheetz, Inc. conducts documented maintenance checks on process equipment to ensure proper operations by a qualified refrigeration technician.  Training is provided to the personnel as needed.  Any equipment deficiencies identified during maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Sheetz, Inc. to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel and all other employees whose job tasks are affected by a change in a process are promptly made aware of and offered training to deal with the changes.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in the established process are conducted as a regular practice at Sheetz, Inc.  "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54270,
      "SummaryText": "These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nSheetz, Inc. conducts audits on a regular basis to determine whether the provisions set out under the RMP Rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nSheetz, Inc. promptly investigates incidents that could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nSheetz, Inc. believes that process safety management and accident prevention is a team effort.  Company employees are encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information collected as part of the facility's compliance with the RMP Rule including information resulting from process hazard analyses.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Sheetz, Inc. has a policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all applicable procedures for emergency response to an accidental release of a regulated substance.\n\nFive-year Accident History\nSheetz, Inc. works continuously to prevent any accident occurring.\n\nEmergency Response Plan\nSheetz, Inc. has a written emergency action plan to deal with accidental releases of hazardous m"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 54270,
      "SummaryText": "aterials.  The plan includes all aspects of emergency action plan including evacuations and notification of local emergency response agencies and the public.  Sheetz, Inc. works closely with the Claysburg Fire Department for response to emergency situations including releases of anhydrous ammonia.\n\nPlanned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Continued training, and program reviews are some of the major steps we want to take to improve safety at our facility."
    }
  ]
}