{
  "FacilityID": 54396,
  "FacilityName": "Mont Belvieu East Product Handling Terminal",
  "FacilityStr1": "9434 Highway 146 North",
  "FacilityStr2": null,
  "FacilityCity": "Baytown",
  "FacilityState": "TX",
  "FacilityZipCode": "77520",
  "Facility4DigitZipExt": "9600",
  "FacilityCountyFIPS": "48071",
  "LEPC": "Chambers County LEPC",
  "FacilityLatDecDegs": "29.831667",
  "FacilityLongDecDegs": "-094.895134",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.epco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Enterprise Products Operating LLC",
  "Company2Name": null,
  "CompanyDUNS": 841528859,
  "Company2DUNS": 841528859,
  "OperatorName": "Enterprise Products Operating LLC",
  "OperatorStr1": "P. O. Box 4324",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77210",
  "OperatorZipCodeExt": "4324",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000189672",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-11-14 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "May 2009 Enterprise Re-submission",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-09-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-05-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-05-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 79408,
      "AltID": "Truck Terminal Operations",
      "FacilityID": 54396,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 105954,
          "ProcessID": 79408,
          "ChemicalID": 155,
          "Quantity": 560000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 88271,
              "ProcessChemicalID": 105954,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 88272,
              "ProcessChemicalID": 105954,
              "ChemicalID": 129
            },
            {
              "FlamMixChemID": 88273,
              "ProcessChemicalID": 105954,
              "ChemicalID": 107
            }
          ]
        },
        {
          "ProcessChemicalID": 105955,
          "ProcessID": 79408,
          "ChemicalID": 98,
          "Quantity": 1200000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 81342,
          "ProcessID": 79408,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 46842,
              "Process_NAICS_ID": 81342,
              "SafetyReviewDate": "2007-12-24 00:00:00",
              "PHA_Date": "2005-02-22 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2007-12-24 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Terminal ESD System",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Installation of new or replacement relief valves",
              "OpProceduresReviewDate": "2009-04-23 00:00:00",
              "TrainingReviewDate": "2009-05-09 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Computer based training (CBT), Safety Meetings",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-05-09 00:00:00",
              "EquipmentInspectionDate": "2009-05-10 00:00:00",
              "EquipmentTested": "Pumps and Transfer Hoses",
              "ChangeMgmtDate": "1999-08-01 00:00:00",
              "ChangeMgmtReviewDate": "2009-05-09 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2004-04-20 00:00:00",
              "AuditCompletionDate": "2004-04-20 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-05-09 00:00:00",
              "HotWorkPermitReviewDate": "2009-05-09 00:00:00",
              "ContractorSafetyReviewDate": "2009-05-09 00:00:00",
              "ContractorSafetyEvalDate": "2004-05-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Mont Belvieu East Product Handling Terminal has a fourteen point safety management and accident prevention system that is in full compliance with the OSHA Process Safety Management regulation and the EPA Risk Management Program regulation.  The plan is designed to insure the safe design, operation, maintenance and modification of the rail terminal facility.  More details on the safety management / accident prevention program are contained in the Executive Summary.",
              "_chemicals": [
                {
                  "PrimaryKey": 68361,
                  "PreventionProgram3ID": 46842,
                  "ProcessChemicalID": 105954
                },
                {
                  "PrimaryKey": 68362,
                  "PreventionProgram3ID": 46842,
                  "ProcessChemicalID": 105955
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 54396,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-01-13 00:00:00",
    "ERTrainingDate": "2009-01-14 00:00:00",
    "CoordinatingAgencyName": "Mutual Aid Mont Belvieu",
    "CoordinatingAgencyPhone": "2815762417",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54396,
      "SummaryText": "EXECUTIVE SUMMARY\nEnterprise Products Operating LLC\nMont Belvieu East Product Handling Terminal\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAt Enterprise, we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n* A description of our facility and use of substances required by EPA's RMP regulation\n* A summary of results from our assessment of the potential offsite consequences from accidental chemical releases\n* An overview of our accidental release prevention programs\n* A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\n* An overview of our emergency response program\n* An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\nEnterprise's Mont Belvieu East Product Handling Terminal is used to receive a Propane/Propylene mixture (P/P mix) in tank trucks and to transfer this mixture via pipeline to Enterprise's Propylene Splitter III.  The mixture is transferred from the tank trucks into one of three Propane/Propylene mix storage tanks which serve as a feed liquid supply to pipeline pumps and a transfer pipeline which ship the offloaded mixture to a fractionation unit that separates the Propane from the Propylene via distillation.\n\nThe terminal also receives a purified Propane product in tank trucks and transfers this Propane to long term underground storage.  The Propane is unloaded from the tank trucks into "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54396,
      "SummaryText": "one of eleven propane storage tanks which serve as a feed liquid supply to pipeline pumps and a transfer pipeline which ship the offloaded Propane product to storage.  The terminal also receives purified Propane product from storage via pipeline and stores the product in one or more of the eleven propane storage tanks for delivery into tank trucks.\nThe terminal has a mercaptan storage and injection system to inject mercaptan odorant into tank trucks that will deliver the Propane to retail distributors.  The amount of mercaptan in storage at the East Product Handling Terminal is below the threshold quantity of the RMP regulation.  Currently, there are no toxic substances used, manufactured, or stored at the East Product Handling Terminal that meet the RMP threshold quantities promulgated for those substances. \n\nFlammables\n\nThe East Product Handling Terminal handles a Propane/Propylene mixture and a pure Propane product.  Our accidental release prevention program and our contingency planning efforts help us effectively manage the hazards that are posed to our employees, the public, and the environment by our use of these chemicals.\n\nKEY OFFSITE CONSEQUENCE ANALYSIS SCENARIOS\n\nEPA's RMP rule requires that we provide information about the worst-case scenario(s) and alternative release scenario(s) for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario:\n\n\nToxic Substances\n\nAs stated previously, no toxic substances were identified at Enterprise's East Product Handling Terminal as meeting the criteria or threshold limits of the RMP Rule.  Hence, there was no need to conduct a worst-case scenario (WCS) with respect to toxic substances. \n\nWorst-Case Release Scenario - Regulated Flammable Chemicals\n\nThe WCS associated with a release of flammable materials from Enterprise's East Product Handling Terminal involves the rupture or "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54396,
      "SummaryText": "failure of one of the three Propane/Propylene mixture storage tanks.  All emergency response and early warning to the employees and the community would be exercised immediately if this scenario were to occur.  All Emergency Response protocols would be in effect.  There would be no offsite environmental impact in this scenario due to the material being consumed on site.  Further details on the East Product Handling Terminal worst case scenario are contained in the Risk Management Program registration document.\n\nAlternative Release Scenario(s) - Regulated Flammable Chemicals\n\nThis scenario involves an assumed Propane product delivery hose failure that would be mitigated by means of excess flow devices and activation of the terminal emergency shutdown system and the emergency response team.  All emergency response and early warning to the employees and the community would be exercised immediately if this were to occur.  We are using this information to help us ensure that our emergency response plan and the community emergency response plan address all reasonable contingency cases.  Further details on the alternate case scenario are contained in the Risk Management Program registration document.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMIAL-SPECIFIC PREVENTION STEPS\n\nWe take a systematic, pro-active approach to preventing accidental releases of hazardous chemicals.  Our Process Safety Management Systems address each of the key features of successful prevention programs, including:\n\n* Process safety information\n* Process hazard analysis\n* Operating procedures\n* Training\n* Mechanical integrity\n* Management of change\n* Pre-Startup Safety Review - \"PSSR\"\n* Compliance audits\n* Incident investigation\n* Employee participation\n* Hot work permit\n* Contractors\n\nAs part of our prevention efforts, we have a multitude of programs in which our employees participate.  We have a training program in which the Operations and Maintenance personnel are specifically trained in"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 54396,
      "SummaryText": " the operation of the plant, the operating procedures, maintenance procedures, and specific other regulations and policies, as well as in all areas of emergency response.  We train, use and apply the guidelines of our PSM program, which include all of the above-listed areas.  All of these programs come under scheduled scrutiny and critique.\n\nWe have an on-going inspection program designed to search out and find deficiencies in the process equipment prior to any incident.\n\nOperations personnel make regular inspections of the equipment and processes they operate.  If something out of the ordinary is detected, it is reported to management in order to expediently resolve any problems.\n\nRecords are maintained for all significant accidental releases of hazardous chemicals that occur at the facility.  For each of these incidents (as defined by OSHA's Process Safety Management Standard), formal incident investigations are conducted to identify and correct the root causes of the events.  There have been no RMP-defined accidental releases of hazardous material from Enterprise's Mont Belvieu East Product Handling Terminal within the last five years. \n\nEMERGENCY RESPONSE PROGRAM\n\nEnterprise maintains an integrated contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning.  The program provides the essential planning and training for effectively protecting the workers, the public, and the environment during emergency situations.  Furthermore, the plan is coordinated with the Mutual Aid Mont Belvieu group, which includes the Mont Belvieu Police, fire department, and Emergency Medical Service as well as the Chambers County Emergency Management system.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nEnterprise personnel are continuously reviewing and improving our PSM systems, especially in the areas of operating procedures and training programs.  Employees are encouraged to submit suggestions or recommendations to"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 54396,
      "SummaryText": " improve process or unit operating safety.  All suggestions are reviewed and, if a probable safety improvement can be expected, the suggestion is implemented.  The following projects or programs are currently being installed or re-evaluated to improve safety of the East Product Handling Terminal facility:\n\n*  The accident prevention program / Process Safety Management system is currently undergoing a complete review and update of all fourteen sections of the program."
    }
  ]
}