{
  "FacilityID": 54442,
  "FacilityName": "Americold - Houston",
  "FacilityStr1": "16100 East Hardy Road",
  "FacilityStr2": null,
  "FacilityCity": "Houston",
  "FacilityState": "TX",
  "FacilityZipCode": "77032",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-City Of Houston",
  "FacilityLatDecDegs": "29.955501",
  "FacilityLongDecDegs": "-095.384872",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 58149378,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "AmeriCold Logistics, LLC",
  "OperatorStr1": "16100 East Hardy Road",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77032",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Elliott",
  "RMPTitle": "Regional Compliance Manager",
  "FTE": 27,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000029248",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-04-01 00:00:00",
  "SafetyInspectionBy": "Contractor - Fire Inspection",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-09-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 29.95114,
  "FRS_Long": -95.38484,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 79482,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 54442,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 81421,
          "ProcessID": 79482,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 106037,
          "ProcessID": 79482,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 606037,
          "ProcessID": 79482,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54442,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nAmericold - Houston employs a single refrigeration system for cooler and freezer storage.  Americold's senior management is not only committed to offer a superior service but to also maintain a safety and environmental program to promote a safe environment for all its employees and the surrounding communities.  Americold's safety and environmental policies are administered by the Regional Safety Manager and Regional Director of Engineering.  These programs include forklift safety, hazard communications, lockout/tagout, Hazardous Materials Emergency Business Plan, employee safety manuals, manufacturers documentation, Emergency Response Plan, as well as the Risk Management Plan.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe Americold - Houston facility is located at 16110 East Hardy Road. The facility is situated in an urban area. With the exception of the condensers, all of the ammonia equipment is located inside.  The facility was initially constructed in 1990 with an expansion in 2000.\n\n\n\nThe primary business of Americold - Houston is to provide cooler and freezer warehousing space.  In order to conduct operations, the facility maintains a refrigeration system.  The facility uses 15,000 pounds of anhydrous ammonia.  The refrigeration system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, and then back to high pressure liquid) in order to provide refrigeration for the warehouse evaporators and blast freezer units.  Typical operating conditions range from 5\" Hg on the low pressure side of the system to 150 psig on the high side of the system.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nIn order to operate the ammonia refrigeration system, the facility complies with the following risk management regulations:\n\n\n\n1) OSHA's Process Saf"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54442,
      "SummaryText": "ety Management (PSM); and\n\n2) EPA's Risk Management Program (RMP)\n\n\n\nThese regulations impose numerous requirements on the facility to ensure the safety of the public and on-site workers.  The following summarizes the key compliance programs that have been implemented by Americold - Houston to prevent the accidental release of ammonia from the facility.  The Operating Procedures program ensures that the ammonia system is operated in a safe manner.  The Training program ensures that personnel fully understand how to perform their jobs in a safe manner.  The Mechanical Integrity program ensures that the ammonia system is in proper working condition based upon routine testing, inspections, and maintenance according to manufacturer's specifications and industry standards.  The Management of Change program ensures that process modifications are implemented in a safe manner.  The Pre-Startup Safety Review program ensures that adequate safety measures are in place before ammonia is introduced into a process.  The Hot Work Permit program ensures that Americold - Houston's employees and contractors perform hot work (e.g. welding) in a safe manner.  The Contractor Safety program ensures that contractors understand the hazards of ammonia and must take specified precautions to safely complete job requirements.\n\n\n\nIt is important to note that the refrigeration system has been designed with several safety features to prevent the accidental release of ammonia.  For example, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits.  Also, level indicators, alarms, and switches are installed in key points within the systems to monitor the supply of liquid ammonia and to ensure that a vessel is not overfilled.  Operators perform inspections of the engine room and record typical operating parameters four times daily.  Additionally, critical process parameters are continuously monitored by an exte"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54442,
      "SummaryText": "rnal alarm company which will alert operators in the event of an abnormal situation.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nBased upon the Americold - Houston Process Hazard Analysis Revalidation (04/23/2009), there have not been any reportable releases of ammonia at the facility over the past five years (May 2004 - May 2009).\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe facility has an Emergency Response Plan (plan) in effect at the facility.  This Plan was designed to meet the following objectives:  \n\n\n\n? save lives;\n\n? minimize and avoid injuries;\n\n? protect the environment; and\n\n? minimize property damage.\n\n\n\nThe Plan provides the notification procedures and evacuation routes for emergencies that may arise at the facility as well as detailing the training, procedures, and members of the Emergency Response Team.  Americold Houston is working with the local Fire and HazMat Departments to formulate a response team per OSHA's requirements. \n\n\n\nThis Plan is reviewed and updated at least once per year to ensure compliance with the PSM and RMP regulations.  Facility personnel receive annual training regarding the emergency procedures and the Emergency Response Team holds regular drills.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nA Revalidation of the initial Process Hazard Analysis Study was performed in April 2009.  The 2009 PHA Revalidation consisted of:\n\n\n\n? a detailed review of the `What-if' log tables from the previous study;\n\n? a series of safety checklists;\n\n? a hazard and operability study; and\n\n? a facility inspection.\n\n\n\nThe mitigation measures include enhanced operating procedures additional equipment added to the mechanical integrity program, and miscellaneous upgrades throughout the system.  All recommendations resulting from the revalidation study were completed."
    }
  ]
}