{
  "FacilityID": 54485,
  "FacilityName": "North Douglas Gas Plant",
  "FacilityStr1": "63501 Hwy 139",
  "FacilityStr2": null,
  "FacilityCity": "Rangely",
  "FacilityState": "CO",
  "FacilityZipCode": "81648",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08103",
  "LEPC": "Rio Blanco County LEPC",
  "FacilityLatDecDegs": "39.677778",
  "FacilityLongDecDegs": "-108.918778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "ETC Canyon Pipeline, LLC",
  "Company2Name": "fka Canyon Gas Resources, LLC",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "ETC Canyon Pipeline, LLC",
  "OperatorStr1": "1600 Broadway",
  "OperatorStr2": "Suite 1900",
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80202",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scott Pierce",
  "RMPTitle": "Director, Operations",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000135427",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "95OPRB011",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-06-15 00:00:00",
  "DeRegistrationEffectiveDate": "2017-06-13 00:00:00",
  "AnniversaryDate": "2014-06-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 39.67778,
  "FRS_Long": -108.91878,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "The processing plant and bulk storage has been decommissioned at this site.",
  "_processes": [
    {
      "ProcessID": 79553,
      "AltID": "Natural Gas Liquid Extrac",
      "FacilityID": 54485,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 81493,
          "ProcessID": 79553,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 106122,
          "ProcessID": 79553,
          "ChemicalID": 155,
          "Quantity": 564000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 88865,
              "ProcessChemicalID": 106122,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 88866,
              "ProcessChemicalID": 106122,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 88867,
              "ProcessChemicalID": 106122,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 88868,
              "ProcessChemicalID": 106122,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 88869,
              "ProcessChemicalID": 106122,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 88870,
              "ProcessChemicalID": 106122,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 606122,
          "ProcessID": 79553,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54485,
      "SummaryText": "\nNorth Douglas Creek Gas Plant \n\nRio Blanco County, Colorado\n\n\n\n\n\nRMP Executive Summary\n\n\n\n\n\nAccidental Release and Prevention Response Policy\n\n\n\nThe ETC Canyon Pipeline, LLC operated North Douglas Creek Gas Plant has a standing commitment to worker and public safety.  This stationary source / facility's accidental release prevention policy involves a unified approach that integrates procedures and management practices. Applicable procedures of the Environmental Protection Agency (EPA) Prevention Program are followed. The facility's emergency policy involves the preparation of plans tailored to the facility and to the emergency response services available in the community.\n\n\n\nThe facility spill prevention policy seeks to implement appropriate controls to prevent accidental releases of regulated flammable substances. In the event such a release occurs facility personnel are prepared to work with the local fire department, Local Emergency Planning Commission, and other authorities to control and mitigate the effects of the release.\n\n\n\n\n\nDescription of the Stationary Source and Regulated Substances Handled\n\n\n\nThe North Douglas Creek Gas Plant is located at 63501 Highway 139 in rural Rio Blanco County, Colorado.  The facility processes natural gas and produces natural gas liquids (NGLs), stores NGLs in above ground pressurized tanks, and delivers NGLs into pressurized tank trucks for delivery into an interstate pipeline. NGL is a flammable pressurized liquid mixture of aliphatic and aromatic hydrocarbons including regulated flammables ethane, propane, butane, isobutane, isopentane and pentane. There are no threshold quantities of toxic substances present. This facility was designed and constructed in accord with applicable state and federal regulations.\n\n\n\n\n\nGENERAL ACCIDENT RELEASE AND PREVENTION PROGRAM\n\n\n\nThe necessary steps have been taken to comply with the accidental release prevention requirements of 40 CFR part 68. This stationary source was designed and constru"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54485,
      "SummaryText": "cted in accord with applicable state and federal regulations and applicable good engineering practices. The following briefly describes the release prevention program that is in place.\n\n\n\n\n\nProcess Safety Information\n\n\n\nA variety of documents are available and used to help maintain safe operation of the process. These documents cover chemical properties and associated hazards, limits for key process parameters, and specific chemical inventories, equipment specification and design basis/ configuration information. This information is updated when a change occurs that makes the information inaccurate. \n\n\n\nChemical specific information describing the chemical hazards associated with regulated substances is maintained e.g. material safety data sheets. For specific process areas, safety related limits for specific process parameters (e.g. temperature, pressure, level) are documented. Process controls and monitoring instruments, protective instrument systems and trained personnel are used to maintain the process within these limits.\n\n\n\nInformation about the design and construction of the process equipment is maintained and readily available. This information provides a basis for establishing inspection and maintenance activities as well as evaluating proposed changes to make sure that process safety features are not compromised.\n\n\n\n\n\nProcess Hazard Analysis\n\n\n\nA hazard review and safety inspections are conducted to identify and control hazards associated with the process and regulated substances including the potential equipment malfunction or human error and the safeguards needed to detect, control or prevent hazards, equipment malfunction and human error. The hazard review will be updated on at least 5-year intervals and whenever a major process change occurs.  Additional reviews/inspections include pre startup for new/ modified process or equipment and periodic equipment inspections. Hazard review findings are addressed in a timely manner. The findings and final resolu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54485,
      "SummaryText": "tions are documented and retained.\n\n\n\n\n\nOperating Procedures\n\n\n\nWritten operating procedures for safely conducting activities associated with the process and regulated substances have been prepared and are maintained at the facility. These procedures address various modes of operation such as initial startup, normal operations, emergency shutdown, emergency operations, normal shutdown, startup after an emergency shutdown and temporary operations.  The procedures address deviation from operating parameters and actions to correct and to avoid deviations and equipment inspection. The procedures are readily accessible to operators involved with the process; and are updated, if necessary, upon a major change and before startup of a changed process.\n\n\n\n\n\nTraining\n\n\n\nAn operator training program is in place to train employees involved in the process. New employees receive basic training in process operations followed by on-the-job supervision until they are determined to be competent to work independently. Training in updated or new procedures is provided before process startup after a major change.  Refresher training is provided at least ever 3 years or more frequently if needed or requested.  In addition, employees not operating the process receive safety training on the hazards associated with the process and regulated substances at the facility.\n\n\n\n\n\nEmployee Participation\n\n\n\nEmployees are encouraged to participate in all facets of process safety management and accident prevention.  Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a process hazard analysis (PHA) team.  Employees have access to all information created as part of the gas plant accident prevention program.  \n\n\n\nContractors\n\n\n\nThe gas plant uses contractors to supplement its work force during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipmen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 54485,
      "SummaryText": "t, procedures are in place to ensure that contractors \n\n(1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow plant safety rules, and  (6) inform gas plant personnel of any hazards that they find during their work.  This is accomplished by providing contractors   with (1) a process overview, (2) information about safety and health hazards, (3) emergency plan requirements, and   (4) safe work practices before their beginning work.  In addition, the gas plant evaluates contractor safety programs and performance during the selection of a contractor.  Gas plant personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\n\n\n\n\n\nMaintenance Procedures\n\n\n\nMaintenance checks are performed on the equipment to ensure proper function.  Maintenance, tests and inspections are consistent with manufacturer?s recommendations, good practices and prior operating experience. Trained and qualified personnel perform the maintenance tasks. Equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner. \n\n\n\nWhen contractors are required for construction and maintenance activities, procedures are in place to ensure they perform their work in a safe manner, are aware of hazards in their work place, understand what they are to do in an emergency, understand and follow facility safety rules, and inform the facility representative of any hazards that they find during their work. \n\n\n\n\n\nCompliance Audits\n\n\n\nCompliance audits will be conducted on a regular basis to determine whether the provisions of the RMP rule are being implemented. These audits are conducted at least ever 3 years in accord with 40 CFR 68. Procedures are in place to make sure corrective actions required as a result of an audit are resolved in a timely manner."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 54485,
      "SummaryText": " The 2 most recent audit reports will be retained on file.\n\n\n\n\n\nIncident Investigation\n\n\n\nAn incident that results in, or could have reasonably resulted in a catastrophic release of a regulated substance will be investigated promptly as possible, and will be initiated within 48 hours after the incident. The goal of the investigation is to determine the facts and develop corrective actions to prevent a recurrence, or a similar incident. A summary report will be prepared at the conclusion of the investigation. The resolutions and action taken will be documented. The findings will be reviewed with the affected personnel. Summaries will be maintained for 5 years.\n\n\n\n\n\nEmergency Plan\n\n\n\nEmployees receive training as necessary to perform their specific emergency actions.  Such actions include, but not limited to, notification of local emergency response agencies and the public and initiate post accident cleanup. The plan is updated when necessary and those affected are informed and or trained in the change. There are no 112(r) threshold toxic substances on site.\n\n\n\n\n\nAccident History\n\n\n\nThe North Douglas Creek Gas Plant has experienced NO reportable accidents in the past 5 years.  Releases that did occur at the plant involving a regulated substance, were quickly contained and resulted in no deaths, injuries, significant property damage, environmental damage, evacuations, or sheltering in place.\n\n\n\n\n\nPlanned Changes for Improved Safety\n\n\n\nIdeas for changes to improve safety are actively sought from employees.  Employee safety meetings that focus on chemical safety issues are held regularly at this facility.  Employees are encouraged and trained to recognize hazards and present ideas to eliminate them or to minimize the potential consequences of those hazards.\n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}