{
  "FacilityID": 54550,
  "FacilityName": "MPEA Energy Center",
  "FacilityStr1": "2211 S. Martin Luther King Jr. Dr.",
  "FacilityStr2": null,
  "FacilityCity": "Chicago",
  "FacilityState": "IL",
  "FacilityZipCode": "60616",
  "Facility4DigitZipExt": "0566",
  "FacilityCountyFIPS": "17031",
  "LEPC": "City of Chicago LEPC",
  "FacilityLatDecDegs": "41.852778",
  "FacilityLongDecDegs": "-087.618611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Metropolitan Pier and Exposition Authority",
  "Company2Name": null,
  "CompanyDUNS": 54343017,
  "Company2DUNS": null,
  "OperatorName": "Metropolitan Pier and Exposition Au",
  "OperatorStr1": "301 East Cermak Road",
  "OperatorStr2": null,
  "OperatorCity": "Chicago",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60616",
  "OperatorZipCodeExt": "0566",
  "FTE": 12,
  "OtherEPAFacilityID": "IL0002091049",
  "EPAFacilityID": "100000050883",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-08-29 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 41.852813,
  "FRS_Long": -87.618051,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 79630,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 54550,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 106206,
          "ProcessID": 79630,
          "ChemicalID": 56,
          "Quantity": 30000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 81570,
          "ProcessID": 79630,
          "NAICSCode": "22133",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 46957,
              "Process_NAICS_ID": 81570,
              "SafetyReviewDate": "2009-05-21 00:00:00",
              "PHA_Date": "2004-11-11 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-06-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Ventilation air dilution",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-12-15 00:00:00",
              "TrainingReviewDate": "2009-05-21 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2006-12-01 00:00:00",
              "EquipmentInspectionDate": "2009-05-20 00:00:00",
              "EquipmentTested": "All system piping and vessels",
              "ChangeMgmtDate": "2005-01-26 00:00:00",
              "ChangeMgmtReviewDate": "2009-05-21 00:00:00",
              "PreStartupReviewDate": "2006-12-01 00:00:00",
              "ComplianceAuditDate": "2009-05-21 00:00:00",
              "AuditCompletionDate": "2009-12-01 00:00:00",
              "IncidentInvestigationDate": "2004-05-13 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-05-21 00:00:00",
              "HotWorkPermitReviewDate": "2009-05-21 00:00:00",
              "ContractorSafetyReviewDate": "2009-02-09 00:00:00",
              "ContractorSafetyEvalDate": "2009-05-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 68501,
                  "PreventionProgram3ID": 46957,
                  "ProcessChemicalID": 106206
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 54550,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-05-21 00:00:00",
    "ERTrainingDate": "2009-01-20 00:00:00",
    "CoordinatingAgencyName": "City of Chicago LEPC",
    "CoordinatingAgencyPhone": "3127466455",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54550,
      "SummaryText": "Introduction\n\nThe Metropolitan Pier and Exposition Authority (MPEA) Energy Center provides steam/heating and chilled water/air conditioning for the Chicago Metropolitan Pier and Exposition Authority's McCormick Place exhibition and Convention Center and surrounding buildings. \n\nMPEA Energy Center integrated existing MPEA heating and cooling equipment with a thermal energy storage (TES) system and three trigeneration (combined heating, cooling, and power) systems. The TES system stores cold water produced at night and discharges it to meet daytime peak cooling loads. Fewer chillers are required to meet peak demands and they can be operated continuously, maximizing their production efficiency. The three trigeneration systems combine a gas turbine, a motor/generator, a heat recovery steam generator and an ammonia screw compressor chiller. Their design also allows the equipment connected to the gas turbine to produce any combination of electricity, steam or chilled water while the gas turbine is in operation. Steam absorption chillers utilize steam produced by the trigeneration systems in the summer.\n\nThe efficiency improvements of the integrated facility result in substantial economic and environmental benefits. By using the same fuel twice to produce electricity and other energy products and maximizing the use of all the possible energy from the fuel, the facility is able to achieve fuel conservation efficiencies of 91%. Operational savings of $1 million per year are projected over the life of the system. Additionally, emissions of CO2 are reduced annually by 24,327 tons, SOX by 126 tons annually, and NOX by 59 tons annually when compared to the separate production of these same energy products (steam, cooling, and electricity) by conventional means. By increased efficiency in the cooling process and use of ammonia as a refrigerating agent, 6,500 refrigeration tons of potential ozone depleting refrigerant (CFCs and HCFCs) have been displaced.\n\nAmmonia Refrigeration Sy"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54550,
      "SummaryText": "stem\n\nMPEA Energy Center uses pressurized liquid anhydrous ammonia as a refrigerant for portions of its district cooling system. The ammonia is used to cool a chilled water system, which in turn is distributed and cools recirculated air systems. MPEA Energy Center's ammonia system contains approximately 30,000 pounds of anhydrous ammonia (based on latest records).\n\nAt ambient temperature and pressure, ammonia is a colorless gas with a characteristic, irritating odor. Ammonia is highly soluble in water. Ammonia is the third highest volume chemical produced in the United States, with eighty percent of the ammonia produced, used in the manufacture of fertilizers. The EPA defined toxic endpoint for ammonia is 0.14 mg/L (approximately 200 ppm). OSHA¿s immediately dangerous to life and health (IDLH) limit is 300 ppm (the facility uses 250 ppm as its IDLH point). The OSHA personal exposure limit (PEL) for a time weighted 8-hour average is 50 ppm.\n\nMPEA Energy Center incorporates OSHA¿s Process Safety Management (PSM) and EPA¿s Risk Management Plan for its ammonia refrigeration process. Its dedication to safety is reflected in zero lost time accidents in the last five years. The facility has not had an ammonia leak resulting in an impact on a public or environmental receptor, or one requiring notification to response agencies in the last five years.\n\nMPEA Energy Center ammonia system utilizes state of the art design, control, and protective devices and systems. All ammonia equipment is located at the central power plant and there is no ammonia distribution piping. All equipment, construction, operations, and maintenance activity meets or exceeds the requirements and/or recommendations of more than thirteen (13) different regulatory codes and industry guidance regarding ammonia refrigeration systems. MPEA only utilizes ammonia compatible products, which are designed to meet or exceed the conditions (pressure, temperature, and function) found in their refrigeration system. MP"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54550,
      "SummaryText": "EA incorporates a management system to ensure all modifications or other changes to the system meet these stringent criteria. Additionally, the management system ensures only qualified contractors (installation, welding, and other specialists), operators, and maintenance personnel are allowed to work on or with the MPEA Energy Center ammonia system.\n\nAmmonia control systems include redundant monitoring and equipment shutdown circuitry. This includes computer controlled operations, alarms, and/or automatic equipment shutdown due to changing process parameters. The computer system is backed up with independent ¿hard wire¿ system, that can independently shutdown equipment due to out of range process values. Finally, if it becomes necessary, an operator can activate a ¿master shutdown¿ switch from the control room or from a remote location.\n\nA preventative maintenance program supplemented by daily (minimum) equipment inspections maintains system mechanical integrity. Problems identified during equipment inspections are addressed immediately. The preventative maintenance program includes regularly scheduled maintenance activities such as equipment testing, clearance checks, vibration analysis, periodic overhauls, vessel and pipe inspections and certifications, and lubrication oil and refrigerant quality testing.\n\nAll ammonia related activities (operations, maintenance, and construction) are conducted under the aegis of the Director of Plant Operations. The Director of Plant Operations coordinates all facility activity. Direct involvement of the Chief Engineer and the Assistant Chief Engineer (Safety Officer) is found in all ammonia related activities and personnel utilize facility specific operation procedures in their operations and maintenance of the ammonia equipment.\n\nLeaks\n\nEvery effort is made to prevent ammonia leaks, however the possibility of a leak does exist and thus MPEA Energy Center has developed an Emergency Ammonia Leak response plan. MPEA personnel are t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 54550,
      "SummaryText": "horoughly trained in ammonia response and have the necessary equipment maintained on-site to respond immediately and effectively to an ammonia release. Employees undergo initial response training and annual refresher course that include practice response scenarios utilizing the required protective equipment under adverse conditions. Personnel safety is of primary importance. An important component of the response plan is, if necessary, to shut down all equipment and await backup personnel before attempting to enter a potentially unsafe area. Essentially, production is sacrificed in order to achieve safety.\n\nThe key to leak mitigation is the ability to identify leaks as early in their development as possible. Ammonia has a very low odor threshold, meaning it can be smelled at low concentrations. All ammonia equipment is staged in a room adjacent to the operations control room and personnel are often entering the area. A small ammonia leak in the room is immediately detected by area personnel (or ammonia sensors) and promptly investigated. Ammonia equipment located on the roof of the facility is physically inspected three (3) times per day.\n\nMPEA also utilizes ammonia sensors located throughout the ammonia equipment areas and ventilation air stream. This system is linked with the computer control system. If a sensor detects an ammonia leak, a series of alarms will activate, alerting the operator not only to the situation, but also to its severity. It also alerts the operator to a changing situation. Upon detection of an ammonia concentration equal to, or greater than 250 ppm, the system will automatically shutdown all equipment in the central power plant (not just the ammonia equipment) and activate a mandatory evacuation of all non-responding personnel. The ventilation system design mitigates the potential impact of an ammonia release on the public and environment by dilution, increased atmospheric mixing and the elevated release point.\n\nIn the event of a major relea"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 54550,
      "SummaryText": "se, MPEA would promptly link with the Chicago Fire Department for removal of the entire ammonia inventory or isolated section of ammonia inventory. This system is called the ¿fireman¿s dump.¿ The ammonia is mixed with water and discharged to the sewer system. The ammonia/water discharge ultimately enters the city¿s wastewater systems, in which ammonia will not adversely impact the environment. The system is required by the City of Chicago Building Code."
    }
  ]
}