{
  "FacilityID": 54834,
  "FacilityName": "Secondary Reservoir",
  "FacilityStr1": "4800 Fairway",
  "FacilityStr2": null,
  "FacilityCity": "Wichita Falls",
  "FacilityState": "TX",
  "FacilityZipCode": "76308",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48485",
  "LEPC": "Wichita County LEPC",
  "FacilityLatDecDegs": "33.867778",
  "FacilityLongDecDegs": "-098.563889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of WichitaFalls",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Wichita Falls",
  "OperatorStr1": "P.O. Box 1431",
  "OperatorStr2": null,
  "OperatorCity": "Wichita Falls",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76307",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000067401",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "*Public Water Treatment Plant",
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2011-12-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 33.867778,
  "FRS_Long": -98.563889,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 79985,
      "AltID": "Chlorine Dioxide Process",
      "FacilityID": 54834,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 106735,
          "ProcessID": 79985,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 81938,
          "ProcessID": 79985,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 28945,
              "Process_NAICS_ID": 81938,
              "SafetyReviewDate": "2009-02-09 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "Chlorine Institute",
              "FR_Comments": null,
              "HazardReviewDate": "2009-06-02 00:00:00",
              "ChangeCompletionDate": "2009-09-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-02-09 00:00:00",
              "TrainingReviewDate": "2009-02-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-02-09 00:00:00",
              "EquipmentInspectionDate": "2009-06-18 00:00:00",
              "EquipmentTested": "All process equipment is inspected daily as part of normal operations",
              "ComplianceAuditDate": "2009-06-02 00:00:00",
              "AuditCompletionDate": "2009-09-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2009-02-09 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 30270,
                  "PreventionProgram2ID": 28945,
                  "ProcessChemicalID": 106735
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 54834,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-01-15 00:00:00",
    "ERTrainingDate": "2008-05-15 00:00:00",
    "CoordinatingAgencyName": "Wichita Falls Fire Department",
    "CoordinatingAgencyPhone": "9407617901",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54834,
      "SummaryText": "City of Wichita Falls\nSecondary Reservoir Pretreatment\nRISK MANAGEMENT PROGRAM\nEXECUTIVE SUMMARY\n\n\n1.0\tAccidental Release Prevention and Emergency Response Policies\n\nThe City of Wichita Falls Secondary Reservoir Pretreatment is committed to the safety of our workers, the public, and the environment.  The resources invested in the prevention of accidental releases of hazardous substances demonstrate this commitment.  The City of Wichita Falls Secondary Reservoir Pretreatment implements reasonable controls, such as training of personnel and the safe design, installation, operation and maintenance of our processes.  Our policy is to make every effort to prevent the release of hazardous substances but in the event of a release, our trained personnel and local emergency response agencies will respond to control and contain the release in a manner that will be safe for workers and will help prevent injuries to the public or the environment.\n\n\n2.0\tDescription of The City of Wichita Falls Secondary Reservoir Pretreatment and Regulated Substances\n\nThe City of Wichita Falls Secondary Reservoir Pretreatment handles one substance regulated by the Risk Management Plan Rule (RMP Rule) in quantities above the Threshold Quantity.  This substance is:\n\n* Chlorine - stored in 1 ton cylinders and used for chlorine dioxide pretreatment of the water.\n\n\n\n3.0\tHazard Assessment\n \nThe RMP Rule requires The City of Wichita Falls Secondary Reservoir Pretreatment to perform a Hazard Assessment of the regulated substances stored and used in the covered processes at the facility.  This Hazard Assessment includes an offsite consequence analysis for the following scenarios:\n \n* One worst-case and one alternative release scenario for the toxic substance chlorine for the chlorination process unit at the facility.\n\nThe City of Wichita Falls Secondary Reservoir Pretreatment completed a Hazard Assessment for the covered processes and the results have been appropriately communicated to the local emergenc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54834,
      "SummaryText": "y response agencies. The Hazard Assessment has been recently updated to reflect changes in population.\n\n\n4.0\tAccidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe RMP Rule requires that a prevention program be established for The City of Wichita Falls Secondary Reservoir Pretreatment chlorination processes.  The following details the prevention program elements at The City of Wichita Falls Secondary Reservoir Pretreatment that apply to these processes.\n\n4.1\tSafety Information\n\nThe City of Wichita Falls Secondary Reservoir Pretreatment maintains a variety of technical documents that are used to help ensure safe operation of The City of Wichita Falls Secondary Reservoir Pretreatment processes.  Material safety data sheets (MSDSs) document the physical and chemical properties of hazardous substances handled at The City of Wichita Falls Secondary Reservoir Pretreatment, including the chlorine in the covered process.  The engineering design documents include the operating parameters, the design basis and configuration of the equipment in each covered process, and references to applicable codes and standards.\n\n\n4.2\tHazard Review\n\nThe City of Wichita Falls Secondary Reservoir Pretreatment performs and periodically updates hazard reviews of the covered processes to help identify and control process hazards.  Checklists are used to guide the hazard review.  These checklists include items to help ensure The City of Wichita Falls Secondary Reservoir Pretreatment operates and maintains the equipment in a manner consistent with the applicable design specifications, codes, standards, and regulations.\n\n4.3\tOperating Procedures\n\nThe City of Wichita Falls Secondary Reservoir Pretreatment develops and maintains operating procedures to define how tasks related to process operations should be performed.  The operating procedures are used to:\n\n1. train employees and contractors, and\n2. serve as reference guides for appropriate actions to take during both norm"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54834,
      "SummaryText": "al and abnormal process conditions.\n\n4.4\tTraining\n\nThe City of Wichita Falls Secondary Reservoir Pretreatment trains personnel in the operating procedures to help ensure safe and effective performance of their assigned tasks. A record of all training is maintained to help ensure new and refresher training is provided on a timely basis.\n\n4.5\tMaintenance\n\nThe City of Wichita Falls Secondary Reservoir Pretreatment properly maintains the equipment in our processes.  The City of Wichita Falls Secondary Reservoir Pretreatment maintenance program includes:\n\n1. procedures to safely guide workers in their maintenance tasks,\n2. worker training in the maintenance procedures, and\n3. inspection and testing program to help identify equipment deterioration and damage before equipment fails.\n\n4.6\tCompliance Audits\n\nThe City of Wichita Falls Secondary Reservoir Pretreatment performs periodic (at least every three years) audits of covered processes to verify the processes are operating in compliance with the requirements of the RMP Rule.  A compliance audit report is prepared after each audit, and any deficiencies noted by the audit are corrected in a timely manner.\n\n\n4.7\tIncident Investigations\n\nThe City of Wichita Falls Secondary Reservoir Pretreatment investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment.  The City of Wichita Falls Secondary Reservoir Pretreatment trains employees to identify and report any and all incidents requiring investigation.  An investigation team is assembled and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n\n4.8\tChemical-specific Prevention Steps - Chlorine\n\nIndustry standards are followed at The City of Wichita Falls Secondary Reservoir Pretreatment to help ensure safe handling of chlorine.  The vendor supplies chlorine via a Depar"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 54834,
      "SummaryText": "tment of Transportation (DOT) approved truck and in DOT approved 1 ton cylinders.  The process equipment is designed and constructed with state-of-the-art materials and technology utilizing the standards and guidelines of the Chlorine Institute, American Water Works Association, ASME, ANSI, and other applicable codes.  Workers who perform operations involving chlorine receive training emphasizing safe handling procedures according to the guidelines required by The City of Wichita Falls Secondary Reservoir Pretreatment.\n\n\n5.0\tFive Year Accident History\n\nThere has been no accidents or incidents that resulted in injuries to employee, the public, or the environment The City of Wichita Falls Secondary Reservoir Pretreatment in the past five years.\n\n\n6.0\tEmergency Response Programs\n\nThe City of Wichita Falls Secondary Reservoir Pretreatment has prepared a written emergency response plan that complies with the RMP Rule, other federal standards and industry guidelines.  This plan has been communicated to the Local Emergency Planning Committee (LEPC) and local fire department.  The City of Wichita Falls Secondary Reservoir Pretreatment periodically conducts emergency drills to test our emergency plan and coordinate these drills with the local fire department.\n\n\n7.0\tPlanned Changes to Improve Safety\n\nThe City of Wichita Falls Secondary Reservoir Pretreatment continuously attempts to improve the safety of our processes to protect our employees, the public and the environment.  The City of Wichita Falls Secondary Reservoir Pretreatment incident investigations, employee suggestions and improvements in technology are utilized to update the safety aspects of the processes.  The following changes to improve process safety are planned or have recently been completed.\n\n1. Implement a chlorine shipment Quality Assurance Program to aid in the inspection of chlorine cylinders when received, and\n2. Implement a preventive maintenance program for the hoist used to move chlorine cylinders."
    }
  ]
}