{
  "FacilityID": 54903,
  "FacilityName": "Stoney Creek Technologies, LLC",
  "FacilityStr1": "3300 West 4th Street",
  "FacilityStr2": null,
  "FacilityCity": "Trainer",
  "FacilityState": "PA",
  "FacilityZipCode": "19061",
  "Facility4DigitZipExt": "5112",
  "FacilityCountyFIPS": "42045",
  "LEPC": "Delaware County LEPC",
  "FacilityLatDecDegs": "39.830054",
  "FacilityLongDecDegs": "-075.399088",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.sctsaci.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 25995395,
  "ParentCompanyName": "SAME",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Stoney Creek Technologies, LLC",
  "OperatorStr1": "3300 West 4th Street",
  "OperatorStr2": null,
  "OperatorCity": "Trainer",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19061",
  "OperatorZipCodeExt": "5112",
  "RMPContact": "Samuel Thomas",
  "RMPTitle": "Plant Manager",
  "FTE": 6,
  "OtherEPAFacilityID": "PAR000039040",
  "EPAFacilityID": "100000109955",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "23-00002",
  "SafetyInspectionDate": "2007-07-19 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-08-24 00:00:00",
  "DeRegistrationEffectiveDate": "2011-10-14 00:00:00",
  "AnniversaryDate": "2014-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 39.8291,
  "FRS_Long": -75.3986,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility 'closed'.",
  "_processes": [
    {
      "ProcessID": 80094,
      "AltID": "Sulfonation",
      "FacilityID": 54903,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 82055,
          "ProcessID": 80094,
          "NAICSCode": "32551",
          "_desc": {
            "NAICS_CODE": "32551",
            "NAICS_DESCRIPTION": "Paint and Coating Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 106852,
          "ProcessID": 80094,
          "ChemicalID": 69,
          "Quantity": 163300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 69,
            "ChemicalName": "Oleum (Fuming Sulfuric acid)  [Sulfuric acid, mixture with sulfur trioxide]",
            "CASNumber": "8014-95-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 606852,
          "ProcessID": 80094,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54903,
      "SummaryText": "Executive Summary\n\n\nStoney Creek Technologies has sales internationally with a manufacturing facility located on 14 acres of land in Trainer, PA, along with a sales office in Trainer as well as sales and distributors in Europe.  This manufacturing location was previously owned by Witco Corporation as part of their Performance Chemicals Group (PCG) and was purchased in July 1998, by a management-led team.  There are currently 6 Stoney Creek personnel at the Trainer facility. Stoney Creek Technologies is currently under US EPA Order # CERC-03-2007-0254-DC, to halt production and lower inventory until refinancing is completed and other conditions stated in the Order are met. Stoney Creek Technologies has been actively seeking and have obtained a source of funding and are in the final stages of the transaction.\n\nSCT manufactures and markets, worldwide, a series of corrosion inhibitors under the trade name SACI (Severe Atmospheric Corrosion Inhibitor).  Additionally SCT produces oil and fuel additives (magnesium and calcium alkylbenzene sulfonates).\n\nSCT operated all processes in an environmentally responsible manner.  \n\nSCT believes that Safety is unequivocally our number one priority.  We have an excellent employee-driven safety program and have an outstanding safety record, with zero (0) loss time injuries and illnesses.\n\nIn the manufacture of SACI and the oil and fuel additives, SCT uses one regulated substance, Oleum (fuming sulfuric acid).  This raw material is used in the production of sulfonic acids, which are the basic building blocks for our products.  \n\nThis chemical is received at Trainer by tank wagon and unloaded/stored in a registered horizontal carbon steel storage tank, with a total capacity of 18,000 gallons.  A 3164 cubic foot dike, designed to contain Oleum, surrounds the storage tank.  SCT written operational procedures prevent more than 10,000 gallons from being stored in this tank.  High-level alarms will be activated if the administrative controls"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54903,
      "SummaryText": " fail and the tank volume reaches 14,700 gallons.\n\nSCT has developed a worst-case and an alternate case scenario for the accidental release of Oleum from the Trainer plant.  The worst-case scenario would be the rupture of the storage tank and the release of its entire contents (163,300 lbs.) in less than 10 minutes.  Such a release would have an off-site impact.  This scenario is a highly unlikely event.\n\nControls in place to limit the quantity released include the following: \n?    Administrative controls to limit the quantity in the storage tank \n?    High level alarms with interlock shut off switches\n?    A concrete retention wall (dike) \n?    Fixed white oil system (for vapor suppression)\n?    HM200 HAZMAT foam nozzles (for vapor suppression)\n?    Tank wagon unloading basin with automatic shut-off and depressurization switch; \n?    Remote emergency shut-off switch\n?    Fixed water monitors for vapor suppression.    \n\nThe alternate case scenario would involve a line leak during the unloading of a tank wagon of Oleum due to the failure of a check valve.  This incident would occur for not more than 10 minutes.  This scenario is considered to be a more likely occurrence.  If such an incident occurred, there would be no off-site impact.\n\nControls in place to mitigate the effects of this alternate case scenario are the same as indicated above for the worst-case scenario.\n\nSCT has a documented spill prevention program.  Processes which are part of our operational SOP and accidental release prevention program include numerous technological systems, i.e., backup systems and redundancies, and procedural and\nmanagerial practices, including PM and employee training in how to prevent accidental releases and how to respond should one occur.\n\nSCT has an Emergence Action Plan in place as described in our Spill Prevention and Integrated Contingency Plan.  Due to the reduction in force of personnel, SCT has had to rely on trained and equipped outside volunteer fire fighters and mutual aid HAZMAT technici"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54903,
      "SummaryText": "ans to deal with emergencies.  A foam-proportioning Pumper fire truck is available on-site, along with a small Fire Brigade.  SCT also maintains HAZMAT mitigation equipment on-site.\n\nThe SCT emergency response program includes\n?    Direct communication with the local Fireboard and LEPC via portable and mobile two-way radios.\n?    A plant alarm system.\n?    All telephones in the facility are able to directly call 911 outside emergency services.\n?    Mobile fire equipment.\n?    Trained and equipped HAZMAT responders.\n?    Mutual Aid with area refineries.\n?    Local area volunteer fire fighters and on-site vapor suppression and mitigation equipment.\n\nIn the last five (5) years there have been no accidental releases of a regulated substance from this facility.\n\nPlanned changes to improve safety at SCT include:\n?    A redundancy of high level switches on the Oleum storage tank"
    }
  ]
}