{
  "FacilityID": 54923,
  "FacilityName": "Mountain Water Ice Company",
  "FacilityStr1": "17011 South Central Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Carson",
  "FacilityState": "CA",
  "FacilityZipCode": "90746",
  "Facility4DigitZipExt": "1303",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.877385",
  "FacilityLongDecDegs": "-118.249760",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9629585,
  "ParentCompanyName": "Arctic Glacier Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Arctic Glacier Inc.",
  "OperatorStr1": "625 Henry Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Winnepeg",
  "OperatorStateFIPS": null,
  "OperatorZipCode": null,
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Fischer",
  "RMPTitle": "Plant manager",
  "FTE": 75,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000092428",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "067533",
  "SafetyInspectionDate": "2008-08-03 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": "Manitoba",
  "ForeignZipCode": "R3A OV1",
  "ForeignCountry": "CA",
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 33.87709,
  "FRS_Long": -118.24881,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 80119,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 54923,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 82080,
          "ProcessID": 80119,
          "NAICSCode": "312113",
          "_desc": {
            "NAICS_CODE": "312113",
            "NAICS_DESCRIPTION": "Ice Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 106887,
          "ProcessID": 80119,
          "ChemicalID": 56,
          "Quantity": 24500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 606887,
          "ProcessID": 80119,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54923,
      "SummaryText": "A California Accidental Release Prevention Program (CalARP) has been developed and a Risk Management Plan has been prepared for use and storage of Anhydrous Ammonia in the Mountain Water Ice Company's Carson, California facility refrigeration system.  The CalARP and RMP meet and address the requirements of Title 40 Code of Federal Regulations Part 68 and California Code of Regulations Health and Safety Code (HSC) Title 19 Article 1 of Chapter 4.5 (CalARP) Sections 25531 through 25543.3.\n\nThis Executive Summary briefly describes the following elements:\nThe accidental release prevention and emergency response policies at the stationary source;\nThe stationary source and regulated substances handled;\nThe general accidental release prevention program and chemical specific prevention steps;\nThe five-year accident history;\nThe emergency response program; and\nPlanned changes to improve safety.\n\nTo address concerns of an accidental release prevention and emergency response all plant and field personnel are trained in ammonia emergency repsonse procedures and use of appropriate protective equipment.  Refresher training and emergency response drills are conducted on a periodic basis to ensure personnel are equipped, trained, prepared, and practiced in responding to ammonia emergencies.\n\nAs a result of information gathered during preparation of this CalARP, Mountain Water Ice (MWI) Company is committing additional respources to further increase employee awareness and equipment reliability and to establish operator training and preventive maintenance programs.  As a demonstration of the MWI's high degree of commitment to public safety and service, MWI is taken action to decrease the risk of ammonia exposure to the public by implementing recommendations made during the Process Hazard Analysis and Off-site Consequence Analysis.\n\nAnhydrous ammonia is used as a refrigerant in the MWI Carson facility refrigeration system.  The majority of liquid ammonia is stored in three (3) vessels"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54923,
      "SummaryText": " (Liquid Sub-Cooler (SC-1), Recirculating Package #1 (RC-1) and Recirculating Package #2 (RC-2).  The liquid is circulated as needed to the icemakers or air handling units where heat is absorbed and removed from the medium.  The anhydrous ammonia refrigeration system is a closed loop industrial refrigeration system.  The ammonia is not used or mixed in any manner with other chemical processes.\n\nEmergency response is discussed in Section 5 of this RMP.  Mountain Water Ice Company has a detailed Emergency Response Plan (ERP) for their facility.  The purpose of this plan is to provide the means for rapidly determining the appropriate response for any emergency that may develop at the facility such as an accidental release of anhydrous ammonia.  MWI conducts scheduled drills of the emergency response plan.\n\nAddressing the five year accident history is not an issue.  No recordable accidents have taken place since the systems commission on May 1998.  To prevent and/or minimize any potential future release of anhydrous ammonia.  Mountain Water Ice Company is implementing a detailed Process Safety Management program (Preventative Program 3) developed in April 1998 for their  facility in Carson, California.  The Preventative Program 3 provides extensive maintenance and operator/mechanic training to ensure the system's mechanical integrity is maintained for the life of the covered process.  Program 3 also incorporates administrative controls when modifications are made to the covered process (ammonia refrigeration system), so the training and preventative programs are updated as the system expands and changes.\n\nMountain Water Ice Company will address and incorporate into processes and procedures any recommendations resulting from the Process Hazard Analysis.  Off-site Consequences, incident investigations and program audits.  The flexibility of the program will allow MWI to respond effectively to prevent or minimize any potential of exposing MWI employees, the surrounding pub"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54923,
      "SummaryText": "lic, and/or the environment to a release of anhydrous ammonia."
    }
  ]
}