{
  "FacilityID": 54946,
  "FacilityName": "Westward Seafoods, Inc.",
  "FacilityStr1": "Mile 1 Captain's Bay Road",
  "FacilityStr2": null,
  "FacilityCity": "Dutch Harbor",
  "FacilityState": "AK",
  "FacilityZipCode": "99692",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "02016",
  "LEPC": "Aleutian  LEPC",
  "FacilityLatDecDegs": "53.857500",
  "FacilityLongDecDegs": "-166.553889",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Westward Seafoods, Inc.",
  "OperatorStr1": "PO Box 920608",
  "OperatorStr2": null,
  "OperatorCity": "Dutch Harbor",
  "OperatorStateFIPS": "AK",
  "OperatorZipCode": "99692",
  "OperatorZipCodeExt": "0608",
  "RMPContact": "Dan Le",
  "RMPTitle": "Plant Manager",
  "FTE": 287,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000152201",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "433TVP01",
  "SafetyInspectionDate": "2009-02-12 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-08-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 53.85806,
  "FRS_Long": -166.55333,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "60",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 80154,
      "AltID": "Refrigeration System",
      "FacilityID": 54946,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 82118,
          "ProcessID": 80154,
          "NAICSCode": "311712",
          "_desc": {
            "NAICS_CODE": "311712",
            "NAICS_DESCRIPTION": "Fresh and Frozen Seafood Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 106924,
          "ProcessID": 80154,
          "ChemicalID": 56,
          "Quantity": 80000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 606924,
          "ProcessID": 80154,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54946,
      "SummaryText": "This Risk Management Plan (RMP) is submitted to the United States Environmental Protection Agency (EPA) to meet the requirements of Section 112? of the Clean Air Act Amendments of 1990, codified in the Code of Federal Regulation Title 40 Part 68.\n\nStationary Source and Chemical of Concern\nWestward Seafoods is located on Unalaska Island in Dutch Harbor, Alaska. The facility is staffed year-round and also employs a large seasonal workforce during the spring and summer months.  The plant produces fresh and frozen seafood products, using anhydrous ammonia in a closed system as a refrigerant in freezers and cold storage.  Ammonia is the safest refrigerant available and has excellent warning properties; it is extremely pungent at levels far below dangerous concentrations.  In calculating worst-case and alternative scenarios in the RMP, efforts were made in all cases to overestimate rather than underestimate the effects of a release.  The Westward Seafoods facility is a modern plant that has been operating safely since it was built in 1989.  Note:  The EPA TRI mapping system is not available for this facility, therefore Latitude/Longitude values remain as calculated by GPS and confirmed by Landview 6.\n\nWorst-Case Scenario\nA worst case scenario is required to be documented in the RMP and must consist of the failure of the largest vessel in the system.  This release is modeled using RMP*Comp? software. \n\nAlternative Release Scenario \nThe alternative release scenario for the ammonia refrigeration process is based on a potential hazard identified during the Process Hazard Analysis conducted during documentation of the facility prevention plan.  To obtain the most conservative assumption, no mitigation is considered in the scenario calculations.  The release was originally evaluated according to the procedures documented in Chapter 4 of the EPA's \"Risk Management Program Guidance for Ammonia Refrigeration\" (EPA GAR).  The scenario was reevaluated according to the new procedures"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54946,
      "SummaryText": " documented in Risk Management Program Guidance (April 2004), Appendix E Supplemental Risk Management Program Guidance for Ammonia Refrigeration Facilities (May 2004) and the result was the same and remains valid.\n\nRelease Prevention Program \nWestward Seafoods has a prevention program in place to comply with the requirements of the Process Safety Management (PSM) standard, which is designed to prevent accidental releases of ammonia.  The PSM program addresses all required elements including employee participation, process safety information and system drawings, operating procedures, hot work permits, management of change, mechanical integrity, training, pre-startup review, compliance audits, process hazard analysis, contractor safety, incident investigation and emergency response.  The system has many safety features built in including high and low level controls and alarms, safety relief valves, automatic and manually controlled valves and shutoffs, and check valves. The plant has a network of electrochemical sensors to detect leaks, initiate automatic area shutdowns and sound alarms.  The facilty has a dedicated ammonia alarm system including pull stations for activation.  Plant personnel responsible for the system have had extensive training including courses published by the Refrigeration Engineers and Technicians Association (RETA).  \n\nFive Year Accident History\nPer the requirements of 40 CFR 68.42, facilities must include a five-year accident history for all accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  There have been no incidents meeting this criteria in the past five years.\n\nEmergency Response\nWestward Seafoods maintains a written emergency response plan as part of the PSM plan to facilitate safe response to accidental ammonia releases.  The plan identifies personnel designated"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54946,
      "SummaryText": " and trained to conduct the necessary duties during a response.  Responsibilities include notification of and communication with local responders and authorities, coordinating and conducting responses, as well as maintenance of emergency equipment and trained personnel.  The facility has coordinated its emergency response plan with local authorities and responders and conducts drills periodically to practice responses. Designated facility personnel receive initial and annual training and certification."
    }
  ]
}