{
  "FacilityID": 54944,
  "FacilityName": "Texas Petrochemicals LLC-Baytown",
  "FacilityStr1": "4604 West Baker Road",
  "FacilityStr2": null,
  "FacilityCity": "Baytown Texas",
  "FacilityState": "TX",
  "FacilityZipCode": "77520",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-",
  "FacilityLatDecDegs": "29.770833",
  "FacilityLongDecDegs": "-095.018611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Texas Petrochemicals LLC",
  "Company2Name": null,
  "CompanyDUNS": 102647005,
  "Company2DUNS": null,
  "OperatorName": "Texas Petrochemicals LLC",
  "OperatorStr1": "4604 West Baker Road",
  "OperatorStr2": null,
  "OperatorCity": "Baytown Texas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77520",
  "OperatorZipCodeExt": null,
  "FTE": 27,
  "OtherEPAFacilityID": "77520TXSPT464WB",
  "EPAFacilityID": "100000028551",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-01-12 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 29.771018,
  "FRS_Long": -95.018456,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 80152,
      "AltID": "Baytown Tank Farm",
      "FacilityID": 54944,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 106922,
          "ProcessID": 80152,
          "ChemicalID": 155,
          "Quantity": 1000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 91860,
              "ProcessChemicalID": 106922,
              "ChemicalID": 147
            },
            {
              "FlamMixChemID": 91861,
              "ProcessChemicalID": 106922,
              "ChemicalID": 146
            },
            {
              "FlamMixChemID": 91862,
              "ProcessChemicalID": 106922,
              "ChemicalID": 126
            },
            {
              "FlamMixChemID": 91863,
              "ProcessChemicalID": 106922,
              "ChemicalID": 141
            },
            {
              "FlamMixChemID": 91864,
              "ProcessChemicalID": 106922,
              "ChemicalID": 140
            },
            {
              "FlamMixChemID": 91865,
              "ProcessChemicalID": 106922,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 91866,
              "ProcessChemicalID": 106922,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 91867,
              "ProcessChemicalID": 106922,
              "ChemicalID": 116
            },
            {
              "FlamMixChemID": 91868,
              "ProcessChemicalID": 106922,
              "ChemicalID": 138
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 82116,
          "ProcessID": 80152,
          "NAICSCode": "32511",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 47314,
              "Process_NAICS_ID": 82116,
              "SafetyReviewDate": "2009-06-15 00:00:00",
              "PHA_Date": "2008-12-09 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-12-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-06-15 00:00:00",
              "TrainingReviewDate": "2009-05-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Virtual Training Assistant",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-06-02 00:00:00",
              "EquipmentInspectionDate": "2009-06-16 00:00:00",
              "EquipmentTested": "Tanks 7 and 8",
              "ChangeMgmtDate": "2009-05-18 00:00:00",
              "ChangeMgmtReviewDate": "2008-06-23 00:00:00",
              "PreStartupReviewDate": "2009-05-18 00:00:00",
              "ComplianceAuditDate": "2006-09-30 00:00:00",
              "AuditCompletionDate": "2008-10-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-06-15 00:00:00",
              "HotWorkPermitReviewDate": "2009-06-15 00:00:00",
              "ContractorSafetyReviewDate": "2009-06-12 00:00:00",
              "ContractorSafetyEvalDate": "2009-05-28 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 69016,
                  "PreventionProgram3ID": 47314,
                  "ProcessChemicalID": 106922
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 54944,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-06-10 00:00:00",
    "ERTrainingDate": "2009-05-21 00:00:00",
    "CoordinatingAgencyName": "Baytown LEPC",
    "CoordinatingAgencyPhone": "2814206558",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54944,
      "SummaryText": "RMP*Submit Executive Summary\n\nTexas Petrochemicals Baytown Plant\n\nAbout Texas Petrochemicals- Baytown\n\nThe Baytown plant operates an organic chemical manufacturing facility and bulk storage terminal located in Baytown, Texas.  It is part of the Performance Products business group of Texas Petrochemicals LLC., providing propylene derivatives such as plasticizers, lube additives, surfactants and antioxidants.\n\nHealth, Safety and Environment/Responsible Care\n\nTexas Petrochemicals LLC is committed to managing health, safety and the environment as a core business value. The company also integrates health, safety and environmental management into all aspects of our businesses as a competitive advantage in achieving profitable growth and accelerated productivity.\n\nTexas Petrochemicals participates in the Responsible Care program of the American Chemistry Council. Established in 1988, Responsible Care is a program focused on achieving improvements in environmental, health and safety performance beyond levels required by the U.S. government\n\nIn addition to detailing practices for the safe use of materials and requiring audits, the Responsible Care initiative requires its member and partner companies to develop mechanisms for outreach with the communities in which they operate. The Baytown facility participates and is active in a local Community Advisory Panels (CAP) that serves as important links between chemical facilities and their neighboring communities. \n\nTexas Petrochemicals Baytown Plant\n\nThe Baytown plant is a world-class nonene and tetramer operation that has approximately 27 employees. Its products go into plastic, lube additives, surfactants and into antioxidants.  \n\nMaterials used or stored at the facility are propylene, propane, 1,3-butadiene and mixed pentanes which are on the RMP Rule's list of regulated substances.  The Baytown plants storage and/or use of propylene, propane, 1,3-butadiene and mixed pentanes exceeds the specified thresholds of 10,000 lbs as d"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 54944,
      "SummaryText": "d to define the scope and requirements of the mechanical integrity program.  Maintenance employees engaged in carrying out the mechanical integrity program are trained to complete the required tasks in a safe manner.\n\nOne component of the mechanical integrity program includes inspection and testing of process equipment.  Equipment inspection and testing is conducted in accordance with manufacturer's recommendations and generally accepted good engineering practices.  Records of inspections and testing are maintained to show the date, equipment identification, inspector, type of test or inspection performed, and test results or observations.  If deficiencies are noted during equipment inspection and testing, corrective actions are taken in a timely manner to assure safe operation of the process.  In some cases, equipment inspections are driven by permit requirements as well as the mechanical integrity program.  For example, process pumps are inspected visually on a weekly basis, and quantitatively for leaks on a quarterly basis, in accordance with specific air permit requirements.\n\n3f. Management of Change\n\nOne component of the plant's Process Safety Management (PSM) program is a written procedure for the Management of Change.  Except for replacements in kind, any change to the PSM-covered process requires completion and approval of a Request for Change prior to making the change.  Such changes include new process chemicals, new technologies, new or modified equipment, new or modified operating conditions, and new or modified procedures.  The Request For Change must be reviewed and approved by a team of employees having experience and knowledge of the process, knowledge of the proposed changes, and knowledge of applicable regulatory requirements.  The Request for Change must describe the proposed change and its impact on employee health and safety, the purposes and benefits of the change, the target date for the change to take effect, and whether the change is tempo"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 54944,
      "SummaryText": "rary or permanent.  The Request For Change must also indicate whether any of the following items are required as a result of the change, and if so, who is responsible for completing these items and when they must be completed: (a) process hazard analysis; (b) new product review; (c) Piping & Instrument Diagram update; (d) operating procedure update; (e) employee training, and; (f) process safety information.  Records of Requests For Change are maintained to track the status and progress of planned changes.\n\n3g. Pre-startup Review\n\nPrior to startup of a new process involving RMP chemicals  and on the plant site, a pre-startup safety review is conducted to ensure that the equipment and installation meets design specifications, a process hazard analysis has been completed, employee training has been completed, and safety, operating, maintenance, and emergency procedures are in place.  A pre-startup safety review is also conducted for process changes where the approved Request For Change indicates a change in the process safety information is required.  A team of employees having knowledge of the process, equipment, procedures and safety requirements operating conditions conducts the pre-startup safety review, procedures and safety requirements.  All items on the pre-startup review checklist must be satisfied prior to commencing startup.\n\n3h. Compliance Audits\n\nCompliance audits for the process are conducted at least every three years with the last audit being conducted in September 2006 to ensure that the elements of the general accidental release prevention program are up to date and are being implemented.  Personnel having experience and knowledge of the covered processes and knowledge of the program requirements conduct the compliance audits.  Records of the compliance audit reports are maintained to document the results of the audits and corrective actions taken, if necessary.\n\n3i. Incident Investigation\n\nAny incident that could have resulted in a catastrophic rele"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54944,
      "SummaryText": "efined by the EPA¿s RMP Rule.  \n\nIn accordance with the requirements of the RMP Rule, a description of the following six elements is provided for the Baytown plant: \n\n1. Accidental Release Prevention and Emergency Response Policies: \n\nIt is the policy of the Baytown plant to operate a safe and environmentally sound facility by identifying and controlling health, safety, or environmental risks related to its operations; by designing its processes to protect people, property and the environment; by conducting and continually reviewing and improving programs for safety, health and environmental excellence; and by establishing processes to assure that all laws and regulations applicable to its operations and products are known and observed.  The accidental release prevention and emergency response policy associated specifically with the plant's use of the regulated chemicals on the RMP list for our site involves the integration of safety devices and technologies inherent in the design of the process, safe operational procedures and management practices, operator training, the preparation and testing of site emergency response plans, the maintenance of onsite emergency response equipment and trained emergency response team coordinating our efforts and resources with CIMA, LEPC and local industry groups and communicating with the community through the Care line or CAP. \n\n2. Description of the Facility and the Regulated Substance Handled:  \n\nThe Baytown Site operates 24 hours a day and has on site four RMP regulated chemicals which include Propylene, Propane, 1,3-Butadiene, and Mixed Pentanes, as either raw materials in the manufacture of nonene and tetramer or stored on site for industrial neighbors and are not used in our processes. \n\nRefinery Grade Propylene (RGP) is stored in quantities that exceed the threshold quantity specified in the RMP Rule.  RGP is purchased from an outside vendor and is delivered to the Plant via tank truck or by railcar. The tanker or railcar"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 54944,
      "SummaryText": "ase of any of the four RMP chemicals would be investigated promptly.  The incident investigation process would start with the completion of an Incident Investigation Report prepared by the supervisor on duty at the time of the incident, and is distributed to the incident investigation team.  The incident investigation team is made up of employees having experience and knowledge of the processes affected by the incident, and knowledge of completing incident investigations.  Following the incident investigation, a report is prepared to include the following information: (a) date, time, and location of the incident; (b) employees involved in the incident, and their roles; (c) date of the incident investigation; (d) names of employees on the incident investigation team; (e) description of the incident, including a chronology of events; (f) root causes and contributing causes, including conditions at the time of the incident, and; (g) recommendations to prevent a recurrence.  Follow-up actions which are taken as a result of the recommendations in the incident investigation report are documented, and records of the reports and follow-up actions are maintained for a minimum of 5 years for future reference.\n\n3j. Employee Participation\n\nAll employees at the Baytown plant have opportunities to access and participate in the sharing of information related to process safety for the processes involving RMP chemicals on our site. Employees in the maintenance and operating areas attend monthly safety meetings to review incidents, learn about new or modified processes, and discuss specific safety awareness topics.  Employees routinely have opportunities to participate in other safety processes under the prevention program such as process hazard analyses, management of change, employee training and incident investigations.\n\n3k. Hot Work Permits\n\nThe Baytown plant has established a hot work permit system.  The hot work permit system applies to the process.  Under the system, a hot wor"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 54944,
      "SummaryText": "k permit must be issued prior to commencing hot work operations.  Hot work operations may include burning, welding, torch cutting, or any spark-emitting equipment/activity.  The hot work permit indicates the type and method of hot work to be conducted, the equipment the hot work will be performed on, the date, time, and location authorized for the hot work, the presence of fire prevention and protection systems meeting the requirements of 29 CFR 1910.252(a), and signatures of the supervisory employees authorizing the hot work.  A separate hot work permit must be issued for each hot work operation, and a separate hot work permit must be issued for each day.  A copy of the hot work permit must be displayed at the job location while hot work is in progress, and the permit is maintained on file after the completion of the hot work. \n\n3l. Contractors\n\nPrior to commencing work on plant, each contractor has received prior approval through our procurement group and each contract employee must have attended the Houston Area Safety Training Council training and received site specific safety training.  The safety orientation covers information on the hazards associated with the process areas where the work will be performed, safety procedures and systems to be used, overview of the plant emergency response program including specific procedures to be followed in case of emergency, and a review of plant safety rules and applicable operating procedures.  Once having attended safety training, the contractor is responsible for ensuring that each contractor employee performs the assigned work in a manner consistent with the information provided during the safety orientation.  If the contractor assigns new employees to the job after work has commenced, the contractor must also ensure that each new employee has received a safety orientation prior to starting work on plant.  Failure of the contractor or any contractor employee to abide by these requirements is grounds for immediate dis"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 54944,
      "SummaryText": "missal from the plant.\n\n4. The Five Year Accident History: \n \nIn the past five years, there have been no deaths, injuries, or significant property damage on site, or known off site deaths, injuries, sheltering in place, property damage, or environmental damage resulting from any releases of any of the RMP chemicals associated with our site. \n\n5. The Emergency Response Plan:  \n\nThe Baytown plant has an emergency preparedness planning and response program designed to deal with accidental releases and other unplanned events associated with the facility.  The plant has a written Emergency Response Plan that addresses various types of contingencies including specific actions for responding to an accidental chemical release.  The Plan provides for both internal plant and external community emergency alerting.  The Plan addresses emergency health care, sheltering in place, evacuation, emergency responsibilities, response and control procedures, and emergency equipment.  The Plan provides for the implementation of an Incident Command System to direct and coordinate the plant's response activities.  The Plan has been coordinated with LEPC, CIMA, local industry and ECHMA and nearby sister plant in Pasadena.  Annual drills of the plant¿s emergency response system are performed\n\n6. Planned Changes to Improve Safety:  \n\nThe Baytown plant completed a process hazard analysis revalidation for the tank farm in 2008.  As a result of these systematic safety reviews, several action items were identified and implemented to improve upon the existing safeguards and to further reduce the potential for accidental release. In 2009, the facility added gas detection and perimeter cameras throughout the plant site.  The process hazard analysis for the RMP chemicals at the Baytown site are reviewed and revalidated every five years."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54944,
      "SummaryText": "contents are unloaded at unloading stations by Plant operators into above ground pressurized bullet tanks identified as T23-T27 which are located on the East Side of the plant.   The maximum capacity of the bulk pressurized storage tank is 60,000 gallons.  Propylene is pumped from the pressurized storage tanks through an enclosed piping system into the production area where it is fed into two reactors in the production process unit.\n\nMixed Pentanes, also called Raffinate, is stored in quantities that exceed the threshold quantity specified in the RMP Rule.  The Raffinate is trucked into the plant and off loaded at the south truck terminal. The Raffinate is sent via closed piping to two sphere tanks (S21 and S22).  This chemical is then sent to Exxon Mobil via pipeline for their production process. \n\nPropane is stored in quantities that exceed the threshold quantity specified in the /RMP rule.  Propane comes in with the refinery grade propylene and is recovered through the distillation process on site and then stored in pressurized bullets identified as T11-T14.  The propane is then sent via pipeline to customers. \n\n1,3-Butadiene is stored in quantities that exceed the threshold quantity specified in the RMP Rule.  1,3-Butadiene is sent via pipeline through a metering station to Texas Petrochemicals and sent via closed pipeline to another adjacent facility that borders our north property line.  The 1,3-Butadiene can be stored in Tanks 7 and 8 which are 30,000 gallon pressurized bullet tanks.\n\n3. The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps:  \n\nThe general accidental release prevention program at the Baytown plant consists of 12 elements.  Each of these elements is described below.  Also described within each of these elements are associated chemical-specific prevention steps, where applicable.\n\n3a. Process Safety Information\n\nWritten process safety information is compiled before conducting process hazard analyses for the ma"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 54944,
      "SummaryText": "nufacturing process including the RMP chemicals.  This enables the employees involved in operating these processes to identify and understand the potential hazards associated with the processes.  The information compiled includes data on the safe use and handling of the regulated chemicals (e.g., Material Safety Data Sheets), data on the process technology (e.g., Process Flow Diagrams, process chemistry, flow rates and storage capacities, operating limits and evaluation of exceedances), and data on the equipment used in the process (e.g., Piping & Instrument Diagrams, materials compatibility, energy ratings and classification, control devices and emergency systems, ventilation systems, design basis including conformance to applicable codes and standards).  The process safety information is adequate to show compliance of the process design with generally accepted good engineering practices.\n\n3b. Process Hazard Analyses\n\nProcess hazard analyses for the manufacturing process have been completed in accordance with 29 CFR 1910.119(e) (OSHA Process Safety Management).  These process hazard analyses are updated and revalidated in accordance with 29 CFR 1910.119(e), and are retained on plant for the life of the process.\n\nIn general, one or more of the following methodologies are used to complete each process hazard analysis: (a) what-if evaluation; (b) checklist; (c) hazard and operability study (HAZOP); (d) failure mode and effects analysis (FMEA); (e) fault tree; (f) process mapping, and; (g) cause and effect matrix.  Each process hazard analysis addresses the process hazards, process incident history, process control devices and detection systems, evaluation of failure of process control devices, equipment location, and human factors.  A team of employees having experience and knowledge of the process design and operation, and knowledge of how to complete a process hazard analysis performs each process hazard analysis.  The Management of Change process (described below)"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 54944,
      "SummaryText": "is used to track and document process changes, which occur as a result of recommendations from process hazard analyses.\n\n3c. Operating Procedures\n\nWritten operating procedures are prepared for the manufacturing process including the RMP chemicals located within our facility.  The operating procedures provide clear instructions for safely conducting activities in the plant.  The procedures are maintained up to date to reflect current operating practices, and are certified annually for accuracy.\n\nSpecific information and instructions covered by the operating procedures include startup, normal operation, emergency operation, shutdown, operating limits, operating controls, chemical-specific health and safety information, required personal protective equipment, and use of safety systems.  Written procedures are also provided for specific operations such as lockout/tagout, confined space entry and line breaking.\n\n3d. Training\n\nEmployees currently engaged in operating the manufacturing process, including the RMP chemicals of interest at our site, have received training to ensure they have the required knowledge, skills, and abilities to safely carry out the requirements specified in the written operating procedures.  Refresher training is provided every three years at a minimum, or sooner if warranted by changes to operating conditions, equipment or procedures.  If refresher training is required more frequently than every three years, it would be triggered through the Management of Change process (described below).  Training records are maintained for each employee to show the date training was conducted and the material covered by the training.\n\n3e. Mechanical Integrity\n\nThe Baytown Plant maintains the mechanical integrity of equipment used to process and handle RMP listed chemicals.  Such equipment includes pressurized vessels, storage tanks, piping systems, pressure relief and vent systems, emergency control devices, pumps, and valves.  Written procedures are establishe"
    }
  ]
}