{
  "FacilityID": 55001,
  "FacilityName": "Odor-Tech LLC",
  "FacilityStr1": "7591 Esler Field Road",
  "FacilityStr2": null,
  "FacilityCity": "Pineville",
  "FacilityState": "LA",
  "FacilityZipCode": "71360",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22079",
  "LEPC": "Rapides Parish LEPC",
  "FacilityLatDecDegs": "31.398154",
  "FacilityLongDecDegs": "-092.308781",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 873053763,
  "ParentCompanyName": "Arkema Delaware Inc.",
  "Company2Name": null,
  "CompanyDUNS": 622121697,
  "Company2DUNS": 0,
  "OperatorName": "Odor-Tech LLC",
  "OperatorStr1": "7591 Esler Field Road",
  "OperatorStr2": null,
  "OperatorCity": "Pineville",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "71360",
  "OperatorZipCodeExt": null,
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000208321",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-09-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 80238,
      "AltID": "Storage Loading/Unloading",
      "FacilityID": 55001,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 107027,
          "ProcessID": 80238,
          "ChemicalID": 105,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000037226,
          "ProcessID": 80238,
          "NAICSCode": "42499",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000032258,
              "Process_NAICS_ID": 1000037226,
              "SafetyReviewDate": "2009-06-10 00:00:00",
              "PHA_Date": "2009-06-09 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-12-31 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Knock out pot float valve",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-06-10 00:00:00",
              "TrainingReviewDate": "2009-04-02 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-06-04 00:00:00",
              "EquipmentInspectionDate": "2009-05-29 00:00:00",
              "EquipmentTested": "Vessels and Piping",
              "ChangeMgmtDate": "2009-05-29 00:00:00",
              "ChangeMgmtReviewDate": "2009-05-18 00:00:00",
              "PreStartupReviewDate": "2009-05-29 00:00:00",
              "ComplianceAuditDate": "2009-05-04 00:00:00",
              "AuditCompletionDate": "2010-04-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-04-21 00:00:00",
              "HotWorkPermitReviewDate": "2009-04-02 00:00:00",
              "ContractorSafetyReviewDate": "2009-04-23 00:00:00",
              "ContractorSafetyEvalDate": "2009-05-18 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000038302,
                  "PreventionProgram3ID": 1000032258,
                  "ProcessChemicalID": 107027
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 55001,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-06-01 00:00:00",
    "ERTrainingDate": "2009-06-15 00:00:00",
    "CoordinatingAgencyName": "Holiday Village Fire Department",
    "CoordinatingAgencyPhone": "3184435243",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55001,
      "SummaryText": "Executive Summary\n\n\n\nINTRODUCTION\n\n\n\nA Risk Management Plan has been implemented at Odor-Tech LLC?s Pineville, Louisiana facility to reduce the risks associated with accidental releases of highly hazardous chemicals.  This Risk Management Plan summarizes the managerial, administrative, procedural, and technological controls that work together to minimize the risk to the community of hazardous chemical releases.  The plan summary is organized to correspond with specific United States Environmental Protection Agency (EPA) Risk Management Plan definitions and requirements:\n\n\n\nIntroduction\n\n\n\n?    Odor-Tech LLC Policies to Protect Health, Environmental, and Safety\n\n\n\n?    Facility Identification and Regulated Substances in Covered Processes\n\n\n\n?    Hazard Assessment\n\n\n\n?    Prevention Program\n\n\n\n?    Five-Year Accident History\n\n\n\n?    Emergency Response Plan\n\n\n\nOdor-Tech LLC POLICIES FOR HEALTH, ENVIRONMENT, AND SAFETY\n\n\n\nOdor-Tech LLC is committed to employee, public, and environmental safety by conducting its operations in a safe and responsible manner.  This commitment is inherent to a comprehensive risk management program that covers equipment design, installation, operating procedures, preventive maintenance, and employee training associated with processes at the Pineville plant.  The Risk Management Plan formalizes the management system that documents these activities. \n\n\n\nThis commitment to health, environment, and safety (HES) starts with Senior Management.  Senior Management routinely dedicates time to review HES matters.  This emphasis on safety is carried on at all levels of the plant.  The success of the plant?s HES program is also demonstrated by a strong commitment to safety by our employees and site contractors. \n\n\n\nOdor-Tech LLC?s HES programs include policies, procedures, standards, and guidance materials to ensure our commitment to health, environment, and safety.  These materials include Risk Management Program guidance used by our facility in the development and imple"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55001,
      "SummaryText": "mentation of risk prevention and reduction programs associated with potential accidental releases. \n\n\n\nFACILITY IDENTIFICATION AND REGULATED SUBSTANCES IN COVERED PROCESSES\n\n\n\nThe Odor-Tech LLC. - Pineville facility is located at 7591 Esler Field Road in Pineville, Louisiana.  This facility currently receives, stores, blends and ships various natural gas odorants.  Ethyl Mercaptan, which is received, stored and shipped at the facility is a regulated substance under 40 CFR 68, the EPA Risk Management Program (RMP) Rule.  Ethyl Mercaptan is used as a propane gas odorizer and it can also be used to produce agrichemicals such as biodegradable herbicides and pesticides.  \n\n\n\nHAZARD ASSESSMENT TOXIC WORST CASE SCENARIO\n\n\n\nThe Odor-Tech LLC Pineville facility does not handle any toxic substances that are regulated under the EPA Risk Management Program (RMP) Rule.\n\n\n\nFLAMMABLE WORST CASE SCENARIO\n\n\n\nThe worst-case accidental release scenario submitted for Program 3 flammable substances involves a catastrophic failure of an Ethyl Mercaptan storage tank.  It is stored as a liquid.  Administrative controls limit the quantity of Ethyl Mercaptan stored to 85 % to the tank liquid capacity.  This quantity (106,000 pounds) is assumed to be released over a 10 minute time period as a vapor.  Hazard assessment data indicates that, under worst-case conditions, the potentially affected area is a maximum distance of 0.32 miles, which corresponds to end point distance of a 1psi over pressure.  Again, it is noted that the worst-case scenario is an extremely unlikely event and Odor-Tech LLC has implemented mitigation and prevention programs to reduce the likelihood of a worst case incident from occurring.\n\n\n\nWORST CASE RELEASE MITIGATION MEASURE \n\n\n\nThe multiple layers of preventive and mitigation measures are currently in use at the Pineville plant make it very unlikely that a significant release involving Ethyl Mercaptan would occur.  In the unlikely event that such a release occurs, Odor"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55001,
      "SummaryText": "-Tech LLC has mitigation measures in place to reduce potential impacts to the community. \n\n\n\nIn accordance with the guidelines used to define worst-case incidents, active mitigation measures were not considered in modeling the worst-case scenarios.  However, the significant mitigation measures will effectively reduce the risk and consequences associated with a RMP worst-case incident.  Mitigation measures include:\n\n\n\n?    Containment Dikes.\n\n\n\n?    Mechanical Integrity Program\n\n\n\n?    Integrated Emergency Response Plan\n\n\n\nHAZARD ASSESSMENT TOXIC ALTERNATIVE RELEASE SCENARIO \n\n\n\nThe Odor-Tech LLC Pineville facility does not handle toxic substances that are regulated under the EPA Risk Management Program (RMP) Rule.\n\n\n\nALTERNATIVE RELEASE SCENARIOS MITIGATION MEASURES\n\n\n\nWhile the Alternative Release Scenario is, by definition, more likely to occur than the worst-case scenario, it is still very unlikely to occur due to the facility?s existing release and accident prevention program.  If a release should occur, Odor-Tech LLC has mitigation measures in place to reduce potential human health and environmental receptor impact.  The alternate release case involved a partial rupture of a liquid hose during unloading a transportation container.  The prevention program elements in place at Pineville are:\n\n\n\n?    Emergency Shutdown Systems - Remote operated valves to isolate the storage tanks in the event of an emergency.\n\n\n\n?    Mechanical Integrity Program\n\n\n\n?    Trained operators on-site.\n\n\n\n?    Dikes\n\n\n\n?    Planned Inspection Programs\n\n\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\n\n\nThe Odor-Tech LLC Pineville plant has an accidental release prevention program in place to minimize the risk of hazardous chemical releases.  This program is designed to address the requirements of the OSHA 29 CFR 1910.119.  Process Safety Management Standard and the EPA Risk Management Program 40 CFR 68.  The accident prevention program includes the following elements "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 55001,
      "SummaryText": "and activities:\n\n\n\nIn-depth process hazard analysis studies for the existing plant by personnel knowledgeable with the process.  The team utilizes study techniques approved under the OSHA Process Safety Management Standard.\n\n\n\nWritten operating procedures that are certified which and are used to train affected personnel to perform their job tasks in a safe manner.  All personnel working in a covered process have been certified to work their jobs.\n\n\n\nA Management of Change Program to ensure that process operating changes are managed safely and that no additional risks result from the change.\n\n\n\nCritical equipment is inspected on a planned, periodic basis to ensure safe operating conditions.\n\n\n\nPre-Startup Safety Reviews are conducted by plant personnel on all changes that affect the Process Safety Information.\n\n\n\nRoutine investigation of incidents is conducted as part of continuous improvement.\n\n\n\nRoutine audits are conducted of the Process Safety Management System to ensure that the standard is being met.\n\n\n\nAll equipment including, pressure vessels, piping systems, compressors, and instrumentation are designed in accordance with industry codes and standards.\n\n\n\nA safety permitting system is in place to control work activity.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nThe Odor-Tech LLC facility has not had any accidental releases. \n\n\n\nEMERGENCY RESPONSE STATEMENT\n\n\n\nThe Odor-Tech LLC Pineville facility maintains a written Site Emergency Response Plan.  The plan includes the procedures for notifying civil authorities and the public in the event of an accidental release.  Material Safety Data Sheets (MSDS) are maintained to provide appropriate medical treatment and first aid necessary in response to an accidental human exposure.  All employees and contractors are trained in the plan and drills are conducted.  The plan provides response guidelines for employee use to respond to liquid spills, gas releases, and fires.  The plan is updated as necessary based on review of incidents"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 55001,
      "SummaryText": " or drills."
    }
  ]
}