{
  "FacilityID": 55388,
  "FacilityName": "El Dorado Hills Water Treatment Plant",
  "FacilityStr1": "1835 Francisco Drive",
  "FacilityStr2": null,
  "FacilityCity": "El Dorado Hills",
  "FacilityState": "CA",
  "FacilityZipCode": "95762",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06017",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "38.723333",
  "FacilityLongDecDegs": "-121.086667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "El Dorado Irrigation District",
  "OperatorStr1": "2890 Mosquito Road",
  "OperatorStr2": null,
  "OperatorCity": "Placerville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95667",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dana Strahan",
  "RMPTitle": "Drinking Water Division Manager",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000099813",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-03-01 00:00:00",
  "SafetyInspectionBy": "El Dorado Co. Envir. Health Dept.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-11-12 00:00:00",
  "DeRegistrationEffectiveDate": "2009-11-03 00:00:00",
  "AnniversaryDate": "2014-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 38.72333,
  "FRS_Long": -121.08667,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 80648,
      "AltID": "PotableWater Disinfection",
      "FacilityID": 55388,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 82614,
          "ProcessID": 80648,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 107439,
          "ProcessID": 80648,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 607439,
          "ProcessID": 80648,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55388,
      "SummaryText": "El Dorado Irrigation District has instituted a Risk Management Program for their water treatment facility, El Dorado Hills Water Treatment Plant, as required by Federal Accidental Release Prevention (ARP) Program regulations at 40 CFR Part 68.  The Risk Management Program identifies the equipment, procedures, maintenance, inspection, and training associated with Regulated Substances (RS's) handled at this facility in excess of Federal threshold quantities; describes the structured assessment of hazards which was conducted to assess possible effects on employees and offsite public and environmental receptors; provides the results of an offsite consequences analysis; defines a prevention program, emergency response program, and mitigation measures to reduce the probability and magnitude of accidental releases of RS's; and establishes a schedule and responsibilities for implementation of mitigation measures and auditing of program elements.  This Risk Management Plan (RMP) is being filed as required by ARP regulations in order to report the elements of the current Risk Management Program and to describe further measures planned to mitigate or prevent accidental releases of RS's.  This filing is being done to meet the requirement of revalidating and updating the RMP every 5 years.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nEl Dorado Irrigation District provides water supply and distribution to portions of El Dorado Hills.  Its water treatment facility, El Dorado Hills Water Treatment Plant, is located on Francisco Drive, El Dorado Hills, CA in El Dorado County, and uses chlorine for disinfection in quantities greater than the Federal threshold quantity for this RS.  The facility is located east of Folsom Lake in a residential neighborhood.  There are three to four full-time employees at this site.  Chlorine is received in ton containers by truck, handled with an electric hoist, and stored on ton container scales and storage trunnions inside the building.  The "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55388,
      "SummaryText": "chlorine is used to control biological growth on the filters and to disinfect the treated water.  Pressurized chlorine gas within a ton container is withdrawn under pressure and piped to a vacuum regulator valve located in the storage room where the gas pressure is reduced to vacuum.  From there, the chlorine under vacuum is metered through rate valves and rotameters in chlorinators located in a separate room, and drawn into water solution by the passage of pressurized water through an injector.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIt is the policy of El Dorado Irrigation District that the receipt, storage and handling of chlorine at its facility be done in a manner which meets regulatory requirements and minimizes the probability and severity of accidental releases of chlorine to the atmosphere, in order to protect the health and safety of its workers, the public, and the environment.  In order to accomplish this goal, El Dorado Irrigation District has gathered safety information on chlorine and on the process, equipment and procedures involving chlorine; performed a structured assessment of hazards of the process and external events which might affect the process; performed an offsite consequences analysis of defined release scenarios; established a written program for prevention and mitigation of accidental releases; and established a written emergency response program coordinated with emergency response agencies.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAMS\n\nGeneral accidental release prevention programs instituted by El Dorado Irrigation District are categorized as administrative (management) programs; procedures, training, and engineering controls; and emergency response programs.\n\nEl Dorado Irrigation District has instituted a Process Safety Management (PSM) Program meeting OSHA requirements at 29 CFR 1910.119 covering its disinfection process.  This constitutes the general accidental release prevention program for El Dorado Irri"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55388,
      "SummaryText": "gation District's operations.  The program and document mangement procedures included in the PSM Program are used as the management system for the Risk Management Program.\n\nCHEMICAL-SPECIFIC RELEASE PREVENTION STEPS\n\nRelease prevention steps specific to chlorine have been identified and implemented.  These include, among other things, the creation of numerous facility-specific operation procedures with check boxes for completion of critical steps.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no accidents involving chlorine at this facility within the past five years resulting in injuries or offsite consequences.\n\nEMERGENCY RESPONSE PROGRAM\n\nEl Dorado Irrigation District's Emergency Response Program applicable to chlorine has been coordinated with El Dorado County Department of Environmental Management, the local agency responsible for hazardous materials inventory reporting and release response coordination.  El Dorado Irrigation District maintains First Responder capability with respect to chlorine releases at its facilities using chlorine.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nAll of the improvements and mitigation measures identified in the process hazard analysis which El Dorado Irrigation District committed to accomplish have been completed or are in progress.  Any other measures identified by employees during workplace hazard surveys, or as a result of audit activities, will be thoroughly reviewed and considered for implementation.  This facility is undergoing an expansion and upgrade.  It is expected that this facility will convert from gas chlorine to sodium hypochlorite in late 2009 or early 2010."
    }
  ]
}