{
  "FacilityID": 55632,
  "FacilityName": "Water Reclamation Plant No. 7",
  "FacilityStr1": "80-609 Avenue 38",
  "FacilityStr2": null,
  "FacilityCity": "Indio",
  "FacilityState": "CA",
  "FacilityZipCode": "92201",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06065",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.771806",
  "FacilityLongDecDegs": "-116.258278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "LC",
  "FacilityURL": "www.cvwd.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Coachella Valley Water District",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Coachella Valley Water District",
  "OperatorStr1": "80-609 Avenue 38",
  "OperatorStr2": null,
  "OperatorCity": "Indio",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92201",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": "CAD982446056",
  "EPAFacilityID": "100000167632",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-01-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-07-01 00:00:00",
  "ErrorReportDate": "2009-07-01 00:00:00",
  "ReceiptDate": "2009-06-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-25 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 33.771806,
  "FRS_Long": -116.258278,
  "FRS_Description": "LOADING AREA CENTROID",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C02",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 80958,
      "AltID": "Chlorination",
      "FacilityID": 55632,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 107769,
          "ProcessID": 80958,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 82927,
          "ProcessID": 80958,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 47503,
              "Process_NAICS_ID": 82927,
              "SafetyReviewDate": "2009-05-01 00:00:00",
              "PHA_Date": "2009-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-06-12 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-06-17 00:00:00",
              "TrainingReviewDate": "2009-05-21 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-06-03 00:00:00",
              "EquipmentInspectionDate": "2009-06-03 00:00:00",
              "EquipmentTested": "vacuum regulator and lines",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": null,
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2008-11-01 00:00:00",
              "AuditCompletionDate": "2009-11-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-06-01 00:00:00",
              "HotWorkPermitReviewDate": "2008-09-01 00:00:00",
              "ContractorSafetyReviewDate": "2008-06-01 00:00:00",
              "ContractorSafetyEvalDate": "2008-06-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 69238,
                  "PreventionProgram3ID": 47503,
                  "ProcessChemicalID": 107769
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 55632,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-05-21 00:00:00",
    "ERTrainingDate": "2009-05-21 00:00:00",
    "CoordinatingAgencyName": "Riverside County Fire Department",
    "CoordinatingAgencyPhone": "7608637075",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55632,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThis document comprises the Five Year Update for the Federal Risk Management Plan (Federal RMP Plan) and the California Accidental Release Prevention Program Risk Management Plan (CalARP RMP) for Water Reclamation Plant No. 7 located at 80-609 Avenue 38 in Indio, California 92201 (herein after referred to as WRP No. 7 or the Plant). The Plant is owned and operated by the Coachella Valley Water District (with a mailing address of P.O. Box 1058; Coachella, California 92236). The District's initial submittal for WRP No. 7 was made to USEPA and to the Riverside County Department of Environmental Health on June 21, 1999.\n\nThe purpose of this document is to comply with the risk management planning requirements as set forth in the Code of Federal Regulations, Title 40, Part 68 (also known as the Federal Risk Management Plan Regulations) and the California Code of Regulations, Title 19, Division 2, Chapter 4.5, Article 3, Section 2745.3 (also known as the California Accidental Release Prevention Program Risk Management Plan - CalARP RMP Regulations). The scope of the Federal RMP and CalARP RMP includes all operations conducted at the subject facility that involve the storage, handling and/or use of chlorine (i.e., chlorine is the only regulated substance handled at the Plant).\n\nPolicy Statement\nIt is the Policy of the Coachella Valley Water District (District) to conduct ALL District activities safely to prevent Job related accidents, illnesses, and injuries to employees and others and damage to District and Others' property. A well organized safety program provides a safe working environment and promotes increased efficiency at ALL levels (IIPP).\n\nES 1.0 DESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nThe primary operation conducted at WRP No. 7 is the treatment of wastewater (NAICS Code 22132 - Sewage Treatment Facilities). \n\nWater Reclamation Plant No. 7 is a wastewater treatment plant that treats domestic wastes. WRP No. 7 uses\nchlo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55632,
      "SummaryText": "rine to disinfect a tertiary effluent before the effluent is discharged to down stream customers. The Plant is manned on the day shift and the process is monitored 24-hours per day, 7-days per week, 365-days per year at the District Headquarters located in Coachella.\n\nMaximum Inventory of Regulated Substances\nThe District's Maximum Inventory of Chlorine is 16,000-pounds (i.e., eight one ton containers of chlorine of which four are online and four are in storage). \n\nSite Security\nIn order to ensure the security of the site, the District has erected a chain link fence around the entire site. Additionally, the site is equipped with a perimeter security system. Lastly, ALL building entries are equipped with intruder alarms to alert Control of unauthorized access. These site security provisions are intended to prevent unauthorized access to areas of the Plant where chlorine is stored, handled or used and seek to provide an added level of safety for the storage of chlorine at the Plant.\n\nES 2.0 ACCIDENTAL RELEASE SCENARIOS\n\nThe Federal RMP regulations and the CalARP RMP regulations require that at least two types of release scenarios be evaluated for their potential to impact off-site populations:\n\nthe worst case release; and\nan alternative release (an accident scenario that is more credible than the worst-case release scenario).\n\nA number of hypothetical accidental release scenarios were postulated and evaluated for the Five Year Federal RMP/CalARP RMP Update. These scenarios were categorized into worst-case release scenarios and alternative release scenarios. Each of these categories of hypothetical accidental release scenarios is discussed below.\n\nCHLORINE \n\nWorst-Case Release Scenarios for Chlorine \nIn this scenario, one of the one-ton containers of chlorine on site experiences a catastrophic failure due to an unknown event. This scenario could be initiated by an external event (i.e., an airplane, missile or meteorite impacting the chlorine storage en\nclosure or area"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55632,
      "SummaryText": "where the one ton containers are located). It is highly improbable that this scenario would be initiated by a seismic event. However, the possibility of this scenario being initiated by a seismic event cannot be completely discarded. This scenario is considered to be extremely unlikely. In the extremely unlikely case that this scenario occurs, up to 2,000-pounds of chlorine could be released (in the worst-case). The release of chlorine could occur either indoors or outdoors. Since the release can occur out-doors (i.e., outside of the chlorine storage room during a delivery for example) the enclosure provided by the chlorine storage room was not taken into account in evaluating the off-site consequences. Rather, it was assumed that the chlorine released during the catastrophic accident was released outdoors forming a cloud of chlorine vapor. The resulting vapor cloud was assumed to freely migrate off-site. Utilizing the methodology specified by USEPA, the estimated vulnerable zone for this hypothetical accidental release scenario is approximately 3.0-miles.\n\nAlternative Release Scenarios for Chlorine\nAlternative release scenarios which are considered to be more likely to occur are those which may result in the release of anywhere from less than one-pound to up to 2000 pounds of chlorine. These scenarios include situations such as delivery of a leaking one-ton container of chlorine to the Plant, a pinhole leak in the chlorine transfer piping, a partial or complete failure of the chlorine transfer lines (100-percent vapor) at various points in the system (in-doors), or the rupture or separation of the flexible connections from the online one-ton containers to the manifold system (in-doors). In order to be conservative in the estimation of the vulnerable zone, it was assumed that 1447-pounds of chlorine was released (over a 60-minute period) during an accident involving the complete rupture of the flexible connection from a one-ton container to \nthe manifold system. It"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 55632,
      "SummaryText": "was assumed that the resulting release activates the chlorine detectors which in turn activate the building ventilation fans. As such the chlorine released indoors, is quickly vented to the atmosphere and the resulting cloud of chlorine vapor is free to migrate off-site. Utilizing the methodology specified by USEPA, the estimated vulnerable zone for this hypothetical accidental release scenario is approximately 0.2-miles.\n\nES 3.0 FIVE YEAR ACCIDENT HISTORY\n\nDuring the five years preceding the submittal of the Five Year Federal RMP/CalARP RMP Update, the Plant has NOT had any accidental releases of chlorine that have resulted in:\n\nOnsite deaths, injuries, or significant property damage; or\nKnown offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\n\nES 4.0 ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS/DEVICES\n\nThe Accidental Release Prevention Program at the Plant consists of a series of programs, procedures and policies designed to minimize the risk of accidental releases involving chlorine. These programs include design and operating controls such as compliance with specified codes, the District's health and safety program, numerous standard operating procedures, the equipment inspection and maintenance program (including a mechanical integrity and preventive maintenance program), the management of change program, pre-start-up review, fire protection and hot work permit programs, management of- and safety of- contractors, accident/incident investigation procedures, emergency response plan, the Federal RMP/CalARP RMP/OSHA PSM Program compliance auditing program, the Federal RMP/CalARP RMP/OSHA PSM Program record keeping program and a variety of personnel training programs. Details of each of these components of the Plant's Accidental Release Prevention Program are provided in the document entitled Federal Risk Management Plan (Federal RMP), California Acci\ndental Release Prevention Progra"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 55632,
      "SummaryText": "m Risk Management Plan (CalARP RMP), OSHA Process Safety Management (OSHA PSM) Program, Volume I - Prevention Program. \n\nIt is highly unlikely that the Worst Case Release Scenario or Alternative Release Scenarios will occur at the plant for the following reasons:\nThe chlorine process and process areas are inspected daily;\nThe chlorine containers and storage rooms are monitored 24-hours per day, 7-days per week, 365-days per year for process leaks via automatic leak detectors;\nThe leak detectors are considered critical equipment and thus are incorporated into the Mechanical Integrity Program. As such, each detector is well maintained and tested twice each month;\nALL chlorine storage, handling and use area entry doors are equipped with intruder alarms to guard against unauthorized entry and/or vandalism;\nALL one ton containers are inspected prior to acceptance and storage onsite;\nALL one-ton containers stored/managed onsite are secured in-place via two chain binders to prevent movement or dislodging due to seismic events; and\nALL Plant Operators and Members of the Emergency Response Team are trained to respond to- and stop- process leaks.\n\nThere are a number of detection and monitoring devices and alarms designed to ensure the continued safe operation of Water Reclamation Plant No. 7. These devices are located throughout the Plant and monitor various aspects of Plant Operations. \n\nAlarms\nWRP No. 7 is equipped with Leak Detectors that are designed to detect chlorine in the chlorine storage area at or above 1-ppm. When one of these detectors senses a gas leak at or above 1-ppm, an audible alarm is indicated locally and on the annunciator panel in the onsite control room AND an alarm is transmitted to District Control at Headquarters AND the ventilation fan is automatically switched on and starts to evacuate the room.. At 3-ppm the beacon lights on top of the chlorine building are activated. These alarms can only be re\nset and cleared after the leak detectors sense less"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 55632,
      "SummaryText": "than 1-ppm of chlorine gas. The alarms are tested by District Operators twice each month. Additionally, the District's Communications Shop inspects, tests and calibrates the chlorine alarm system on a monthly schedule. \n\nES 5.0 EMERGENCY RESPONSE\n\nThe Coachella Valley Water District recognizes that emergency planning and emergency response are an integral component of risk management. As such, the District, as part of its hazardous materials business plan (HMBP) and Emergency Response Program for Water Reclamation Plant No. 7, has developed and implemented an emergency response plan and an emergency evacuation plan. \n\nCall Outs\nWhen a gas leak alarm occurs during the hours that a Plant is staffed, the Plant Operators will respond to the leak with three operators. The Chlorine Response Team can be dispatched to the Plant during the staffed hours if the Plant Staff are unable to respond to the leak with a three person crew.\n\nWhen control receives a gas leak alarm after hours, the Control Operator will call out the Chlorine Response Team and the Sanitation Standby Operator. Upon arrival at the scene, both will wait at the entrance gate for the other to arrive and will enter the Plant together.\n\nResponse Teams\nEmergency response and any work with chlorine connections requires a minimum of three employees to be present. ALL Plant Operators are trained in Emergency Response. The crew of employees trained in response to chlorine leaks at the District's domestic well sites have been trained to respond to chlorine leaks at WRP No. 7 as well. After hours this two-person crew responds with the standby operator to unmanned Plants or to other Plants that may need assistance. There are always three employees on call with pagers ready to respond to chlorine emergencies. The on call crew is rotated weekly.\n\nTraining\nChlorine response personnel are scheduled to be trained quarterly in the use of emergency repair kits, \nthe use of personal protective equipment (PPE), and District Eme"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 55632,
      "SummaryText": "rgency Response Procedures. Furthermore, chlorine emergency response personnel are trained annually in the safe storage and handling of chlorine and in CPR/First Aid. The District also has a cut-out one-ton container and a 150-pound cylinder that are used to simulate emergency releases and to practice emergency response/repairs and supply isolation procedures.\n\nResponse to Minor Leaks\nTwo employees will respond with Self-Contained Breathing Apparatuses (SCBAs), Chlorine B Repair Kits, gloves and a bottle of 26 Baume Ammonia. The third crew member will also respond with an SCBA and stay near the truck radio.\n\nThe first and second person will don their SCBAs, keeping each other in sight at all times. Using the ammonia, they will locate the chlorine leak. Once the leak is located and confirmed to be a system leak and not a vessel tank, the gas supply valve on the container can be shut off by turning the valve clockwise one full turn. When this has been done, the Third Crew Member will let Control know whether repairs have been made or if further assistance is needed.\n\nResponse to Major Leaks\nThe District's response to Major Leaks is similar to its response for Minor Leaks, except that the Response Team will wear fully encapsulated suits if a severe gas leak has occurred or if the Response Team finds a vessel/tank leak. The Third Crew Member will notify Control to send Police and Fire Department Personnel to the scene to secure and evacuate the surrounding area, as necessary. The District's standby personnel and Training/Safety Specialist will be called as well.\n\nES 6.0 PLANNED CHANGES TO IMPROVE SAFETY\n\nA detailed hazard and operability study (i.e., hazards analysis) was performed in June 2009 and covered ALL operations involving chlorine. As a result of the process hazards analysis update performed a number of recommendations were made to improve the safety of the operations conducted at the P\nlant. The District is currently evaluating the recommended actions and"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 55632,
      "SummaryText": "also evaluating implementation options. It is expected that the majority of recommended actions will be completed by December 31, 2009.\n\nES 7.0 FOR MORE INFORMATION\n\nThe Coachella Valley Water District recognizes that some persons may be interested in obtaining more detailed information regarding the Five Year Federal RMP and CalARP RMP Update and various Prevention Program components not discussed herein. Interested parties that have additional questions regarding the Risk Management Plan for Water Reclamation Plant No. 7 and or the Prevention Program, are directed to contact:\n\nAnthony Zamudio\nSafety and Training Specialist\nc/o Coachella Valley Water District\nREF: Water Reclamation Plant No. 7\nP.O. Box 1058\nCoachella, California 92236"
    }
  ]
}