{
  "FacilityID": 55640,
  "FacilityName": "The Smithfield Packing Co. Inc - Grayson Division",
  "FacilityStr1": "800 C. W. Stevens Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Grayson",
  "FacilityState": "KY",
  "FacilityZipCode": "41143",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21043",
  "LEPC": "Carter LEPC",
  "FacilityLatDecDegs": "38.348056",
  "FacilityLongDecDegs": "-082.938889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 43205053,
  "ParentCompanyName": "The Smithfield Packing Co. Inc.",
  "Company2Name": null,
  "CompanyDUNS": 43205053,
  "Company2DUNS": 0,
  "OperatorName": "The Smithfield Packing Co. Inc.",
  "OperatorStr1": "800 C.W. Stevens Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Grayson",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "41143",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brent Vernon",
  "RMPTitle": "Plant Manager",
  "FTE": 450,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000103755",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-04-28 00:00:00",
  "SafetyInspectionBy": "PSM/RMP compliance",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-08-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 38.34917,
  "FRS_Long": -82.93333,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 80966,
      "AltID": "anhydrous ammonia",
      "FacilityID": 55640,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 82935,
          "ProcessID": 80966,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 107778,
          "ProcessID": 80966,
          "ChemicalID": 56,
          "Quantity": 40856.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 607778,
          "ProcessID": 80966,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55640,
      "SummaryText": "This is to inform all interested persons; including employee?s that The Smithfield Packing Co. Inc - Grayson is complying with the Occupational Safety and Health Administrations (OSHA) Process Safety Management (PSM) Regulation, Title 29 Code of Federal Regulations, (CFR) 1910.119, and the Environmental Protection Agency (EPA) Risk Management Program (RMP) Regulations, Title 40 Code of Federal Regulations (CFR) Part 68.  These Regulations deal with the risk involved with the storage, handling and processing of hazardous chemicals.  In complying, we promote overall facility, employee and public safety.  Smithfield's program enables our facility to prevent the occurrence and minimize the consequences of significant releases of toxic substances as well as fires, explosions and other types of catastrophic accidents.  Overall, these programs are in place to prevent the potential for accidental injury, illness or death and to avoid the potential for property and environmental impact.  \n\nSmithfield's safety programs are applied to all activities involving hazardous chemicals including use, storage handling or the on-site movement of chemicals.  Any groups of vessels interconnected and separate vessels which are located such that a hazardous chemical could be involved in a potential release shall be considered a single process.   Smithfield's has a policy and commitment to employee safety and it is expressed in all programs and training. \n\nSmithfield's safety programs prevent accidents because they focus on rules, procedures, and best practices which govern processes, activities, and/or pieces of equipment.  These rules are detailed and revised as necessary; all information is communicated to employees of Smithfield through training and documentation.  The safety equipment used for HAZ-MAT purposes is inspected monthly and records are retained in the safety office.  \n\nSmithfield is a  processing and packaging company utilizes approximately 40,000 pounds of Anhydrous Ammonia"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55640,
      "SummaryText": " in its refrigeration system to cool the facility?s production and shipping areas.  \n\nSmithfield has passive mitigation measures in use due to the location of the vessel in Alternate Case Scenarios. There is no mitigation in use with the Worst Case Scenario.   \n\nThe Worst Case Scenario is highly unlikely for the following reasons:\n    Worst Case weather conditions are uncommon\n    The vessel is in a protected area clear of vehicular traffic and pedestrian traffic\n    Industrial Safety standards for the construction and quality control of pressure vessels\n    Safety relief valves preventing over-pressurization of the vessel are in use\n    Accident prevention programs in place \n    Mechanical Integrity programs, inspections and testing procedures are in place\n    Emergency alerting alarms integrated into the process system\n    Emergency response and action plans in place at the facility\n\nThe alternative release scenario, selected from recommended scenarios, though potentially possible, is unlikely for the following reasons:\n    Emergency shut-down procedures\n    Inspections and rounds made daily of the process system to ensure safe operation\n    Emergency response plan and refrigeration personnel on-site around the clock\n\n\nSmithfield?s accidental release prevention programs are based on safe work practices as referenced by the OSHA, EPA and American National Safety Standards (ANSI), and the International Institute of Ammonia Refrigeration (IIAR) 2-1992 Key element of this prevention program are comprise of:\n    Equipment Design\n    Installation and Operation of Ammonia Process Systems (ANSI/IIAR 2)\n    Emergency Response and Action Plan Program (OSHA 29 CFR 1910.120, 1910.38 and EPA 40             CFR Parts 68)\n    Mechanical Integrity\n    Emergency shut down procedures\n    Inspection program (OSHA 29 CFR 1910.119)\n    \nSmithfield has not experienced any accidental release over the past 5 (five) years.    \n\nThe facility emergency response program is based on OSHA?s Regulation for Emergency Action Plans (1910.38 and 1910.119) and "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55640,
      "SummaryText": "HAZWOPER (29 CFR 1910.120).  Smithfield has an on-site trained emergency response team (HAZMAT) and maintains a written emergency response plan which is reviewed annually.  This plan is coordinated with the Local Emergency Planning Committee (LEPC), the Fire Department, Police and Emergency Medical facilities to ensure communication with all potential or actual involved resources should their involvement be necessitated by a release. \n\nThrough Process Hazard Analysis, inspections, annual reviews and audits, Smithfield continuously improves its process system, procedures, programs and training to ensure mitigation, control, technology, equipment and organizational changes remain consistent and in force. Through this initiative, Smithfield can ensure the utmost safeguards are utilized as it related to its process systems and programs for the overall safety and well being of the employees, facility and the environment."
    }
  ]
}