{
  "FacilityID": 55712,
  "FacilityName": "IO Phoenix One, LLC",
  "FacilityStr1": "615 North 48th Street",
  "FacilityStr2": null,
  "FacilityCity": "Phoenix",
  "FacilityState": "AZ",
  "FacilityZipCode": "85008",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.454167",
  "FacilityLongDecDegs": "-111.976667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.iodatacenters.com",
  "FacilityEmailAddress": "Jpfaff@iodatacenters.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "IO Data Centers, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "IO Phoenix One, LLC",
  "OperatorStr1": "615 North 48th Street",
  "OperatorStr2": null,
  "OperatorCity": "Phoenix",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85008",
  "OperatorZipCodeExt": null,
  "RMPContact": "Marvin Rowell Marvin Rowell",
  "RMPTitle": "Operations Manager",
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000192338",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-06-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-07-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-07-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-07-24 00:00:00",
  "DeRegistrationEffectiveDate": "2019-02-15 00:00:00",
  "AnniversaryDate": "2014-07-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 81076,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 55712,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 83053,
          "ProcessID": 81076,
          "NAICSCode": "541513",
          "_desc": {
            "NAICS_CODE": "541513",
            "NAICS_DESCRIPTION": "Computer Facilities Management Services"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 107934,
          "ProcessID": 81076,
          "ChemicalID": 56,
          "Quantity": 35250.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 607934,
          "ProcessID": 81076,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55712,
      "SummaryText": "Executive Summary\n\nThis Executive Summary briefly describes the following elements:\n\n?  The accidental release prevention and emergency response policies at the stationary source.\n\n?  The stationary source and regulated substances handled.\n\n?  The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\n?  The general accidental release prevention program and chemical-specific prevention steps.\n\n?  The five-year accident history.\n\n?  The emergency response program.\n\n?  Planned changes to improve safety.\n\n\n1. The accidental release prevention and emergency response policies at the stationary source\n\nTo address concerns of an accidental release, prevention and emergency response, all plant and field personnel are trained in ammonia emergency response procedures and use of appropriate protective equipment.  Refresher training and emergency response drills are conducted on a periodic basis to ensure personnel are equipped, trained, prepared, and practiced in responding to ammonia emergencies.  \n\nAs a result of information gathered during preparation of this Risk Management Program, IO Data Centers, Phoenix Facility is committing additional resources to further increase employee awareness and equipment reliability and to establish operator training and preventive maintenance programs.  As a demonstration of IO Data Centers, Phoenix Facility?s high degree of commitment to public safety and service, IO Data Centers, Phoenix Facility is taking action to decrease the risk of ammonia exposure to the public by implementing recommendations made during the Process Hazards Analysis and Off-site Consequence Analysis.\n\n2. The stationary source and regulated substances handled\n\nAnhydrous ammonia is used as a refrigerant in the IO Data Centers, Phoenix Facility refrigeration system.  The liquid is circulated as needed to the heat exchangers where heat is absorb"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55712,
      "SummaryText": "ed and removed from process system water.  The anhydrous ammonia refrigeration system is a closed loop industrial refrigeration system.  The ammonia is not used or mixed in any manner with other chemical processes.\n\n3. The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nA \"Worst-Case Scenario Offsite Consequence Analysis\" and an \"Alternative Scenario Offsite Consequence Analysis\" were performed identifying the public and environmental receptors within the toxic endpoint concentration radius of 200 ppm.  The results are mitigated by the fact that all the vessels and the much of the piping are inside the IO Data Centers, Phoenix Facility building.  A variety of administrative controls and computerized controls are in place to shut the system down when operating parameters and limits are exceeded.\n\n4. The general accidental release prevention program and chemical-specific preventative steps\n\nThe basic elements of the Program 3 Prevention program have been developed and are now in place. These include:\n\n?  Process Safety Information\n?  Process Hazard Analysis\n?  Standard Operating Procedures\n?  Safework Practices\n?  Employee and Operator Training Programs\n?  Mechanical Integrity Program\n?  Management of Change Procedures\n?  PSM Compliance Audit Procedures\n?  Incident Investigation Procedures\n?  Employee Participation Program\n?  Hot Work Permit Procedures\n?  Contractor Safety Program\n?  Emergency Response Program\n\nAmmonia specific prevention steps include:\n\n?  Administrative controls\n?  Operator Training\n?  Computerized controls\n\nThe Preventive Program 3 provides extensive maintenance and operator/mechanic training to ensure that the system?s mechanical integrity is maintained for the life of the covered process. Program 3 also incorporates administrative controls when modifications are made to the covered process (ammonia refrigeration sys"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55712,
      "SummaryText": "tem), so the training and preventative programs are updated as the system expands and changes.\n\n5. The five-year accident history\n\nA five-year accident history has not been prepared and included in the RMP since there have been no reportable incidents within the last 5 years (new facility).  To prevent and/or minimize any potential future release of anhydrous ammonia, IO Data Centers, Phoenix Facility is implementing a detailed Process Safety Management program (Preventive Program 3).\n\n6. The emergency response program\n\nEmergency response is discussed in Section 5 of the RMP.  IO Data Centers, Phoenix Facility has a detailed Emergency Response Plan (ERP) for their facility.  The purpose of this plan is to provide the means for rapidly determining the appropriate response for any emergency that may develop at the facility such as an accidental release of anhydrous ammonia.  IO Data Centers, Phoenix Facility conducts scheduled drills of the emergency response plan. The Emergency Response Program is written, includes specific actions to be taken in response to an accidental release, includes procedures for informing the public and local agencies responsible for responding to an accidental release, and includes information on emergency health care.\n\n\n7. Planned changes to improve safety\n\nIO Data Centers, Phoenix Facility is incorporating and addressing any recommendations resulting from the Process Hazard Analysis, Offsite Consequences, and program audits.  The flexibility of the program allows IO Data Centers, Phoenix Facility to respond effectively to prevent or minimize any potential exposure of IO Data Centers, Phoenix Facility employees, the surrounding public, and/or the environment to a release of anhydrous ammonia. Specific actions taken to improve safety are the implementation of the Program 3 Prevention Program described above, improved operator training, administrative controls, and computerized system controls."
    }
  ]
}