{
  "FacilityID": 55759,
  "FacilityName": "Alcoa Inc. Warrick Operations",
  "FacilityStr1": "State Road 66",
  "FacilityStr2": null,
  "FacilityCity": "Newburgh",
  "FacilityState": "IN",
  "FacilityZipCode": "47629",
  "Facility4DigitZipExt": "0010",
  "FacilityCountyFIPS": "18173",
  "LEPC": "Warrick County LEPC",
  "FacilityLatDecDegs": "37.920833",
  "FacilityLongDecDegs": "-087.329444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6366819,
  "ParentCompanyName": "Aloca Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Alcoa Inc.",
  "OperatorStr1": "State Road 66",
  "OperatorStr2": null,
  "OperatorCity": "Newburgh",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "47629",
  "OperatorZipCodeExt": "0010",
  "RMPContact": "Nathan Long",
  "RMPTitle": "Sr. Industrial Hygienist",
  "FTE": 2300,
  "OtherEPAFacilityID": "IND006366819",
  "EPAFacilityID": "100000081984",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "T173-6627-00007",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-03-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-03-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-02-04 00:00:00",
  "DeRegistrationEffectiveDate": "2019-02-01 00:00:00",
  "AnniversaryDate": "2014-03-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 37.92497,
  "FRS_Long": -87.33231,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "1",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 81152,
      "AltID": null,
      "FacilityID": 55759,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 83129,
          "ProcessID": 81152,
          "NAICSCode": "331314",
          "_desc": {
            "NAICS_CODE": "331314",
            "NAICS_DESCRIPTION": "Secondary Smelting and Alloying of Aluminum"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 108020,
          "ProcessID": 81152,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 608020,
          "ProcessID": 81152,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55759,
      "SummaryText": "\n\n\nRMP Executive Summary\n\nAlcoa Inc. ? Warrick Operations\n\nEPA ID: 110000602045\n\n\n\nAlcoa Inc. ? Warrick Operations has implemented a Risk Management Plan (RMP) to effectively manage risks to the public from accidental hazardous releases.  This RMP summarizes the elements of the Risk Management Program and is organized according to specific EPA definitions and requirements, as follows:\n\n\n\n         ? Alcoa?s policies to protect environment, health, and safety\n\n         ? Facility identification and regulated substances covered processes\n\n         ? Hazard Assessment\n\n         ? Prevention Program\n\n         ? Five-Year accident history\n\n         ? Emergency Response Plan\n\n         ? Planned changes to improve safety\n\n\n\nThe worst-case release scenario for a toxic involves a chlorine gas release due to a breech in transits the chlorine unloading and vaporization building.  This results in an impact distance of 3.0 miles using EPA?s Offsite Consequence Analysis Guidance (OCAG) tables.  40 CFR 68.36(a) requires that facilities update the offsite consequence analysis when a change in conditions occur.  This review was completed on January 2009 , using the most current OCAG document dated April 1999.    This scenario is extremely unlikely.  Alcoa Inc. ? Warrick Operations has never had an RMP incident involving chlorine that resulted in off-site impacts.  \n\n\n\nAlcoa Inc. ? Warrick Operations Policy for Environmental, Health, and Safety\n\n\n\nIt is Alcoa?s policy to operate worldwide in a safe, responsible manner, which respects the environment and the health of our employees, our customers and the communities where we operate.  We will not compromise environmental, health, or safety values for profit or production.  All Alcoans are expected to understand, promote, and assist in the implementation of this policy and the accompanying principles.\n\n\n\nFacility Identification & Regulated Substances in Applicable Processes\n\n\n\nAlcoa Inc. ? Warrick Operations is located on Highway 66 in "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55759,
      "SummaryText": "Newburgh, Indiana.  The facility consists of a primary aluminum smelter and a fabrication facility.  Warrick Operations uses one chemical regulated under 40 CFR 68.  Chlorine is present at or above the minimum threshold level for RMP applicability.  The total maximum quantity in the process for the substance is less than6000 pounds.  Chlorine gas is used to remove impurities from molten aluminum.  \n\n\n\nHazard Assessment ? Worst Case Scenario\n\n\n\nThe worst-case toxics accidental release scenario would be a breach of a 1 ton cylinder in transit to the Cl2 unloading and vaporization building.  Liquefied chlorine gas is transported to Warrick Operations via 1ton cylinders to the Chlorine building from the supplier, the cylinders are hooked up one at a time  directly to the Ingot process.  During a change out, residual chlorine in the system can be manually purged to a caustic neutralization system.  The maximum total chlorine in the process is 6,000 or 3 cylinders.  This quantity is assumed in the worst-case scenario to be released over 10 minutes, as required by the RMP rule.  \n\n\n\nHazard Assessment modeling shows that, under worst case weather conditions, the worst case release could produce a chlorine plume that could travel more than 3.0 miles before dispersing enough to no longer pose a hazard to the public.  This RMP includes information on mitigation and prevention measures implemented by Alcoa to reduce the risk of this type of event.\n\n\n\nWorst Case Release Mitigation Measures \n\n\n\nAlcoa?s preventative measures make it extremely unlikely that a significant chlorine release will occur.  Active mitigation systems cannot be considered in modeling worst-case scenarios for RMP; however, in the unlikely event that a release occurs, these systems should effectively reduce the risk associated with an RMP incident.\n\n\n\nHazard Assessment ? Alternative Release Scenario\n\n\n\nOne alternative scenario for chlorine was also modeled in the hazard assessment.  The alternative release sc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55759,
      "SummaryText": "enario for chlorine consists of simultaneous, automated, and manual failures of the system.  These systems include:\n\n* Leak in the <? hose hooking up the 1 ton Cl2 cylindaer to the vaporization for feeding process.\n\n* failure of the automatic shutoff valves\n\n* failure of the detection system\n\n* failure of the Ingot Maintenance Emergency Response to fix the leak\n\n* failure of the HazMat Team to respond\n\nresulting in a release of chlorine.  In this case, the plume was estimated to go 1.0 miles before dispersing enough to no longer pose a hazard to the public.  This scenario is more likely than the Worst Case Scenario, but it is very unlikely to happen.  There have been no actual releases that have caused off-sit impacts for this toxic.\n\n\n\nAlternative Release Mitigation Measure\n\n\n\nWhile the Alternative Release Scenario is more likely to occur than the Worst Case Scenario, it is still very unlikely given Alcoa?s prevention program.  The mitigation systems should effectively reduce the risk associated with a release.  Trained personnel follow standard job procedures for chlorine unloading.    In the event of a leak, these valves can be closed either automatically, by the leak detection system or a loss of power, or manually, by the emergency shutoff buttons.  The manual shutoff valves can be closed quickly following an early warning by the chlorine detectors, which sound a low level alarm at 0.5ppm.  A comprehensive fault-tree analysis of a severed liquid valve via the failure of the excess flow valve or the failure of the automatic shutoff valves determined a probability of occurrence of one in 38,000 years.    \n\nPrevention Program\n\n\n\nA prevention program is in place to minimize the risk of hazardous chemical releases in accordance with the Occupational Health and Safety Administration (OSHA) Process Safety Management (PSM) standard and the EPA Risk Management Program.  This prevention program covers those processes that handle chlorine above the threshold quantity of e"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 55759,
      "SummaryText": "ither PSM or RMP rules.\n\n\n\nFive-Year Accident History\n\n\n\nThere have been no incidents in the past five years that involve the release of a regulated substance from covered processes that meet EPA criteria for the Five-Year Accident History, which are focused on serious accidents with either on-site deaths, injuries, or significant damage; or known off-site deaths, injuries, property damage, or environmental damage.  \n\n\n\nEmergency Response Plan\n\n\n\nIt is Alcoa?s policy in the event of a spill or release of materials to initiate activities to limit the spread of the released material and then immediately notify Plant Protection, who has been designated as the first-plant-contact.  Plant Protection will respond to the scene in order to evaluate the nature of the situation, and if the Fire Brigade or HazMat Team is required to respond.  Actions are also coordinated with outside emergency response agencies, such as the Warrick County Fire Departments, the Warrick E.M.S., and the Warrick County Sheriff?s Department.  Contact will then be made to an Emergency Response Coordinator in order to notify EPA.  It should also be noted that Alcoa?s on-site response team provides emergency medical, fire, and hazardous materials back-up for local response teams, and Alcoa provides fire training for the local volunteer fire departments on-site.  Alcoa is highly prepared to provide immediate response in the event of an accidental release and minimize the impact of such a release.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nSafety is the most important aspect of the working environment at Alcoa.  Chemical exposure risks have been minimized through ongoing internal risk reduction efforts as well as regulatory requirements.  \n\n\n\n\n\n\n\n                                   ALCOA - WARRICK OPERATIONS ENVIRONMENTAL DEPARTMENT           Page: 3 of 3\n\n                           ID NUMBER: ENV-018                       Revision Date: 02/02/2009\n\n                                    TITLE: RISK MANAGEMENT PL"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 55759,
      "SummaryText": "AN EXECUTIVE SUMMARY      Original Date: 08/16/2004\n\n                                    Written By: Chris Allen                                                        Approved By: Scott M. Darling\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}