{
  "FacilityID": 55789,
  "FacilityName": "Delta Chemical Corporation",
  "FacilityStr1": "2601 Cannery Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Baltimore",
  "FacilityState": "MD",
  "FacilityZipCode": "21226",
  "Facility4DigitZipExt": "1595",
  "FacilityCountyFIPS": "24510",
  "LEPC": "Baltimore City LEPC",
  "FacilityLatDecDegs": "39.230529",
  "FacilityLongDecDegs": "-076.563630",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A6",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.deltachemical.com",
  "FacilityEmailAddress": "jbesson@deltachemical.com",
  "FacilityDUNS": 3068228,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "John Besson",
  "OperatorStr1": "2601 Cannery Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Baltimore",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21226",
  "OperatorZipCodeExt": "1595",
  "RMPContact": "Rich White",
  "RMPTitle": "Operations Manager",
  "FTE": 76,
  "OtherEPAFacilityID": "21226DLTCH2601",
  "EPAFacilityID": "100000053915",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-12-10 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Delta Chemical Polymer Plant",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-07-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-07-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-07-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-12-12 00:00:00",
  "DeRegistrationEffectiveDate": "2015-12-15 00:00:00",
  "AnniversaryDate": "2014-07-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 39.23122,
  "FRS_Long": -76.563,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 81195,
      "AltID": "Polymer Manufacturing",
      "FacilityID": 55789,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 83174,
          "ProcessID": 81195,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 108065,
          "ProcessID": 81195,
          "ChemicalID": 1,
          "Quantity": 73000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 108066,
          "ProcessID": 81195,
          "ChemicalID": 133,
          "Quantity": 55000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 133,
            "ChemicalName": "Dimethylamine  [Methanamine, N-methyl-]",
            "CASNumber": "124-40-3",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 608065,
          "ProcessID": 81195,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 608066,
          "ProcessID": 81195,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55789,
      "SummaryText": "EXECUTIVE SUMMARY\nJuly 21, 2009\n\nDelta Chemical Corporation manufacturers chemicals used in water and wastewater treatment and general industry.  Our products include Aluminum sulfate, Sodium aluminate, Aluminum chloride hydroxide sulfate, Aluminum chloride and Polymer.\n\nThe chemicals on-site that exceed the reporting threshold for RMP are Formaldehyde and Dimethylamine.  Formaldehyde is in an aqueous solution and stored in an 8,000-gallon tank at the facility.  The Dimethylamine is also in an aqueous solution and stored in an 8,000-gallon tank on site, although administrative controls limit the storage to 7,000 gallons.  Both chemicals are used in our polymer plant.\n\nDimethylamine is the worst case flammable.  Formaldehyde is the worst case toxic.\n\nA minimum team of two people and an unloading procedure and checklist are used for Dimethylamine and Formaldehyde unloading to ensure safe deliveries.  All storage and unloading areas have secondary containment; the polymer plant perimeter is curbed to create a containment area in the polymer plant.\n\n\nDelta Chemical Corporation is committed to handling chemicals responsibly, which includes continual environmental, health and safety training for plant employees as well as training our customers in the safe use of our products.  At Delta Chemical Corporation we believe that all jobs can be accomplished without injury to employees or harm to the environment.  Delta Chemical Corporation has trained personnel that will respond to any chemical release at our facility or customer?s facilities.  Training is conducted to insure personnel can respond to emergencies that could occur.\n\nDelta Chemical Corporation?s Polymer Manufacturing operation falls under the Occupational Safety and Health Administration (OSHA) Process Safety Management standard, 29 CFR 1910.119.  The elements of PSM are:  employee participation, process safety information, process hazard analysis, operating procedures, training, contractor safety, pre-startup saf"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55789,
      "SummaryText": "ety review, mechanical integrity, hot work permit, management of change, incident investigations, emergency planning and response, compliance audits and trade secrets.  PSM has enhanced Delta Chemical Corporation?s commitment to safety and to conducting our operations in an environmentally friendly manner.  Employees are required to help with Process Hazard Analysis of PSM processes and participate in PSM Audits of covered processes in accordance with the Employee Participation Program.  Standard Operating Procedures are used to provide clear instructions and training in PSM covered processes.  Our Mechanical Integrity program ensures that process equipment remains in a safe and reliable condition.  All contractors are required to attend safety orientation in accordance with our Contractor Safety Program.  All welding and cutting in regulated areas must be accompanied by a ?Hot Work? permit in accordance with our ?Hot Work? Permit Program.  This ensures that personnel take the time to survey the area to make sure all potential sources of ignition and fuel are eliminated/removed from the area prior to starting work.\n\nDelta Chemical Corporation is committed to providing a safe and healthy workplace and conducting its operations in and environmentally friendly manner.  Delta Chemical Corporation employees are highly trained in environmental, health and safety work practices and participate in safety training on a regular basis. All personnel are then given a chance to talk with their supervisors to discuss the positive and negative aspects of emergency response and are given a chance to input answers to develop solutions to problems.\n\nDelta Chemical Corporation?s chemical operators go through drug and alcohol testing at initial hire and for cause and participate in a random testing program.  Employees are encouraged to participate in the Safety Committee, Communications Committee and PSM/RMP Committee meetings.\n\nDelta Chemical Corporation uses standard operating proced"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55789,
      "SummaryText": "ures for handling chemicals in various processes.  The procedures plus the knowledge and experience of the employees coupled with the design, maintenance and integrity of the various processes allow for a continuation of our history of no serious accidents.\n\nFIVE YEAR ACCIDENT HISTORY\n\nDelta Chemical Corporation has not had a reportable release in the last seventeen (17) years.\n\nEMERGENCY RESPONSE PROGRAM\n\nDelta Chemical Corporation trains all production and maintenance personnel to give them the ability to contain and mitigate emergencies at Delta Chemical Corporation.  Delta Chemical Corporation is a member of the South Baltimore Industrial Mutual Aid Program (SBIMAP).  SBIMAP is a group of private companies and public agencies that have entered a mutual agreement to interact and practice emergency scenarios that may arise in the Baltimore Area.  These companies are committed to Mutual Aid by providing technical assistance and supplies to aid in the prevention and in recovery of an incident or accident.\n\nDelta Chemical Corporation?s personnel maintain proficiency through monthly meetings and emergency response training at various times throughout the year.  This is the basis for further plant specific training in the areas that utilize Dimethylamine and Formaldehyde. \n\nDelta Chemical Corporation schedules training on Dimethylamine, Formaldehyde and emergency response drills periodically.  Delta Chemical Corporation is in the process of implementing a computerized maintenance management system to facilitate the inspections and record keeping that are part of the PSM process."
    }
  ]
}