{
  "FacilityID": 55792,
  "FacilityName": "SupHerb Farms",
  "FacilityStr1": "300 Dianne Drive",
  "FacilityStr2": null,
  "FacilityCity": "Turlock",
  "FacilityState": "CA",
  "FacilityZipCode": "95381",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06099",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.494900",
  "FacilityLongDecDegs": "-120.879000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "www.supherbfarms.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 788317253,
  "ParentCompanyName": "McCormick & Co",
  "Company2Name": "Daregal, Inc.",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Mike Brem",
  "OperatorStr1": "P. O. Box 610",
  "OperatorStr2": null,
  "OperatorCity": "Turlock",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95381",
  "OperatorZipCodeExt": null,
  "FTE": 82,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000051711",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "N-2327",
  "SafetyInspectionDate": "2009-03-05 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "RMP submission updated 6/2009",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-07-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-07-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-07-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 37.49688,
  "FRS_Long": -120.88213,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 81199,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 55792,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 108070,
          "ProcessID": 81199,
          "ChemicalID": 56,
          "Quantity": 19300.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 83178,
          "ProcessID": 81199,
          "NAICSCode": "311411",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 47666,
              "Process_NAICS_ID": 83178,
              "SafetyReviewDate": "2009-03-16 00:00:00",
              "PHA_Date": "2009-03-17 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-08-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "diffusion tank",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "engine room ammonia detectors",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-06-15 00:00:00",
              "TrainingReviewDate": "2009-05-11 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-03-25 00:00:00",
              "EquipmentInspectionDate": "2009-04-02 00:00:00",
              "EquipmentTested": "compressors",
              "ChangeMgmtDate": "2009-03-26 00:00:00",
              "ChangeMgmtReviewDate": "2009-04-02 00:00:00",
              "PreStartupReviewDate": "2009-03-26 00:00:00",
              "ComplianceAuditDate": "2009-02-18 00:00:00",
              "AuditCompletionDate": "2009-08-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-06-03 00:00:00",
              "HotWorkPermitReviewDate": "2009-04-02 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Ammonia refrigeration",
              "_chemicals": [
                {
                  "PrimaryKey": 69593,
                  "PreventionProgram3ID": 47666,
                  "ProcessChemicalID": 108070
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 55792,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-06-02 00:00:00",
    "ERTrainingDate": "2009-05-26 00:00:00",
    "CoordinatingAgencyName": "Turlock Fire Department",
    "CoordinatingAgencyPhone": "2096685580",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55792,
      "SummaryText": "SUPHERB FARMS, INC.\nTURLOCK PLANT\nRISK MANAGEMENT PROGRAM (CalARP)\nAND PROCESS SAFETY MANAGEMENT PROGRAM\n\nAnhydrous Ammonia Refrigeration System\nChlorine Water Treatment System\n\nEXECUTIVE SUMMARY\nRevised March 2009\n\nSupHerb Farms, Inc. (SupHerb Farms) prepared a Chemical Risk Management Program and Process Safety Management Program (RMP/PSM) for its Turlock plant in general accordance with state and federal regulations. The state risk management regulations, also referred to as the California Accidental Release Prevention Program (CalARP), are codified in California Code of Regulations (CCR), Title 19, Section 2745, et. seq. The Environmental Protection Agency (EPA) also regulates facilities with certain toxic and flammable substances. The federal regulations are codified in the Code of Federal Regulations (CFR), Title 40, Section 68. Finally, both the California Occupational Safety and Health Administration (CalOSHA) and the Federal Occupational Safety and Health Administration (OSHA) regulate facilities with certain acutely hazardous materials under the PSM standards as defined in CCR, Title 8, Section 5189 and CFR Title 29, Part 1910, Section 119, respectively.\n\nSupHerb prepared the RMP/PSM Program to satisfy regulatory requirements and to demonstrate a commitment to evaluate and improve anhydrous ammonia and chlorine handling systems and practices at the facility. In the unlikely event that a chemical release does occur at the facility, SupHerb Farms has written an Emergency Action Plan and personnel are trained in the appropriate response measures, relying on emergency services provided by the local fire department and the Stanislaus County Hazardous Materials Response team. SupHerb will continue to improve ammonia-handling safety through the implementation of the prevention program elements of the RMP/PSM Program.\n\nSupHerb Farms plant is located at 300 Dianne Drive, Turlock, California. The area is zoned for industrial use. This facility processes herbs and sp"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55792,
      "SummaryText": "ecialty vegetables by freezing. Depending on the final product, the herbs and specialty vegetables are processed through an Instant Quick Freeze (IQF) tunnel, or a paste line prior to packaging for wholesale markets. Cold storage is also provided within the warehouse for holding incoming herbs, specialty vegetables, and packaged final products.\n\nAnhydrous ammonia is used in the facility?s refrigeration system. The refrigeration system, which is a closed system, contains approximately 19,300 pounds of anhydrous ammonia. The system provides cooling to the cold storage rooms, and processing lines. The cold rooms are used to store finished products ready for shipping.\n \nChlorine is utilized as a biocide to disinfect the process water in the facility. The source of chlorine for the chlorination system during normal operation is a 1-ton container. When the contents of the 1-ton container are consumed, chlorination is manually transferred to 150 pound chlorine cylinders to accommodate 1-ton container exchanges without significantly interrupting chlorination of the process water. A 1-ton container and up to two 150 pound cylinders may be onsite, resulting in a maximum chlorine inventory of 2,300 pounds.\n\nThe RMP regulations require facilities to identify and evaluate chemical release scenarios resulting from potential failures of the chemical handling systems covered by the RMP. Program 3 requirements of the RMP apply to the SupHerb Farms facility due to the quantity of ammonia and chlorine used. Program 3 facilities are required to evaluate a worst-case release scenario (release parameters are defined by the regulations) and an alternative release scenario. The regulations define a worst-case release scenario as ??the greatest amount held in a single vessel?released as a gas over 10 minutes.? An alternative release scenario is identified as a release that is more likely to occur at the facility.\n\nThis facility has prepared worst-case and alternative release scenarios. Thes"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55792,
      "SummaryText": "e are not summarized herein as recommended by EPA, but are presented in the RMP.\n\nThe RMP/PSM regulations require a review of the accidental release prevention program and chemical specific prevention steps used by the facility. SupHerb Farms has incorporated many safety features in the ammonia refrigeration system to prevent system failures and to mitigate potential releases. The predominant safety concern with closed-loop ammonia systems is an inadvertent buildup of pressure exceeding pressure ratings or capacities of equipment due to ammonia expansion. The SupHerb Farms ammonia system has safeties and cutouts that shutdown pump components if deviations from normal operating conditions occur. Further, the ammonia system is equipped with pressure relief valves on all pressure vessels and most, if not all, additional locations within the ammonia system where ammonia could become trapped. The pressure relief valves discharge into a properly sized diffusion tank.\n\nThe chlorine system is, for the most part, under less than atmospheric pressure with only the ton container and vacuum regulator operated at above atmospheric pressure. The vacuum regulator will shut off chlorine flow if vacuum is lost anywhere in the delivery piping.\n\nOther safety features at the facility include: \n?    Ammonia leak detection in engine room\n?    Chlorine release detection in incoming vegetable wash line area\n?    Remote emergency shutdown switch\n?    Fire sprinklers indoors throughout the facility\n?    component specific safety shutdowns\n\nIn addition to the physical features of the ammonia refrigeration and chlorine systems at the facility, SupHerb Farms has extensive administrative controls in place to maintain safe operation of the systems. Administrative controls include, but are not limited to, formal training programs for system operators and mechanics, emergency training, a hot work permit program, a lock out/tag out program, a contractor safety program, incident investigation program, mechanical in"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 55792,
      "SummaryText": "tegrity program, management of change program, pre startup safety review program and an RMP/PSM auditing and inspection program. Written standard operating procedures (SOPs) are prepared for the ammonia and chlorine systems at the facility. The SOPs provide a basis for site specific operator training and a ready reference for operating and trouble-shooting the systems.\n\nSupHerb Farms is committed to maintaining the mechanical integrity of the ammonia refrigeration and chlorine systems. A preventive maintenance system is utilized to manage the maintenance of the refrigeration system. Preventive maintenance at the facility includes shift, daily, weekly, and periodic inspection; calibration; testing; and overhaul of ammonia system equipment. The system is used to track equipment performance and to create reports that are used by maintenance personnel to monitor the frequency of repairs and deviations from normal operating parameters.\n\nThe RMP/PSM regulations require a review of the 5-year accident history at the regulated facility. SupHerb Farms has had no reportable accidental releases of ammonia or chlorine during the past 5 years.\n\nSupHerb Farms has revalidated its Process Hazard Analysis (PHA) for ammonia and conducted a PHA for chlorine in 2009 and has received a new list of suggested mitigating measures. SupHerb Farms will respond to all suggested mitigation measures promptly and has established completion schedules for proposed actions. Management responses and support will be consistent with SupHerb Farms commitment to safe and environmentally responsible operations.\n"
    }
  ]
}