{
  "FacilityID": 55858,
  "FacilityName": "Cabot Packing, LLC",
  "FacilityStr1": "10881 S. Englehart",
  "FacilityStr2": null,
  "FacilityCity": "Reedley",
  "FacilityState": "CA",
  "FacilityZipCode": "93654",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.576111",
  "FacilityLongDecDegs": "-119.413611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A6",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Cabot Packing, LLC",
  "OperatorStr1": "10881 S. Englehart",
  "OperatorStr2": null,
  "OperatorCity": "Reedley",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93654",
  "OperatorZipCodeExt": null,
  "FTE": 28,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000167446",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-06-30 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "2009 update",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-08-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-08-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-08-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-08-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 36.57724,
  "FRS_Long": -119.41297,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 81281,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 55858,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 108155,
          "ProcessID": 81281,
          "ChemicalID": 56,
          "Quantity": 17262.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 83262,
          "ProcessID": 81281,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 47723,
              "Process_NAICS_ID": 83262,
              "SafetyReviewDate": "2014-07-24 00:00:00",
              "PHA_Date": "2014-07-24 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-07-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Fork lift traffic impact",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Constant electronic monitoring & control",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Daily inspections",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Installed single larger HPR",
              "OpProceduresReviewDate": "2014-07-24 00:00:00",
              "TrainingReviewDate": "2014-07-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-07-24 00:00:00",
              "EquipmentInspectionDate": "2014-05-09 00:00:00",
              "EquipmentTested": "Vessels, SRV's, piping, controls, evaporative condenser and evaporators.",
              "ChangeMgmtDate": "2014-04-07 00:00:00",
              "ChangeMgmtReviewDate": "2014-07-24 00:00:00",
              "PreStartupReviewDate": "2014-04-09 00:00:00",
              "ComplianceAuditDate": "2012-08-14 00:00:00",
              "AuditCompletionDate": "2013-07-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2014-05-01 00:00:00",
              "HotWorkPermitReviewDate": "2014-01-30 00:00:00",
              "ContractorSafetyReviewDate": "2014-07-24 00:00:00",
              "ContractorSafetyEvalDate": "2014-01-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 69651,
                  "PreventionProgram3ID": 47723,
                  "ProcessChemicalID": 108155
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 55858,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-05-22 00:00:00",
    "ERTrainingDate": "2014-06-03 00:00:00",
    "CoordinatingAgencyName": "Fresno Cnty Fire Protection Dist",
    "CoordinatingAgencyPhone": "5592686488",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 55858,
      "SummaryText": "at is in place at our stationary source.\r\n\r\nProcess Safety Information\r\nCabot Packing, LLC maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\r\n\r\nProcess Hazard Analysis\r\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is What If/Checklist (combined).  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of 5 years.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA/update was performed on 7/24/2014.\r\n\r\nOperating Procedures\r\nFor the purposes of safely conducting activities within our covered processes, Cabot Packing, LLC maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes. A complete review and revision of Standard Operating Procedures was completed 2/25/2013.\r\n\r\nTraining\r\nCabot Packing, LLC has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every 3 years and more frequently as needed. Training includes classroom and on-the-job techniques. Competency testing includes oral, demonstration and observation.\r\n\r\nMechanical Integrity\r\nCabot Packing, LLC carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressu"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 55858,
      "SummaryText": "Executive Summary for Cabot Packing LLC Cold Storage\r\n\r\nIntroduction\r\nThis update report reflects an ownership change, update of the RMP and PSM programs at Cabot Packing, LLC and changes/updates made. It¿s designed to provide the Fresno County CUPA with necessary details required for review. The original program was filed and approved in 1999. It was updated per regulatory requirements in 2004,2009,2013.\r\n\r\nThere were minor changes in refrigeration equipment with no inventory change or releases in the last 5 years. The only changes at the facility was ownership change, General Manager change and replacing 2 underd High Pressure Receivers with a single HPR large enough to hold the entire charge. \r\n\r\nA Compliance Audit was completed in 2012. Suggestions from the Compliance Audit will be followed and implemented, or rejected and any suggestions documented in the follow-up section. The major recommendation was more complete documentation of inspections, training, contractor qualifications and employee awareness.\r\n\r\nThe original Process Hazards Analysis was reviewed as required at 5 years. Since Royal Valley Fruit Growers did an excellent job of implementing recommendations in the original PHA, and since no equipment changes had occurred since the first PHA, no revisions were required to update the original PHA in 2004. The most significant item was that SRV's will be replaced on a 5 year basis rather than the previously proposed testing program. In the 2009 PHA Update 21 recommendations were made.\r\n\r\nA current detailed copy of RMP, PSM including PHA materials can be reviewed at the facility by contacting Curt Morton. Since the materials consist of several 2 binders and facility drawings which are constantly updated as changes are implemented, any reproduction becomes obsolete at the time of printing. This document includes accurate descriptions of sections without regulatory formats and forms.\r\n\r\nPublication or sharing of OCA portions of RMP materials can be in violati"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55858,
      "SummaryText": "on of the Chemical Safety Information, Site Security and Fuels Regulatory Relief Act (PL106-40). This facility will not make specific RMP or OCA information available to the public or included in the Executive Summary.\r\n\r\nAccidental Release Prevention and Emergency Response Policies\r\n\r\nCabot Packing, LLC is strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our use of Industrial Refrigeration Contractors for all maintenance including remote system monitoring in addition to our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls and perform preventative maintenance to prevent possible releases of regulated substances.\r\n\r\nStationary Source and the Regulated Substances Handled\r\n\r\nOur facility's primary activities are consistent with SIC code 0723. Specific activities include washing, packing, pre-cooling and cold storage of grapes and tree fruit.  The flooded Ammonia refrigeration system provides 3 pre-coolers, 3 storage rooms 1 refrigerated hallway/dock and a hydro-cooler.  Ammonia (anhydrous) refrigerant is the only regulated substance present at our facility above thresholds requiring an RMP.  Total system NH3 capacity is estimated at 17,262 lbs..  Sulphur Dioxide seasonally used for fumigation is also present however quantities are under 300 lbs.\r\n\r\nWorst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\r\nTo perform the required offsite consequence analysis for our facility, we have used the EPA's RMP Guidance for Ammonia Refrigeration Reference Tables or RMP Comp Software. No specific unusual external events were included due to the facilities rural location, remote equipment location and rece"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55858,
      "SummaryText": "nt construction meeting all applicable seismic and safety codes. A pipe/tank rupture in the largest vessel was used to represent the Worst Case. Potential impacts by forklift or other facility traffic typical to this type of operation or errors made during maintenance/construction are the most likely cause of a reportable release. Any catastrophic earthquake, fire or weather type events would result in the same impacts as presented in this OCA or less. Details are not included in the executive summary to prevent potential abuse of public information.\r\n\r\nSince no accidents or near - misses occurred, a common compressor shaft seal failure was used for the alternate release scenario. This is a realistic release that is expected to happen at least once over the life of the system. To simulate it a seal or flange leak of ¼ diameter gas release is assumed. The release rate is 10 lbs/minute at a pressure of 154 psig corresponding to 86°F condensing pressure. A response time of 30 minutes is assumed. Plant maintenance personnel could respond more quickly in most cases. The distance of <0.1 miles is obtained from RMP Comp software corresponding to a toxic endpoint of 0.14 mg/L. Using tables which have values less than .1 miles it's actually less than .06 miles. \r\nFive-year Accident History\r\nThe previous owner and Cabot Packing, LLC has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there have been no reportable accidental releases or injuries during this period.\r\nProgram 3 General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps \r\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition.  The following sections briefly describe the elements of the release prevention program th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 55858,
      "SummaryText": "re vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner. The last complete Mechanical Integrity survey was 10/11/2012 during the HPR replacement project.\r\n\r\nManagement of Change\r\nWritten procedures are in place at Cabot Packing, LLC to manage changes in process chemicals, technology, equipment and procedures.  The most recent review/revision of maintenance procedures was performed in 2014.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\r\n\r\nPre-startup Reviews\r\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Cabot Packing , LLC.  The most recent review was performed in 2014.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\r\n\r\nCompliance Audits\r\nCabot Packing, LLC conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent compliance audit was started on 8/14/2012.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\r\n\r\nIncident Investigation\r\nCabot Packing, LLC promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leadin"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 55858,
      "SummaryText": "g to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years. No incidents have occurred in the previous 5 years. Several minor incidents were used as training.\r\n\r\nEmployee Participation\r\nCabot Packing, LLC truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular. The most recent review was 7/24/2014.\r\n\r\nHot Work Permit\r\nAt Cabot Packing, LLC the hot work permit procedure ensures that employees, contractors and company property are properly protected against fire, explosion, and other dangers resulting from hot work (cutting and welding and any other spark producing operation such as brazing, grinding, burning, and exposure of energized electrical conductors) in or near a process. \r\n\r\nContractors\r\nOur company hires contractors to conduct maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Cabot Packing, LLC has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\r\n\r\nEmergency Action Plan\r\nCabot Packing, LLC carries a written emergency action plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination o"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 55858,
      "SummaryText": "f affected areas.\r\n\r\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response. The RMP will be updated within 30 days of any changes in emergency contact information. A revised RMP will be submitted to the EPA and Cal ARP.\r\n\r\nPlanned Changes to Improve Safety\r\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Additional RMP and PSM refresher training, calculations of SRV  and mechanical ventilation requirements and SRV discharge piping review.  These changes are expected to be implemented by 2015."
    }
  ]
}