{
  "FacilityID": 55935,
  "FacilityName": "Home Market Foods, Inc.",
  "FacilityStr1": "140 Morgan Drive",
  "FacilityStr2": null,
  "FacilityCity": "Norwood",
  "FacilityState": "MA",
  "FacilityZipCode": "02062",
  "Facility4DigitZipExt": "5013",
  "FacilityCountyFIPS": "25021",
  "LEPC": "Norwood LEPC",
  "FacilityLatDecDegs": "42.171389",
  "FacilityLongDecDegs": "-071.190833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.homemarketfoods.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 19265073,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Home Market Foods, Inc.",
  "OperatorStr1": "140 Morgan Drive",
  "OperatorStr2": null,
  "OperatorCity": "Norwood",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "02062",
  "OperatorZipCodeExt": "5013",
  "RMPContact": "Corinne Schultz",
  "RMPTitle": "EHS Manager",
  "FTE": 372,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000189397",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-04-09 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-09-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-09-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-09-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-09-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.11",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 81390,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 55935,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 83372,
          "ProcessID": 81390,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        },
        {
          "Process_NAICS_ID": 83373,
          "ProcessID": 81390,
          "NAICSCode": "311613",
          "_desc": {
            "NAICS_CODE": "311613",
            "NAICS_DESCRIPTION": "Rendering and Meat Byproduct Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 108275,
          "ProcessID": 81390,
          "ChemicalID": 56,
          "Quantity": 19600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 608275,
          "ProcessID": 81390,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55935,
      "SummaryText": "Home Market Foods Risk Management Plan\nExecutive Summary\n\nFacility Overview:\n\nThe Home Market Foods, Inc. (Home Market Foods) facility of Norwood, Massachusetts, produces and distributes quality meat products.   The facility utilizes anhydrous ammonia as a refrigerant to maintain the proper temperature in support of production needs and for storing the product until distribution.  Anhydrous ammonia is an effective refrigerant that has been used for many years by most food processing facilities.  Ammonia is normally a gas at ambient temperatures but is handled as a gas that is liquefied under pressure.  The refrigeration system consists of pressure vessels, evaporators, compressors, piping and other refrigeration equipment.  The same properties that make ammonia a valuable refrigerant also make it necessary to observe certain safety precautions during its use to prevent exposure to workers, the surrounding community, and the environment.  \n\nAccidental Release Prevention and Emergency Response Policies:   \n\nHome Market Foods is committed to promoting safety for the facility, its employees and the surrounding area.  The facility is complying with OSHA's Process Safety Management Standard, Title 29 Code of Federal Regulations 1910.110 and EPA's Risk Management Program Title 40 CFR Part 68.  The purpose of these programs is to ensure that the refrigeration system is operated safely in order to prevent releases of ammonia from the system.  In addition, the. operational procedures minimize the potential for releases and are established with formulated guidelines,  outlining appropriate emergency action steps to take in the event of a release.\n\nFive Year Update:\n\nThis RMP was originally developed in September 2004 by American Refrigeration, Inc. on behalf of Home Market Foods to prevent and mitigate accidental releases associated with the ammonia refrigeration system.  GeoInsight, Inc. performed the requisite regulatory update necessary for covered facilities on their five "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55935,
      "SummaryText": "year RMP submission anniversary date of September 24, 2009.  The update included performance of an off-site consequence analysis (OCA) taking into account data revised from the year 2000 census.  \n\nRegulated Substance:\n\nHome Market Foods operates a refrigeration system utilizing anhydrous ammonia as the primary refrigerant.  Mechanical refrigeration is a thermodynamic process where the refrigerant, ammonia, is used as a heat exchanging fluid to maintain a desired temperature in an enclosed environment.  The refrigeration cycle consists of evaporation, compression, condensation and expansion.  Evaporation and condensation are designed to alter the quantity of energy associated with the refrigerant.  Compression and expansion are designed to change the availability of the associated energy.  The refrigeration cycle is a closed-loop process.  The ammonia cycle utilizes fluid temperature, pressure and latent heat of vaporization for cooling.  The refrigeration system uses this phenomenon to remove heat from a desired space, and then to discard that heat through condensation, to an area where it is of no consequence.\n\nHome Market Foods operates the machine room (compressors, condenser, receivers), as well as the low pressure side of the system (pump receivers, coil evaporators, water chillers and coolers) to maintain processing, freezer and holding room temperatures required for the processing and storage of their product.  There are approximately 272 employees at the Home Market Foods facility, including hourly and salary personnel that support manufacturing and logistics relating to product preparation and  product shipment  approximately 24 hours a day, five days a week.\n\nAggregate ammonia storage is 19,614 pounds.  The potential hazards that could lead to an accidental release of the ammonia include, but are not limited to, equipment failure, damage to piping, damage to equipment, human error, etc.\n\nAccidental Release Prevention Program:  \n\nAs a part of the Process S"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55935,
      "SummaryText": "afety Management (PSM) program, Home Market Foods has established numerous programs that serve to prevent accidental releases of ammonia.  The programs include:\n\n?Process Safety Information\n?Process Hazard Analysis\n?Operating Procedures\n?Training\n?Mechanical Integrity\n?Management of Change\n?Pre Startup Safety Review\n?Compliance Audits\n?Incident Investigation\n?Employee Participation\n?Hot Work Permits\n?Contractor Safety\n\nEmergency Response Information:  \n\nAs a part of the PSM Program, Home Market Foods maintains an Emergency Action Plan that was prepared in order to improve responsiveness to an emergency incident, and to increase the reliability of actions taken during an incident.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies as well as the public.  In the event of an emergency involving the ammonia system, it is the policy of the facility to request assistance as necessary by calling 911.\n\nFive-Year Accident History:  \n\nHome Market Foods has not had any accidents over the last five years that have resulted in on-site deaths, injuries, or significant property damage.\n\nSteps to Improve Safety:  \n\nHome Market Foods takes a hands-on approach to enduring the safety of their employees and community.  Home Market Foods will operate and maintain the system in accordance with IIAR Guidance and will continue to implement its OSHA PSM Program in conjunction with the Risk Management Program."
    }
  ]
}