{
  "FacilityID": 55985,
  "FacilityName": "City of Burbank Water & Power-Valley Pumping Plant",
  "FacilityStr1": "2030 North Hollywood Way",
  "FacilityStr2": null,
  "FacilityCity": "Burbank",
  "FacilityState": "CA",
  "FacilityZipCode": "91505",
  "Facility4DigitZipExt": "1520",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.186277",
  "FacilityLongDecDegs": "-118.347916",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.burbankwaterandpower.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Burbank",
  "Company2Name": null,
  "CompanyDUNS": 71906432,
  "Company2DUNS": null,
  "OperatorName": "City of Burbank W&P-Water Division",
  "OperatorStr1": "P.O. Box 631",
  "OperatorStr2": null,
  "OperatorCity": "Burbank",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91503",
  "OperatorZipCodeExt": "0631",
  "FTE": 9,
  "OtherEPAFacilityID": "CAD980360796",
  "EPAFacilityID": "100000162851",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-09-29 00:00:00",
  "SafetyInspectionBy": "AQMD",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-10-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-10-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-10-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-10-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 34.185273,
  "FRS_Long": -118.349151,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 81492,
      "AltID": "Chlorine Water Treatment",
      "FacilityID": 55985,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 108382,
          "ProcessID": 81492,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 83475,
          "ProcessID": 81492,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 47864,
              "Process_NAICS_ID": 83475,
              "SafetyReviewDate": "2009-10-19 00:00:00",
              "PHA_Date": "2010-09-30 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-09-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "fuse plugs",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Updated policies and procedures",
              "OpProceduresReviewDate": "2009-10-19 00:00:00",
              "TrainingReviewDate": "2009-10-19 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-10-19 00:00:00",
              "EquipmentInspectionDate": "2004-10-19 00:00:00",
              "EquipmentTested": "chlorine cylinders, chlorinators, vacuum regulators, and all piping.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2009-10-19 00:00:00",
              "PreStartupReviewDate": "2009-10-19 00:00:00",
              "ComplianceAuditDate": "2009-10-19 00:00:00",
              "AuditCompletionDate": "2010-10-19 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-10-19 00:00:00",
              "HotWorkPermitReviewDate": "2009-10-19 00:00:00",
              "ContractorSafetyReviewDate": "2004-10-11 00:00:00",
              "ContractorSafetyEvalDate": "2009-10-19 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 69798,
                  "PreventionProgram3ID": 47864,
                  "ProcessChemicalID": 108382
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 55985,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2005-04-01 00:00:00",
    "ERTrainingDate": "2009-10-15 00:00:00",
    "CoordinatingAgencyName": "Burbank Fire Department",
    "CoordinatingAgencyPhone": "8182383473",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55985,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe City of Burbank Water & Power has a corporate structure to assist the Water Division with compliance issues associated with release prevention and safety issues.  The Water Division is committed to providing a safe work environment for its employees.  Water Supervisor is tasked with the implementation of the safety programs and policies at the Valley Pumping Plant.  In addition, the Division has an Accident Review Committee that is responsible for reviewing all incidents and near misses that occur at the facilities.  This group is responsible for collecting all necessary information from employees (and contractors as necessary) regarding a reported incident through interview sessions.  Following the data collection, the Accident Review Committee will meet to hypothesize potential causes and develop mitigation measures to prevent future occurrences.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe City of Burbank Valley Pumping Plant is located at 2030 North Hollywood Way in Burbank, California 91505.  The ammonia system and the chlorine system were constructed in accordance with all applicable federal, state, and local regulations.  The facility is surrounded by chain link fence with access through several gates.  Visitors are permitted to enter the facility by checking in with the operations personnel.  A maximum five one-ton containers and three 150-pound cylinders (10,450 pounds) of chlorine is maintained on site.  A maximum of 4,480 pounds of ammonia is maintained on site within two tanks.\n\nThe City of Burbank Valley Pumping Plant disinfection process consists of treating up to 9,000 gallons per minute of pre-treated groundwater from the San Fernando Valley groundwater basin at the North Hollywood Area Superfund site.  The process consists of injecting chlorine and ammonia into the pre-treated groundwater supply.  \n\nChlorine System:\n\nThe chlorine system is operated under vacuum conditions.  Gaseou"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55985,
      "SummaryText": "s chlorine stored in one-ton containers in the chlorine storage room is metered and added to potable supply water in the chlorine feed room using two chlorinators and two injectors, respectively.  The resulting chlorine solution is added to the influent groundwater in a diffuser vault prior to the five million gallon reservoir (forebay) for primary disinfection.  The forebay is used to provide the required chlorine contact time for primary disinfection by free chlorination.\n\nIn the chlorine storage room at the Valley Pumping Plant, two one-ton chlorine containers are maintained on-line.  An automatic switchover valve allows only one of the containers; it opens supply chlorine from the other container.  All empty tanks connected to the manifold are replaced with a full tank from the storage area.  This replacement is done by City of Burbank operators using a monorail hoist.\n\nWhile connected to the system, two one-ton containers are placed on a scale to allow City of Burbank operators to plan the change out procedure.  Each one-ton container is positioned so that the valves are vertically aligned.  The vacuum regulator/heater assembly is placed on the top container valve to ensure that chlorine gas is pulled from the container.  The vacuum created at the injector(s) produces the necessary vacuum to operate the vacuum regulators in the chlorine distribution system.  The heater is used to ensure that gaseous chlorine does not condense.\n\nThe chlorine gas is pulled from the one-ton container to the chlorinators through the vacuum regulator.  The chlorinators are equipped with rotameters to control the flow of the chlorine gas.  After the chlorinator, the chlorine is injected (by the injector) into the water line to create a chlorine solution.\n\nDetectors in the storage and feed rooms indicate chlorine gas leaks.  The disinfection building is also equipped with an automatic emergency chlorine scrubber system that is capable of neutralizing more than 400 pounds of chlorine v"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55985,
      "SummaryText": "apor (the equivalent of a complete one-ton container failure with an average 20 percent flash-off rate).\n\nThe 150-pound cylinders (3 total) are stored on-site for use at the GAC Unit, Reservoir 5, and/or Palm Avenue Pumpling Station when necessary.\n\nAmmonia System:\n\nAmmonia stored in two 2,240 pound storage vessels in the ammonia storage room is metered and added to potable supply water (soft water required) in the ammonia feed room using two ammoniators and two injectors, respectively.\n\nThe resulting ammonia solution is added to the chlorinated water from the forebay in a diffuser vault in the pipeline from the forebay to the booster station.  The ammonia reacts with chlorine almost instantaneously to form the monochloramines required to meet the water distribution system residuals.  A potable water softening system is located in the water softener room north of the ammonia feed room.\n\nThe ammonia system is vacuum operated.  The vacuum created at the injector(s) produces the necessary vacuum to operate the vacuum regulators on the ammonia distribution system.  Detectors in each of the storage and feed rooms indicate possible ammonia gas leaks.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe City of Burbank ammonia system and chlorine system have many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the City of Burbank facility operates in accordance with OSHA¿s Process Safety Management regulation and the California Accidental Release Prevention (CalARP) Program.\n\nThe pumping plant operating schedule is 9 hours per day, 7 days per week, with at least two (2) employees assigned to each shift.  The disinfection operation at the facility operates 24 hours a day, seven days per week.  The Valley Pumping Plant maintains tight control of its ammonia and chlorine systems through various process controls and monitors.  \n\nChlorine System:\n\nI"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 55985,
      "SummaryText": "ed to minimize potential releases of chlorine and ammonia.  There are several types of equipment status indicators throughout the facility: pressure, temperature, level, vacuum, etc.  These indicators monitor the status of the different devices.  Some status indicators send an alarm to the control panel, others trigger another device to start up or shut off, and some are remote indicators that are monitored on a routine basis during operations.\n\nThree (3) ammonia leak detectors are operated on 120-volt AC, 60 Hz, 5A power supply.  The detectors are located on the west wall of the ammonia storage room and on the south wall of the ammonia feed room.  Both ammonia leak detectors are electrochemical to detect and provide warning of the presence of ammonia gas in the air.  The detectors are sensitive to ammonia gas at concentrations of 20 ppm by volume, and have double pole, double throw (DPDT) alarm contacts.  During an alarm condition in the ammonia feed room or the ammonia storage room, the leak detectors initiate the following actions: 1) a red alarm light within the detector, 2) activate the alarm system.\n\nIn addition, common industry standards, policies, and procedures are utilized to ensure safe practices are being performed.\n\nFIVE YEAR ACCIDENT HISTORY\n\nAt the time of the Process Hazard Analysis Revalidation conducted on September 30, 2009, it was verified that there have been no significant release of chlorine or ammonia that exceeded the applicable Federal Reportable Quantity of 10 pounds and 100 pounds, respectively, at the Valley Pumping Plant, Reservoir #5, the GAC Unit, and the Palm Avenue Pumping Station over the past five years (September 2004 to September 2009) or the California threshold of ¿any significant¿ release. In addition, there have been no injuries resulting from a chlorine or ammonia release.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe City of Burbank Water and Power-Water Division (City of Burbank) facility has an emergency action plan in effect.  The E"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 55985,
      "SummaryText": "mergency Action Plan (Plan) is detailed in the Emergency Action Plan Manual, which is maintained at the facility and updated as necessary.  This Plan was designed to meet the following objectives:\n\n1. To save lives.\n2. To minimize and avoid injuries.\n3. To protect the environment.\n4. To minimize property damage\n\nCity of Burbank maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, chlorine health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes due to the renovation of the facility.\n\nCity of Burbank has coordinated emergency response efforts with the local fire department.  In the case of a chlorine-related emergency, it is the policy of City of Burbank to evacuate and to allow the fire department and/or the chemical supplier to respond to the emergency (potentially with the assistance of trained facility personnel).\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe City of Burbank Water and Power ¿ Water Division conducted a Process Hazard Analysis Revalidation (September 30, 2009) and a PSM/RMP Compliance Audit (October 19, 2009).  Both studies resulted in minor procedural modification to ensure safe operation.  These modifications are currently being implemented with an expected date of completion being September 30, 2010 and October 19, 2010 for the PHA Revalidation and the Compliance Audit, respectively.  The Water Supervisor is responsible for ensuring that these recommendations are implemented.\n\nThe Process Safety Management team is planning to complete several items over the next year as their continued effort to provide a safe work environment for t"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 55985,
      "SummaryText": "he City employees.  These changes include the following items:\n\n1. Continue to train all employees in Process Safety Management and the facility Safety Plan/Programs.\n\n2. Continue to have employee involvement in Safety Plan Development.\n\n3. Continue employee involvement through safety team participation.\n\n4. Continue internal and external safety audits/inspections and implement changes as needed."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 55985,
      "SummaryText": "n the event that the primary engineering or administration controls at the facility fail and result in a release of chlorine, there are three mechanisms in the plant to minimize the impact:  1) chlorine sensors/detectors, 2) alarms, and 3) emergency chlorine scrubber system.  The chlorine sensors that trigger audible and visual alarms at a chlorine concentration of 1 ppm are located in the chlorine storage room and the chlorinator room.  Once a chlorine concentration of 3 ppm is detected by the sensors, the chlorine scrubber system is activated which neutralizes gaseous chlorine in the room resulting in a lower chlorine concentration, and an off-site alarm company will alert the local fire department via telephone.\n\nThe emergency chlorine scrubber is located outside and east of the chlorine storage room.  The system is designed to achieve a flow rate of 3,000 cubic feet per minute and is capable of completely neutralizing more than 400 pounds of chlorine vapor on a once-through basis (equivalent to a complete ton container failure with an average 20% flash off rate).  The scrubber design requirements are based on the Uniform Fire Code (UFC), which allows for a maximum concentration of chlorine in the scrubber exhaust for 10 parts per million (ppm).\n\nFuse plugs serve as safety relief for one-ton containers.  There are three fuse plugs on each end of the one-ton containers for a total of six.  They are designed to melt, relieving pressure, in the event that the temperature reaches 156-164oF.\n\nAmmonia System:\n\nThe Valley Pumping Plant is designed to safely and efficiently treat groundwater.   The ammonia system process takes place in several rooms.  The ammonia storage room safety device consists of a leak detector on the interior wall, a panic button on the interior wall at each exit, and an alarm panel.  The ammonia feed room has a leak detector on the interior wall, and an alarm panel.\n\nThe disinfection facility is equipped with an alarm and monitoring system intend"
    }
  ]
}