{
  "FacilityID": 56100,
  "FacilityName": "Caddo Port Dehy Facility",
  "FacilityStr1": "Leonard Road",
  "FacilityStr2": null,
  "FacilityCity": "Shreveport",
  "FacilityState": "LA",
  "FacilityZipCode": "71115",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22017",
  "LEPC": "Caddo-Bossier LEPC",
  "FacilityLatDecDegs": "32.378333",
  "FacilityLongDecDegs": "-093.666389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "J-W Operating Company",
  "OperatorStr1": "P.O. Box 8488",
  "OperatorStr2": null,
  "OperatorCity": "Longview",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75607",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000207652",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-08-09 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-12-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-12-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-12-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2013-08-21 00:00:00",
  "DeRegistrationEffectiveDate": "2013-08-01 00:00:00",
  "AnniversaryDate": "2014-05-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 32.378333,
  "FRS_Long": -93.666389,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": null,
  "HorizontalAccMeasure": "12.5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C06",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 81628,
      "AltID": "J-T Unit",
      "FacilityID": 56100,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 108564,
          "ProcessID": 81628,
          "ChemicalID": 155,
          "Quantity": 66120.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 97086,
              "ProcessChemicalID": 108564,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 97087,
              "ProcessChemicalID": 108564,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 97088,
              "ProcessChemicalID": 108564,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 97089,
              "ProcessChemicalID": 108564,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 97090,
              "ProcessChemicalID": 108564,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 97091,
              "ProcessChemicalID": 108564,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 97092,
              "ProcessChemicalID": 108564,
              "ChemicalID": 115
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 83611,
          "ProcessID": 81628,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 29790,
              "Process_NAICS_ID": 83611,
              "SafetyReviewDate": "2008-12-03 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2008-12-03 00:00:00",
              "ChangeCompletionDate": "2010-02-28 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-12-03 00:00:00",
              "TrainingReviewDate": "2009-02-25 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-12-03 00:00:00",
              "EquipmentInspectionDate": "2009-02-28 00:00:00",
              "EquipmentTested": "dehydrator and tanks",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 31126,
                  "PreventionProgram2ID": 29790,
                  "ProcessChemicalID": 108564
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 56100,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Caddo-Bossier LEPC",
    "CoordinatingAgencyPhone": "3184255351",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 56100,
      "SummaryText": "Executive Summary\n\nCADDO PORT DEHY FACILITY RISK MANAGEMENT PLAN:  EXECUTIVE SUMMARY\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nJ-W Operating Company (J-W) has a long-standing commitment to workers and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of the facility¿s processes.  The J-W policy is to implement reasonable controls to prevent foreseeable releases of substances.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nJ-W operates the Caddo Port Dehy Facility located in Caddo Parish, Louisiana.  The Caddo Port Dehy Facility is a natural gas processing plant that produces liquefied petroleum gas (LPG) by Joule-Thompson separation with water removal by glycol dehydration.  The LPG, a mixture of methane, ethane, propane, butanes, pentanes, hexanes, and C6+ compounds, is stored in a pressurized bullet tank for transportation by truck.  As evidenced in the ensuing text and based on criteria outlined in the Accidental Release Prevention (ARP) Program, the Caddo Port Dehy Facility is a Program 2 RMP process.\n\nOperations at the Caddo Port Dehy Facility were evaluated to determine if any regulated flammable or toxic substances were present in the process and if they exceeded the threshold quantity.  All equipment and vessels are considered to be connected and/or co-located; consequently, for the purposes of the ARP Program, all equipment and vessels are part of a single process.  The identification of even a single vessel exceeding threshold quantities of a regulated flammable or toxic substance would subject a process to threshold determination for offsite consequence analysis.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe Caddo Port Dehy Facility has not had any accidental releases in the past five years that meet the criteria of an accidental release as defined in 40 CFR 68.42.\n\nGENERAL ACCIDENTAL REL"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 56100,
      "SummaryText": "EASE PREVENTION PROGRAM\n\nThe following is a summary of the accident prevention program in place at the Caddo Port Dehy Facility:  \n\nEmployee Participation\n\nJ-W actively encourages all employees and contract employees to participate in creating a safe work environment.   This participation begins with well-established mechanisms of communication with all employees regarding covered process information.  Employees are involved in maintaining RMP rule compliance based on their knowledge, skill, job responsibilities, and experience.  \n\nProcess Safety Information \n\nJ-W maintains written information intended to provide a foundation for identifying and understanding the process hazards.  This information addresses chemical properties, inventories, and associated hazards, as well as key process parameter limits and equipment design basis/configuration information.    \n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in the material safety data sheets (MSDSs).  In addition, J-W has documented safety-related limits for specific process parameters and ensures limit maintenance by using highly trained personnel, process controls, and monitoring and protective instrument systems.\n\nHazard Review and Analysis\n\nJ-W has a comprehensive program to ensure that hazards associated with the process are identified and controlled.  Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\nJ-W primarily uses the ¿What-if¿ method to perform these evaluations.  The Hazard Review is conducted by persons knowledgeable about the process.  Based on the answers to the questions, consequences and preliminary recommendations can be determined.\n\nThe Hazard Review findings are promptly and systematically addressed.  J-W assures that the recommendations are documented and resolved in a timely manner. This documentation includes t"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 56100,
      "SummaryText": "des those knowledgeable in the process, operations personnel, and at least one person trained in audit techniques and practices.  The audit team develops findings and corrective actions which are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nJ-W is committed to operating the Caddo Port Dehy Facility in a safe manner for workers, the public, and the environment.  When major changes to the process take place, J-W will update operating procedures and train operators on the new equipment.  J-W will also conduct compliance audits and hazard reviews as required and make improvements to safety based on findings of the audits and reviews."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 56100,
      "SummaryText": "he actions to be taken and a written schedule of completion dates.   All Hazard Review findings are communicated with J-W employees and contractors that may be affected. \n\nTo help ensure that the process controls and/or process hazards do not eventually deviate from the original design safety features, the plant periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted at least every five years by the Hazard Review team.  \n\nOperating Procedures\n\nJ-W maintains written procedures that address various modes of process operations, such as (1) initial startup, (2) normal startup, (3) normal operations, (4) temporary operations, (5) normal shutdown, (6) emergency shutdown and operations, and (7) startup following a normal or emergency shutdown.  These procedures can be used as a reference by experienced operators and provide a consistent training basis for new operators. Operating procedures are periodically reviewed and certified as current.  When a process change occurs, operating procedures are revised as necessary. \n\nTraining\n\nTo complement the written process operating procedures, J-W has implemented a comprehensive training program for all employees. New employees receive job specific basic training in plant operations. Employee training includes emphasis on safety and health hazards, emergency shutdown operations, and safe work practices. Operators demonstrating adequate knowledge to safely perform duties and tasks are allowed to work independently.\n\nMechanical Integrity\n\nJ-W has well-established programs, procedures and practices that are required to ensure that equipment used to process, store, or handle flammable material is designed, constructed, installed, and maintained to minimize the risk of a release. Equipment examples include vessels, storage tanks, piping systems, and relief and vent systems with associated emergency shutdown systems and controls (i.e., monitoring devices, sensors, alarms, and interlocks)."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 56100,
      "SummaryText": "Maintenance personnel receive training on (1) an overview of the process, (2) a review of the process hazards, and (3) the procedures applicable to the employee¿s job tasks to ensure that the employees can perform the job tasks in a safe and satisfactory manner.  Process equipment inspection and testing follows recognized and generally accepted good engineering practices.  Equipment deficiencies that are outside of acceptable limits are corrected before further use or in a safe and timely manner when necessary means are taken to ensure safe operation.\n\nIncident Investigation\n\nJ-W promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, major property damage, environmental loss, or personal injury.  An incident investigation is initiated as promptly as possible to thoroughly investigate and analyze the incident.  This investigation is led by an incident investigation team consisting of those with appropriate knowledge and experience in the process.  The findings and recommendations made by the incident investigation team are promptly addressed and resolved in a timely manner. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings. \n\nEmergency Planning and Response\n\nEmergency Response activities for this facility are coordinated with the Local Emergency Planning Committee (LEPC).  In the case of an accidental release, the J-W employee will activate the emergency shutdown system if possible and evacuate upwind of the release.  They will immediately notify the local fire department who will then respond to the emergency.\n\nCompliance Audits\n\nTo ensure that the accident prevention program is functioning properly, J-W periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  The audit team inclu"
    }
  ]
}