{
  "FacilityID": 5614,
  "FacilityName": "Huntsville Regional Water Supply System",
  "FacilityStr1": "188 Wallace Road",
  "FacilityStr2": "PO Box 1635",
  "FacilityCity": "Huntsville",
  "FacilityState": "TX",
  "FacilityZipCode": "77342",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48471",
  "LEPC": "Walker County LEPC",
  "FacilityLatDecDegs": "30.837222",
  "FacilityLongDecDegs": "95.546111",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "trinity@trinityra.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Trinity River Authority of Texas",
  "Company2Name": null,
  "CompanyDUNS": 43810290,
  "Company2DUNS": 0,
  "OperatorName": "Trinity River Authority of Texas",
  "OperatorStr1": "188 Wallace Road",
  "OperatorStr2": "PO Box 1635",
  "OperatorCity": "Huntsville",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77342",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dewayne Coburn",
  "RMPTitle": "Mgr., So. Region Support Services",
  "FTE": 8,
  "OtherEPAFacilityID": "n/a",
  "EPAFacilityID": "100000071316",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-01 00:00:00",
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 30.8371,
  "FRS_Long": -95.5195,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6708,
      "AltID": "Water Supply",
      "FacilityID": 5614,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 6864,
          "ProcessID": 6708,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 7318,
          "ProcessID": 6708,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 507318,
          "ProcessID": 6708,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5614,
      "SummaryText": "The Trinity River Authority of Texas (TRA) is a political subdivision charged by legislative mandate with three functions.  These include the maintenance of a Master Plan for basin-wide development, serve as a local sponsor for federal water projects and provide services authorized by the Texas Legislature within TRA's defined territory that include all or part of seventeen counties encompassing approximately 17,500 square miles.\n\nPublic services currently provided and/or being developed by the Authority include wastewater treatment, water treatment, water supply, flood control, recreation and reservoir facilities.  The Authority also serves as a conduit for tax exempt financing for municipal water and wastewater facilities and industrial air and water pollutiion control facilities.  Each operation and/or financing endeavor is an independent financial entity.  On a functional basis, the Authority operates as a governmental utility, receives no direct tax revenues or revenue sharing and is compensated for services rendered.\n\nPerhaps our greatest impact to the general public is our ownership and operation of several large water and wastewater treatment facilities.  We provide essential services to a significant portion of the public in the Dallas/Fort Worth metropolitan area and to several cities around Lake Livingston.  As the operator of these facilities, it is our duty to inform the public about efforts to prevent and, if necessary respond if a hazardous substance were inadvertently released from one of our treatment facilities.  There are other operators of water utilities in these regions who have an interest in the same risk management issues.\n\nThe Trinity River Authority of Texas (TRA) Huntsville Regional Water Supply System (HRWSS) began delivering treated water to the City of Huntsville in September of 1980.  This system, located north of Huntsville, provides service to a population of approximately 35,000 people.  Raw water for this project is supplied from "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5614,
      "SummaryText": "nearby 90,000 surface acre Lake Livingston.  The treatment process involves the usage of chemical additions to supplement mechanical procedures resulting in clear, clean, safe drinking water.  Chlorine is used for disinfection.  The facility has a peak design capacity of eight million gallons per day and is designed to allow for expansion as needed.  The facility provides quality drinking water of a standard that meets or exceeds all state and federal regulations.\n\nAs a result of new federal guidelines, 40 CRF Part 68, Accidental Release Prevention Program (ARPP), the HRWSS is required to develop and implement a Risk Management Program (RMP) due to the amounts of chlorine that it uses in its treatment process.  In developing its RMP, HRWSS has conducted an analysis of potential off-site consequences of an accidental release including a \"worst case\" and \"alternative case\" release scenario.  In addition, the facility has compiled a five year accidental release history, a release prevention program and an emergency response program.  The HRWSS has an outstanding safety record and there have been no accidents related to covered processes in the past five years.\n\nWith respect to accident prevention program:\n*Annual training is required by all operations and maintenance employees who work in and around  hazardous chemical storage and loading areas.\n*Visual inspections of these covered processes are conducted by operations personnel on each shift\n*Sensors and alarms are in place around all process areas to detect any leakage of the hazardous chemicals.\n*Written operating procedures are continuously updated and maintained for operations personnel to use during their work routines.\n*All accidents are investigated promptly with written documentation of all findings.  These accident investigations are reviewed by management and Certified Safety Professionals to determine cause and prevention.\n*Monthly safety audits are conducted of all plant process areas including covered pro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5614,
      "SummaryText": "cess areas.  Written documentation of these monthly audits, including actions taken to correct problems, is maintained for a minimum of five years.\n*Preventative maintenance programs for covered processes are in place and a computerized records management system is in place to automatically generate reports regarding preventative maintenance needs and/or histories on all covered process equipment.\n*Project personnel on various safety issues that are pertinent to covered processes conduct monthly safety meetings.\n*Emergency Response Plans are in place to outline actions to take should an accidental release occur.  The plans have been reviewed by the local Fire Departments and Local Emergency Planning Committees.\n*These above procedures have resulted in a greater awareness of operation limits and emergencies and have resulted in a much safer work place thereby benefiting employees and the general public."
    }
  ]
}