{
  "FacilityID": 5625,
  "FacilityName": "White River Water Treatment Plant",
  "FacilityStr1": "950 W. 16th Street",
  "FacilityStr2": null,
  "FacilityCity": "Indianapolis",
  "FacilityState": "IN",
  "FacilityZipCode": "46202",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18097",
  "LEPC": "Marion County LEPC",
  "FacilityLatDecDegs": "39.789472",
  "FacilityLongDecDegs": "-86.172306",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6938351,
  "ParentCompanyName": "Indianapolis Water Company",
  "Company2Name": "NiSource, Inc.",
  "CompanyDUNS": 6938351,
  "Company2DUNS": null,
  "OperatorName": "Indianapolis Water Company",
  "OperatorStr1": "1220 Waterway Blvd. P.O. Box 1220",
  "OperatorStr2": null,
  "OperatorCity": "Indianapolis",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46206",
  "OperatorZipCodeExt": null,
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000072654",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-09-30 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2003-10-27 00:00:00",
  "DeRegistrationEffectiveDate": "2003-08-01 00:00:00",
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.78872,
  "FRS_Long": -86.17731,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6720,
      "AltID": "Chlorine Rail Car",
      "FacilityID": 5625,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 7331,
          "ProcessID": 6720,
          "ChemicalID": 62,
          "Quantity": 420000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6876,
          "ProcessID": 6720,
          "NAICSCode": "99999",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2820,
              "Process_NAICS_ID": 6876,
              "SafetyReviewDate": "1999-06-21 00:00:00",
              "PHA_Date": "1995-10-24 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-06-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-21 00:00:00",
              "TrainingReviewDate": "1995-10-29 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1995-10-30 00:00:00",
              "EquipmentInspectionDate": "1999-02-01 00:00:00",
              "EquipmentTested": "Chlorinator",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1995-11-08 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1995-11-10 00:00:00",
              "HotWorkPermitReviewDate": "1995-11-08 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1995-10-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3214,
                  "PreventionProgram3ID": 2820,
                  "ProcessChemicalID": 7331
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5625,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-03-01 00:00:00",
    "ERTrainingDate": "1999-10-01 00:00:00",
    "CoordinatingAgencyName": "Indianapolis Fire Department",
    "CoordinatingAgencyPhone": "3173276073",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5625,
      "SummaryText": "Introduction\n\nUSEPA's RMP rule (40 CFR 68), published in the Federal Register on June 20, 1996, was developed to assist facilities in preventing accidental releases of highly toxic or flammable chemicals.  The RMP rule applies to an owner or operator of a stationary source that has more than a threshold quantity of a regulated substance in a process, as determined under '68.115.\n\nThe USEPA has established three tiers of requirements to reduce the level of effort for facilities with a lower risk of offsite impacts.  These tiers are known as Programs 1, 2, and 3.  Program 1 applies to any process that has not had an accidental release with prescribed offsite consequences for five years and has no public receptors impacted by a worst-case release.  Program 3 applies to processes in specified industries, and to all processes subject to the OSHA Process Safety Management (PSM) standard, unless the process is eligible for Program 1.  Program 2 applies to processes not covered by Programs 1 or 3.\n\nThe Indianapolis Water Company's White River WTP utilizes more than the threshold quantity of chlorine (2,500 pounds) in their process.  Therefore, this facility is required to submit a Risk Management Plan (RMP) as defined in '68.150 by June 21, 1999 (three years after publication of the final rule). Since public employees are covered under the state-delegated OSHA program, the White River WTP is subject to the OSHA PSM standard and is therefore subject to Program 3 requirements.  \n\nUSEPA's RMP rule requires that covered facilities prepare an executive summary.  The following pages represent the executive summary, summarizing the items required as described in 68.155 (a) through (g).\n\n'68.155(a) Accidental Release and Emergency Response Policies\n\nThe Indianapolis Water Company has documented emergency response procedures contained in their Emergency Response Plan.  The Emergency Response Plan has been endorsed by the officials at the highest level of the Indianapolis Water Compa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5625,
      "SummaryText": "ny.  The Indianapolis Water Company maintains a staff specifically trained to handle chlorine safely and respond to minor releases.  In the case of a potentially major release, the Indianapolis Water Company will rely on the hazardous materials responders from the Indianapolis Fire Department.  The White River WTP operators coordinate with the local fire department once a year to perform an inspection of the chlorine facilities. An operator is located at the facility 24 hours a day, ready to respond to emergencies.  All personnel involved in handling chlorine are trained on chlorine safety and accident prevention.\n\n'68.155(b) Stationary Source and Substance Handled\n\nThe stationary source subject to 40 CFR Part 68 is the Indianapolis Water Company's White River WTP.  The White River WTP is a 96-mgd facility.  The facility uses 90-ton and 30-ton railcars for storage of chlorine.  Liquid chlorine from the railcars is piped to evaporators and chlorinators in the chlorine room through 1-inch piping.  The facility typically has one 90-ton railcar connected to the evaporators/chlorinators, with the standby car also connected to the chlorinators for backup purposes.  At times, the facility also has a second 90-ton railcar located at the site ready for use when the other 90-ton railcar is is empty.\n\nThe White River WTP is equipped with many safety devices to prevent a release and decrease response time in the unlikely event of a chlorine leak.  Chlorine leak detectors are located near the rail cars and in the chlorine room.  Audible alarms automatically sound inside the building when chlorine levels reach one part per million (ppm), allowing safety personnel time to respond to emergencies.  The chlorine rail car liquid lines are equipped with excess flow check valves which close when the chlorine flow from the rail car exceeds a certain level (15,000 pounds per hour).  Also, there are low pressure alarms for the chlorine feed.  An operator is located at the facility 24 hours"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5625,
      "SummaryText": "a day, ready to respond to emergencies.\n\n'68.155(c) Offsite Consequence Analysis\n\nThe worst-case release scenario was determined in accordance with the requirements provided in 40 CFR 68.22 and 40 CFR 68.25(b,c).  For the White River WTP, the worst-case scenario is a release from one of the 90-ton rail cars (greatest amount held in a single vessel) of chlorine. It is assumed that the container ruptures and its contents escape to the ground in 10 minutes.  The worst-case scenario requires a ground level release height.  It was assumed that the release occured outside, and no mitigation measures were incorporated into the evaluation.   The reference tables in the USEPA RMP Guidance for Wastewater Treatment Plants were used to determine the toxic endpoint for the worst case scenario.  The toxic endpoint distance indicated that residental areas, parks, and schools could be impacted by a catastrophic release.\n\nThe White River WTP is also required to complete at least one alternative release scenario.  The alternative release scenario considered was completed in accordance with the guidelines provided in 40 CFR 68.22 and 40 CFR 68.28.  The alternative release scenario selected (the one with most signifcant off-site consequences) was that of a 1/2-inch diameter  hole in the piping from the railcar.  This release could result from vehicular contact with the piping, corrosion of the piping, or improper connection of piping.  As with the worst case scenario, the reference tables in USEPA's RMP Guidance for Wastewater Treatment Plants was used to determine the toxic endpoint, and the resulting toxic endpoint predicted potential off-site impacts.  \n\n'68.155(d) Accidental Release Prevention Program\n\nThe White River WTP has a documented Prevention Program for the chlorine systems that documents release prevention measures.  These prevention measures include elements such as employee participation, process safety information, process hazard analysis, operating procedures, trainin"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5625,
      "SummaryText": "g, contractors, pre-startup review, mechanical integrity, hot work permits, management of change, incident investigation, and compliance audits.  \n\nThe White River WTP is equipped with many safety devices to prevent a chlorine release and decrease response time in the unlikely event of a chlorine leak.  Chlorine leak detectors are located near the rail cars and in the chlorine container storage room.  Audible alarms automatically sound inside the building when a chlorine release occurs.  The chlorine rail car is equipped with excess flow check valves which close when the chlorine flow from the rail car exceeds a certain level.  Also, White River employees involved in chlorine operations are trained in specific procedures regarding handling and storage of chlorine at the facility.\n\n'68.155(e) Five-Year Accident History\n\nThe Indianapolis Water Company's White River WTP has had no accidental releases of chlorine in the last five years that have resulted in on-site injuries, off-site injuries, or other impacts.  Available records indicate that there have been no accidental releases of chlorine from the White River WTP that have resulted in on-site deaths, off-site injuries, or other impacts since the facility began using chlorine in approximately 1920.\n\n'68.155(f) Emergency Response Program\n\nThe White River WTP operators coordinate with the local fire department once a year to perform an inspection of the chlorine facilities. An operator is located at the facility 24 hours a day, ready to respond to emergencies.  All personnel involved in handling chlorine are trained on chlorine safety and accident prevention.\n\n'68.155(g) Safety Improvements\n\nRecommendations for safety improvements were identified in the Process Hazard Analysis (PHA) which was completed per OSHA 29 CFR 1910.119(e) in November of 1995 by Battelle.  The Indianapolis Water Company has elected to voluntarily convert from the use of gaseous chlorine to sodium hypochlorite.  Sodium hypochlorite poses less th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5625,
      "SummaryText": "reats to the surrounding community that gaseous chlorine and is not covered the 112(r) Risk Management Program Rule.  It is anticipated that the conversion to sodium hypochlorite at the White River WTP will be complete by June of 2004."
    }
  ]
}