{
  "FacilityID": 5710,
  "FacilityName": "Town of Gilbert Water Treatment Plant",
  "FacilityStr1": "2865 East Guadalupe Road",
  "FacilityStr2": null,
  "FacilityCity": "Gilbert",
  "FacilityState": "AZ",
  "FacilityZipCode": "85234",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.363611",
  "FacilityLongDecDegs": "-111.728056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 602956920,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Gene Schmidt",
  "OperatorStr1": "2865 East Guadalupe Road",
  "OperatorStr2": null,
  "OperatorCity": "Gilbert",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85234",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000074929",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-03-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-01-24 00:00:00",
  "DeRegistrationEffectiveDate": "2018-12-03 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.36465,
  "FRS_Long": -111.73032,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6816,
      "AltID": "Water Disinfection",
      "FacilityID": 5710,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 7441,
          "ProcessID": 6816,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6972,
          "ProcessID": 6816,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2864,
              "Process_NAICS_ID": 6972,
              "SafetyReviewDate": "1999-05-17 00:00:00",
              "PHA_Date": "1999-05-18 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-17 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Revisions to preventive maintenance tasks, rotation of emergency equipment",
              "OpProceduresReviewDate": "1999-06-10 00:00:00",
              "TrainingReviewDate": "1999-06-10 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-18 00:00:00",
              "EquipmentInspectionDate": "1999-06-17 00:00:00",
              "EquipmentTested": "Electronic scale, cylinder feed lines, vacuum regulator",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-17 00:00:00",
              "PreStartupReviewDate": "1999-06-17 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-04 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-04 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-10 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3265,
                  "PreventionProgram3ID": 2864,
                  "ProcessChemicalID": 7441
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5710,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Maricopa County LEPC",
    "CoordinatingAgencyPhone": "6022731411",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5710,
      "SummaryText": "\nIntroduction\n\nThe Town of Gilbert Water Treatment Plant (WTP) was made operational in March of 1997.  The 15 million gallon-per-day facility is designed to treat both Salt River Project (SRP) and Central Arizona Project (CAP) water delivered though the SRP canal system.  The WTP uses chlorine to both treat and disinfect the water to ensure compliance with Federal and State drinking water standards.  The amount of chlorine stored at the facility is normally greater than the threshold quantity of 2,500 pounds listed in the Accidental Release Prevention Program regulations.  Chlorine is the only compound at the facility that is present in amounts greater than the threshold quantity.   One-ton cylinders of chlorine are stored and used in the WTP's Disinfection Building.  There have been no accidental releases of chlorine since the facility started operations in March of 1997.\n\nAccidental Release Scenarios\n\nTwo Accidental Release Scenarios were performed using the SLAB and Industrial Source Complex (ISC3) Air Dispersion Models.  These models follow Environmental Protection Agency (EPA) guidelines. \n\nWorst-Case Release Scenario.  The worst-case release scenario consists of a rapid liquid chlorine discharge.  This discharge would be a direct result of a ruptured one-ton cylinder.  Because the chlorination equipment is enclosed within a specially designed building and chlorine cylinders are delivered directly into the building, the worst-case release scenario incorporates a passive mitigation factor into the worst-case chlorine release.  The passive mitigation factor establishes the exterior emission rate equal to 55% of the interior container release rate.  \n\nThe SLAB model for the WTP uses a distance of 3.3 miles as the maximum downwind distance to the toxic endpoint of chlorine to predict a circular impact zone.  Per the EPA's RMP Off-Site Consequence Analysis Guidance, no existing active mitigation factors at the WTP were considered in the development of the worst-case"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5710,
      "SummaryText": " release scenario.  The impact area predicted in this scenario is misleading.  Since the development of the worst-case release scenario, the EPA has revised the maximum downwind distance for a chlorine release to 1.3 miles.  If the current EPA parameter were applied, the impact zone would be significantly reduced.  In addition, the actual area of the impact would occur in a plume relative to wind direction within the impact zone, and would not affect the entire circular area.\n\nWorst-case release scenarios are highly improbable as they assume that the total quantity of a one-ton chlorine cylinder is quickly released, atmospheric conditions will maximize the effect of the event, and no response actions are taken.  In addition, worst-case release scenarios do not incorporate the existence of several active mitigation factors at the WTP.  All factors play an important role in the detection and impact reduction of a chlorine leak.  \n\nTwo of the most significant active mitigation factors are the continuous operation of a chlorine leak detector and an emergency scrubber system.  The first, the chlorine leak detector, is located in the Disinfection Building, approximately twenty feet from the chlorine cylinders in service.  If chlorine is detected at concentrations greater than 0.5 parts per million (ppm), an alarm is initiated, and sent to a central monitoring computer located in the WTP Control Room.  The alarm is enunciated on the computer screen and is subsequently sent to the operator that is on-shift.  \n\nThe chlorine leak detector alarm initiates the emergency scrubber system with a 3,000 cubic feet-per-minute suction fan drawing air from the floor level of the Disinfection Building.  Outside air is drawn into the building from vents located in the ceiling, and maintains negative pressure in the building during chlorine scrubber operation.  An injection of caustic soda (NaOH) solution into the scrubber circulation loop enhances a reaction of chlorine and caustic soda "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5710,
      "SummaryText": "to reduce chlorine scrubber discharge concentrations to no greater than 15 ppm of chlorine.  Scrubber operation and alarms continue until less than 1 ppm is detected in the storage area, when the system can be manually reset.\n\nAlternative-Release Scenario.  Alternative release scenarios are based on more credible, reliable factors.  To perform the WTP's alternative release scenario, a process hazard review was conducted to identify potential causative factors.  The alternative release scenario was then based on the most likely type of event to occur.  The event selected was a chlorine release due to a rupturing of the flexible aluminum tubing which connects the one-ton cylinder to the chlorine feeder manifold.  The two mitigation measures considered in the development of the alternative release scenario were:  (1) the capture of chlorine through the Disinfection Building's emergency scrubber system; and (2) the enclosure of the chlorine cylinders in the Disinfection Building at all times.  \n\nAn important finding in the analysis of a candidate alternative release scenario is that all off-site consequences are avoided when existing active mitigation factors present at the WTP operate as intended.  If a chlorine release is contained within the Disinfection Building and the chlorine is neutralized by the emergency scrubber system to a concentration of 15 ppm, then no off-site areas would experience chlorine concentrations above the toxic endpoint threshold.  For this reason, the compounded factors of a plumbing failure release and scrubber pump failure were needed to develop an alternative scenario having significant off-site consequences, per the EPA's regulatory requirements.\n\nAccidental Release Prevention Program\n\nIn an effort to reduce the release risks associated with the disinfection of drinking water, the Town of Gilbert WTP fully complies with the Risk Management and Accidental Release Prevention Program requirements of the EPA's Risk Management Program Rule and"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5710,
      "SummaryText": " OSHA's Process Safety Management Standard.  Specific factors of the facility's Accidental Release Prevention Program are:\n\n( Advanced Technological Equipment and Facility Design.  In addition to a chlorine leak detector and an emergency scrubber system, the WTP uses relief valves, 24-hour staffing, a centralized computer monitoring system, vents, manual shutoffs, alarms (both audible and visual), an  emergency power source, and a secured, enclosed process building to minimize risk to the community. \n\n( Process Hazard Analysis (PHA).  A PHA was implemented at the facility in May of 1999 by a qualified and impartial third party, and all potential hazard risks received a ranking of four on a hazard scale of one to four (one being the greatest level of hazard). PHAs will be conducted every five years as part of the facility's accidental release prevention program, and recommendations will be assessed and implemented. \n \n( Employee Training.  Facility employees are trained in operating procedures, chlorine safety and handling, and in other issues essential to the safe operation of the Facility's chlorine equipment.\n  \n( Preventative Maintenance.  A preventative maintenance program has been established and designated individuals have been made responsible for preventative maintenance activities related to the chlorine process equipment.  Preventative maintenance and other operating procedures are reviewed every two years.  Facility employees perform daily visual inspections of the chlorine process equipment.\n   \n( Employee Involvement.  Weekly employee safety meetings are held to discuss safety issues relative to the chlorine process equipment and Facility operations in general.   \n\nEmergency Response\n\nThe facility complies with the Emergency Community Right-to Know Act (EPCRA), Section 302 and makes emergency response stakeholders aware of the quantities and locations of regulated substances that are maintained on-site.  EPCRA reports are submitted annually to the Town "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5710,
      "SummaryText": "of Gilbert Fire Department, the Maricopa County Local Environmental Planning Committee (LEPC) and the Arizona State Emergency Response Commission (SERC).  An emergency response plan survey has been submitted to the LEPC and the facility is part of the LEPC's community response plan. \n\nThe facility has an Emergency Action Plan as required by 29 CFR 1910.38, and an Emergency Response Plan as it pertains to incidental releases that are controlled by employees in the immediate release area.  Facility employees do not respond to releases of chlorine at the facility that pose an immediate safety or health hazard.  In addition to notifying the LEPC in an emergency, the WTP has coordinated emergency response arrangements with the Fire Department, the chlorine vendor and distributor, and an emergency response contractor."
    }
  ]
}