{
  "FacilityID": 5723,
  "FacilityName": "Naval Station Energy Facility",
  "FacilityStr1": "Building 3427",
  "FacilityStr2": "Surface Navy Boulevard",
  "FacilityCity": "San Diego",
  "FacilityState": "CA",
  "FacilityZipCode": "92136",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06073",
  "LEPC": null,
  "FacilityLatDecDegs": "32.666667",
  "FacilityLongDecDegs": "-117.116667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Applied Energy, Inc.",
  "Company2Name": "Sithe Energies, Inc.",
  "CompanyDUNS": 952574560,
  "Company2DUNS": 293039314,
  "OperatorName": "Applied Energy, Inc.",
  "OperatorStr1": "707 Broadway, Suite 500",
  "OperatorStr2": null,
  "OperatorCity": "San Diego",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92101",
  "OperatorZipCodeExt": "5378",
  "FTE": 6,
  "OtherEPAFacilityID": "CAD981575558",
  "EPAFacilityID": "100000071361",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "Not yet issued",
  "SafetyInspectionDate": "1999-04-26 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-09-12 00:00:00",
  "DeRegistrationEffectiveDate": "2018-09-06 00:00:00",
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 32.69273,
  "FRS_Long": -117.2044,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6832,
      "AltID": "SCR NOx control",
      "FacilityID": 5723,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 7459,
          "ProcessID": 6832,
          "ChemicalID": 56,
          "Quantity": 24300.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6988,
          "ProcessID": 6832,
          "NAICSCode": "22133",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2871,
              "Process_NAICS_ID": 6988,
              "SafetyReviewDate": "1999-06-14 00:00:00",
              "PHA_Date": "1994-05-12 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": "Combination of site inspection, PHA review and employee interviews to verify scenario responses (05/12/99)",
              "PHACompletionDate": "1996-10-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Continuous emissions monitoring systems analyzers",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Water deluge system",
              "OpProceduresReviewDate": "1999-06-14 00:00:00",
              "TrainingReviewDate": "1999-01-04 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "hands-on",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-14 00:00:00",
              "EquipmentInspectionDate": "1998-05-27 00:00:00",
              "EquipmentTested": "Ammonia tank",
              "ChangeMgmtDate": "1997-05-07 00:00:00",
              "ChangeMgmtReviewDate": "1994-05-12 00:00:00",
              "PreStartupReviewDate": "1994-05-12 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1994-05-12 00:00:00",
              "HotWorkPermitReviewDate": "1994-05-12 00:00:00",
              "ContractorSafetyReviewDate": "1994-05-12 00:00:00",
              "ContractorSafetyEvalDate": "1994-05-12 00:00:00",
              "CBI_Flag": 0,
              "Description": "The facility is in compliance with Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program, which provides for the identification, prevention and minimization of chemical releases that could result from failures in processes, procedures and equipment.  The major safety systems in place at the facility include process safety equipment and administrative safety procedures.  There is also a Year 2000 (Y2K) plan under implementation.\n\nProcess safety equipment means that the facility is designed and built according to accepted safety codes and standards for electrical, mechanical, and structural integrity.  AEI's process safety equipment includes a number of redundant systems, made up of local and remote indicators, sensors, and alarms that monitor operating levels, pressures and temperatures, and relay information to the facility Control Room Operator through an automated Distribution Control System. \n\nThe ammonia handling process includes relief and vent valves that can provide a margin of safety in the event of deviations from normal conditions, by allowing the operator to identify and isolate the problem and either return the system to normal conditions, or safely shut down the process.  The ammonia storage tank has a deluge system, which, in the event of a major leak or release, will activate high pressure water nozzles around the tank to quench the ammonia that is released.\n\nA number of administrative safety procedures complement the process safety equipment at the AEI facility.  These include written standard operating procedures (SOP) for all processes; twice-daily shift walkdown inspections of all major equipment, valves and alarms; extensive use of procedures checklists, such as for ammonia tank loading; and an automated preventative maintenance system for tracking daily repair work orders and scheduled maintenance operations. \n\nAn operator training program encompassing operating procedures, safety and health, and emergency response with a biennial re-qualification requirement, helps ensure that employees think, act, and work safely while on the job.\n\nIn addition to the OSHA PSM, the AEI facility complies with all federal and state emergency response and safety plan requirements, including the Hazardous Substance Control Plan (HSCP), Emergency Action Plan (EAP), Fire Prevention Plan (FPP), Exposure Control Plan (ECP), Injury and Illness Prevention Plan (IIPP), Spill Prevention, Control and Countermeasures Plan (SPCC), Hazardous Materials Business Plan (HMBP), and Risk Management and Prevention Plan (RMPP).",
              "_chemicals": [
                {
                  "PrimaryKey": 3273,
                  "PreventionProgram3ID": 2871,
                  "ProcessChemicalID": 7459
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5723,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-03-27 00:00:00",
    "ERTrainingDate": "1998-07-30 00:00:00",
    "CoordinatingAgencyName": "San Diego County Dept of Env Health",
    "CoordinatingAgencyPhone": "6193382222",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "OSHA 29 CFR 1910.252(a); 29 CFR 1910.119"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5723,
      "SummaryText": "\nSECTION 1.0\nRMP EXECUTIVE SUMMARY\n\nApplied Energy, Inc. (AEI) prepared a Risk Management and Prevention Program (RMPP) for handling anhydrous ammonia (NH3) at this facility in October 1996, and submitted the RMPP to the San Diego County Department of Environmental Health's Hazardous Materials Division (HMD) under the former California RMPP rule.  HMD approved the RMPP for this facility on January 14, 1997.  HMD granted approval for AEI to revise and update the existing RMPP and submit it as a Risk Management Plan (RMP) to U.S. EPA and HMD under the California Accidental Release Program (CalARP).  The findings and recommendations of the review have been incorporated into this RMP Public Document.  A detailed description of the purpose and scope of the revision and update are included in the CalARP Technical Supporting Records maintained at the facility.  As required by the federal EPA, this executive summary has been submitted to the EPA under the filename \"NVS_EXEC\" as a text document.  This RMP Public Document presents the efforts of AEI to manage and prevent risks associated with the storage and use of anhydrous ammonia at its cogeneration facility located at 32nd Street U.S. Naval Station (NAVSTA) in the County of San Diego, California.\n\n1.1 Accidental Release Prevention and Emergency Policy\n\nIt is the policy of Applied Energy, Inc. to protect the health and safety of its employees, officers, and the general public.  It is the firm policy of the companies of the Sithe Energies Group to fully and faithfully comply with all requirements, both substantive and reporting, of all environmental, health, and safety statues, regulations, ordinances, and permits affecting the operations and maintenance of our plants.  Applied Energy, Inc. has in place a number of plans for responding to emergency situations.  These plans are described in this RMP Public Document.\n\n1.2 Description of Regulated Process\n\nAEI operates a cogeneration facility which uses anhydrous ammonia at Na"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5723,
      "SummaryText": "val Station in the City of San Diego.  The facility is located within U.S. Navy property.  The cogeneration facility provides steam to the Navy and electricity to the electric utility company, San Diego Gas & Electric (SDG&E).  The major system components are a gas turbine generator, a heat recovery steam generator (HRSG), a steam turbine generator, and associated equipment and control systems.  The facility began commercial operations in 1989.\n\nAEI uses anhydrous ammonia (NH3) to control emissions of oxides of nitrogen (NOx) from the gas turbine exhaust at the cogeneration facility.  Anhydrous ammonia is stored in a horizontally mounted tank.  The maximum capacity of the tank is 4,500 gallons. The tank contents are limited to a maximum of 4,000 gallons (24,320 lbs.).  Annual consumption of ammonia is approximately 46,426 gallons. \n\n1.3 Release Scenarios\n\nAnhydrous ammonia is the only regulated substance at the AEI facility subject to RMP.  AEI has completed an analysis of the consequences of various accident release scenarios that would result in the uncontrolled release of ammonia to the surrounding environment.  Under the provisions of the RMP, the facility operator is required to analyze both:\n* a \"worst-case\" release scenario, and \n* one or more alternative release scenarios. \nBoth release scenarios follow the U.S. EPA documents \"Risk Management Program Guidance for Offsite Consequence Analysis\" (EPA 1999), and \"Risk Management Program Guidance for Ammonia Refrigeration\" (EPA 1998).\n\n1.3.1 Worst-Case Release Scenario\n\nThe worst-case release scenario at the AEI facility involves the complete release of the contents of the full ammonia storage tank of 4,000 gallons or 24,320 lbs. over a period of 10 minutes, with worst-case meteorology prevailing at the time of release.  The release rate is assumed to be 24,320 lbs. divided by 10 minutes, or 2,430 lbs./min.  Because the tank is located outside, no correction for passive mitigation was applied.  The ammonia is rel"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5723,
      "SummaryText": "eased as a liquid, which then flashes to a vapor as it exits the tank.  (Quantities reported in RMP*Submit have been rounded to 2 significant digits.)\n\n1.3.1.1 Distance to End Points\n\nThe toxic endpoint for ammonia is 0.14 milligrams per liter (mg/l), which is equivalent to 140 milligrams per cubic meter of air (mg/m3) or 200 parts per million by volume (ppm).  The results of this analysis indicate that the worst-case release scenario distance to the toxic endpoint is approximately 1.9 miles. \n\n1.3.1.2 Administrative Controls and Mitigation Measures\n\nAEI currently maintains a water deluge system to quench an ammonia release if an accident were to occur.  For the worst-case scenario credit can be taken for passive mitigation features (such as a physical enclosure), but not for active features (such as safety procedures or the water deluge system).  No passive mitigation measures were considered to reduce the potential offsite consequences of this worst-case release scenario.\n\n1.3.2 Alternative Release Scenario\n\nFor purposes of the alternative release scenario at the AEI facility, the release event involves the failure of a pressure relief valve (PRV) located on top of a horizontally mounted 4,500-gallon ammonia storage tank.  It is assumed that the tank is filled with 50% liquid, with the headspace filled with gas-phase ammonia.  When the failure occurs, the contents are at ambient temperature (assumed to be 70oF), which corresponds to a pressure of about 114 psig.  The total volume of gas-phase ammonia, and some of the liquid, would be released.  The calculated release rate (averaged over a minute or more) would be 35 lbs./min initially, but would fall as pressure is lost.  The release duration is assumed to last for one hour; over that time, a total of 1,280 lbs. of ammonia would be released.  (Quantities reported in RMP*Submit have been rounded to 2 significant digits.)\n\n1.3.2.1 Distance to End Points\n\nThe toxic endpoint for ammonia, which is 0.14 mg/l (140 mg/m3 "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5723,
      "SummaryText": "or 200 ppm), is the same as for the worst-case release scenario.  The results of this analysis indicate that the alternative release scenario distance to the toxic endpoint is approximately 0.074 miles (or 130 yards). (Quantities reported in RMP*Submit have been rounded to 2 significant digits.)\n\n1.3.2.2 Administrative Controls and Mitigation Measures\n\nWithin the assessment for the alternative release scenario, credit can be taken for passive, as well as active, mitigation measures, provided that the mitigation measures are capable of withstanding the event that is assumed to cause the release.  Although AEI currently maintains a water deluge system (active mitigation) to quench an ammonia release if an accident were to occur, for the analysis of the alternative release scenario, neither active nor passive mitigation measures was assumed.\n\n1.4 Accidental Release Prevention Program\n\nAs a facility constructed and operated to provide steam to the Navy and electricity to SDG&E, AEI's cogeneration facility is vital to national security and must be operated safely and efficiently. \n\nThe facility is in compliance with Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program, which provides for the identification, prevention and minimization of chemical releases that could result from failures in processes, procedures and equipment.  The major safety systems in place at the facility include process safety equipment and administrative safety procedures.  There is also a Year 2000 (Y2K) plan under implementation.\n\nProcess safety equipment means that the facility is designed and built according to accepted safety codes and standards for electrical, mechanical, and structural integrity.  AEI's process safety equipment includes a number of redundant systems, made up of local and remote indicators, sensors, and alarms that monitor operating levels, pressures and temperatures, and relay information to the facility Control Room Operator through a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5723,
      "SummaryText": "n automated Distribution Control System. \n\nThe ammonia handling process includes relief and vent valves that can provide a margin of safety in the event of deviations from normal conditions, by allowing the operator to identify and isolate the problem and either return the system to normal conditions, or safely shut down the process.  The ammonia storage tank has a deluge system, which, in the event of a major leak or release, will activate high pressure water nozzles around the tank to quench the ammonia that is released.\n\nA number of administrative safety procedures complement the process safety equipment at the AEI facility.  These include written standard operating procedures (SOP) for all processes; twice-daily shift walkdown inspections of all major equipment, valves and alarms; extensive use of procedures checklists, such as for ammonia tank loading; and an automated preventative maintenance system for tracking daily repair work orders and scheduled maintenance operations. \n\nAn operator training program encompassing operating procedures, safety and health, and emergency response with a biennial re-qualification requirement, helps ensure that employees think, act, and work safely while on the job.\n\nIn addition to the OSHA PSM, the AEI facility complies with all federal and state emergency response and safety plan requirements, including the Hazardous Substance Control Plan (HSCP), Emergency Action Plan (EAP), Fire Prevention Plan (FPP), Exposure Control Plan (ECP), Injury and Illness Prevention Plan (IIPP), Spill Prevention, Control and Countermeasures Plan (SPCC), Hazardous Materials Business Plan (HMBP), and Risk Management and Prevention Plan (RMPP).\n\n1.5 Five-Year Accident History\n\nThere have been no accidental releases of ammonia at the AEI facility within the last five years.\n\n1.6 Planned Changes to Improve Safety\n\nSince the RMPP was prepared in 1996 and approved in 1997, AEI installed a water deluge system around the ammonia storage tank and chiller sys"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5723,
      "SummaryText": "tem to spray water on the tanks in the event of an uncontrolled release or major leak of ammonia.  Other than the addition of this system and replacement of equipment, the facility has not undergone any significant changes in its process, SOPs, maintenance system, training program, or equipment.\n\nAll of the safety recommendations contained in the RMPP prepared in 1996 have been implemented at the facility.  Recommendations made as part of the RMPP review for the federal RMP and CalARP will be implemented by January 1, 2001, unless otherwise indicated.  These are: \n\n1) Review and update, where necessary, procedures for ammonia transfer operations.\n2) Evaluate the water deluge system to ensure full coverage of the ammonia tank PRV.\n3) Follow manufacturer's recommendations in developing a procedure for testing the water deluge system on a regular basis.\n4) Evaluate safe alternatives to locking the ocvered bypass valve F, as was recommended in the RMPP, that are compatible with facility operations.\n\n\n\n\n\n\n\n1-1\nRMPSEC01NVS\n\n\n\n\n\n"
    }
  ]
}