{
  "FacilityID": 5728,
  "FacilityName": "Graves-Foster Water Treatment Plant",
  "FacilityStr1": "4108 Highway 355 South",
  "FacilityStr2": null,
  "FacilityCity": "Fulton",
  "FacilityState": "AR",
  "FacilityZipCode": "71838",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05057",
  "LEPC": "Hempstead County LEPC",
  "FacilityLatDecDegs": "33.624056",
  "FacilityLongDecDegs": "93.824583",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Hope Water And Light Commission",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Hope Water and Light Commission",
  "OperatorStr1": "105 North Elm Street",
  "OperatorStr2": "P.O. Box 2020",
  "OperatorCity": "Hope",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "71802",
  "OperatorZipCodeExt": "2020",
  "FTE": 5,
  "OtherEPAFacilityID": "AR0000230",
  "EPAFacilityID": "100000075731",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-04 00:00:00",
  "SafetyInspectionBy": "Environmental Data Services",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2008-04-08 00:00:00",
  "DeRegistrationEffectiveDate": "2008-03-18 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.6198,
  "FRS_Long": -93.81875,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6837,
      "AltID": "Water Treatment Facility",
      "FacilityID": 5728,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 7466,
          "ProcessID": 6837,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6993,
          "ProcessID": 6837,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 3588,
              "Process_NAICS_ID": 6993,
              "SafetyReviewDate": "1999-04-12 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-03-18 00:00:00",
              "ChangeCompletionDate": "1999-03-18 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Chlorine Vacuum Feed System (automatic shutoff of chlorine feed in the event of an increase or decrease in pressure of feed lines)",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Chlorine Vacuum Feed System",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1996-08-01 00:00:00",
              "TrainingReviewDate": "1996-08-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1996-08-01 00:00:00",
              "EquipmentInspectionDate": "1999-03-01 00:00:00",
              "EquipmentTested": "chlorine cylinders inspected, regulators, pressure guages, feed system (all doen daily, and before changing out cylinders)",
              "ComplianceAuditDate": "1999-01-01 00:00:00",
              "AuditCompletionDate": "1999-03-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-03-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Graves-Foster Water Treatment Plant in Fulton, AR is a municipal water treatment facility owned by Hope Water and Light Commission.  This facility falls under the NAICS Code 22131.  Our safety information was last reviewed and updated April 12, 1999.  We are subject to the handling codes of the National Fire Protection Association for Compressed Gas Cylinder Storage, American National Standards Institute, and American Society of Mechanical Engineers.  These standards, along with applicable (though not required) OSHA Standards have been implemented through written manuals.  Even though this is a municipal facility, and is not governed by OSHA, Graves-Foster Water Treatment Plant has decided to use Process Safety Management as the Prevention Program.  To prevent/limit releases, this facility operates the chlorine system on an automatic vacuum feed system, manual shut-off valves, and pressure regulators.  This facility also uses chlorine detection alarms which indicates a release with a visual and audible alarm.  Employees at the water treatment plant conduct maintenance checks on all system involved with the chlorine on a daily basis.  These checks involve reading pressure guages, inspecting cylinders, feed lines, etc.  Employees practice safe handling practices, and follow manufacturer's recommendations on cylinder change-out.  All employees are trained in the maintenance and operating procedures at theis facility when theya re hired, and throughout their employement.  The operating and training procedures were last reviewed in August of 1996.  The employees at the Graves-Foster Water Treatment Plant are trained in the classroom, and on-the-job training.  The last review of maintenance procedures was also in August of 1996.  There have been no incidents or accidents in the past five years.  The last Hazard Review was conduct on March 18, 1999 by use of a fault tree analysis.  There weren't any hazards identified during this review, so a completion date of the hazard review has been identified as the same date of the hazard review.  The prevention program for this facility is required to be a Level 2, however, a Level 3 PSM Prevention Program has been added for a more effective release prevention program.",
              "_chemicals": [
                {
                  "PrimaryKey": 3693,
                  "PreventionProgram2ID": 3588,
                  "ProcessChemicalID": 7466
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5728,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-04-12 00:00:00",
    "ERTrainingDate": "1999-08-01 00:00:00",
    "CoordinatingAgencyName": "Hempstead Couty LEPC",
    "CoordinatingAgencyPhone": "8707771478",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5728,
      "SummaryText": "In this water treatment facilty (Graves-Foster Water Treatment Plant), we handle chlorine which is considered hazardous by EPA, OSHA, etx.  The same properties that makes chlorine valuable as a water treatment chemical, also makes it necessary to observe certain safetu precautions in handling chlorine.  Overall, the prevention of unnecessary human exposures, reducing the threat to our own personnal health as well as our co-workers, and reducing the threat to nearby members of the community is the amin goal of incorporating this risk management plan into our daily operations.  It is our policy to adhere to all applicable federal and state rules and regulations.  Safety depends upon the manner in which we handle and use chlorine combined with the safety devices inherent in the design of this facility, with the safe handling procedures that we utilize, along with the training of our personnel.\n\nThe primary purpose of this facility is to treat the water system by utilizing chemicals such as chlorine.  Chlorine is received by individual one ton cylilnders and stored until needed.  chlorine is fed into the water system by automatic vacuum operated feeders.  The vacuum system will prevent the continual operation of the system if there is an increase or decrease in operating pressure on the cylinders or feed lines.  Access to the site is restricted to authorized facility employees, authorized management personnel, and authorized contractors.  The maximum amount of chlorine at this Graves-Foster Water Plant in Fulton, AR is 4,000 pounds.  There are other wells and booster location located throughout the Hope, AR area which also contain chlorine in 150 pound cylinders.  There are normally only 300 pounds at any of these locations.  The Old Wel #'s 3 & 5 are storage locations where the maximum amount on hand would be 2,500 pounds in 150 pound cylinders.  The wells and booster location also operate on vacuum feed systems.\n\nOur employees conduct proper cylinder change-out proced"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5728,
      "SummaryText": "ures daily.  They also review operating procedures, and maintenance tasks daily.  The prevention program for this facility is a level 2.  Lock-out/Tag-out Procedures are used to help prevent in accidental releases of chlorine.  When maintenance is conducted on the chlorination system, the Plant Production Manager (Russell Cornelius), and the Water manager (Lesslie Patterson II) approve the proper installation of the materials.  Any change in maintenance procedure is reviewed and approved by Leslie Patterson II.  All operators at this facility are knowledgeable in the proper start-up and shut-down procedures for the water treatment operations.\n\nOur emergency response program was devloped with the assistance of Environmental Data Services, Inc., the Hempstead County LEPC (Steve Smith), the Fulton, AR Volunteer Fire Department, and the Hope Fire Department.  If a chlorine release occurs at the Fulton Site, the chlorine alarm will sound to notify plant personnel of the release.  The exaust fans will be activated manually after a period which will allow for time needed to evacuate the affected population.  The emergency response plan includes the proper notification procedures by person (s) on duty, who call the Plant Superintendent (Russell cornellius), who wil then call Les Patterson (Water Manager/Safety Coordinator).  The extent of the hazard will be determined, and mitigation measures will be started.  If the degree of the chlorine release requires evacuation, the 911 system will be used to notify on-duty fire department personnel to assist in the response and the evacuation of the surrounding population.  Employees at the Fulton site are Haz-Mat triained, and will be the responders for this facility.  They have the proper PPE necessary to respond to a release of chlorine at this location.\n\nThw worst case scenario for this facility is a one tone chlorine cylinder failure, which would be a release of 2,000 pounds of chlorine gas into the atmospheere.  Active mitigati"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5728,
      "SummaryText": "on has been considered for this scenario consisting of manual shutoffs, as well as the vacuum system.  Passive mitigation has also been considered for this release scenario, which would be the release into an enclosed space with contact with outside air.  It is assumed that the entire contents of the cylinder are released as vapor.  The distance to endpoint of 0.087mg/l for the worst case scenario is 4.8 miles.\n\nAlternate releases were determined for the Fulton location, as well as the well locations, booster locations, storage loactions, etc.  All chlorine cylinders operate on a vacuum feed system, so the amount of chlorine released at the fulton site would be minimal (approximately 10 pounds).  However, if a 150 pound cylinder at any other location were to have a vessel problem, such as a valve, the locations of these sites could allow for a release of the entire contents of the cylinderin a short period of time.  The result of a 150 pound release typically would allow for a distance to endpoint of 0.43 miles.\n\nThere have been no accidental releases of chlorine from this facility in the paast five years.  The automatic vacuum feed system limits the amount (if any) of chlorine that escapes during operational periods.  Operators of the chlorination system are requird to check instruments, cylinders, feed systems, etc. on a daily basis to aid in the prevention of accidental releases.\n\nThis water treatment facility complies with EPA's Accidental Release Prevention Rule, and with all applicable state/federal codes and regulations."
    }
  ]
}