{
  "FacilityID": 5747,
  "FacilityName": "Thomas P. Smith Water Reclamation Facility",
  "FacilityStr1": "3805 Springhill Road",
  "FacilityStr2": null,
  "FacilityCity": "Tallahassee",
  "FacilityState": "FL",
  "FacilityZipCode": "32310",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12073",
  "LEPC": "District 2 LEPC",
  "FacilityLatDecDegs": "30.390556",
  "FacilityLongDecDegs": "-84.321389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Tallahassee",
  "Company2Name": null,
  "CompanyDUNS": 171121999,
  "Company2DUNS": 0,
  "OperatorName": "City of Tallahassee",
  "OperatorStr1": "Water Utilities, Gemini Bldg.",
  "OperatorStr2": "100 W. Virginia St.",
  "OperatorCity": "Tallahassee",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32301",
  "OperatorZipCodeExt": null,
  "RMPContact": "James H. Peters",
  "RMPTitle": "General Manager",
  "FTE": 93,
  "OtherEPAFacilityID": "FLD000857896",
  "EPAFacilityID": "100000076945",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1995-03-14 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-02-11 00:00:00",
  "DeRegistrationEffectiveDate": "2015-03-16 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 30.39319,
  "FRS_Long": -84.3228,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6871,
      "AltID": "Sewage Treatment",
      "FacilityID": 5747,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7027,
          "ProcessID": 6871,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 7533,
          "ProcessID": 6871,
          "ChemicalID": 62,
          "Quantity": 75000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 507533,
          "ProcessID": 6871,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5747,
      "SummaryText": "  The City of Tallahassee owns and operates two waste water treatment facilities, including Thomas P. Smith Water Reclamation Facility located at 3805 Springhill Road.  The T.P. Smith Plant has a design capacity of 27.5 million gallons per day (MGD) of sewage with a peak flow capacity of 55 MGD.  The plant primarily functions on the basis of aerobic decomposition and anaerobic digestion processes.  The 40 CFR 68.130 regulated substances identified at the facility include chlorine (disinfectant), anhydrous hydrogen chloride (temporarily as needed.  The hydrogen chloride is never stored in quantities greater than the threshold quantity identified under 40 CFR 68.130), and methane (a naturally occurring by-product of the anaerobic digestion process; The quantities of methane produced on-site are less than the threshold quantity identified under 40 CFR 68.130).\n\nThe City of Tallahassee Water Utilities Department recognizes the risks and dangers associated with working with toxic chemicals common to the waste water treatment industry.  As such, the City places the health and safety of its employees and the surrounding public and the protection of the environment above all other interests at the waste water treatment facilities.  In complying with this policy, the City adheres to a strict policy of administering safety management procedures and provides continuous training of its employees that handle, or work in close proximity to, the toxic chemicals located at its facilities.  The procedures and training address both the prevention of accidiental chemical releases and the protocol for responding to potential emergency situations.\n\nThe City of Tallahassee manages only one Chemical Accident Prevention Provisions (40 CFR 68) covered process (chlorination) at the Thomas P. Smith Water Reclamation Facility.  For the purposes of the Chemical Accident Prevention Program, the City has developed a release scenario, pursuant to 40 CFR 68.25, involving the release of the greatest"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5747,
      "SummaryText": " amount of chlorine held in a single vessel within a 10 minute period and the assumptions established under 40 CFR 68.25.  As an alternative release scenario, the City estimated a release from the failure of the chlorine transport tubing over a 60 minute period.  In light of the health, safety, and environmental damage that are possible due to exposure to chlorine, the City takes additional mitigative precautions by supplying the facility with emergency leak kits and personal protective equipment to support addressing emergency releases.\n\nThe City of Tallahassee Water Utilities Department has instituted procedures for accidental release prevention.  The topics addressed include handling of chlorine cylinders during physical transfer at the site, location and atmosphere conducive to proper storage of chlorine cyclinders, placement of chlorine cyclinders into service, and removal of chlorine cylinders from service.\n\nThere have been no accidental releases of chlorine over the past five years that have resulted in deaths, injuries, evacuation, sheltering in place, or damage to property or the environment.\n\nIn the event a chlorine leak were to occur at the facility, the City also has a comprehensive emergency response program in place that includes support from the local fire department.  The response plan is frequently reviewed to maintain familiarity and emergency response drills are performed to exercise the emergency response procedures of facility personnel by simulating a release.  The program has detailed procedures addressing communication with local emergency management agencies, protocol for evacuating potentially impacted areas, and repairing equipment, valve, and piping leaks and container leaks that may occur while in transit, storage, or in service.  Personnel are trained in  methods of stopping leaks and/or reducing the rate of leakage."
    }
  ]
}