{
  "FacilityID": 5750,
  "FacilityName": "Jim Blanchard Water Treatment Plant",
  "FacilityStr1": "832 Point Comfort Road",
  "FacilityStr2": null,
  "FacilityCity": "Martinez",
  "FacilityState": "GA",
  "FacilityZipCode": "30907",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13073",
  "LEPC": null,
  "FacilityLatDecDegs": "33.5575",
  "FacilityLongDecDegs": "82.068056",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.co.columbia.ga.us/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Columbia County Board of Commissioners",
  "Company2Name": null,
  "CompanyDUNS": 72471667,
  "Company2DUNS": null,
  "OperatorName": "Columbia County",
  "OperatorStr1": "P.O. Box 204660",
  "OperatorStr2": null,
  "OperatorCity": "Martinez",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30917",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": "NA",
  "EPAFacilityID": "100000076017",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-02-03 00:00:00",
  "DeRegistrationEffectiveDate": "2003-10-14 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.55908,
  "FRS_Long": -82.06548,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6874,
      "AltID": "Chlorine System",
      "FacilityID": 5750,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 7536,
          "ProcessID": 6874,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7030,
          "ProcessID": 6874,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 3603,
              "Process_NAICS_ID": 7030,
              "SafetyReviewDate": "1999-06-18 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "Chlorine Gas Institute",
              "FR_Comments": "A review of existing O&M proceedures were reviewed against CGI Standard and revised accordingly.",
              "HazardReviewDate": "1999-06-04 00:00:00",
              "ChangeCompletionDate": "1999-08-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-18 00:00:00",
              "TrainingReviewDate": "1999-06-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "All on-site employees are required to attend chlorine gas handling/hazard training.",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-18 00:00:00",
              "EquipmentInspectionDate": "1999-06-18 00:00:00",
              "EquipmentTested": "Daily inspections of the chlorine gas systems/equipment are performed.",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3708,
                  "PreventionProgram2ID": 3603,
                  "ProcessChemicalID": 7536
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5750,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-18 00:00:00",
    "ERTrainingDate": "1998-10-22 00:00:00",
    "CoordinatingAgencyName": "Columbia County (LEPC)",
    "CoordinatingAgencyPhone": "7068683333",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5750,
      "SummaryText": "Risk Management Plan\n\nExecutive Summary\n\nYour facility and the regulated substances handled.\n\nColumbia County Jim Blanchard Water Plant is a water treatment plant that provides drinking water to customers in the area of Columbia County, Georgia. To ensure that our water remains safe throughout the distribution system to every tap, the Jim Blanchard Water Plant adds a small amount of chlorine as a disinfecting agent.  The concentrated form of chlorine is liquefied and stored in up to eight one ton containers (i.e., up to 16,000 lbs.). Before it is mixed with water, chlorine can be extremely hazardous if released to the air all at once.  \n\nThe accidental release prevention and emergency response policies at your facility.\n\nColumbia County Water Systems is committed to protecting its employees, the public, and the environment from any accidental releases of hazardous materials used at its facilities.  We have implemented safety, environmental protection, and risk management programs to prevent hazardous materials releases.  If there is an accidental release, we will immediately call for emergency response to minimize the effect of the release and notify the public of any actions necessary to ensure public protection, through county emergency management agencies.\n\nWorst-Case Release Scenario\n\nThe Jim Blanchard Plant has conducted an offsite consequence analysis including a worst-case release scenario.  As required by the EPA RMP regulations, the worst-case scenario is defined as the release of an entire one ton container as a gas in ten-minutes.  The regulations require assuming worst-case wind speed and atmospheric conditions that result in the greatest projected impact distance. \n\nFor the offsite consequence analyses, the \"endpoint\" concentration is defined by the Emergency Response Planning Guideline (ERPG-2) values developed by the American Industrial Hygiene Association (AIHA).  AIHA defines the ERPG-2 value as, \"the maximum airborne concentration below which it is"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5750,
      "SummaryText": "believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms that could impair an individual's ability to take protective action.\"  The endpoint (ERPG-2 value) established for chlorine is 0.0087 mg/L (3 ppm).\n\nFor the wooded and hilly setting of the Jim Blanchard Plant, the potential distance to the endpoint concentration obtained from EPA guidance for the worst-case release is 1.3 miles. \n\nThere are approximately 3,530 residents within the 1.3-mile radius for the worst-case scenario.  However, if the worst-case release occurred, only a small fraction of these residents that are located downwind of the plant would be in the affected area.  Other than churches there are no public facilities (i.e., recreational and park areas, hospitals, prisons, or major office or industrial areas) or environmental receptors (i.e., national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preserves, refuges, or areas; and Federal wilderness areas) within the worst-case radius.\n\nA major release of the magnitude represented by this worst-case scenario is extremely unlikely because of the robust design of one-ton chlorine containers (they are designed to withstand transportation mishaps) and the rigorous maintenance and prevention programs in place at the Jim Blanchard Water Plant.  In fact, release reporting databases and water industry experience suggest that the worst-case release scenario as defined in the RMP regulations is so unlikely that it should not be used as the basis for emergency planning.  A more reasonable potential release scenario for emergency planning is presented in \"The alternative release scenario(s)\" section below.\n\nAlternative Release Scenario\n\nA \"credible worst-case\" scenario was selected as the Jim Blanchard alternative release scenario. This scenario assumes that the vacuum regulator connection to the container is complete"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5750,
      "SummaryText": "ly severed and 317 lbs. of chlorine is released in an hour (based on the American Water Works Association Research Foundation guidance for this type of plant). \n\nThe results of the hazard review and the facility's operating history suggest that even this credible worst-case is extremely unlikely to occur, but it can serve as the basis for emergency planning. \n\nThe potential distance to the endpoint concentration for this alternate release scenario is 0.48 miles.  The total population within a 0.48 mile radius is approximately 15 residents; however, only a small fraction of these residents located downwind of the release would typically be in the affected area.  There are no other public facilities or environmental receptors within this area. As with the worst-case scenario, actual distances and directions vary with terrain and weather conditions.\n\nAccidental Release Prevention Steps\n\nColumbia County is committed to personnel safety, public safety, continued reliable operation and regulatory compliance.  Based on this commitment, the Water Systems Manager has assumed overall responsibility for the development and implementation of the Risk Management Program.  The Water Systems Manager has also clearly defined accountability and responsibility for each of the prevention program elements to meet both EPA and Safety Management requirements.\n\nTo ensure a worst-case or alternative release scenario does not occur, the Jim Blanchard Water Plant maintains a release prevention program with the primary focus of protecting plant employees and the public from the hazards associated with an accident or release involving chlorine.  The multifaceted program includes the use of:\n\n-  vacuum feed of chlorine to minimize the chance of release if equipment fails;\n-  chlorine detectors and alarms to rapidly alert operators to any problems;\n-  process safety information to document the safe process design;\n-  process hazards reviews to evaluate the chemical and process hazards;\n-  operat"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5750,
      "SummaryText": "ing procedures to ensure that the system is operated safely;\n-  maintenance, inspection and testing to ensure that the system is maintained according to applicable standards and manufacturer's recommendations;\n-  training, contractor safety and employee participation programs to ensure that all employees and contractors working on and around the processes are aware of the hazards, can perform their job duties safely and know the actions to be taken in an emergency;\n-  management of change and pre-startup safety reviews to ensure that changes are documented, analyzed and kept within the design basis;\n-  incident investigation procedure to investigate each incident and \"near misses\" to determine root causes and make needed safety improvements;\n- and periodic compliance audits to ensure that our programs working as they should to protect both employees and the public.\n\nFive-Year Accident History\n\nWithin the past five years, the Jim Blanchard Water Plant has not had any accidental releases that resulted in injuries or property damage. The plant has maintained an excellent safety record throughout its operating history and has never had a major chlorine release that could have had adverse effects on the public.  \nEmergency Response\n\nIn the event that a chlorine release does occur, the Jim Blanchard Water Plant has an emergency response program that coordinates emergency response with the Columbia County Emergency Management Agency. If such a release did occur, plant personnel would contact the Columbia County Emergency Management Agency. The Columbia County would dispatch a trained HAZMAT team to the site to handle the chlorine release from the Department of Energy's Savannah River Site, and Augusta Fire and Rescue Department.\n\nMaintaining A Safe Operation\n\nPlanned changes to improve safety\n\nThe Jim Blanchard Water Plant continually works to safely manage the hazards of chlorine to protect employees and the community we serve. The Risk Management Program will be maintain"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5750,
      "SummaryText": "ed to reduce the risk of accidental releases and each year we will conduct training, review procedures, maintain the equipment and follow safe work practices. Periodically, we will audit our program,  review our Process Hazards and coordinate with the community emergency response organization."
    }
  ]
}