{
  "FacilityID": 5771,
  "FacilityName": "Turner Road Vintners West",
  "FacilityStr1": "5852 West Turner Road",
  "FacilityStr2": null,
  "FacilityCity": "Lodi",
  "FacilityState": "CA",
  "FacilityZipCode": "95242",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06077",
  "LEPC": null,
  "FacilityLatDecDegs": "38.145833",
  "FacilityLongDecDegs": "-121.385556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "ehansen@sebastiani.com",
  "FacilityDUNS": 9200882,
  "ParentCompanyName": "Sebastiani Vineyards, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sebastiani Vineyards, Inc.",
  "OperatorStr1": "389 Fourth Street East",
  "OperatorStr2": null,
  "OperatorCity": "Sonoma",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95476",
  "OperatorZipCodeExt": null,
  "RMPContact": "Eric L. Hansen",
  "RMPTitle": "Compliance/Project Manager",
  "FTE": 29,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000071799",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-03 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Federal RMP",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 38.14582,
  "FRS_Long": -121.38861,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6907,
      "AltID": "Main Refrigeration System",
      "FacilityID": 5771,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7063,
          "ProcessID": 6907,
          "NAICSCode": "31213",
          "_desc": {
            "NAICS_CODE": "31213",
            "NAICS_DESCRIPTION": "Wineries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 7569,
          "ProcessID": 6907,
          "ChemicalID": 56,
          "Quantity": 48000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 507569,
          "ProcessID": 6907,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 6908,
      "AltID": "Sulfur Dioxide Transfer",
      "FacilityID": 5771,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7064,
          "ProcessID": 6908,
          "NAICSCode": "31213",
          "_desc": {
            "NAICS_CODE": "31213",
            "NAICS_DESCRIPTION": "Wineries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 7570,
          "ProcessID": 6908,
          "ChemicalID": 49,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 507570,
          "ProcessID": 6908,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5771,
      "SummaryText": "Executive Summary\nSebastiani Vineyards, Inc.\nTurner Road Vintners West\nRisk Management Plan\nJune 1999\n\n\nINTRODUCTION\nThe Turner Road Vintners West Cellars is located at 5852 West Turner Road, Lodi, California and is owned and operated by Sebastiani Vineyards, Inc. Construction of this facility began in 1998 and the initial phase was completed in 1999. The facility was constructed on land acquired by Sebastiani Vineyards in 1988 along with an existing winery (currently known as Turner Road Vintners East) located at 4614 West Turner Road. It is designed as a wine grape processing and wine production facility. All process and operations conducted at the facility are integral parts of the winemaking process.\n\nOperations conducted at the facility include processes that use certain substances identified in federal and state regulations as Extremely Hazardous Substances (EHS). Sufficient quantities of these substances are used and stored at the facility to require the development and implementation of a Risk Management Program and submittal of a Risk Management Plan.\n\nThe primary purpose of the Risk Management Program and Plan (RMP) is to prevent accidental releases of toxic substances. The secondary purpose is to develop the information necessary to prepare facility personnel and public agencies to respond adequately and appropriately to releases when they do occur.\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nIn matters of safety and environmental protection, Sebastiani Vineyards (The Company) maintains a proactive stance, from senior management on down. As a labor-intensive agricultural based industry, The Company is firmly dedicated to protection of its natural and human resources. It is the goal of Management to be prepared and self sufficient to handle any foreseeable emergency and the Management believes that preparation and training are the best way to meet this goal. It is Company policy however, that no employee will take unnecessary chances, a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5771,
      "SummaryText": "nd if a situation is beyond the expertise or resources of facility personnel, outside assistance will be summoned at once.\n\nReporting of releases is an important element of the Emergency Response Plan. Procedures are in place and employees are trained to perform a rapid initial assessment and report as needed to the appropriate agencies. The Company recognizes that early intervention can minimize the impact of any emergency.\n\nUsing regulations and agency guidance documents for reference and consulting with the appropriate agencies and industry experts, policies and programs are written and updated as needed to keep current. Regular training is provided for all affected employees. In addition to the RMP, some of the key programs and policies currently in place are:\n7 Injury and Illness Prevention Program\n7 Hazard Communication Program\n7 Confined Space Procedures\n7 Lock-out Tag-out Procedures\n7 Respiratory Protection Program\n7 Hearing Conservation Program\n7 Storm Water Prevention Program\n7 Spill Prevention and Control Program\n7 Hazardous Materials Management Plan\n7 Emergency Action Plan (including Fire Prevention Plan and specific procedures for natural disasters and hazardous materials releases\n\nSafety meetings are held regularly and all employees are provided with initial training and annual refresher training in all necessary safety programs. Health testing is provided for all employees in accordance with Title 8 CCR GISO\n\n\nTHE FACILITY AND THE REGULATED SUBSTANCES HANDLED\nAt the facility, there are two processes using anhydrous ammonia and one process using sulfur dioxide. These processes are integral parts of the winemaking process and are described below.\n\nProcess ID #14 -- Main Refrigeration System \nThis process is a centralized ammonia compression refrigeration system consisting of a central power plant with two (2) 400 hp FES S-Series screw compressors, and a low pressure liquid ammonia recirculation system. The power plant has sufficient capacity for six (6)"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5771,
      "SummaryText": " tube-in-shell heat exchangers used for direct cooling of wine, one (1) tube-in-shell heat exchanger used for direct cooling or heating of wine, and a low pressure recirculator that serves the cooling jackets on twenty-four (24) storage and fermenting tanks. The system was designed and installed in 1998-1999.\n\nProcess ID #15 -- Sulfur Dioxide Transfer\nThis process is the simple transfer of liquid anhydrous sulfur dioxide from one-ton transportable cylinders into smaller gauging cylinders that are used for dispensing the gas into wine and tank headspaces. The process uses gravity assisted by inert gas counterpressure to provide the motive force.\n\n\nWORST-CASE AND ALTERNATIVE RELEASE SCENARIOS\nIn order to determine the scenario that results in the greatest distance to the toxic endpoint, it was necessary to analyze worst case scenarios for both ammonia and sulfur dioxide. Of the two potential worst case release scenarios analyzed, the one resulting in the greatest distance to the toxic endpoint was the release of 2,000 lbs. of sulfur dioxide from a full one-ton cylinder. EPA's RMP*Comp computer modeling program was used for the analysis and yielded a distance of 3.10 miles to the toxic endpoint. Using EPA's LandView mapping and census information program the population within the zone of influence was estimated at 1,583 persons in 542 households. Other public receptors located within the zone of influence were Turner School, Turner Road Vintners East, Sutter Home Winery (under construction) and a truck stop known as Flag City. No environmental receptors were located within the zone of influence.\n\nAs required, Alternative Release Scenarios were analyzed for both toxic substances. The Alternative Release Scenario selected for sulfur dioxide was assumed to result from an overpressure condition due to malfunction of the counterpressure regulator. This malfunction would result in a release of five (5) pounds of sulfur dioxide over a period of 30 minutes.\n\nThe Alternative Re"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5771,
      "SummaryText": "lease Scenario selected for anhydrous ammonia was assumed to result from the shearing of a small gauge or valve from the high-pressure liquid piping manifold. This would result in a continuous release of liquid ammonia at a rate of 153 pounds per minute for a maximum duration of 30 minutes.\n\nThese scenarios were chosen because they were determined to be the most likely releases that might occur at the facility.\n\nRMP*Comp was used for the analysis and yielded a distance to the toxic endpoint of 0.1 miles for the first scenario and 0.2 miles for the second scenario. Using EPA's LandView mapping and census information program the population within the zone of influence was estimated at 2 for the first scenario and 6 for the second scenario. No other public receptors or environmental receptors were located within either zone of influence. These results were not surprising, as the facility is located in a rural agricultural area with very low population density.\n\nIn order to generate a conservative estimate of the potential consequences, mitigations were not considered in the analysis of the worst case or alternative release scenarios. Mitigation methods are available and would be invoked during an actual release so that the actual consequences would be significantly less than predicted by these scenarios.\n\nIn the case of the sulfur dioxide facility, Large volume water nozzles are available to manually control releases of vapors. Absorbed vapors will drain down into the adjacent wastewater collection sump that has a liquid capacity of 60,000 gallons. It is estimated that this method will effectively absorb approximately 80% of any foreseeable release. \n\nThe same method may be used for minor releases of ammonia. In addition, the housing of the refrigeration system power plant within a closed building provides some mitigation of releases effecting this part of the system.\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\nThe general acc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5771,
      "SummaryText": "idental release prevention program consists of Standard Operating Procedures (SOP) and maintenance procedures and schedules specific to each process, equipment, or system. In addition to written procedures, specific training is provided initially and refresher training is provided as needed to all employees who work with the processes. General safety inspections conducted under the IIPP are also used to ensure compliance with SOPs. Annual inspections are conducted for Storm Water Pollution Prevention compliance, Hazardous Material Inventory Reporting, and Toxic Chemical Release Inventory Reporting requirements. All programs and policies are designed for compliance with all applicable environmental and safety regulations including Title 8 CCR General Industry Safety Orders\n\nEmployees are directed to report immediately any minor leakage or other abnormal conditions that might be indicative of an imminent accidental release. These reports are directed to the Maintenance Department at once and top priority is given to correction of the deficiency. \n\n\nFIVE-YEAR ACCIDENT HISTORY\nAs this is a new facility, a five-year history does not yet exist, however a review of accident history for the main facility was conducted. Within the past 5 years there have been no serious accidents involving any of the processes listed.\n\n\nEMERGENCY RESPONSE PROGRAM\nIt is the goal of the Company to be as self-sufficient as possible in responding to control and contain releases of hazardous materials or other emergencies. At the same time, we recognize that people can get hurt and a bad situation can get worse quickly when inadequately trained and equipped personnel get involved. It is for this reason that our emergency response program will always use a combination of response strategies. On site personnel are trained under ICS procedures first in awareness and self-protection, and then in specific control and containment procedures. Particular attention is given to reporting and communications"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5771,
      "SummaryText": " with emergency response agencies. An ongoing commitment to joint participation exercises with local ER is a key element of the program.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\nManagement is always exploring new ways to enhance safety awareness and knowledge of the employees. Currently in the planning stages is a dedicated Plant Safety Day during which all plant operations will be shut down and the entire plant will participate in safety training covering as many topics as can be worked into a single day. It is anticipated that this event will occur at least once per year and possibly more frequently. We believe that the benefits of dedicating an entire day to safety will pay dividends well in excess of the costs.\n\nIn addition, a policy of zero tolerance for nuisance leakage of ammonia and sulfur dioxide will be promoted to encourage employees to maintain a higher level of vigilance in prevention of accidental releases.\n\nConsideration is also given to upgrades of certain equipment as new technologies and standards are developed and proven. Where feasible and cost effective, upgrades for compliance with new standards and methods are reviewed and considered for implementation.\n\nIt is consideration of upgrades in technology, training and procedures that allows a facility to continue to improve its Risk Management Program and demonstrate its commitment to protection of human health and safety, property, and the environment."
    }
  ]
}