{
  "FacilityID": 5808,
  "FacilityName": "Duckwall-Pooley Fruit Company",
  "FacilityStr1": "3430 Davis",
  "FacilityStr2": null,
  "FacilityCity": "Hood River",
  "FacilityState": "OR",
  "FacilityZipCode": "97301",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41027",
  "LEPC": "Hood River County LEPC",
  "FacilityLatDecDegs": "45.512833",
  "FacilityLongDecDegs": "-121.595667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "knishim@duckwallpooley.com",
  "FacilityDUNS": 27696871,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Fred D. Duckwall",
  "OperatorStr1": "PO Box 150",
  "OperatorStr2": null,
  "OperatorCity": "Odell",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97044",
  "OperatorZipCodeExt": null,
  "RMPContact": "Curt Hockett",
  "RMPTitle": "Operations Manager",
  "FTE": 50,
  "OtherEPAFacilityID": "023913",
  "EPAFacilityID": "100000074849",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-21 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 45.62425,
  "FRS_Long": -121.5348,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6956,
      "AltID": "Refrigeration System",
      "FacilityID": 5808,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7115,
          "ProcessID": 6956,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 7619,
          "ProcessID": 6956,
          "ChemicalID": 56,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 507619,
          "ProcessID": 6956,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5808,
      "SummaryText": "\n1.0 EXECUTIVE SUMMARY\n\n1.10 Accidental Release Prevention And Emergency Response Policies\n\nThe Duckwall-Pooley Fruit Company refrigeration system uses pure anhydrous ammonia (a commonly used refrigerant for industrial systems) as the refrigerant.  Given the quantity handled, anhydrous ammonia is considered a hazardous substance by EPA.  Many of the properties that make ammonia valuable as a refrigerant also requires that precautions and procedures be in place to protect employee and public health and safety during a chemical emergency.  It is the policy of Duckwall-Pooley Fruit Company to be in compliance with all applicable federal and state rules and regulations.    \n\nSafety at Duckwall-Pooley is inherent on the manner in which anhydrous ammonia is handled.  While the design of the facility incorporates a multitude of safety devices, safe handling procedures combined with appropriate training of our personnel are key aspects to maintaining safety at our facility.\n\nWe have a written Process Safety Management (PSM) plan that complies with the regulations stipulated by OAR 437 Division 1910.119.  A crucial component of this plan is the Emergency Response Plan, developed in compliance with the Emergency Response provisions of OAR 437 Division 1910.120.  The Emergency Response Plan includes pre-emergency planning and coordinating with outside parties.  This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events.\n\n1.20 Facility Description And Substances Handled \n\n7 Duckwall-Pooley Fruit Company packages, stores, and distributes fruit.  Storage requires the use of a refrigeration system to preserve the fruits.  This refrigeration process uses ammonia as a refrigerant.  Access to the facility is restricted to authorized employees, management personnel, and contractors.\n7 The regulated substance handled at this facility is anhydrous ammonia.\n7 The ammonia refrigeration system maximum inventory is 14,500 pounds of anhy"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5808,
      "SummaryText": "drous ammonia.  There is no standby make-up inventory kept on-site.\n\n1.30 The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario. \n\nRelease scenarios were modeled using RMP*Comp (Version 1.06), a software program developed by the National Oceanic and Atmospheric Administration (NOAA) and EPA.  Offsite receptors were defined using the LandView III (Version 1.0) system.  This system estimates residential population within the circle defined by the endpoint of the worst-case and alternative release scenarios.  In addition, it lists whether certain types of public receptors and environmental receptors are within the circles.\n\n7 Worst-Case Scenario.  Catastrophic failure of two interconnected High Pressure Receivers located outside, when filled to the greatest amount, would release 9,400 pounds of liquid ammonia.  This scenario presumes that the entire contents are released.  \n\nThe distance to the toxic endpoint for the worst-case scenario is 1.7 miles from the point of release.  This distance extends beyond the facility fence line, and would encompass a population of 1,917 with the closest residence across the street and a school is = mile to the west of the facility, inside of this release zone.  Other fruit processing facilities are within close proximity.  A hospital is about 7 miles away, outside of this release zone.  No other public or environmental receptors are located within this zone. \n\n This worst-case scenario would not likely occur unless an act of nature (e.g., earthquake) physically compromised the tank.   The structural integrity of the tank is safeguarded by periodic inspection for mechanical integrity to prevent a rupture due to tank degradation.  The tank is also safeguarded from rupture from over-pressurization.  It is a rated pressure vessel hydro-tested to 375 psi and equipped with 250 psi pressure relief valves. The desi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5808,
      "SummaryText": "gn specification of the tank only allows a maximum capacity of 80% at 800F, limiting the total amount of ammonia in the system.  During high demand, the High Pressure Receiver may only be filled to a fraction (~30%) of capacity. \n\n7 Alternative Scenario. Several alternative scenarios can generate the equivalent of a 1\" opening in a high pressure liquid line.  Alternative scenarios could include an opening created by a valve sheared off, a large gasket leak, or a pressure relief valve release.  These scenarios presumes a release duration of 10 minutes resulting in a loss of 14,500 pounds of liquid ammonia.  This scenario was selected because a release of this type would occur outdoors resulting in the highest potential exposure to offsite receptors.\n\nThe distance to the toxic endpoint for the alternative scenario is 0.7 miles from the point of release.  This distance extends beyond the facility fence line, and would encompass a population of 325 with the closest residence across the street and a school = mile to the west of the facility, inside of this release zone.  Other fruit processing facilities are within close proximity.  A hospital is about 7 miles away, outside of this release zone.  No other public or environmental receptors are located within this zone. \n\nThe severity of release from this scenario would likely be less since safety system provisions are in place to limit the release duration to less than ten minutes through the use of appropriately placed isolation valves. \n\n 1.40 General Accidental Release Prevention Program And Chemical-Specific Prevention Steps\n\nDuckwall-Pooley Fruit Company complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  The design and construction of this facility was in accordance with published standards, tests or recommended methods of trade, industry or governmental organizations.  \n\nDuckwall-Pooley Fruit Company's written PSM plan incorporates many policies and procedure"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5808,
      "SummaryText": "s to ensure safe operation and maintenance of this facility.  Plan elements essential to safe operation of the refrigeration system include employee participation, process hazard information, process hazard analysis, operating procedures, training, contractor safety, pre-startup safety review, mechanical integrity, management of change, hot-work permits, incident investigation, emergency response and planning, and compliance audits.  This plan will be reviewed annually and updated as necessary by the Duckwall-Pooley Fruit Company Safety Supervisor. \n\nTraining is provided to ensure that each employee involved in operating a process has been trained in an overview of the process, the operating procedures, and safety considerations.  This training uses guidelines developed by the International Institute of Ammonia Refrigeration (IIAR) and Refrigeration Engineers Technology Association (RETA).  Only qualified maintenance personnel operate and interact with the refrigeration system.  This minimizes the chances of inadvertent error in operation that could lead to a release of ammonia.  Startup, shutdown, and any onstream adjustments are handled by these qualified persons.  \n\n1.50 Five-Year Accident History\n\nThere has been no significant release of ammonia at Duckwall-Pooley Fruit Company in the past five years.\n\n 1.60 Emergency Response Program\n\nDuckwall-Pooley Fruit Company has a written Emergency Response Plan developed to ensure that precautions and procedures are in place to protect employee and public health and safety during a chemical emergency.  It complies with the provisions of OR-OSHA Emergency Response regulations, OAR 437 Division 1910.120.  The Emergency Response Plan includes pre-emergency planning and coordinating with outside parties. This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events.  This plan has been coordinated with the Odell Fire Department.\n\nThe approach in the development of this plan"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5808,
      "SummaryText": " has been to identify the ammonia emergencies most likely to occur at Duckwall-Pooley Fruit Company and establish precautions and procedures to protect life safety and health during an emergency.  The refrigeration process has back-up prevention systems to keep processing malfunctions from becoming ammonia release emergencies.  If an emergency does occur, the following response personnel, facilities, and equipment are in place:\n\n7 Incident Command Center\n7 Emergency Alarm and Communication System\n7 Emergency Response Team\n7 Safe Rooms, Evacuation Plans, and Assembly Points\n7 Personal Protective Equipment\n\nThe role and procedures for obtaining external emergency assistance have been coordinated with the Odell Fire Department, including the Local Emergency Planning Committee stationed Hood River.  The Emergency Response Plan also includes procedures for notification of any potentially affected neighbors.  \n\nAll Duckwall-Pooley Fruit Company personnel will be trained to fulfill their designated responsibilities in an emergency.  Mock emergency drills will be held periodically to maintain familiarity with response actions and identify plan elements requiring improvement.\n\nThis plan will be reviewed annually and updated as necessary by the Duckwall-Pooley Fruit Company Safety Supervisor.\n\n1.70 Planned Changes To Improve Safety\n\nThis facility started production operations in 1989.  All system components meet design specifications in ANSI/IIAR, equipment, design, and installation of ammonia mechanical refrigerating systems.  All pressure vessels are built according to American Society of Mechanical Engineers (ASME), ASME Boiler and Pressure Vessel Code, pressure vessels.  Any upgrades or extensive maintenance work performed in the future will be in compliance with those standards applicable at that time.\n\nAll Duckwall-Pooley Fruit Company personnel are trained to fulfill their designated responsibilities in an emergency.  Mock emergency drills will be held periodically to "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5808,
      "SummaryText": "maintain familiarity with response actions and identify elements requiring improvement.\n\nThe highest Process Hazard Analysis (PHA) Recommendations Resolution centered on training in making minor adjustments with subsequent monitoring.  This situation is created when there are excessive compressor operations relative to demand.  Another high priority is to study compressor operating parameters and staging to prevent foaming of oil in the crankcase.  Future hardware changes include the 5-year changeouts of pressure relief valves according to IIAR recommendations.  Resolution of this recommendation is due August 1, 1999."
    }
  ]
}