{
  "FacilityID": 5816,
  "FacilityName": "Advance Chemical Distribution, Inc. (PC)",
  "FacilityStr1": "5702 East Channel Road",
  "FacilityStr2": "Port of Catoosa",
  "FacilityCity": "Catoosa",
  "FacilityState": "OK",
  "FacilityZipCode": "74015",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40131",
  "LEPC": "Tulsa County LEPC",
  "FacilityLatDecDegs": "36.245",
  "FacilityLongDecDegs": "-95.738056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.hollandchemical.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7220825,
  "ParentCompanyName": "HCI USA Distribution Companies, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 926348517,
  "Company2DUNS": 0,
  "OperatorName": "Advance Chemical Dist. Inc. (SS)",
  "OperatorStr1": "P.O. Box 70",
  "OperatorStr2": "206 East Morrow Road",
  "OperatorCity": "Sand Springs",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74063",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ken Smith",
  "RMPTitle": "Branch Manager",
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000070647",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-09-04 00:00:00",
  "SafetyInspectionBy": "DOT-RSPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": "1999-06-30 00:00:00",
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 36.245,
  "FRS_Long": -95.73806,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6964,
      "AltID": "Chlorine Repackaging",
      "FacilityID": 5816,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7123,
          "ProcessID": 6964,
          "NAICSCode": "42269",
          "_desc": {
            "NAICS_CODE": "42269",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 7627,
          "ProcessID": 6964,
          "ChemicalID": 62,
          "Quantity": 600000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 507627,
          "ProcessID": 6964,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 6965,
      "AltID": "Sulfur Dioxide Repacking",
      "FacilityID": 5816,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7124,
          "ProcessID": 6965,
          "NAICSCode": "42269",
          "_desc": {
            "NAICS_CODE": "42269",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 7628,
          "ProcessID": 6965,
          "ChemicalID": 49,
          "Quantity": 400000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 507628,
          "ProcessID": 6965,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5816,
      "SummaryText": "EPA RISK MANAGEMENT PROGRAM\n\nADVANCE CHEMICAL DISTRIBUTION, INC.\nPORT OF CATOOSA, CATOOSA, OK.\nEXECUTIVE SUMMARY\n                                            Page 1 of 4\n\nINTRODUCTION\n\nThis Advance Chemical facility is a chemical distribution plant located in the Port of Catoosa, north of Catoosa, Oklahoma.  It is part of the Advance Chemical Distribution, Inc. Business Unit of HCI USA Distribution Companies Inc. headquartered in St. Louis, Missouri.  HCI USA Distribution Companies is a chemical distribution company serving customers with worldwide products, chemicals, and advanced materials. The company ranks among the top 10 chemical distribution firms in North America.  HCI USA Distribution Companies has approximately 1,000 employees at more than 50 facilities in 21 states and Mexico.  HCI USA Distribution Companies may be found at its Web Page: www.hollandchemical.com\n\nIt is the worldwide policy of HCI USA Distribution Companies to design, blend and distribute its products and to handle materials throughout their life cycle in a manner that protects the environment and safeguards employees, customers and the public from unacceptable risk. \n\nAdvance participates in the Responsible Distribution Process program of the National Association of Chemical Distributors (NACD). The Community Outreach and Emergency Response Plan of Responsible Distribution Process brings chemical distribution plants and local communities together through communications and cooperative emergency planning.  Advance also participates in the safe handling programs of The Chlorine Institute for which the company has been a member for 15 years. \n\nThe HCI Safety Program of the HCI Health, Safety and Environmental Program are designed to prevent fires, explosions and accidental chemical releases. The program requires safety audits, inspection and maintenance programs, and safety training for employees and contract workers. Facilities are encouraged to listen to the concerns of the community and to consider these concerns when desi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5816,
      "SummaryText": "gning and implementing process safety systems.\n\n\nPLANT DESCRIPTION\n\nThis Advance Chemical facility is located at 5702 East Channel Road in the Port of Catoosa, an industrial area north of the city of Catoosa.  The facility employs 15 people on a full time basis.  At this facility, Advance repackages, stores and handles Chlorine and Sulfur Dioxide, which are considered hazardous by the Environmental Protection Agency (EPA).  Chlorine has many beneficial uses, some of which include the production of consumer goods such as plastics, pipe, automobile parts, and toys among a few, but Chlorine's main use in this area remains the treatment of waters ensuring safe drinking water for all.  Sulfur Dioxide is also used in the treatment of water among other uses.  The same properties that make these chemicals valuable as a commodity also make it necessary to observe certain safety precautions in handling them to reduce the threat to nearby members of our community as well as to that of the people in our company.  It is our policy to adhere to all applicable Federal, State and Local regulations. \n                                                2 of 4\n\nAdvance Chemical maintains continuous efforts toward constantly improving its community status as a valuable asset to the Port.  This is accomplished through several special activities along with the company generating a substantial tax base for ongoing improvements for the Port, and Tulsa County. \n\nOne such activity that the company participates in as a member is the Tulsa County Local Emergency Planning Committee (LEPC).  This committee in conjunction with other groups is responsible for pre-planning the safety of all citizens within the port, and county during emergencies and natural disasters.  Advance is also a member of the Tulsa County Industrial Committee of the LEPC.  Another activity that the company makes available to the community is the training of emergency responders.  Advance has held several training drills at the facility with the Tulsa Fire Departm"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5816,
      "SummaryText": "ent.  This training is aimed at increasing the fire fighter's knowledge of hazardous materials, and how to properly protect themselves in the event of a release.  Advance has also conducted safety seminars at various locations throughout Tulsa county, Oklahoma, and the surrounding states for over ten years.  These seminars are open to the public and are free of charge.  The goals of these seminars are to enhance the knowledge of the attendees in the fields of preventing, responding safely to, and controlling emergencies in the event of a release.  Seminar attendees include people from industrial plants, city water and waste treatment plants, emergency response companies, city and county police departments, city and county fire departments, state emergency management agencies, local governments, the news media, interested citizens, and neighbors, among others.             \n\n\nACCIDENT RELEASE & EMERGENCY RESPONSE POLICIES\n\nThe Emergency Programs in place at the facility include an:\n\nEmergency Action Plan, \nFire Prevention Plan,\nEmergency Response Plan, and a\nTransportation Emergency Plan.\n\nAlong with these written plans, Advance also maintains a facility organization plan that outlines the responsibilities of each job description from top management positions to the newest employee.  The General Manager and the Environmental Coordinator for the mid-west region both maintains an office in the Tulsa area.   Their responsibilities include overseeing the management of environmental, health, and safety programs for the entire company. The Branch Manager of the facility maintains direct responsibility for the plant in conjunction with his staff, the Plant Manager, the Site Safety Officer, and other management employees.  \n\nAdvance Chemical maintains a close working relationship with local emergency responders.  Emergency responders from the city fire department and third party companies are invited to tour the facility annually in order to gain knowledge of the physical set"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5816,
      "SummaryText": "up of the plant.  This information becomes very valuable during an emergency incident.  The company also maintains a working relationship with area clinics and hospitals in order to be prepared during emergency events of any kind.   \n\n\n\n                                                3 of 4\n\nWORST CASE & ALTERNATIVE CASE SCENARIOS\n\nThe EPA was mandated by the law to define the Worst Case Scenario (WCS), as an unlikely event: the largest single storage vessel losing all of its contents in 10 minutes.  Advance Chemical's Port of Catoosa facility does have off-site consequences to the public and the environment under this law. \n\nEfforts maintained by the facility to prevent such an incident from occurring include several programs.  One basic program is the general housekeeping policy for the entire plant with a special emphasis placed on the storage areas for these containers.  Under this policy, combustible materials, and other products are not allowed to build up or to be stored in the processing or storage areas.  Another important program is implementing the knowledge gained from being a member of The Chlorine Institute for fifteen years. The Institute establishes written pamphlets, and videos among other information to guide facilities in prevention and emergency programs that cover issues such as processing, handling, storage, and releases of chemicals such as Chlorine.  Along with the numerous training programs from the Institute, the facility also complies with container specifications, inspections, and testing requirements of laws in-acted by the Department of Transportation.  Still other programs such as the NACD's Responsible Distribution Process, and guidance implemented based on EPA's SARA Title III regulations aids the facility in setting-up, and maintaining a more safe plant due to issues like the separation of products within certain areas of the facility.  Programs like these coupled with company policy help to ensure that the possibility of a release of this magnitude would never occur "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5816,
      "SummaryText": "at the facility.  \n\nThe EPA calls a more likely incident, many of which will have limited or no off-site consequences, an Alternate Release Scenario (ARS).  An ARS for this facility could be a small hose or vessel leak.  For the Port of Catoosa facility the ARS will have off-site consequences for both Chlorine and Sulfur Dioxide, but would be limited to an area in close proximity to the plant.  \n\nThe facility maintains emergency equipment specifically designed to be able to stop leaks of Chlorine or Sulfur Dioxide if they occur.  This equipment includes Chlorine Institute approved kits for railcars, ton containers, and cylinders, along with a recovery vessel.  Advance Chemical maintains employees who are trained in the specialized use of this emergency equipment. \n\n\nACCIDENT PREVENTION PROGRAM & CHEMICAL SPECIFIC ACCIDENT PREVENTION PROGRAM\n\nHCI USA Distribution Co., Inc maintains Health, Safety and Environmental manuals, which contain company policies for Risk Management, Training, Product Stewardship, Community Outreach and Hazard Communication among others.  The manuals also include Emergency Action Plans, Emergency Response Plans, and Transportation Emergency Plans. The facility is also in compliance with the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard which requires careful reviews of the hazards and the safeguards that must be implemented to prevent releases of regulated chemicals.  This facility has 50 years experience in handling chlorine, and 10 years experience in handling sulfur dioxide.\n\n\n\n                                                4 of 4\n\nFIVE YEAR ACCIDENT HISTORY\n\nAdvance Chemical began operations at this site in the late 1970s, and has never experienced an accidental release involving either RMP listed chemicals, Chlorine or Sulfur Dioxide. The facility has never experienced a release of any magnitude, any off site injuries, or had to implement evacuation measures in its twenty plus years at this location. \n\n \nEMERGENCY RESPONSE PR"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5816,
      "SummaryText": "OGRAM\n\nThis facility has emergency plans, which have been coordinated with local fire departments and the Local Emergency Planning Committee (LEPC). The branch has conducted joint training and drills with the local fire department, the Tulsa county fire department and HazMat teams, the Northeast Oklahoma Emergency Management Office along with various other departments and agencies. All of our safety equipment at the plant is Y2K compatible.\n\nOur response plan for chlorine is based upon the Chlorine Institute's Pamphlet 64, Emergency Response Plans for Chlorine Facilities. The emergency response plans for all of our facilities include procedures for notification of the local fire authority and notification of any potentially affected neighbors.\n\n\nPLANNED CHANGES\n\nThe Port of Catoosa facility has made several changes over the years to enhance the safe repackaging, handling and storage of compressed liquefied gases such as Chlorine and Sulfur Dioxide.  Some of these changes have occurred due to plant inspections based upon information from industrial associations such as The Chlorine Institute and the NACD; still others are based upon internal company policies.  While most of the changes have been accomplished in the past, the company continuously inspects and audits its facility to identify any existing needs.  Currently, the facility is working toward completing a minor project aimed at improving handling methods deployed when unloading cylinders from trucks.  This project consists of updating portable racks that are used to secure cylinders during the off-loading process. \n\nTo continue to improve upon its safety record, Advance Chemical requires all of its facilities to conduct incident investigations, safety compliance audits, continuous training of emergency procedures, and continuous community outreach actions which include: educating and training neighbors, customers, fire departments, and emergency response teams."
    }
  ]
}