{
  "FacilityID": 5823,
  "FacilityName": "Beringer Vineyards",
  "FacilityStr1": "1000 Pratt Avenue",
  "FacilityStr2": null,
  "FacilityCity": "St. Helena",
  "FacilityState": "CA",
  "FacilityZipCode": "94574",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06055",
  "LEPC": "California Coastal Region",
  "FacilityLatDecDegs": "38.513444",
  "FacilityLongDecDegs": "-122.479528",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A3",
  "LatLongDescription": "AS",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Beringer Wine Estates",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Beringer Wine Estates",
  "OperatorStr1": "1000 Pratt Avenue",
  "OperatorStr2": null,
  "OperatorCity": "St. Helena",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94574",
  "OperatorZipCodeExt": null,
  "FTE": 187,
  "OtherEPAFacilityID": "CAL 000049240",
  "EPAFacilityID": "100000070914",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-08-28 00:00:00",
  "SafetyInspectionBy": "Napa County Env Health Dept",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2000-02-16 00:00:00",
  "DeRegistrationEffectiveDate": "2000-01-31 00:00:00",
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 38.51158,
  "FRS_Long": -122.47633,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6974,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 5823,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 7637,
          "ProcessID": 6974,
          "ChemicalID": 56,
          "Quantity": 10500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7133,
          "ProcessID": 6974,
          "NAICSCode": "111332",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2949,
              "Process_NAICS_ID": 7133,
              "SafetyReviewDate": "1999-06-16 00:00:00",
              "PHA_Date": "1999-06-18 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-18 00:00:00",
              "TrainingReviewDate": "1999-06-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-18 00:00:00",
              "EquipmentInspectionDate": "1999-06-18 00:00:00",
              "EquipmentTested": "Twice weekly system inspection",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-14 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1998-08-09 00:00:00",
              "InvestigationChangeDate": "1998-08-10 00:00:00",
              "ParticipationPlansReviewDate": "1999-06-14 00:00:00",
              "HotWorkPermitReviewDate": "1992-08-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1992-08-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3357,
                  "PreventionProgram3ID": 2949,
                  "ProcessChemicalID": 7637
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5823,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-02-18 00:00:00",
    "ERTrainingDate": "1998-05-01 00:00:00",
    "CoordinatingAgencyName": "Napa County Dept of Env Management",
    "CoordinatingAgencyPhone": "7072534471",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5823,
      "SummaryText": "Beringer Vineyards in St Helena, California, is covered by the California Accidental Release Prevention (Cal-ARP) program and the EPA's Risk Management Plan (RMP) regulations. Anhydrous ammonia is used in a refrigeration system with a maximum quantity that exceeds 10,000 pounds. \n\nIt is the policy of Beringer Wine Estates (Beringer) to comply with the regulatory requirements of the RMP and Cal-ARP regulations. Beringer employees, supervisors and managers are all responsible for complying with the regulations, and they are provided training to help them implement their various responsibilities. \n\n Beringer has developed a process safety and risk management program that documents the policies pertaining to the prevention of accidental releases. In addition, Beringer has conducted technical studies such as the Process Hazards Analysis and the Offsite Consequence Analysis to identify and evaluate potential hazards associated with the use of anhydrous ammonia. Beringer Vineyards has an Emergency Response Plan (ERP) which is coordinated with Napa County response agencies. \n \nA management system is in place for implementing the RMP and Cal-ARP regulations. This system defines the scope and purpose for each program element, procedures for implementation, roles and responsibilities, and the record-keeping requirements. The person with overall responsibility for implementing the risk management program is the Facility Engineer. Delegated responsibilities are outlined in Beringer's written programs. \n\nThe refrigeration system includes 12 major pressure vessels including a high-pressure receiver, accumulators, low-pressure receivers, and suction traps. There are three evaporative condensers, eight compressors and a range of refrigeration process equipment including chillers, an ice builder and jacketed tanks. The ammonia system is equipped with a wide range of safety features:\n\n- The system is designed to meet industry standards and regulatory requirements.\n\n- The system compo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5823,
      "SummaryText": "nents meet industry standard specifications, and they are made of materials compatible with the process chemicals.  \n\n- Safety interlocks will automatically shut down the compressors and/or the refrigeration system when certain operating parameters exceed safe limits. \n\n- Emergency shut down switches for the refrigeration system are located outside the mechanical room and at the tank farm. \n\n- Isolation valves are strategically placed to allow vessels to be closed off in the event of an emergency.\n\n- Ammonia detectors are located in the mechanical room to detect any release of ammonia.\n\n- The exhaust ventilation of the mechanical room goes to the suction of the evaporative condenser. This provides scrubbing of ammonia vapors in the event of an ammonia release inside the mechanical room.\n\n- Pressure relief valves are placed in the system wherever there is potential for overpressure. \n \nThe ammonia refrigeration system is a closed-loop, recirculating process, with little or no need for operator involvement. The system is automatically controlled by a programmable logic controller, which minimizes potential for human error. Under normal conditions, the operator's primary role is to monitor process parameters such as pressure and temperature and check for deviations. The operators also check the system periodically to inspect primary system components, record critical process parameters, and note any abnormal conditions (e.g., leaks, excessive equipment vibration, etc.).  These formal inspections are documented using log sheets, and they are performed at least twice a week. \n\nIn developing the Offsite Consequence Analysis (OCA), the approach taken was to follow EPA's RMP Guidance for Ammonia Refrigeration facilities and their RMP OCA Guidance document. These publications were used to evaluate the hazard distances for the worst-case and alternative release scenarios. \n\nFor the worst-case scenario, the high-pressure receiver was used to determine the release quantity (10,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5823,
      "SummaryText": "500 pounds). For the worst-case release to occur, there would have to be a vessel rupture, allowing the entire contents to become airborne within ten minutes. Using the Model RMP tables, the distance to the ammonia toxic endpoint for this scenario would be 1.8 miles, assuming rural terrain. However, this type of release is extremely unlikely to occur, as it takes no account of the many safety features inherent in the design, operation and maintenance of the system, described above. \n\nFor the alternative release scenario, the scenario selected was a small hole in a line with high-pressure liquid ammonia. This scenario would result in a higher release rate than other scenarios considered, such a release from a safety relief valve. Using the Model RMP tables, the distance to the toxic endpoint for this scenario would be 0.2 miles. \n\nFor the worst-case scenario, the population within the vulnerable zone circle is over 1,200, and 120 for the alternative release scenario. Beringer has identified the public receptors within these zones, and those within the alternative release zone are addressed in the emergency response plan. \n\nDuring the last five years, there have been no accidents involving ammonia that resulted in any offsite impacts, and there have been no injuries or fatalities onsite. \n \n Beringer has implemented a comprehensive prevention program to minimize the potential for a catastrophic release of ammonia. Process safety information is available to employees, and a Process Hazards Analysis (PHA) has been conducted. External events (including earthquakes) were considered in the PHA. Recommendations made by the PHA team to improve safety are being addressed. A registered engineer is involved in the design of all major system changes, and pre-startup safety reviews are conducted prior to startup. A management of change procedure has been implemented. \n\nOperations and Maintenance (O&M) manuals provide written operating instructions for the ammonia refrigeration sy"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5823,
      "SummaryText": "stem, including the control system. Equipment inspections, testing and maintenance activities are performed on a routine basis. Annual training for ammonia is provided to the mechanics who operate the system. \n\nA compliance audit procedure has been developed for the risk management program, and this will be used every three years to verify compliance with the Cal-ARP and RMP regulations. Beringer investigates any incident or accident that results in the release of a reportable quantity of ammonia. Incident investigation procedures include root cause analysis.\n\nBeringer mechanics are trained as first responders under the HAZWOPER standard for emergency response. For an ammonia emergency, the procedures are to shut down the system, notify the response agencies, shelter in place, and assess the cause of the release, if this can be done safely. Guidance is provided to employees to distinguish between an incidental release and an emergency. The emergency response plan has been coordinated with the local County agencies, and Beringer will cooperate with these agencies to coordinate any offsite response that may be required in an emergency. \n\n Following the PHA conducted in June 1999, Beringer is implementing recommendations to improve safety. These include improvements to the safety systems, equipment modifications, and revisions to the operating and maintenance procedures. Recommendations developed in any future MOC review will be included in the action tracking system to ensure they are addressed in a timely manner. \n\nBeringer is continually looking at new technologies to improve safety and to reduce the inventory of anhydrous ammonia. For example, anhydrous ammonia used for wastewater treatment is being replaced with aqueous ammonia, and some tube and coil heat exchangers are being replaced with more efficient plate and frame exchangers. \n\nIn summary, the design of the refrigeration system at Beringer Vineyards, and the implementation of the safety and risk management"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5823,
      "SummaryText": "programs provide a high level of assurance that the risks associated with the use of ammonia are effectively managed."
    }
  ]
}