{
  "FacilityID": 5847,
  "FacilityName": "Luzenac America Alpine Mill",
  "FacilityStr1": "4100 Grist Mill Road",
  "FacilityStr2": null,
  "FacilityCity": "Alpine",
  "FacilityState": "AL",
  "FacilityZipCode": "35014",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01121",
  "LEPC": "Talladega County LEPC",
  "FacilityLatDecDegs": "33.313889",
  "FacilityLongDecDegs": "-86.216389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 79114013,
  "ParentCompanyName": "Luzenac America, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 790522791,
  "Company2DUNS": 0,
  "OperatorName": "Luzenac America, Inc.",
  "OperatorStr1": "9000 E. Nichols Avenue, Suite 200",
  "OperatorStr2": null,
  "OperatorCity": "Englewood",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80112",
  "OperatorZipCodeExt": null,
  "FTE": 18,
  "OtherEPAFacilityID": "ALB 980217921",
  "EPAFacilityID": "100000072663",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-31 00:00:00",
  "SafetyInspectionBy": "MSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "1999-08-19 00:00:00",
  "DeRegistrationEffectiveDate": "1999-08-01 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.347,
  "FRS_Long": -86.24635,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7003,
      "AltID": "Alpine Mill",
      "FacilityID": 5847,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 7667,
          "ProcessID": 7003,
          "ChemicalID": 49,
          "Quantity": 71732.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 7668,
          "ProcessID": 7003,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7162,
          "ProcessID": 7003,
          "NAICSCode": "327992",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 3654,
              "Process_NAICS_ID": 7162,
              "SafetyReviewDate": "1999-06-01 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 1,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-01 00:00:00",
              "ChangeCompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-01 00:00:00",
              "TrainingReviewDate": "1999-06-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-16 00:00:00",
              "EquipmentTested": "All process equipment inspected daily",
              "ComplianceAuditDate": "1999-03-31 00:00:00",
              "AuditCompletionDate": "1999-06-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-06-01 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3759,
                  "PreventionProgram2ID": 3654,
                  "ProcessChemicalID": 7667
                },
                {
                  "PrimaryKey": 3760,
                  "PreventionProgram2ID": 3654,
                  "ProcessChemicalID": 7668
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5847,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-02-01 00:00:00",
    "ERTrainingDate": "1999-03-01 00:00:00",
    "CoordinatingAgencyName": "Childersburg Fire Department",
    "CoordinatingAgencyPhone": "2053787062",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5847,
      "SummaryText": "Luzenac America, Inc has developed this Risk Management Program to comply with the requirements of the Clean Air Act Amendments, as designated at 40 CFR part 68.  It is Luzenac America's corporate policy to comply with all elements of environmental regulation as they apply to Luzenac America facilities.  Luzenac America maintains a proactive program for environmental compliance and actively seeks ways in which the potential for environmental risks can be reduced on a daily basis.\n\nThe talc processing facility in Alpine, Alabama receives raw talc ore and processes the ore by size reduction, purification and bleaching to produce high quality talc for use in food, paper, pharmaceutical and other industrial applications.  Due to realignment of Luzenac America facilities, functions and manufacturing needs, the processing operations at Alpine are going to be dramatically reduced in June, 2000.  The only remaining operations at Alpine after this date will include size reduction and talc slurry manufacturing.  This slurry is used by a paper manufacturer in central Alabama.  This change in manufacturing will reduce the workforce at the Alpine facility from present day levels of approximately 18 people to three people.  After realignment of the facility operations occurs, many of the chemicals currently used in the process will be discontinued and residual chemicals will be removed from the site.\n\nCurrently the Alpine has two chemicals that are in use that trigger compliance with the Risk Management Program (RMP) under the Clean Air Act.  The two chemicals in use that fall under the RMP are sulfur dioxide and chlorine.  Both of these materials are compressed (liquefied) gases.  Both materials are stored in tanks at the facility.\n\nSulfur dioxide is used at the facility to aid in the removal of contaminants from the talc during processing.  Sulfur dioxide is added to the process to break the molecular bonds between the talc ore and contaminants such as metals and other inorgani"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5847,
      "SummaryText": "c materials.  Chlorine is also used in the process, but in a secondary manner.  Talc processing uses a considerable amount of water.  To improve the quality of the water used at the facility, the water is chlorinated.  Treating the water with chlorine kills many bacteria in the water that may negatively impact the processed talc.  Sulfur dioxide and chlorine are both essential materials for processing talc at the Alpine Mill.\n\nBoth sulfur dioxide and chlorine can produce serious consequences, should they be released from their storage containers.  As outlined in their Materials Safety Data Sheets, attached to the RMP as Appendix A, both gases can cause moderate to sever respiratory problems if they are inhaled, and also cause skin burns if they come into contact with a person when they are accidentally released.  Luzenac America maintains as small an amount of these materials on site at any one time to practically and economically support the manufacturing process in an attempt to reduce overall release potentials.\n\nLuzenac America is currently removing residual products from the bulk sulfur dioxide storage tank, and converting remaining sulfur dioxide delivery storage over to one ton cylinders.  It is the intention of Luzenac America to discontinue use of the bulk storage tank within the next thirty days.  Once this has been completed, Luzenac America will remove piping to/from the tank, and secure the tank such that it can not be used.  Luzenac America will inert and remove the tank from the premises as soon as it is practical to do so.\n\nAs required by the RMP under the Clean Air Act, this Executive Summary must address several issues.  These are presented as stated in the RMP:\n\nThe accidental release prevention and emergency response policies of your facility:  Luzenac America recognizes the danger of using any chemical in an industrial process.  As a corporate policy, Luzenac America continually evaluates processes to reduce the amount of chemicals in use in fac"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5847,
      "SummaryText": "ility processes.  Luzenac America maintains training programs for all staff members for emergency response to releases of regulated materials at the facility.  The Alpine staff also have a standing safety committee that is comprised of managerial, line supervision and hourly staff personnel.  This committee meets monthly to address issues of safety, process, and emergency response.  Luzenac America has also developed a set of Best Management Practices and emergency response programs for each facility, including Alpine.  Each Luzenac America facility is reviewed on a regular basis by a corporate environmental coordinator.  These facilities are also reviewed by the Federal Mine Safety and Health Administration (MSHA).\n\nYour facility and the regulated substances handled: As described above, the Alpine Mill process talc ore into finished products that are used by paper, pharmaceutical, food and other industrial markets.  The process involves the size reduction of the talc, flotation/separation of contaminants and bleaching (whitening) the talc prior to drying and packaging.  In terms of the RMP, two materials fall under the program, sulfur dioxide and chlorine.  Sulfur dioxide is used in the purification of the raw ore during processing, while the chlorine is used to treat process water prior to the water entering the process stream.  The sulfur dioxide is stored in a 6,000 gallon (nominal capacity) tank, while the chlorine gas is stored in four, one ton cylinders.  Storage of both of these materials is in areas that are restricted by fencing, dikes, berms or structures, thus minimizing the potential for rupture of the storage vessels due to vehicular damage or process equipment.\n\nThe worst case scenarios and the alternative release scenarios: The worst case scenario for the Alpine Mill is the sudden release of the entire contents of the sulfur dioxide tank.  This type of release is very unlikely for two specific reasons.  The first is that it is unlikely that the stora"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5847,
      "SummaryText": "ge tank would rupture.  It is located outside the facility behind two containment walls.  The first is approximately three feet high, and the second is approximately four feet high.  The tank and containment walls are located away from the flow of vehicular traffic.  It is perhaps more likely that a small rupture could occur in a process line.  Should this occur, the leak can be locally controlled by process valving, isolated, and repaired.  In the event of any release, the facility staff will be evacuated until the leak can be controlled and repaired.  The second reason, and perhaps the more important reason is that it is unlikely that the storage tank will be filled to capacity at any given time, thus reducing the potential for the full release scenario.  The alternative release scenarios are considerably less severe, and typically would not impact any off-site populations.\n\nThe general accidental release prevention program and chemical-specific prevention steps:Luzenac America Best Management Practices and operations protocols require facility staff to review and inspect the process equipment on a daily basis.  This review is intended to recognize potential hazards in the work place, and attempt to mitigate issues before they become problems.  As described above, Alpine staff review safety and emergency preparedness programs on a regular basis.  These programs are also reviewed and amended as needed by Luzenac America corporate staff.\n\nFive year accident history: During the past five years, the Luzenac America Alpine Mill has not had a reportable quantity release of regulated materials.  The Alpine Mill also has an impressive safety record with no loss-time reported injuries over the past sixteen years.\n\nThe emergency response program: The Alpine facility continues to monitor and improve emergency response programs and protocols.  As with many other industries, emergency response at the Alpine facility is based on interaction with local emergency personnel.  Firs"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5847,
      "SummaryText": "t efforts at mitigation and control will be conducted by Alpine staff, after the emergency has been evaluated and the emergency response program placed into action.  If the nature of the emergency is of such that it can not be controlled by on site staff, the Childersburg, Alabama emergency response team will be contacted.  Childersburg maintains a complete hazardous materials (HAZMAT) response team.  The safety committee for the Alpine facility is assigned the task of insuring that facility staff are trained and updated on emergency response procedures.\n\nPlanned changes to improve safety: The Luzenac America Alpine Mill has not had a reportable quantity release or a lost time accident in over five years.  This is a notable accomplishment.  The Alpine management and staff plan on updating training programs to incorporate the information included in this RMP.  However, since the facility is scheduled to be reduced in staff, hours and processing in June, 2000, there are no plans to undertake major revisions to existing safety programs at this time."
    }
  ]
}