{
  "FacilityID": 5871,
  "FacilityName": "Planters Service & Sales, Inc.",
  "FacilityStr1": "1463 Highway 20 South",
  "FacilityStr2": null,
  "FacilityCity": "Helena",
  "FacilityState": "AR",
  "FacilityZipCode": "72342",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05107",
  "LEPC": "Phillips County LEPC",
  "FacilityLatDecDegs": "34.476667",
  "FacilityLongDecDegs": "-90.606667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": "PLSS@IPA.net",
  "FacilityDUNS": 35660620,
  "ParentCompanyName": "G & B Terminal, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "P. R. Burks",
  "OperatorStr1": "P. O. Box 2488",
  "OperatorStr2": null,
  "OperatorCity": "West Helena",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72390",
  "OperatorZipCodeExt": null,
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000075367",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-03 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-06-25 00:00:00",
  "DeRegistrationEffectiveDate": "2004-06-21 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 34.479178,
  "FRS_Long": -90.6102,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7036,
      "AltID": "Phosphate Ammoniation",
      "FacilityID": 5871,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 7707,
          "ProcessID": 7036,
          "ChemicalID": 56,
          "Quantity": 54238.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7196,
          "ProcessID": 7036,
          "NAICSCode": "325311",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2980,
              "Process_NAICS_ID": 7196,
              "SafetyReviewDate": "1999-06-01 00:00:00",
              "PHA_Date": "1999-05-13 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Operating Procedures, Contractor Safety, Preventive Maintenance Inspections",
              "OpProceduresReviewDate": "1999-06-01 00:00:00",
              "TrainingReviewDate": "1999-06-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-15 00:00:00",
              "EquipmentTested": "Anhydrous Ammonia Storage Area",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-06-01 00:00:00",
              "AuditCompletionDate": "1999-08-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-01 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3391,
                  "PreventionProgram3ID": 2980,
                  "ProcessChemicalID": 7707
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5871,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-01 00:00:00",
    "ERTrainingDate": "1999-06-30 00:00:00",
    "CoordinatingAgencyName": "Phillips County LEPC",
    "CoordinatingAgencyPhone": "8703385530",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 5871,
      "SummaryText": "ms,\n* consequences of deviation from operating limits,\n* safety systems,\n* applicable design codes and standards,\n* process chemistry, and\n* design basis for relief and ventilation systems.\n\nWhen information was not available for design documents, it was developed through special project committees or during the Process Hazard Analyses (PHAs) of the Phosphate Fertilizer Ammoniation Process.  Many of the operating parameters are included in the operating procedures to aid in the safe and proper operation of the process.  These documents are used to:\n\n* train employees,\n* perform Process Hazard Analyses (PHAs), and\n* help maintain the equipment.\n\nAll the above mentioned information, in combination with written procedures and trained personnel, provide a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the Phosphate Fertilizer Ammoniation Process are not compromised.\n\n4.2  Process Hazard Analysis\n\nPlanters Service performs and periodically updates process hazard analyses (PHAs) of the Phosphate Fertilizer Ammoniation Process to help identify process hazards and generate recommendations that might improve the safe operation of the process.  Within this program, the Phosphate Fertilizer Ammoniation Process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\nTo perform the PHAs, Planters Service primarily uses the What-if/Checklist technique.  The PHAs are conducted using a team of people with experience in engineering and Phosphate Fertilizer Ammoniation Process operation and a leader with experience in process hazard analysis techniques. This team identifies and evaluates hazards of the process as well as accident prevention and/or mitigation measures, when appropriate.  The team then prepares a written report describing the results of the analysis, including a list of recommendations ranked a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5871,
      "SummaryText": "Service Phosphate Fertilizer Ammoniation Process is covered by the OSHA Process Safety Management standard.  The requirements of the OSHA Process Safety Management standard are nearly identical to the RMP Rule Program 3 Prevention Program requirements.  The Phosphate Fertilizer Ammoniation Process Prevention Program consists of the following elements:\n\n4.1  Process Safety Information\n\nPlanters Service maintains a variety of technical documents that help ensure the safe operation of our processes.  These documents address:\n\n* physical properties of hazardous substances handled,\n* chemical properties and associated hazards of those substances,\n* operating parameters and limitation(s) of the process equipment,\n* design basis and configuration of the equipment, and\n* specific chemical inventories.\n \n Planters Service ensures that the process safety information is available to all Planters Service employees, the Local Emergency Planning Committee (LEPC), and the local fire department.  The Plant Maintenance Manager is responsible for maintaining and updating this information, as needed.\n Chemical specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs).  This information is supplemented by other technical information specific for these chemicals.  Continuous attention is given to revisions and updates on the hazards of anhydrous ammonia and other chemicals used in our processes.  Information regarding toxicity, environmental impacts, corrosion concerns, inadvertent mixing hazards, and other safety and health concerns are addressed and communicated to the appropriate parties.\n Planters Service also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes:\n \n* materials of construction,\n* design pressures,\n* temperature ratings,\n* electrical ratings,\n* flow limits,\n* block flow diagra"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 5871,
      "SummaryText": "1.0  Accidental Release Prevention and Response Policies\n\n\nPlanters Service has a long standing commitment to operating our facility in a manner that is safe for our employees, the public, and the environment.  A primary aspect of this commitment is Planters Service's system to help ensure the safe operation of our processes.  Our commitment is also demonstrated by the resources invested in accident prevention, such as considering safety in the design, installation, operation and maintenance of our processes, as well as, extensive training of our operating personnel. \nIn the event of an accidental release, Planters Service has procedures which are designed to control and contain the release in a manner which will be safe for our 9employees and will help prevent injury to the public and the environment.  Planters Service's emergency response personnel receive thorough training in handling accidental releases.  An emergency response coordinator has been assigned to oversee response activities and to coordinate response efforts with local emergency agencies. Communications with the Local Emergency Planning Committee (LEPC) have been ongoing throughout the preparation of this plan and policies.\nIn order to effectively implement these policies, Planters Service established a management system headed by the Vice-President to ensure the proper implementation and effectiveness of our Risk Management Program.\n\n\n2.0\tPlanters Service and Regulated Substances\n\n\nPlanters Service, located in Helena, Arkansas, is primarily involved in the manufacture of agricultural fertilizer products.  To manufacture our products, Planters Service utilizes one regulated substance in sufficient quantity to be covered by the RMP Rule.  The following table lists Planters Service's covered process under the RMP Rule and the associated Regulated Substance with its respective maximum quantity:\n\nProcess Description: Phosphate Fertilizer Ammoniation\nProgram Level: 3\nRegulated Substance: Anhydrous Ammoni"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5871,
      "SummaryText": "a\nMaximum Quantity (lbs): 54,238\n\n\n3.0  Hazard Assessment Results\n\n\nPlanters Service performed an offsite consequence analysis to estimate the potential impacts of accidental releases of the anhydrous ammonia from our process. The Regulated Substance was evaluated for a possible worse-case release scenario and alternative release scenario.  It is important to understand that Planters Service has invested extensive resources to prevent releases, and the potential for a worse-case release is extremely small.  The alternative release scenario represents a more realistic potential for occurrence and is based on historical data from our process or other similar processes.  By identifying these potential releases, Planters Service has developed an extensive program to prevent such an occurrence. This program is discussed in detail in the Prevention Program section of this plan.\nThe primary objective of performing the offsite consequence analysis is to determine the distance at which certain effects might occur to the public and/or the environment as a result of an accidental release.  This point is called the endpoint distance.  At distances less than the endpoint distance, the effects would be greater; at distances farther than the endpoint, the effects would be less.\n\n3.1  Hazard Assessment - Toxic Substances\n\nThe worst-case scenario (WCS) associated with Regulated Toxic Substances is a failure of a 12,523 gallon storage tank of anhydrous ammonia when filled to the controlled 80% of capacity level.  A toxic cloud formed by the evaporating anhydrous ammonia would reach offsite endpoints and public receptors.\nAn alternative release scenario (ARS) for anhydrous ammonia releases is a release from a severed pipe in the storage tank area.  The modeled release lasted for 60 minutes before it is stopped.  A toxic cloud formed by the evaporating anhydrous ammonia would reach offsite endpoints and public receptors.\n\n\n4.0  Accidental Release Prevention Program Program 3\n\n\nPlanters"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5871,
      "SummaryText": "ccording to relative risk ratings assigned by the team.  Responsibility to resolve the recommendations is assigned to the Manager of Pulp and is tracked through completion.  The final resolution of each finding is documented and retained.\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, Planters Service periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the Phosphate Fertilizer Ammoniation Process is no longer in operation.  The results and findings of these updates are documented and retained.  The team findings are forwarded to the President for consideration, and the final resolution of the findings is documented and retained.\n\n4.3  Operating Procedures\n\nPlanters Service engineers, operators, and supervisors work together to develop and maintain written operating procedures to define how tasks related to the Phosphate Fertilizer Ammoniation Process operation should be safely performed.  These written procedures address various modes of process operations, such as:\n\n* unit startup,\n* normal operations,\n* temporary operations,\n* emergency shutdown,\n* normal shutdown, and\n* initial startup of a new process.\n \n The written operating procedures include:\n \n* steps for safely conducting process tasks,\n* applicable process safety information, such as safe operating limits and consequences of process deviations, and\n* safety and health considerations, such as chemical hazards, personal protective equipment requirements, and action(s) to take in the event of an exposure to a hazardous substance.\n\n4.4  Training\n\nPlanters Service trains workers to safely and effectively perform their assigned tasks.  Planters Service training program includes both initial and refresher training that covers:\n\n* a general overview of the Phosphate Fertilizer Ammoniation Process,"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 5871,
      "SummaryText": "Service's safety rules, and\n* inform Planters Service personnel of any hazards identified during their work.\n \n Program efforts are accomplished by providing contractors with:\n \n* a process overview,\n* information about safety and health hazards,\n* emergency response plan requirements, and\n* safe work practices prior to beginning work.\n \n 5.0  Chemical Specific Prevention Steps\n \n \n In addition to the required prevention program elements, Planters Service has implemented safety features specific to the hazardous substances used at our facility.  The following describe some of these safety features:\n \n* replacement of relief valves on the anhydrous ammonia storage tank annually,\n* replacement of unloading hoses annually and as needed, and\n* installation of a single switch in the main control room to stop the flow of all raw materials to the reactor in the event of an emergency.\n \n \n 6.0  Five-Year Accident History\n \n \n Planters Service has completed a five-year accident history study of the Phosphate Fertilizer Ammoniation Process process.  No incidents have occurred in the Phosphate Fertilizer Ammoniation Process which resulted in offsite or onsite injuries or property damage.\n \n \n 7.0  Emergency Response Programs\n \n \n Planters Service maintains a written emergency response program, which is in place to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  \n Planters Service emergency response program includes procedures for:\n \n* \ninforming the local LEPC, fire department, and public about accidental releases that could reasonably result in offsite consequences,\n* providing proper first aid and emergency treatment for accidental human exposure to hazardous substances,\n* evacuation plans and methods for accounting for personnel after an evacuation,\n* controlling and contai"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 5871,
      "SummaryText": "ning accidental releases of hazardous substances, including the use of emergency response equipment,\n* inspecting and maintaining emergency response equipment,\n* post-incident cleanup and decontamination requirements, and\n* reviewing and updating the emergency response plan.\n\nPlanters Service maintains an emergency response team trained in these emergency response procedures.  All Planters Service personnel are trained in evacuation procedures.  Drills are conducted periodically to test our evacuation and emergency response procedures.  Annual drills are conducted with local emergency response agencies to ensure emergency plans are properly coordinated. \n\n\n8.0  Planned Changes To Improve Safety\n\n\nPlanters Service continuously strives to improve the safety of our processes through incident investigation, Process Hazard Analysis, and employee suggestions.  Our engineering and technical personnel stay abreast of technology advancements which may improve the safety of our processes.  As a result of these efforts, Planters  Service has planned the following changes in our processes to improve safety:\n\n* employment of outside resources to assist in safety and health efforts,\n* upgrading of existing safety and health programs,\n* organizing process safety information,\n* updating the labeling and warning signs in the plant area, and\n* developing a written procedure for the unloading of anhydrous ammonia.\n\n\nJune 8, 1999\t1"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5871,
      "SummaryText": "* the properties and hazards of the substances in the process, and\n* a detailed review of the process operating procedures and safe work practices.\n\nIn addition to the above mentioned classroom training, each operator is required to work for a period of time with an experienced operator until clear understanding of the operating procedures is demonstrated.  Refresher training is conducted annually as part of Planters Service's ongoing safety training effort.\n\n4.5  Mechanical Integrity\n\nPlanters Service maintains the mechanical integrity of Phosphate Fertilizer Ammoniation Process equipment to help prevent failures that could endanger workers, the public, or the environment.  Planters Service mechanical integrity program includes:\n\n* an inspection and testing program to help identify equipment deterioration and damage before the equipment fails,\n* a quality assurance program to help ensure that the new and replacement equipment meet the design standards required for service in our process,\n* procedures for safe work practices such as lockout/tagout, hot work, confined space entry and line or equipment opening,\n* training of maintenance personnel, and\n* documentation of maintenance activities.\n\n4.6  Management of Change\n\nPlanters Service has a comprehensive program to manage changes to processes.  Under this program, all proposed changes to chemicals, equipment, and procedures for the Phosphate Fertilizer Ammoniation Process must be evaluated and approved to help ensure the change does not negatively affect safe operations.  Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, and procedures are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided with any necessary training related to the change.\n\n4.7  Pre-s"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 5871,
      "SummaryText": "tartup Review\n\nPlanters Service performs a safety review of all new or modified processes prior to their being placed into service to ensure that these processes have been prepared to operate safely.  This review is designed to confirm:\n\n* construction and equipment are in accordance with design specifications,\n* adequate safety, operating, maintenance, and emergency procedures are in place,\n* employee training has been completed, and\n* for covered processes, a PHA has been performed for new processes and management of change requirements have been completed for modified processes.\n \n A pre-startup review team uses checklists to verify all aspects of readiness.  The review involves field verification of the construction elements and serves as a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\n \n 4.8  Compliance Audit\n \n Planters Service conducts periodic audits of the Phosphate Fertilizer Ammoniation Process to ensure Planters Service Prevention Program has been effectively implemented and addresses the safety issues of our operations. Compliance audits are conducted at least every three years by a team of hourly and management personnel who are knowledgeable of the RMP Rule and the Phosphate Fertilizer Ammoniation Process.  The team evaluates Planters Service Prevention Program and other aspects of Planters Service Risk Management Program.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the Prevention Program are implemented.  Planters Service maintains records of at least the last two audits conducted.\n \n 4.9  Incident Investigation\n \n Planters Service promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to pre"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 5871,
      "SummaryText": "vent recurrence of the incident or a similar incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n \n 4.10  Employee Participation\n \n Planters Service developed a written employee participation program for the Phosphate Fertilizer Ammoniation Process and other aspects of our operations to ensure that the safety concerns are addressed.  Planters Service encourages the active participation of our employees in the Prevention Program for all processes and tasks at our facility.  Employees are consulted on and informed of all aspects of Planters Service Risk Management Program and participate on PHA and Compliance Audit teams.\n \n 4.11  Hot Work Permits\n \n Planters Service established a Safe Work Permit program to control spark or flame producing activities that could result in fires or explosions in the processes at our facility. Planters Service utilizes a Safe Work Permit form designed after the OSHA fire prevention and protection requirements found in 29 CFR 1910.252(a).  Personnel who are to perform the Hot Work are required to complete the form which is reviewed by the area supervisor.  The form must be approved before work can proceed.  Training in the use of the Safe Work Permit form is provided to all affected personnel.\n \n 4.12  Contractors\n \n Planters Service established a program to help ensure that contractors who are used to supplement the workforce during periods of increased maintenance or construction conduct their work in a safe manner.  Under the program, the record of all contractors is reviewed to ensure that Planters Service hires contractors who can safely perform work on or near covered process equipment.  Our program ensures that contractors:\n \n* \nperform their work in a safe manner,\n* have the appropriate knowledge and skills,\n* are aware of the hazards in the workplace,\n* understand what to do in the event of an emergency,\n* understand and follow Planters"
    }
  ]
}