{
  "FacilityID": 5956,
  "FacilityName": "GKN Aerospace, Chem-tronics, Inc",
  "FacilityStr1": "1150 West Bradley Ave",
  "FacilityStr2": null,
  "FacilityCity": "El Cajon",
  "FacilityState": "CA",
  "FacilityZipCode": "92020",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06073",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "32.818056",
  "FacilityLongDecDegs": "-116.976667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "jxm@chem-tronics.com",
  "FacilityDUNS": 67655985,
  "ParentCompanyName": "GKN Westland Aerospace",
  "Company2Name": "GKN plc",
  "CompanyDUNS": 291993939,
  "Company2DUNS": 0,
  "OperatorName": "Chem-tronics, Inc",
  "OperatorStr1": "1150 West Bradley Ave",
  "OperatorStr2": null,
  "OperatorCity": "El Cajon",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92020",
  "OperatorZipCodeExt": null,
  "RMPContact": "Julian Medina",
  "RMPTitle": "Manager of Environmental Affairs",
  "FTE": 970,
  "OtherEPAFacilityID": "92020chmtr1150W",
  "EPAFacilityID": "100000071085",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-01-24 00:00:00",
  "DeRegistrationEffectiveDate": "2004-07-19 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 32.81724,
  "FRS_Long": -116.97868,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7140,
      "AltID": null,
      "FacilityID": 5956,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7303,
          "ProcessID": 7140,
          "NAICSCode": "336412",
          "_desc": {
            "NAICS_CODE": "336412",
            "NAICS_DESCRIPTION": "Aircraft Engine and Engine Parts Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 7819,
          "ProcessID": 7140,
          "ChemicalID": 55,
          "Quantity": 54000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 507819,
          "ProcessID": 7140,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5956,
      "SummaryText": "1.0 EXECUTIVE SUMMARY\n\nChem-tronics has been manufacturing aerospace parts using HF in El Cajon, California for over20 years, and for 20 years we have remained committed to the safety of the community and the environment.  Our safety program includes:\n\n1. Proven and reliable controls and monitoring systems for all our critical operations;\n2. Spill prevention systems designed to minimize the possibility and the impact of spills;\n3. Fully trained and equipped emergency response teams, available to respond around the clock.\n\nCalifornia instituted requirements for risk analysis and prevention programs before the U.S. EPA, so our facility prepared and submitted a Risk Management and Prevention Program in 1996.  As part of the California program, we conducted an earthquake risk analysis and an extensive review of our process hazards.  Our safety program was reviewed by an independent consultant working with our in-house safety experts, which resulted in a number of improvements to our program.\n\nFor the EPA's Risk Management Program, we conducted a new hazard review which included a \"What If ?\" analysis.  Potential spill scenarios were identified and the possibilities of off-site impacts were studied.  Potential spill scenarios include releases from chemical storage tanks, from transfer piping, and spills from 55 gallon drums.  The presence of containment trenches and sumps at our facility was taken into account in this analysis.\n\nThis Risk Management Plan covers one regulated substance - 70% hydrofluoric acid (HF) - used in a single process - chemical milling and cleaning of metals - which does not involve elevated temperatures or pressure.  The maximum amount of 70% HF at the facility is 7,350 gallons.  Most of the HF inventory is in a single enclosed rubber lined steel storage tank located inside covered concrete walls.  Small amounts of HF are in pipes which run from the storage tank to the process tanks where the HF is diluted to an 8% concentration used in the chemic"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5956,
      "SummaryText": "al milling process.  For short periods of time, 70% HF can also be stored in 55 gallon drums (maximum four drums).  \n\nThe Risk Management Plan also involves a review of the transportation of HF.  The majority of the HF is received at Chem-tronics in bulk quantities from the manufacturer and is transferred directly from the transport truck to the enclosed storage tank.  When HF is received in 55 gallon drums, they are off-loaded near the building where they are used in the chemical milling process.\nAs part of our hazard review, numerous spill scenarios were considered.  Because there is a containment wall around, and a cover over the storage tank, the worst case scenario was determined to be a  release of the contents of the 2-in diameter piping used for bulk refilling of the supply storage tank.  The 36 gallon spill would be contained in trenches sloping to a large wastewater treatment sump.  Among the potential spills examined, this scenario's spill and evaporation area was largest, thereby maximizing the potential offsite impacts.  Also assumed in this worst case scenario was an acid and air temperature of 104 0F, based on the maximum daily temperature recorded in El Cajon in the previous 3 years, a stability category of F, a wind speed of 3.3 miles/hour and a release rate of 2.1 pounds per hour.  Using the ALOHA computer code it was determined that  residents and the high school would not be impacted by  this worst case scenario.  The only public receptors within that distance would be the neighboring industrial facilities.  Most of these receptors work mainly indoors and would be sheltered during this worst case scenario.\nA more likely alternative release scenario was determined to be a spill from a 55-gallon drum in the truck unloading area.  Typical weather conditions during this scenario are a temperature of 70 0F and winds of 11 miles per hour.  Secondary containment trenches and a small sump fully contain the spill amount without overflowing, with a safety "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5956,
      "SummaryText": "factor of over two.  It was assumed that the sump pump, which would be used to pump the spilled liquid to the wastewater treatment sump, would not be used.  Using the ALOHA computer code for a typical weather condition (stability category D) and a constant evaporation rate of about 2.2 lb/min the only impacted  offsite area would be a portion of the neighboring industrial facility used for warehousing.  \n\nWe have reviewed our spill records for this Risk Management Plan, and in the past five years there have been no releases involving the HF process.  Experienced employees specially trained in spill prevention measures are in charge of the delivery operations and the chemical milling process.  These employees are required to understand and follow specific procedures and safety rules.  An additional margin of safety is provided by the fact that HF is used only at ambient temperatures and pressures.  In addition, HF can be detected by smell at very low concentrations if it is released.  The facility also maintains an Emergency Response Team that is trained to handle HF spills.  The team trains or conducts drills at least 4 times per year.  The local fire department (which is only a block away)  and the county HAZMAT team representatives have attended these sessions.  Chem-tronics is in full compliance with the state Risk Management Prevention Plan rules, as well as those of the Occupational Safety and Health Administration.\n In the course of reviewing our current procedures and rules, we have identified several measures to further improve safety at the facility:\n\n1. Expand the written procedure for 55 gallon drum handling and storage to include transfer to the pumping station;\n2. Improve the design of the spill containment trenches and sump;\n3. Develop a specific written procedure to ensure against spills during maintenance of the HF transfer pump;\n4. Re-designing the tanker truck access to the storage tank to reduce the chance of vehicle accidents;\n5. Increase the sep"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5956,
      "SummaryText": "aration between the HF storage tank and flammable chemicals.\n\nChem-tronics believes these improvements, in conjunction with our existing safety program, provide safe, effective conditions for the use of HF."
    }
  ]
}