{
  "FacilityID": 5959,
  "FacilityName": "Randall Bold Water Treatment Plant",
  "FacilityStr1": "3760 Neroly Road",
  "FacilityStr2": null,
  "FacilityCity": "Oakley",
  "FacilityState": "CA",
  "FacilityZipCode": "94561",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06013",
  "LEPC": "Contra Costa County HSD",
  "FacilityLatDecDegs": "37.589111",
  "FacilityLongDecDegs": "121.440694",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Contra Costa Water District",
  "Company2Name": null,
  "CompanyDUNS": 796517050,
  "Company2DUNS": null,
  "OperatorName": "Contra Cost Water District",
  "OperatorStr1": "PO Box H20",
  "OperatorStr2": "1331 Concord Avenue",
  "OperatorCity": "Concord",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94524",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": "CAL000127527",
  "EPAFacilityID": "100000071478",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-01-27 00:00:00",
  "SafetyInspectionBy": "Contra Costa County Health Services Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 37.980252,
  "FRS_Long": -121.740054,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7145,
      "AltID": "Chlorine Disinfection",
      "FacilityID": 5959,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 7824,
          "ProcessID": 7145,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7308,
          "ProcessID": 7145,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3034,
              "Process_NAICS_ID": 7308,
              "SafetyReviewDate": "1998-07-27 00:00:00",
              "PHA_Date": "1999-04-22 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-01-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Building enclosed, scrubber",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Install physical barriers/controls",
              "OpProceduresReviewDate": "1998-07-27 00:00:00",
              "TrainingReviewDate": "1998-07-27 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-07-27 00:00:00",
              "EquipmentInspectionDate": "1999-04-05 00:00:00",
              "EquipmentTested": "Emergency equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1998-07-27 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-06-14 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-07-27 00:00:00",
              "HotWorkPermitReviewDate": "1997-12-31 00:00:00",
              "ContractorSafetyReviewDate": "1998-07-27 00:00:00",
              "ContractorSafetyEvalDate": "1998-07-27 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3456,
                  "PreventionProgram3ID": 3034,
                  "ProcessChemicalID": 7824
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5959,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-07-28 00:00:00",
    "ERTrainingDate": "1999-04-20 00:00:00",
    "CoordinatingAgencyName": "Oakley Fire Department",
    "CoordinatingAgencyPhone": "9259305500",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5959,
      "SummaryText": "Introduction\n\nThe Contra Costa Water District's (CCWD) Randall-Bold Water Treatment Plant (Randall-Bold WTP), located in Oakley, California, supplies filtered and disinfected water to the general public for drinking and other uses.  Disinfection involves addition of chlorine gas to the water to destroy bacteria, viruses and other pathogens that may cause harm to public health.  Other chemicals are handled and safely used onsite to aid filtering and removal of organics and other particulate materials that may affect the taste and odor of the treated water.  These chemicals are not part of the RMP program, but are handled, stored, and used in a safe manner by Randall-Bold WTP staff.  \n\nThe chlorine disinfection process at the Randall-Bold WTP is subject to two new regulations - the Federal Risk Management Plan (RMP) and the California Accidental Release Prevention Program (CalARP), which is California's version of the RMP.  The compliance deadline for both of these regulations is June 21, 1999.  The Randall-Bold WTP has already implemented programs to comply with several other accidental release prevention regulations including California's OSHA Process Safety Management (PSM) program and California's Risk Management and Prevention Program (RMPP) because of use and storage of chlorine. The California RMPP law was repealed in January 1997 and replaced by the CalARP regulation.\n\nThe goal of these regulations and programs (new and existing) is to prevent and minimize the consequences of accidental releases of chlorine to both on-site staff and the surrounding community.  To meet this goal, CCWD has identified potential hazards, implemented comprehensive accident prevention programs, installed safety and release response equipment (including a scrubber system to treat release events and other process and piping related safety equipment), and prepared for emergencies. CCWD's approach to meet safety information and associated operating and maintenance procedures and documen"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5959,
      "SummaryText": "tation requirements for RMP/CalARP is to build upon the existing programs and regulatory compliance activities associated with the PSM and RMPP Programs. The PSM and RMPP were implemented at Randall-Bold WTP when regulations became effective at the facility.  Most of the compliance requirements, documentation, procedures, and safety programs to meet compliance with these new regulations were taken directly from PSM and RMPP documents or existing operating and maintenance procedures. \n\nChlorine Safety Policy\n\nChemicals are widely used in industry, in the home, and in the environment.  They are transported on roads, water, and railways.  We at the Randall-Bold WTP use chlorine to disinfect our water.  Storing large qualities of chlorine can be a hazard.  We take our safety obligations in storing and using chlorine as seriously as we take providing a safe, reliable supply of drinking water.  This RMP describes what could happen if there were to be an accident, the steps we take every day to ensure a safely operating plant, and what we do in event of an emergency.  Please feel free to contact David Omoto, CCWD Environmental Compliance Officer at (925) 688-8023 if you have any questions regarding this plan.\n\nWater Treatment Plant Chlorine Disinfection System\n\nThe Randall-Bold WTP supplies treated drinking water to its customers. The Randall-Bold WTP uses chlorine to disinfect water so that it is safe for customers to drink. Chlorine disinfection is a common process at water treatment plants. The Randall-Bold WTP disinfection system uses liquefied chlorine gas from up to four 1-ton containers. Up to eight more 1-ton containers are kept in the chlorine storage room. A vacuum is used to draw chlorine out of the containers and into the water supply.  \n\nThe chlorine storage and use areas are all inside a building that is designed to vent to a scrubber in the event of a chlorine release. The scrubber system can remove up to 2,000 pounds of chlorine gas released inside the buil"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5959,
      "SummaryText": "ding. The areas where chlorine is stored or used are equipped with chlorine sensors that alarm in the event of a chlorine leak. The Randall-Bold WTP is operated and maintained 24-hours a day by highly trained and experienced staff who are experts in the safe handling of chlorine and are prepared to respond to any release situation. Plant access is controlled so that only authorized personnel are allowed to enter the chlorine building. Trained plant staff must accompany visitors.\n\nPotential for Releases with Offsite Consequences\n\nCCWD evaluated two scenarios that might lead to releases. The worst case scenario is specified by the EPA and consists of releasing the entire contents of one of the chlorine containers over a 10-minute period. This scenario is extremely unlikely, resulting only from catastrophic events such as an airplane crash. This scenario assumes that the incident occurs after the containers have been delivered and are in the chlorine storage building because containers are not stored outside. An EPA-developed air dispersion model called RMP*Comp was used to estimate the distance to a point at which the released chlorine gas would no longer present a significant public health impact. The calculated distance for the worst case scenario was 2.2 miles based on indoor chlorine use and storage. This distance may be exaggerated because of the use of the conservative EPA model and the use of conservative weather conditions required in the regulation. In addition, this scenario is extremely unrealistic and does not take into account Randall-Bold WTP's existing safety and prevention programs or scrubber and alarm systems. \n\nA second, alternative release, scenario was identified based on the process hazard analysis update as the occurrence of 1/16th-inch leak in the flexible connection between the piping and the chlorine container. This scenario is less improbable than the worst-case release scenario. It takes into account that Randall-Bold WTP's extensive safety"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5959,
      "SummaryText": "and release prevention systems will help to mitigate the impacts of such a release. The relatively small quantity of chlorine gas that is estimated would be released through this hole would be prevented from leaving the building by the scrubber system.  Thus, it was determined that there is no offsite impact associated with this alternative release scenario. CCWD has developed and implemented the systems in its RMP/PSM program to prevent or mitigate such releases.\n\nNote that the EPA's RMP*Submit program does not allow for an ACS without offsite consequences (endpoint at zero miles). Therefore, the ACS endpoint is entered as 0.01 miles, the minimum allowable in the program.\n\nAccidental Release Prevention\n\nCCWD is in compliance with Federal and State Process Safety Management (PSM) requirements.  CCWD's accidental release prevention program is based on the following key elements:\n7 Detailed management system and clear levels of responsibilities and team member roles;\n7 Comprehensive safety process information that is readily available to staff, emergency responders, and contractors;\n7 Comprehensive preventive maintenance program;\n7 Completion of a process hazard analysis of equipment and procedures with operation and maintenance staff participation and review;\n7 Use of state-of-the-art process and safety equipment;\n7 Use of accurate and effective operating procedures, written with operations and maintenance staff participation;\n7 High level of training of operators and maintenance staff; and\n7 Implementation of an incident investigation, inspection, and auditing program using qualified staff.\n\nProcess and Chemical Safety Information\n\nComprehensive chemical data have been assembled to include regulatory reporting and action thresholds, health hazard, and chemical exposure limitations, as well as detailed physical properties of chlorine. Included are chlorine background information, material safety data sheets (MSDS), and chlorine reaction chemistry. Chlorine process e"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5959,
      "SummaryText": "quipment safety information has also been compiled, including specifications for the chlorine process, maximum intended inventory; safe upper and lower temperatures; safe upper and lower pressures; and codes and standards used to design, build, and operate the processes. This information is on file at the facility and readily accessible and available to the Randall-Bold WTP staff.\nRandall-Bold WTP  also has procedures in place to update safety information if there is a major change that makes existing information inaccurate.\n\nProcess Hazard Analysis \n\nIn 1992, a detailed process hazard analysis (PHA) was conducted by a team of process operating and maintenance experts and process design engineers.  The PHA technique used was the \"Hazard and Operability\" (HAZOP) study, a rigorous approach acceptable to the EPA. The PHA was lead by a person knowledgeable in the HAZOP study technique. A list of actions to resolve significant hazard review findings was prepared and has been fully implemented. A revalidation study of the 1992 PHA was conducted in 1999 and an implementation schedule for findings has been developed and is being implemented.\n\nAs part of the Cal ARP requirements and the RMP external events evaluation, a seismic walkthrough was also recently completed based on the 1997 UBC, and recommendations were provided to CCWD for evaluation and implementation. \n\nProcess Safety Management Program Summary\n\nRandall-Bold WTP's PSM program includes the programs summarized below that control the use and storage of chlorine and ensure the integrity of these systems.\n\nOperating Procedures\n\nCCWD maintains up-to-date, accurate, written operating procedures that give clear instructions for the chlorine process. CCWD ensures effective operating practices by combining them with operating and maintenance training programs.  Standard operating procedures (SOPs) provide system descriptions, specifications, equipment inspection requirements, and operating procedures for the chlorine sys"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5959,
      "SummaryText": "tem.  Procedures include startup, shutdown, and normal, alternate, and emergency operation.  Also included are maintenance and troubleshooting procedures, including consequences of deviation and the steps to avoid and correct deviations.  CCWD will update procedures whenever a change occurs that alters the steps needed to operate safely. Operating procedures will be modified and in place prior to any new process equipment coming on line and before the process is started up after a change.\n\nOperations and Maintenance Training Program\n\nEach CCWD employee involved in operating or maintaining the chlorine process is trained in an overview of the process and detailed, applicable operating and maintenance procedures. CCWD's training program helps our employees understand the nature and causes of problems arising from operations involving chlorine on site, and increases the employees' awareness of process hazards. CCWD's training program includes both initial and refresher training that covers: 1) a general overview of the process; 2) the properties and hazards of the substances in the process; and 3) a detailed review of the process operating procedures and safe work practices.  Written tests, demonstrations, and field observation are used to verify that an employee understands the training material before the process work can be resumed. \n\nTraining documentation includes: date of most recent review or revision to the training program; type of training required; and the type of competency testing used to ensure staff understand the training.\n\nContractors\n\nCCWD has procedures and policies in place that ensure that only contractors with good safety programs are selected to perform work on and around the chlorine process. These policies and procedures also inform contractors of process hazards, access limitations to process areas, and emergency response procedures, and are provided to prepare the contractor to safely complete the work.  CCWD sets minimum contractor safety pe"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 5959,
      "SummaryText": "rformance requirements to work at the Randall-Bold WTP, holds contractor safety briefings before allowing contractors near or in the chlorine process area, controls access to the chlorine process area, and evaluates contractor performance.\n\nPre-Startup Safety Review and Mechanical Integrity Program\n\nCCWD ensures that a pre-startup safety review is completed for any new process at the plant which is covered by the PSM or RMP rules, or for significant modifications to an existing covered process that requires a change in the process safety information. CCWD maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment. CCWD believes that this program is the primary line of defense against a release. The mechanical integrity program addresses equipment testing and inspection, preventive maintenance schedules, and personnel training, including:\n7 Written procedures for maintaining mechanical integrity through inspection and testing of process equipment, based on instructions of equipment vendors, industry codes, and prior operating experience\n7 Written procedures for performing inspections and tests on process equipment at specified intervals\n7 Training of maintenance personnel in procedures for safe work practices such as lockout/tagout, line or equipment opening, and avoidance and correction of unsafe conditions\n7 Procedures specifying training requirements for contract maintenance employees, as well as requiring contractors to use plant developed maintenance procedures for process areas.\n\nHot Work Permits and Management of Change \n\nCCWD requires employees and contractors to employ safe work practices when performing \"hot work\" in, on, or around the covered processes.  CCWD uses a comprehensive permitting and training program to ensure hot work is performed safely.  \n\nCCWD provides a system and approach to maintain and implement any management of changes or modifications to equipm"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 5959,
      "SummaryText": "ent, procedures, chemicals, and processing conditions.  This system allows CCWD employees to identify and review safety hazards and gather additional safety, process, or chemical information before any proposed change is implemented that would either compromise system safety or need training before implementation.\n\nInternal Compliance Audits\n\nInternal compliance audits are conducted at a minimum every three years to verify compliance with the programs and procedures contained in the RMP.  CCWD assembles an audit team of personnel knowledgeable in the RMP rule and in the process. This team evaluates whether the prevention program satisfies the requirements of the Risk Management Program rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented. The most recent audit was conducted in June 1999.\n\nIncident Investigation\n\nCCWD investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented.  CCWD trains employees to identify and report any incident that requires investigation.  An investigation team is assembled and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.  Information found during the investigation is reviewed by affected staff, added or used to revise operating and maintenance procedures, and incorporated into existing training programs, if warranted, to prevent future incidents.\n\nFive-Year Accident History\n\nNo accidental releases of chlorine have occurred at the Randall-Bold WTP that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, pr"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 5959,
      "SummaryText": "operty damage, or environmental damage. Any small, incidental releases are quickly handled or neutralized to prevent off-site impacts and safety or health problems for on-site workers and the community.\n\nEmergency Response Program\n\nCCWD has implemented its Emergency Response Program as well as installed safety systems on its chlorine process such as leak detection equipment and a scrubber to prevent and mitigate chlorine releases. The goal of the emergency response program is to protect its employees and the public in the unlikely event of a release. The two major elements of the emergency response program are an emergency action plan and notification procedures, both of which are described in CCWD's Emergency Response and Evacuation Plan/Employee Training. In the event of a release, the Operator/Supervisor on duty is responsible for immediately calling the on-duty Antioch Control Operator who in turn calls the local fire and emergency medical services agency. The Operator/Supervisor on duty uses the plant public address system to announce the plant evacuation. The local fire and emergency medical services agency is responsible for alerting the public regarding the release.\n\nPlanned Changes to Improve Safety\n\nCCWD is in the process of implementing findings from the PHA revalidation study. CCWD will continue to maintain its own safety programs for hazardous materials to protect its employees and the public."
    }
  ]
}