{
  "FacilityID": 5981,
  "FacilityName": "Farmland Hydro, L.P. (Tampa Terminal)",
  "FacilityStr1": "3421 Port Sutton Road",
  "FacilityStr2": null,
  "FacilityCity": "Tampa",
  "FacilityState": "FL",
  "FacilityZipCode": "33619",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12057",
  "LEPC": "District 8 LEPC",
  "FacilityLatDecDegs": "27.902778",
  "FacilityLongDecDegs": "-82.425",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "http.//www.lblauderdale@farmland.com",
  "FacilityDUNS": 783919780,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Farmland Hydro, L.P.",
  "OperatorStr1": "3421 Port Sutton Road",
  "OperatorStr2": null,
  "OperatorCity": "Tampa",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33619",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000073742",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-31 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 27.9064,
  "FRS_Long": -82.42378,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7175,
      "AltID": "Terminal",
      "FacilityID": 5981,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 7884,
          "ProcessID": 7175,
          "ChemicalID": 56,
          "Quantity": 98000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7339,
          "ProcessID": 7175,
          "NAICSCode": "49319",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3053,
              "Process_NAICS_ID": 7339,
              "SafetyReviewDate": "1997-04-22 00:00:00",
              "PHA_Date": "1997-04-22 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1997-06-17 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Remote shut-down valves",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Monitor cameras",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Added safety showers and escape respirators.",
              "OpProceduresReviewDate": "1999-05-04 00:00:00",
              "TrainingReviewDate": "1997-04-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-06-17 00:00:00",
              "EquipmentInspectionDate": "1999-01-18 00:00:00",
              "EquipmentTested": "Flash tank",
              "ChangeMgmtDate": "1998-02-12 00:00:00",
              "ChangeMgmtReviewDate": "1998-02-12 00:00:00",
              "PreStartupReviewDate": "1999-04-09 00:00:00",
              "ComplianceAuditDate": "1997-04-22 00:00:00",
              "AuditCompletionDate": "1997-10-06 00:00:00",
              "IncidentInvestigationDate": "1997-02-06 00:00:00",
              "InvestigationChangeDate": "1997-02-06 00:00:00",
              "ParticipationPlansReviewDate": "1998-06-17 00:00:00",
              "HotWorkPermitReviewDate": "1995-12-15 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-18 00:00:00",
              "ContractorSafetyEvalDate": "1998-02-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3477,
                  "PreventionProgram3ID": 3053,
                  "ProcessChemicalID": 7884
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5981,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-04-30 00:00:00",
    "ERTrainingDate": "1999-02-25 00:00:00",
    "CoordinatingAgencyName": "Local Fire Department",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5981,
      "SummaryText": "RISK MANAGEMENT PLAN\n                                                             EXECUTIVE SUMMARY\n                                                               Farmland Hydro, L.P.\n                                                          Tampa Ammonia Terminal\n\nTAMPA FACILITY:\n\nFarmland Hydro, L.P. (FHLP) is a limited partnership corporation formed by Farmland Industries, the largest U.S. farmers\u0012 cooperative headquartered in Kansas City, Missouri, and Norsk Hydro ASA, a large Norwegian company engaged in fertilizer, oil and gas, and specialty metals.  Farmland Industries is a highly diversified company with major business lines in crop production and crop protection products, livestock feeds, petroleum, grain processing and marketing, and the processing and marketing of pork and beef products serving the needs of its 600,000 United States farmer-owners.\n\nFarmland Hydro, L.P. purchased the Tampa Ammonia Terminal from Cargill Fertilizers, Inc. in June, 1994.  The facility is located about 1 mile west of U.S. Route 41 on Port Sutton Road south of Tampa, Florida.  The facility receives anhydrous ammonia from ocean-going vessels, stores the ammonia at atmospheric pressure and transfers it to a pipeline (primarily) and trucks.  The facility is situated on Port Sutton Channel with dock facilities for one ship and storage tanks capable of storing up to 49,000 tons of ammonia.  The ammonia is in liquid form and is maintained at low temperature to keep the storage tank pressure below one pound per square inch.\n\nPOLLUTION PREVENTION POLICY:\n\nFHLP is committed to protecting the environment and preserving our natural resources for future generations.  We strive to eliminate or reduce our use of toxic substances and to minimize our use of energy and the generation of all wastes to the extent technically and economically feasible.  We strive to minimize the generation of pollution at the source, but, where that cannot"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5981,
      "SummaryText": "be achieved, we are committed to environmentally sound methods of recycling, treatment and disposal.  By preventing pollution at the source, we strive to achieve cost savings, increase operational efficiencies and maintain a safe, healthy workplace.\n\nREGULATED SUBSTANCE:\n\nAnhydrous ammonia is the only regulated substance at this facility subject to EPA Risk Management Program and the OSHA Process Safety Management Program.  The Tampa Ammonia Terminal receives all of its ammonia by ship and transfers the ammonia out of the facility by pipe line (owned by others) and tank truck.  The ammonia contains a small amount of water which serves as a corrosion inhibitor.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICY:\n\nThe management and employees of this facility are committed to the prevention of any accidental releases.  It is the personal challenge and policy of the management and associates of this facility to identify and reduce or eliminate all recognized process hazards.\n\nTo reduce or eliminate accidents and prevent accidental releases, the facility is committed to the following:\n\n7 A knowledgeable, highly trained and motivated employee group\n7 A well designed facility that is state-of-the art which is maintained and operated in a superior manner\n7 Improvements that enhance safety and accident prevention\n7 Preparation and training for emergency response\n\nFHLP has had a written Emergency Response Plan in effect for many years and employees are trained to the extent of first responder level for ammonia emergency release.  The plan is designed to prevent employee exposure and to coordinate with local emergency response agencies in the event of a release.  A shared community and plant alarm system is in operation.  This plan is coordinated with the local community response plan and is available to those responding agencies.  Emergency Planning and Community Right-To-Know information as required under SARA Title III has been provided to the State Emergency Res"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5981,
      "SummaryText": "ponse Commission, Local Emergency Planning Committee, and local fire department.\n\nPREVENTION PROGRAM:\n\nThe Tampa Terminal is subject to OSHA Process Safety Management rule and is therefore under the EPA Risk Management Rule.  It is a Program 3 facility with a Program 3 Prevention Program.  The OSHA PSM/EPA Prevention Program consists of a set of facility management policies and procedures which promote and recognize process safety and the prevention of accidents in plants that handle, use, store, and process hazardous chemicals above the threshold quantity specified.  The procedures address all aspects of plant activities including training, maintenance, operating procedures, process reviews, safe work practices, incident investigation, audits, and other activities in a manner to provide controls to prevent errors, failures, and inadvertent changes in a process that could result in accidents.\n\nThe prevention program consists of many elements and policies, which are briefly outlined below.\n\nEMPLOYEE PARTICIPATION - Employees participate in all aspects of the program and are provided information developed in the program.\n\nPROCESS SAFETY INFORMATION - All necessary process information and records are maintained in several convenient locations including information on the hazards of the chemicals, process technology with safe operating limits, and equipment records and design requirements.\n\nPROCESS HAZARD ANALYSIS - Several employees have had extensive professional training in the methods of process hazard analysis (PHA) and are available to act as PHA team leaders.  These reviews are updated on a regular basis.\n\nOPERATING PROCEDURES - Operating procedures are in place for all aspects of operation including emergency operation and shutdown.\n\nOPERATIONS TRAINING - All operators are trained initially in the process and its operating procedures and are supervised by an experienced operator for a lengthy training period before being allowed to control the process on their o"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5981,
      "SummaryText": "wn.  They must demonstrate competency in all aspects of the plant operation including unexpected malfunctions.\n\nCONTRACTORS - Contractor selection includes review of safety performance and programs.  All contractor employees are required to attend an initial 16 hour OSHA/MSHA structured class offered at several local community training facilities.  Contractors are also required to have had a recent site specific training and periodic evaluations are made to assure work is completed in a safe manner.\n\nPRE-STARTUP REVIEW - A safety review is conducted on any new process equipment or any significant modification of the process.  This assures that construction and equipment is installed in accordance with design, all necessary procedures including safety procedures are in place, training is completed, and that hazard analysis or requirements of management of change are completed.\n\nMACHANICAL INTEGRITY - This is a quality assurance procedure to assure that equipment, parts, materials, and installations are suitable for the applications intended.  Maintenance employees are trained in process hazards and in safety procedures applicable to their work.  Inspections, procedures and testing are conducted under this part of the program.\n\nSAFE WORK PRACTICES - Procedures and policies for work permits and maintenance lock-out-tag-out procedures are in force and reviewed periodically for completeness and effectiveness.\n\nMANAGEMENT OF CHANGE - No changes in process or procedures are allowed without review and authorization.  Safety impacts, technical review, required procedure modifications, and training are all considered in the review.\n\nINCIDENT INVESTIGATION - Any accident, near-miss, or incident that resulted in or could have resulted in a release is promptly investigated by a facility team.  Findings of the investigation team and recommendations for corrective action are documented, as is the resolution of the recommendations and corrective actions.\n\nCOMPLIANCE AUDIT - Complia"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5981,
      "SummaryText": "nce with the program is audited at least every three years to verify compliance with these procedures.  Findings of the audit are documented and any deficiencies are corrected and documented.\n\n5-YEAR ACCIDENT HISTORY:\n\nThe Risk Management rule requires inclusion of the five-year accident history of the facility for all accidental releases that resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  This facility has not had any incidents or off-site impacts as a result of a release.\n\nSYNOPSIS OF WORST AND ALTERNATE CASE RELEASE SCENARIOS:\n\nThe Risk Management rule requires a hazard analysis for worst case and alternate case accidental release scenarios for regulated substances.  The rule requires an analysis involving the release of the total contents of the largest storage vessel of ammonia at this site.  This is called the \"worst case toxic release scenario\" (worst case scenario) and involves the release of 32,250 tons of ammonia.  This release must be considered to occur over a 10-minute period and pooling of the ammonia can be considered when modeling this release.  We have retained a consultant to model this unlikely release utilizing a model known as DEGADOSE.  His modeling results, according to the rule, determined that there would be off-site impacts.  This worst case is a requirement of the rule regardless of whether the event is likely, or, could even reasonably occur.\n\nAn alternate scenario, which is a more likely event, is required to be submitted.  The alternate chosen involved the release of ammonia from a transfer pipe where 96,000 pounds would be released over a 2 minute period.  A significantly lower quantity is involved because various shutdown safeguards have been installed and operator intervention will tend to mitigate and limit the quantity of failures.  The same modeling techniques were applied and resulted in much les"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5981,
      "SummaryText": "ser off-site impact.\n\nPLANNED CHANGES FOR SAFETY IMPROVEMENTS:\n\nSafety improvements are a continual and ongoing process at the Tampa Terminal facility which is facilitated by the Prevention Program/Process Safety Management Program.  Many process safeguards have been implemented as a result of the Process Hazard Analysis and incident investigation activities.  Such things as remote shut-down systems and surveillance monitors have been installed within the last two years.  It is the understanding of FHLP that through the diligent application of the elements of the Prevention Program/Process Safety Management Program that our employees and the community are assured that the need for emergency response has been significantly diminished and hopefully will never be necessary."
    }
  ]
}