{
  "FacilityID": 6012,
  "FacilityName": "Biddeford And Saco Water Company - Pumping Station",
  "FacilityStr1": "466 South Street",
  "FacilityStr2": null,
  "FacilityCity": "Biddeford",
  "FacilityState": "ME",
  "FacilityZipCode": "04005",
  "Facility4DigitZipExt": "0304",
  "FacilityCountyFIPS": "23031",
  "LEPC": null,
  "FacilityLatDecDegs": "43.498111",
  "FacilityLongDecDegs": "-70.504306",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "IP",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6949119,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Biddeford And Saco Water Company",
  "OperatorStr1": "P.O. Box 304",
  "OperatorStr2": null,
  "OperatorCity": "Biddeford",
  "OperatorStateFIPS": "ME",
  "OperatorZipCode": "04005",
  "OperatorZipCodeExt": "0304",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000074215",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-17 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-09-17 00:00:00",
  "DeRegistrationEffectiveDate": "2014-09-12 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 43.49797,
  "FRS_Long": -70.50706,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7207,
      "AltID": null,
      "FacilityID": 6012,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 7921,
          "ProcessID": 7207,
          "ChemicalID": 62,
          "Quantity": 9800.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7372,
          "ProcessID": 7207,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3064,
              "Process_NAICS_ID": 7372,
              "SafetyReviewDate": "1999-04-27 00:00:00",
              "PHA_Date": "1999-04-29 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-11 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Emergency Lighting",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-09 00:00:00",
              "TrainingReviewDate": "1999-04-27 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-27 00:00:00",
              "EquipmentInspectionDate": "1999-06-09 00:00:00",
              "EquipmentTested": "Response of Chlorine Leak Detector",
              "ChangeMgmtDate": "1999-05-07 00:00:00",
              "ChangeMgmtReviewDate": "1999-04-27 00:00:00",
              "PreStartupReviewDate": "1999-05-07 00:00:00",
              "ComplianceAuditDate": "1999-06-11 00:00:00",
              "AuditCompletionDate": "1999-06-18 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-27 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-09 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-09 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-09 00:00:00",
              "CBI_Flag": 0,
              "Description": "Chlorine Treatment System - Chlorine is drawn from a one-ton cylinder under vacuum and delivered to the chlorinators (3) for introduction into two chlorine solution lines and the treatment process. Other than the solution lines, all chlorination equipment is contained in one room, located at the lowest elevation in the facility and equipped with a chlorine leak detection sensor. The chlorine feed system will only operate under vacuum. Loss of vacuum at any point beyond the vacuum regulator (mounted on the cylinder manifold valve) will stop the discharge of chlorine gas. Fusible plugs are located at the end of each cylinder, and pressure relief valves are located on each chlorinator. The chlorine solution lines are painted safety red, and the contents of each solution line are labeled at four-foot intervals.",
              "_chemicals": [
                {
                  "PrimaryKey": 3490,
                  "PreventionProgram3ID": 3064,
                  "ProcessChemicalID": 7921
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6012,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-11 00:00:00",
    "ERTrainingDate": "1999-06-11 00:00:00",
    "CoordinatingAgencyName": "York County Emergency Mgmt Agency",
    "CoordinatingAgencyPhone": "2073241578",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6012,
      "SummaryText": "The Biddeford And Saco Water Company is committed to being a responsible member of the community by giving top priority to operating in a safe and environmentally sound manner. This commitment is documented in the facilitys accident prevention and emergency response plans, which are available to all employees.\n\nThe primary purpose of the facility is to provide safe drinking water to the communities of Biddeford, Saco, Old Orchard Beach, and Pine Point. Chlorine, a regulated toxic substance, is used for disinfection. Chlorine is delivered to the facility by truck in one-ton cylinders in 100 percent concentration. Fusible plugs are located at the end of each cylinder to prevent rupture and explosion. The delivery truck backs into a garage for unloading. Therefore, the chlorine cylinders are never located outside the building. Three chlorine cylinders are delivered at one time. The maximum amount of chlorine present on-site at any one time would be approximately 9,800 pounds. Four cylinders would be full and a fifth cylinder could contain as much as 1,800 pounds. \n\nThe facility operates a vacuum chlorine process, in which chlorine is drawn from a one-ton cylinder under vacuum and delivered to the chlorinators (3) for introduction into two chlorine solution lines and the treatment process. The chlorine feed system will only operate under vacuum. Loss of vacuum at any point beyond the vacuum regulator (mounted on the cylinder manifold valve) will stop the discharge of chlorine gas. Other than the solution lines, all chlorination equipment is contained in one room, which is located at the lowest elevation in the facility. This room, where all chlorine cylinders are stored and the chlorinators are located, is equipped with a chlorine leak detection sensor. The chlorine cylinders are equipped with fusible plugs, as indicated above, and the chlorinators are equipped with pressure relief valves. A large viewing window allows equipment in the room (or emergency responders) to"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6012,
      "SummaryText": " be monitored from outside. From the chlorinators, chlorine is delivered in a less concentrated chlorine solution to various feed points at the treatment station. Two chlorine solution lines are used regularly, the Top of Filter and the Clearwell application lines. The two chlorine solution lines are painted safety red, and the contents of each solution line are labeled at four-foot intervals. A Chlorine Institute Repair Kit B is maintained at the Pumping Station. The kit includes materials to contain any leaking manifold valves or defective chlorine cylinders. \n\nThe worst-case release scenario associated with the chlorine process is the release of the total contents of one chlorine cylinder, or 2,000 pounds of chlorine. Because the chlorine cylinders are never located outside the building, the worst-case release was assumed to occur in an enclosure, but with direct contact with outdoor air via windows and doors. It is extremely unlikely that this worst-case release would occur due to chlorine industry standard procedures, as well as the safety measures instituted by the facility, as described briefly above. Numerous alternative release scenarios were considered. Although an accidental release of chlorine is unlikely for any scenario, the most reasonable alternative scenario was identified as a break in the Top of Filter solution line. Again, this release is assumed to occur in the building. USEPA guidance documents and the USEPAs RMP*CompTM model were used to determine the distance to endpoint for each scenario. In both cases, the resulting distance to endpoint extends offsite. However, no residences are located within the distance to endpoint for the alternative release scenario.\n \nThe facility complies with OSHAs process safety management regulation and with the USEPAs Accidental Release Prevention regulations, 40 CFR Part 68, as well as applicable state and local regulations. \n\nThere has never been an accident involving chlorine at the facility that caused de"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6012,
      "SummaryText": "aths, injuries, property or environmental damage, evacuations, or sheltering in place.\n\nThe facility has developed an emergency response program to minimize the effects of accidental releases of chlorine on employees, the public, and the environment. The facility has a trained emergency response team, appropriate equipment and supplies, and a detailed emergency preparedness plan. In the event of a chlorine release of 10 pounds or more or a release which could potentially extend beyond the facilitys boundaries, it is the companys policy to notify agencies as required by SARA regulations which would include the emergency response agency, the State Police, the fire department, and the Maine Drinking Water Program and Public Utilities Commission.\n\nA new vacuum chlorine process was installed this year. Because of the new process, all prevention, safety, and emergency response procedures were recently reviewed and revised, as appropriate. A few additional safety measures are planned. The chlorine cylinders will be anchored for security in case of flooding, and the fan in the chlorine room will be relocated for easy removal during flooding conditions. Additional measures will also be taken to shield the Clearwell solution line from ice where the line is exposed outside the building."
    }
  ]
}