{
  "FacilityID": 6024,
  "FacilityName": "Trigas, Inc. (Pasadena)",
  "FacilityStr1": "13440 Bay Area Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Pasadena",
  "FacilityState": "TX",
  "FacilityZipCode": "77507",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "LaPorte LEPC",
  "FacilityLatDecDegs": "29.648889",
  "FacilityLongDecDegs": "95.042222",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "P2",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 179092028,
  "ParentCompanyName": "Nippon Sanso",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Trigas, Inc.",
  "OperatorStr1": "6225 N State Hwy 161 Suite 200",
  "OperatorStr2": null,
  "OperatorCity": "Irving",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75038",
  "OperatorZipCodeExt": null,
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000075483",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-30 00:00:00",
  "SafetyInspectionBy": "J&H Marsh & McLennan",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-06-21 00:00:00",
  "DeRegistrationEffectiveDate": "2004-05-01 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 29.64969,
  "FRS_Long": -95.04614,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7223,
      "AltID": "Air Seperation",
      "FacilityID": 6024,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 7937,
          "ProcessID": 7223,
          "ChemicalID": 56,
          "Quantity": 48000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7388,
          "ProcessID": 7223,
          "NAICSCode": "32512",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3078,
              "Process_NAICS_ID": 7388,
              "SafetyReviewDate": "1999-04-27 00:00:00",
              "PHA_Date": "1999-04-27 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 1,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Improper Start-up Procedures (Human Error)",
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Shutoffs do not shut down the system on a releasse, they are only controller oriented (High & Low Temp. and pressure)",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Manual shutoff of valves & controls",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Process High & Low Temperature Alarm",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-01 00:00:00",
              "TrainingReviewDate": "1999-03-01 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-15 00:00:00",
              "EquipmentTested": "Visual Inspections of system completed daily, flow meter, fittings, etc.",
              "ChangeMgmtDate": "1999-04-27 00:00:00",
              "ChangeMgmtReviewDate": "1999-04-27 00:00:00",
              "PreStartupReviewDate": "1999-04-27 00:00:00",
              "ComplianceAuditDate": "1998-06-30 00:00:00",
              "AuditCompletionDate": "1998-08-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-27 00:00:00",
              "HotWorkPermitReviewDate": "1999-04-27 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-27 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-27 00:00:00",
              "CBI_Flag": 0,
              "Description": "TRIGAS is an industrial gas manufacturing facility.  This facility falls under the NAICS Code 32512.  Our safety information was last reviewed and/updated April 27, 1999 (with safety meetings conducted every month).  We are subject to the handling codes of the National Fire Protection Association, American Society of Mechnical Engineers, and the Texas Railroad Commission.  These standards, an all applicable OSHA standards, have been implemented here through written manuals with the assistance of ENvironmental Data Services, Inc.  The most recent hazard review and/update conducted for this facility was April 27, 1999.  To prevent/limit releases, this facility uses automatic shutoff devices for temperature and pressure controls, manual valve shutoffs, and pressure regulators.  The facility also uses detection devices such as a anhydrous ammonia alarm for High & Low Temperature, and a High Temperature Shutdown alarm, which indicates an increase above operating temperatures with a visual and audible alarm.  Operating and training procedures were also reviewed and revised in March 1999.  The employees of TRIGAS are trained in the classroom and by on-the-job training.  This training is completed with competency tests including written tests, demonstration, and observation.  The maintenance procedures are reviewed by operators on a regular basis to ensure proper anhydrous ammonia vapor dissociation.  The last time they were reviewed and updated in March of 1999.  There have been no incident investigations the past five years.  \n\nEmployees who are trained in the proper operating procedures of the ammonia dissociator are knowledgeable in the O&M Manual provided by the manufactuer.  Employees follow the startup procedures to prevent accidental releases of anhydrous ammonia.  Maintnenance procedures are also followed per the manufacturer's recommendations.  Regular maintenance is important to all industrial processing, but especially so to furnace atmosphere producing equipment.  The flow scope, pressure regulator, and other components are precision units, and any contamination will impair the proper functioning of these units.  Under no circumstances should oil or other petroleum-base compounds be used as valve lubricants, or anywhere else in the piping system.  It is important that the thermocouple and temperature control instrument be accurate.  Therefore, it is checked and calibrated at least once every 3 months.  For efficient operation of the dissociator, all pipe joints must be extremely tight.  Periodically all unions and other joints are checked, especially if unsatisfactoy dew point is being obtained.  The flow scope glass tube is filled with a special oil used as a damping agent to reduce the flutter of the float rod assembly.  The oil level is maintained in the glass tube using oil supplied by the manufacturer.  the pressure relief valves are actuated only in unusual conditions and normally require no maintenance.  If, however, one should open to relieve an excess pressure condition, employees will shut down the dissociator immediately.  When the cause of the excess pressure has been corrected, the operation of the dissociator can resume.  Spares of relief valves are kept, because they may not reseat after blowing if foreign matter has become lodges in the seat.  To remove the retort assembly and/or preheat chamber, employees follow the manufacturer's recommendations listed in the O&M Manual.\n\nThe dissociator is equipped with temperature and pressure safeguards.  These are checked periodically by creating the conditions which normally cause the safety devices to function; i.e., low temperature, over temperature, under pressure, over pressure, etc. A program of planned maintenance insures long trouble-free service.  This program is also found in the O&M manual from the manufacturer.\n\nTRIGAS contracted Environmental Data Services, which triggered a review of our safety information, operating and maintenance procedures and training.  TRIGAS is a Level 3 Prevention Program Facility, and has implemented Process Safety Management for their prevention program.",
              "_chemicals": [
                {
                  "PrimaryKey": 3504,
                  "PreventionProgram3ID": 3078,
                  "ProcessChemicalID": 7937
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6024,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "LaPorte LEPC & Pasadena Fire Dept.",
    "CoordinatingAgencyPhone": "7134713811",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6024,
      "SummaryText": "In this industrial gas air seperation plant, (TRIGAS Pasadena), we handle anhydrous ammonia which is considered hazardous by EPA, OSHA, etc.  The same properties that makes anhydrous ammonia valuable as a source gas for the production of Hydrogen & Nitrogen, also makes it necessary to observe certain precautions in handling anhydrous ammonia.  Overall, the prevention of unnecessary human exposures, reducing the threat to our own personal helath as well as our co-workers, and reducing the threat to nearby members of the community is the main goal of oncorporating this Risk Management Plan into our daily operations.  It is our policy to adhere to all applicable federal and state rules and regulations.  Safety depends upon the manner in which we handle and use anhydrous ammonia combined in coordination with the operations and maintenance procedures provided by the manufacturer of the ammonia dissociator, as well as the training of our personnel.\n\nThe primary purpose of this facility is to manufactuer industrial gases (liquid oxyggen, liquid nitrogen & liquid argon).   The dissociator is designed to economically produce a 75% hydrogen, 25% nitrogen atmposphere.  The nitrogen is vented to the atmosphere, the hydrogen is used to remove oxygen from a crude argon stream.  Anhydrous ammonia is received by truck shipments, and stored in one aboveground storage vessel.  The storage vessel is directly linked to the ammonia dissociator by valves, fittings, and piping.  Anhydrous ammonia is liquified under pressure in the storage vessel, but ammonia gas is released into the dissociator for the production of nitrogen and hydrogen.  The maximum amount of anhydrous ammonia stored at any given time is 48,000 pounds.\n\nOur employees conduct proper start-up procedures as listed in the manufacturer's O&M Manual for the ammonia dissociator (ROLOCK).  They also review the operating procedures and maintenance tasks when needed to insure the proper and safe use of the ammonia dissociator to "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6024,
      "SummaryText": "prevent a release of ammonai vapor.  The maintenance tasks are completed as needed, with the most critical being visual inspections of valves, fittings, pipe joints, etc. for deterioration.  Also, keeping the system clean and free of oil is an important aspect of the maintenance tasks performed according the manufacturer's recommenndations.  Mechanical integrity of the system is completed by keeping a listing of parts recommended by the manufacturer for change-out if and when needed.  Mr. Ray Roberts (Plant Manager) will ensure that the installation/repair of the dissociator system is completed properly.  This facility has a Process Safety Management  plan which they are incorporating into their daily routine to comply with the Level 3 Prevention Program Requirements.  They also have a Lock-out/Tag-out program, Hazard Communication Program, Confined Space Program (if needed), and an Emergency Action Plan to aid in the prevention of accidental releases of anhydrous ammonia.  These program, along with the Process Safety Management Program comprise a huge portion of TRIGAS's prevention portion.\n\nThe emergrncy response (action) program was developed with the assistance of Environmental Data Services, Inc., the LaPorte LEPC, and the Pasadena Fire Dept.  If an anhyrdous ammonia release occurs at the 13440 Bay Area Blvd. location, the manual alarm will be activated (in main office) to inform employees of a release.  Plant Manager (Ray Roberts) will get personnel organized for an emergency action and possible evacuation.  The emergency action plan consists of on-duty operators shutting off the ammonia dissociator by pressing the on/off button.  If this doesn't stop the release, then the ammonia vessel vapor valve can be turned off to prevent the further release of ammonia vapor from the vessel.  If these actions do not stop the release of ammonia, evacuation procedures will begin.  A head count will be made of employees according to shift rosters, and Tom Larson (VP Product"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6024,
      "SummaryText": "ion/Safety) will be notified.  The 911 call will also be made to notify the Pasadena Fire Department, the Laporte LEPC, and the Pasadena Police Dept. of the release.  The LaPorte LEPC will organize the Emergency Response Activities, and will help the Pasadena Fire Dept. mitigation the vapor release by water spray, or if mitigation doesn't work, evacuation of the affected population.  \n\nThe worst case scenario for this facility is the failure of the storage vessel for anhydrous ammonia. This would be a release of 48,000 pounds of ammonia vapor into the atmosphere.  Active mitigation has been considered for this scenario, consisting of manual shut-offs, of the vapor feed from the storage vessel to the dissociator, and the manual shut-down of the controls for the dissociator.  Passive mitigation was not considered for this scenario.  It is assumed that the entire contents of the cylinder are released as vapor.  The distance to endpoint of 0.14 mg/l for the worst case scenario is 3.4 miles.  The area surrounding the facility is flat, yet the trees, vegetation and other structures around the facility makes the determination that this area is urban.  The worst case scenario would impact approximately 130,000 persons using the Landview Software.  This number may be exagerrated somewhat, however, with the numbers of heavily employed industrial manufacturers in the area, the affected population may not be households, rather employees.\n\nAn alternate release scenario was determined for this facility.  The ammonia dissociator operates on low pressure, and high temperaturs.  Pressure regulators reduce the pressure to no more than 25 psi, and no less than 15 psi.  The most likely release would be a vapor line failure which would result in an estimated release of 50 pounds of ammonia vapor in 10 minutes (5 pounds per minute).  The release of 50 pounds of ammonia vapor would result in a distance to endpoint of approximately 0.06 miles.  This relatively short distance would impact a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6024,
      "SummaryText": "pproximately 140 persons using the Landview Software.\n\nThere have been no accidental releases of anhydrous ammonia from this facility in the past five years.  The operators at this facility conduct proper oprating and maintenance procedures to aid in the prevention of accidental releases of ammonia.  TRIGAS (Pasadena) has started the incorporation of Process Safety Management for their Level 3 Prevention Program to further emphasize their efforts in preventing accidental releases of anhydrous ammonia."
    }
  ]
}