{
  "FacilityID": 6054,
  "FacilityName": "CITGO Petroleum Corporation - Louisville Terminal",
  "FacilityStr1": "4724 Campground Road",
  "FacilityStr2": null,
  "FacilityCity": "Louisville",
  "FacilityState": "KY",
  "FacilityZipCode": "40216",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21111",
  "LEPC": "Louisville/Jefferson Cnty LEPC",
  "FacilityLatDecDegs": "38.206667",
  "FacilityLongDecDegs": "-85.850833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "OT",
  "LatLongDescription": "CE",
  "FacilityURL": "www.citgo.com",
  "FacilityEmailAddress": "ter3423@citgo.com",
  "FacilityDUNS": 175743087,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "CITGO Petroleum Corporation",
  "OperatorStr1": "P.O. Box 3758",
  "OperatorStr2": null,
  "OperatorCity": "Tulsa",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74136",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": "Plant ID 0225",
  "EPAFacilityID": "100000077043",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-09-09 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Chloroform Storage - Program Level 2.",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": "1999-06-30 00:00:00",
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-20 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2021-07-23 00:00:00",
  "DeRegistrationEffectiveDate": "2021-07-15 00:00:00",
  "AnniversaryDate": "2004-06-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 38.20611,
  "FRS_Long": -85.85,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7257,
      "AltID": "Chloroform",
      "FacilityID": 6054,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 7991,
          "ProcessID": 7257,
          "ChemicalID": 4,
          "Quantity": 15805818.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7423,
          "ProcessID": 7257,
          "NAICSCode": "42271",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 3776,
              "Process_NAICS_ID": 7423,
              "SafetyReviewDate": "1998-06-15 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": "RCRA (40 CFR parts 264 D, 265 D, & 279.52b), EPA OPP (40 CFR 112), USCG FRP (33 CFR 154), DOT/RSPA FRP (49 CFR 194), OSHA (29 CFR 1910.38(a), 29 CFR 1910.119, 29 CFR 1910.120)",
              "FR_Comments": null,
              "HazardReviewDate": "1998-06-01 00:00:00",
              "ChangeCompletionDate": "1998-08-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "All chloroform tanks have high level alarms.  Visually inspected daily.",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-06-15 00:00:00",
              "TrainingReviewDate": "1998-06-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-06-15 00:00:00",
              "EquipmentInspectionDate": "1996-09-15 00:00:00",
              "EquipmentTested": "API 653 External Visual inspection on all 3 chloroform tanks.",
              "ComplianceAuditDate": "1998-06-15 00:00:00",
              "AuditCompletionDate": "1998-08-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1985-06-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Chloroform storage",
              "_chemicals": [
                {
                  "PrimaryKey": 3906,
                  "PreventionProgram2ID": 3776,
                  "ProcessChemicalID": 7991
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6054,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-06-15 00:00:00",
    "ERTrainingDate": "1998-07-14 00:00:00",
    "CoordinatingAgencyName": "Emergency Management Agency",
    "CoordinatingAgencyPhone": "5025743220",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6054,
      "SummaryText": "EXECUTIVE SUMMARY\nCITGO PETROLEUM CORPORATION\nLOUISVILLE, KENTUCKY TERMINAL\n\nCITGO takes every precaution to prevent the discharge of petroleum products and hazardous substances into the environment.  To this end, CITGO continues to maintain a rigorous environmental and safety program that ensures the highest level of pollution control and chemical safety procedures.  CITGO's goal is to prevent accidental releases.  To date, CITGO has never had an accidental release of a hazardous substance from the Louisville Terminal.  The reason is because every accidental release precaution, short of removing chloroform from the facility, has been implemented at the Louisville Terminal and routinely checked for performance standards.\n\nIn the event that an accidental release does occur, CITGO has an emergency response plan designed to notify the surrounding public, coordinate the local emergency response authorities, and address the release in the most direct and time-effective manner.  This executive summary highlights the key aspects of CITGO's accidental release prevention program.\n\n\nFACILITY DESCRIPTION\n\nCITGO Petroleum Corporation owns and operates a bulk-liquids terminal located on the far west side of Louisville, Jefferson County, Kentucky.  Chloroform is delivered to the Louisville Terminal by barge.  From the barge, the material is pumped via pipeline to one of three onsite above-ground storage tanks (tank numbers 9, 10, and 11).  These tanks temporarily store the chloroform and continually send the material offsite via pipeline to the nearby DuPont facility.\n\nChloroform is a regulated hazardous substance per the listing in 40 CFR 68.  The three tanks are interconnected and each tank can hold a maximum of 10,000 barrels, which, combined, is above the threshold quantity of 10,000 pounds.  As a result, CITGO is required to implement a Risk Management Program (RMP)  at the Louisville Terminal per the requirements of 40 CFR Part 68 and Regulation 5.15 of the Jefferson County"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6054,
      "SummaryText": " Air Pollution Control District (JCAPCD) administrative code.\n\n\nWORST-CASE RELEASE SCENARIO\n\nFor the Louisville Terminal, the worst-case release of chloroform is defined as a catastrophic failure of either Tank 9 ,10, or 11 and the concurrent failure of all safety valves that connect the three tanks together.  In this scenario, the entire contents of all three tanks (15,805,818 pounds in total) would be released onto the ground.  A diking system (passive mitigation) that surrounds the tanks would contain the spill, thereby limiting the surface area of the chloroform pool to 57,092 square feet (ft2).  According to the methodology outlined in the USEPA's Offsite Consequence Analysis (OCA) Guidance, the limited surface area reduced the release rate to 4,396 pounds per minute (lb/min) to the atmosphere.  At this release rate, the duration of the release was determined to be 3,596 minutes.  For this scenario, the OCA guidance predicts a distance to chloroform's toxic endpoint (0.49 mg/l) to be 3.5 miles.\n\nThe meteorological conditions that govern the worst-case release scenario is an atmospheric stability class of F, wind speed of 1.5 meters per second (m/s), temperature of 77 degrees Fahrenheit, and 50 percent relative humidity.\n\nWith a radius of 3.5 miles, the impact zone of the worst case scenario is predicted to affect approximately 57,000 persons.  The U.S. EPA's Landview III database predicts the impact zone to include 19 schools, 19 religious institutions, and 6 cemeteries.  Also included in the impact zone is the natural habitat of approximately 7 miles of Ohio river shoreline.\n\n\n\nALTERNATIVE RELEASE SCENARIO\n\nSince chloroform is transported to and from the Louisville Terminal via pipeline, the most probable alternative release scenario would be if a pipe sheared off, thereby spilling the contents of one tank.  The spill would be captured by passive mitigation (diking system), thereby reducing the surface area to 57,092 ft2.  Also, the chloroform would be spillin"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6054,
      "SummaryText": "g from a 4 inch diameter pipe, so the time it would take to empty the tank would be considerably longer (greater than 24 hours) than for the worst case scenario.\n\nGiven this release criteria, the alternative release scenario was modeled using the Process Hazard Analysis Software Tools (PHAST) program to calculate the release rate from the pipe (10.6 kilograms per second [kg/sec]) and the vaporization rate of the chloroform pool (26.83 kg/sec).  The vaporization rate was then part of the input for the US EPA's DEnse GAs DISpersion (DEGADIS) model to determine the distance to the toxic endpoint.\n\nPer the requirements of the Jefferson County Air Pollution Control District (JCAPCD), the appropriate meteorological conditions that represent the Louisville area are an atmospheric stability class of D, a wind speed of 4.6 m/s, temperature of 57 degrees Fahrenheit, and a relative humidity of 68 percent.  Based on these meteorological parameters, DEGADIS predicts the distance to the toxic endpoint to be 0.59 miles (3115 feet).  At this distance, the U.S. EPA Landview III database predicts 1,728 persons and one religious institution would be affected.  No natural environmental receptors (i.e. nation wildlife refuses, shorelines, or parks) are included in this impact zone.\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nCITGO is proud to report that in the past five years there have been no accidental releases from the Louisville Terminal.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\nAs a start to CITGO's commitment to preventing accidental releases, the Louisville Terminal has a complete Integrated Contingency Plan (ICP) that provides details about the precautions and prevention activities that are carried out onsite as well as company-wide.  The ICP addresses full compliance with the prevention and emergency response procedures from all applicable regulations (i.e., certain applicable sections of RCRA, EPA's Oil pollution Prevention Regulations (40 CFR Part 112), United States Coast Guard (USCG) F"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6054,
      "SummaryText": "acility Response Plan (33 CFR Part 154), Department of Transportation/Research and Special Programs Administration (DOT/RSPA) Facility Response Plan (49 CFR Part 194), Occupational Safety and Health Administration (OSHA) Emergency Action Plans (29 CFR 1910.38(a) and Process Safety (29 CFR 1910.119), and OSHA HAZWOPER (29 CFR 1910.120).\n\nAll tanks are welded steel, and are fitted with ground level liquid gauges, high level alarms systems to prevent overfilling, and cathodic protection.  Construction materials are compatible with the products stored in them.  CITGO currently stores chloroform in tanks that employ internal floating roofs, which eliminate the vapor space above the liquid surface.  This, in turn, minimizes the escape of vapors to the atmosphere and maintains high product retention. Furthermore, all storage tanks undergo a formal American petroleum Institute (API) 653 External Inspection every five (5) years.  In addition, the Terminal Manager or designee performs a visual inspection at least once per month.  All loading connections at the dock are capped or blank flanged when not in service or on standby for extended periods (transport connections, etc.).  As required, tanks are opened and cleaned.  When opened, each tank is thoroughly inspected.  Records of internal inspections are retained onsite.\n\nTo prevent the possibility of storage tank overfill, the terminal representative is notified of the quantities of each product to be received well in advance of the barge delivery.  If the amount of the product scheduled for delivery cannot be held, the barge is held back until its entire contents can be emptied upon arrival.  In the event a high level condition occurs in a tank, a visual and audible alarm will activate in the office.  In an attempt to eliminate the possibility of tank overflow alarm failure, all high-level alarms are manually checked at least once per month.  A log entry is recorded for each test.\n\nAll tanks are built within the diked area."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6054,
      "SummaryText": "  The capacity of the diked area is large enough to contain the entire contents of the largest single tank plus sufficient freeboard to allow for precipitation.  In the case of a liquid release, the diking will reduce the surface area of the liquid, thereby reducing the amount of material released to the atmosphere.  During the daily site inspection walkaround, the diking area is kept free of debris or combustible material.\n\nAny pumps used to transport chloroform are of the \"magnetic drive\" variety so as to create a seal-free environment when handling hazardous or flammable materials.  In addition, all aboveground pipeline systems are visually inspected on a daily basis as part of the Louisville Terminal's daily facility walkaround inspection.\n\nFor safety reasons, the Louisville Terminal is completely enclosed by fence to prevent public access.  After hours, the main gate is secured with card access for the truck drivers.\n\nAll CITGO employees are thoroughly trained in how to handle worst case discharges of hazardous material.  Annually, each employee undergoes extensive training exercises to reinforce their education and emergency response prowess.  The training courses offered to the CITGO employees are listed in Annex 5 of the ICP.  Appropriate training records are maintained in CITGO's Tulsa, Oklahoma office.\n\n\nEMERGENCY RESPONSE PROGRAM\n\nAs previously mentioned, CITGO's emergency response program is capsulated in the Integrated Contingency Plan.  The ICP provides detailed steps on how an incident investigation in carried out.  Upon discovery of a spill, the person is instructed to immediately contact the:\n\n- Terminal Manager or Alternate\n- Primary Response Contractor\n- Fire Department (for spills that are not contained in the secondary containment)\n- CITGO Hotline\n- National Response Center\n- CITGO's Regional Environmental & Safety Manager\n\nNotification of these people simultaneously starts a series of response actions.  The notification process is critical in r"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6054,
      "SummaryText": "esponding to a spill.  To ensure that the situation is being handled in the most efficient and direct manner, CITGO's Crisis Resource Center (CRC) will make any and all notifications as requested by the Incident Commander.  This includes any internal notifications and confirm that outside notifications have been completed.\n\nCITGO KEY PERSONNEL\n\nCITGO's corporate organizational infrastructure to manage response actions is fully defined in CITGO's Crisis Management Plan (CMP).  The CMP explains CITGO's Incident Command System and details how it adopts the fundamental principles of National Inter-Agency Management System (NIIMS).  CITGO has designated the following personnel to activate, implement, and assess the response actions to an incident.  This command structure ensures the most efficient response to a spill incident.\n\n- The Incident Commander is responsible for conducting an initial assessment of the incident and tanking all steps necessary to ensure the safety of the personnel, property, and the environment.\n\n- The Logistics Section Chief is responsible for managing personnel, equipment, and supplies required to respond to the spill.  All secondary notifications both internal and external are the sole responsibility of the Logistics Section Chief.\n\n- The Planning Section Chief is responsible for the gathering and analysis of all data regarding incident operations and assigned resources, developing alternatives for tactical operations, conducting the planning meetings, and preparing the action plan for each operational period.  The Planning Section Chief shall coordinate with any additional response groups during the spill cleanup effort and is responsible for supervising the activities of the situation, resources, documentation, demobilization units, and the technical specialists.  Constant communication with the Incident Commander is required to keep them informed as to the status of the planning operations.\n\n- The Finance Section Chief is responsible for all"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 6054,
      "SummaryText": " financial and cost analysis aspects of the incident and for supervising members of the finance section.  The Finance Section Chief shall coordinate with all other section chiefs.  Constant communication with the Incident Commander is required to keep them informed as to the status of the response costs.\n\n- The Operations Section Chief is responsible for supervising the development of tactical response plans. The deployment of response equipment, and operation of all response equipment.  The Operations Section Chief shall coordinate with any additional response groups during the spill cleanup effort and is responsible for supervising the activities of either the Shoreside or Marine Recovery groups.  Constant communication with the Incident Commander is required to keep them informed as to the status of the response cleanup operations.\n\n- The Marine Operations Supervisor is responsible for deploying containment boom, product recovery devices, and/or waste storage devices as directed by the Operations Section Chief.  Boat operation, boom placement, and monitoring are primary responsibilities.  The Marine Operations Group may only be comprised of a small number of individuals during a small quantity spill.  This \"Marine Operations Group\" guideline is designed for a \"moderate\" or \"major\" spill where the response effort would require large numbers of personnel.  The Marine Operations Supervisor will direct the efforts of the Marine Operations Group.\n\n- The Shoreside Operations Supervisor is responsible for carrying out shoreside activities pertaining to the containment (boom deployment) and cleanup as directed by the Operations Section Chief.\n\nIn assembling the ICP for the Louisville Terminal, CITGO identified some common response scenarios that could occur onsite.  In assembling response actions to these scenarios, CITGO ensures that the resources and personnel will respond in a efficient and effective manner.  CITGO understands the benefit in being prepared.  CITGO is "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 6054,
      "SummaryText": "prepared to handle the following scenarios in a step-by-step response action:\n\n- Tank Overfill\n- Tank Failure\n- Piping Rupture\n- Piping Leak\n- Explosion and/or Fire\n- Equipment Failure\n\nIn the event that a spill incident did occur at the Louisville Terminal, CITGO's ICP and Emergency Response procedures are coordinated with the local emergency responders and the Jefferson County Air Pollution Control District.  All public notification, evacuation, and alert systems are conjoined with these groups.\n\nTRAINING\n\nThe level of training provided to CITGO employees is consistent with the worker's job function, responsibilities, and expected response to the hazards anticipated with their job.  Those employees who may discover or respond to the scene of a hazardous materials spill are trained to at least the first responder \"operations level.\"  As such, they will be expected to clean up incidental spills, if within the realm of their abilities, training, and personal protective equipment.  If they come upon the scene of a major spill, they will be expected to exercise proper \"Site Control\" measures and make emergency notifications.  They will act in a defensive role in order to protect people, the environment, and property.  They will also know the applicable evacuation routes in the event of a situation that is out of control and beyond their capabilities to handle.\n\nThe health and safety training of CITGO employees goes beyond the basic requirements of the \"operations\" level.  Initially, employees go through intensive indoctrination training, covering those areas necessary to properly perform their job.  Next, they are placed with experienced employees who continue the training \"in the field.\"  After completing this, employees attend on-going training pertinent to their job and attend safety meetings addressing new training topics or refresher training.  All terminal employees undergo the training necessary to qualify them to at least the OSHA \"Technician\" level as well as "
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 6054,
      "SummaryText": "24-hour OSHA training.  Additionally, the Terminal Manager and assistant Terminal Manager will be provided with Incident Command training.\n\nInitial and on-going training for all employees includes such topics as First Aid, Access to Medial Monitoring, CITGO Hazard Communication Program, Right-to-Know Law, Accident Prevention Signs and Tags, Employee Emergency Plans, SPCC Plans, Fire Fighting Incipient Stage, Coast Guard Manual, Use of the DOT Emergency Response Manual, and other courses as necessary.\n\nEvery year, CITGO conducts Facility Response Drills on a regional basis.  These drills cover notification procedures, utilize tabletop simulations and involve actual response equipment deployment.  The CITGO Drill and Exercise Program has been developed in accordance with the National Preparedness for Response Exercise Program (PREP) to meet the intent of the Oil Pollution Act of 1990 for spill response preparedness.\n\nCITGO also participates in the Area Exercises as scheduled by the Area Exercise Design Team comprised of representatives from Federal, State, and Local Government, environmentalists and industry.  These drills are designed to emulate a crisis situation in order to provide a test of the team's ability to react and respond to an actual incident.  Drills are to be critiqued by all agencies involved so that organization, response plan, and teamwork can be improved.  Both announced and unannounced drills are to be scheduled by the Environmental Safety Manager for Terminal Operations.\n\nNotification Drills:\n\nFacility and Qualified Individual Notification drills are conducted on a quarterly basis.  These drills are utilized to evaluate both the documented notification procedures and the personnel conducting such procedures.  The drill initially involves minimal explicit simulation and role playing to test the operational soundness of the procedures.  This drill is used to review the accuracy of the plan and informally apply plan procedures to potential emergency "
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 6054,
      "SummaryText": "situations.\n\nSpill Management Tabletop Exercises:\n\nSpill Management Team Tabletop drills are conducted annually.  A tabletop exercise is primarily a learning exercise that takes place in a meeting room setting.  Preparedness simulations and problems are combined with role playing to generate discussion of the plan, its procedures, policies and resources required.  Table top exercises are excellent for familiarizing groups and organizations with their roles and for practicing proper coordination.  They also provide a good environment in which to reinforce the logic and contents of the plan, identify weaknesses and to integrate new policies into the decision making process.  Tabletop exercises allow participants to act out critical steps, recognize the difficulties and resolve problems in a non-threatening format.  Tabletop exercises will exercise the Facility Response Team, Regional Response Team, Corporate Management Team, and outside resources to the extent required under the spill scenario.\n\nFacility-Owned Equipment Deployment Exercises:\n\nFacility equipment deployment drills are conducted on a semi-annual basis.  These drills involve deployment of facility equipment (up to 1,000 feet of boom, spill response boat, and a skimmer), and are designed to provide training for, and evaluation of, emergency operations.  These drills concentrate on the actions of facility personnel and will utilize outside resources (pipeline owners, government agencies, etc.) to the extent required under the spill scenario.\n\nOSRO Equipment Deployment Exercises:\n\nDeployment exercises are conducted annually.  Oil Spill Response Organizations (OSRO) as identified in this plan are deployed, equipment operated in the intended operating environment, and provide documentation as required under PREP guidelines.  A full scale drill, one which includes notification, team management, facility and contractor deployment, is conducted once every three years.  A full-scale drill evaluates all components "
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 6054,
      "SummaryText": "of the response plan and affected organizations simultaneously.  More complex than a tabletop, it focuses on interactive decision making and agency coordination in a classical emergency management environment.  A detailed scenario is used to simulate an emergency that requires on-scene direction and operations, and also includes coordination and policy-making roles.  Direction and control, mobilization of resources, communications and other special functions are rigorously exercised.\n\nAll training records are maintained in the Human Resources Division at CITGO's corporate headquarters in Tulsa, Oklahoma.\n\n\nPREVENTION CHANGES TO IMPROVE SAFETY\n\nThe potential for a spill or release is always present at any terminal.  CITGO Petroleum Corporation has taken a number of precautions to insure that any spills or releases are contained within the terminal.  The first precautions are in the installation of engineering controls and equipment to prevent the accidental release of petroleum at the terminals.  Some of the controls are listed as follows:\n\n- Automatic Loading Rack with automatic cutoff switches, emergency cutoff control switches, containment curbing, and trench drains on the rack floor in each lane that are piped to a holding tank.\n- All of the tanks in the facility are contained within one (1) continuous diked area.\n- All the facility storage tanks are equipped with high level alarms, shutoff valves, and ground level gauges.  The valves are tested to ensure that they close before every product receipt.\n\nAll storage tanks undergo a formal API 653 External Inspection every 5 years.  In each facility, the Terminal Manager or designee performs a visual inspection at least once per month.  The loading/unloading connections of oil pipelines are capped or blank flanged when not in service or on standby service for extended periods (transport connections, etc.).\n\nLOADING PROCEDURES\n\nSeveral measures are employed at the loading rack to prevent overfill and spills during loa"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 6054,
      "SummaryText": "ding.  All drivers must be trained and/or checked out by terminal personnel prior to being allowed to use the loading rack.  Signed documentation verifying that the training has been given is maintained at the terminal until the driver's loading privilege is canceled.  Specific loading instruction signs are posted at each loading bay.  Shutoff valves and emergency cutoff switches are loaded close to the trucks, in the vicinity of the fill pipe.  The ports are color coded per API specifications.  The computerized inventory system pumps only the amount requested.  Dry-break disconnects are also used.  Only trucks that are compatible with this system are allowed to load at the rack.  Signs, warning the drivers not to smoke and to keep engines off when on the area also are displayed in the loading area.\n\nPREVENTION OF PREMATURE DEPARTURE\n\nThe trucks are bottom-loaded through loading arms and hoses with dry break couplings.  Bottom loading trucks are equipped with an electrical/mechanical brake lock system that locks the truck brakes while loading lines are connected.\n\nLEAK PREVENTION\n\nOther release-prevention systems in use at the loading rack include an automatic set-stop meter that presents the amount to be loaded.  The emergency shutdown switches are located at each loading rack at the exit side of the racks near the accuload meters.  There are three additional emergency shut-off switches; one located near the entrance of the drivers' room that is on the rear side of the garage, one located on the east side of tank #8, and one at the east entrance gate.\n\nAll systems default to the \"closed\" position until the driver's card is inserted into the card reader.  All of these shut down methods will completely disable all loading operations.  Activation of the fire alarm system will also shut down all product-pumping operations.\n\nDrains and outlets on all tank trucks are checked by their drivers for leakage prior to departure from the loading rack area.\n\nThe point of transfe"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 6054,
      "SummaryText": "r from the loading rack to the tank truck is a dry break coupling.  This is a positive locking mechanical device that will not open unless properly connected.  While disconnected, the coupling is locked in the closed position.\n\nTank truck loading racks are equipped with vapor recovery piping that is connected to the Vapor Combustor Unit (VCU).  The vapors are collected at each lane of the loading rack and transported to the Zinc Combustor Unit.\n\nOVERFILL PROTECTION\n\nThe Scully overfill system, a computerized reading system, is located at the loading rack.  Stop buttons on registers, disconnecting the Scully overfill system or pressing the emergency shut-off switch will terminate loading.\n\nAll tankers are required to be fitted with probes.  Sensing devices tied in with loading control equipment will shut down valves and pumps if these tanker-mounted devices are defective or when product levels reach maximum capacity in any compartment of the tanker.\n\nSet stops, which allow a certain amount of product to be loaded, are controlled by the driver.  An amount of product (usually, the capacity of one compartment) is entered in the device.  After this amount is pumped, the product flow is stopped; the procedure must be repeated to load further compartments.\n\nA positive static ground must be established and maintained throughout the loading process.  This ground is established by the Scully System.\n\nDISCHARGE PREVENTION SYSTEMS\n\nAll product storage tanks are aboveground carbon steel tanks designed for petroleum products storage per American Petroleum Institute Standard 650 (API 650).  All gasoline, chloroform, and fuel oil storage tanks are equipped with high alarms, direct visual level gauges and automatic ground level gauges to prevent overfill.  All tank valves are closed when not in use.\n\nTo prevent the possibility of storage tank overfill, the terminal representative is notified of the quantities of each product to be received well in advance of the pipeline delivery.  "
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 6054,
      "SummaryText": "If the amount of the product scheduled for delivery cannot be held, CITGO's Supply and Distribution Department is notified and the shipment to the terminal is reduced.\n\nThe majority of the pipelines located on site are aboveground.  Aboveground pipelines are painted and elevated on pipe supports.  Structural design allows close visual inspection of the contract area between aboveground pipelines and supports.  Wear or corrosion at aboveground pipeline supports could cause a release.  This is prevented by regular visual inspections.\n\nUnderground pipelines are coated, wrapped and cathodically protected.  When pipelines are not in service, or are in standby service for an extended period of time, the facility connection at the transfer point is blind-flanged.\n\nAll aboveground pumps, valves, and pipelines (*including flange joints, valve glands and bodies, catch pans, supports, locking valves, and metal surfaces) are examined on a regular basis.  Prompt action is taken to remedy any condition that could result in spillage.\n\nWhen an underground pipe section is exposed, it is examined for signs of corrosion, leaks, or wear, and corrective action is taken as necessary.\n\nNew piping is constructed aboveground, when possible, in an effort to minimize corrosion and accidental damage during construction and to make leaks visible on the event that they occur.  All new underground structures (including piping and external tank bottoms) are coated and equipped with complete cathodic protection.\n\nThe pipelines are visually inspected daily.\n\nThe protection of the inside bottoms of tanks is normally accomplished with specialized coating systems.  Storage tanks are inspected for cracks at door sheets, man ways, nozzles, and chime areas on an annual basis and when taken out of service.\n\nTANK ALARM TESTING\n\nCITGO personnel attend all petroleum transfers.  In the event a high level condition occurs in a tank, a visual and audible alarm will activate in the office.  In an attempt to elimi"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 6054,
      "SummaryText": "nate the possibility of tank overflow alarm failure, the following procedures are followed:\n\n- All high-level alarms are manually checked at least once per month.\n- A log entry is recorded for each test.\n\nSECONDARY CONTAINMENT\n\nAll storage tanks are provided with secondary containment in accordance with NFPA 30.  The dikes are constructed of earthen materials.  All storage tanks with free flowing petroleum product are situated within continuous dikes.  The dike area is routinely inspected and kept free of debris or combustible material.  Storm water, which accumulates within the containment areas, is periodically drained.  Spills and storm water runoff at the loading rack drains into an oil-water separator.  From the oil/water separator, oil is pumped to a storage tank and water is discharged into the dike area.\n\nThe truck loading rack is equipped with trench drains that route storm water and spilled product to the oil/water separator.\n\nInspections are completed periodically with records retained in the Terminal Files.  All items that are different from the norm are recorded as such.  The record is revised after the problem has been addressed.\n\nFACILITY SELF INSPECTION\n\nFacility personnel are responsible for maintaining the safe condition of loading areas, tanks, and related facilities within the terminal.  Facility personnel ensure that the terminal and its facilities are maintained in safe and efficient operating condition performs inspections.  The following are the primary areas inspected for spill prevention.\n\n- Spill Prevention and Countermeasure Control\n- Loading Rack\n- Tank Farm Area\n- Security\n\nFacility inspections must be conducted using common sense.  There are many hazards within a terminal.  Personnel should be safety trained, and should observe all personal protection requirements and CITGO safety guidance.\n\nIn conducting the inspection, the following items apply:\n\n- Inspections are not conducted from a vehicle.\n- The entire site is to be covered on fo"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 6054,
      "SummaryText": "ot.\n- All findings are documented regardless of whether good or bad.\n\nAn inspection is used as a learning tool for the operator as well as management.  Any deficiencies should be noted as observations and the reports forwarded to the appropriate parties.  The inspection records are maintained at the facility.\n\nOverall, the potential for a spill, aside from transportation-related spills, or those at the rack, which are completely contained, is considered slight.  There have been no spills recorded for this facility."
    }
  ]
}