{
  "FacilityID": 6092,
  "FacilityName": "George Bros., Inc.",
  "FacilityStr1": "10537 Boone Dr.",
  "FacilityStr2": null,
  "FacilityCity": "Sultana",
  "FacilityState": "CA",
  "FacilityZipCode": "93666",
  "Facility4DigitZipExt": "0115",
  "FacilityCountyFIPS": "06107",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.549972",
  "FacilityLongDecDegs": "-119.33925",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G4",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "M. George, S. George, C. George",
  "OperatorStr1": "10537 Boone Dr.",
  "OperatorStr2": null,
  "OperatorCity": "Sultana",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93666",
  "OperatorZipCodeExt": "0115",
  "FTE": 36,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000077114",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-10-22 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-04-29 00:00:00",
  "DeRegistrationEffectiveDate": "2014-04-18 00:00:00",
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 36.543897,
  "FRS_Long": -119.338453,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "I sold the business",
  "_processes": [
    {
      "ProcessID": 7308,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 6092,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 8048,
          "ProcessID": 7308,
          "ChemicalID": 56,
          "Quantity": 13677.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7474,
          "ProcessID": 7308,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3123,
              "Process_NAICS_ID": 7474,
              "SafetyReviewDate": "1999-09-30 00:00:00",
              "PHA_Date": "1999-10-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-09-30 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "none",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "SRV's  plumbed to water tank",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-09-30 00:00:00",
              "TrainingReviewDate": "1999-09-30 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "No",
              "TR_OtherType": "None to date",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": "None to date",
              "MaintenanceReviewDate": "1999-09-30 00:00:00",
              "EquipmentInspectionDate": "1999-10-30 00:00:00",
              "EquipmentTested": "All will be inspected by above date.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-09-30 00:00:00",
              "PreStartupReviewDate": "1999-09-30 00:00:00",
              "ComplianceAuditDate": "1999-09-30 00:00:00",
              "AuditCompletionDate": "1999-09-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": "1999-09-30 00:00:00",
              "ParticipationPlansReviewDate": "1999-09-30 00:00:00",
              "HotWorkPermitReviewDate": "1999-09-30 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-09-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3572,
                  "PreventionProgram3ID": 3123,
                  "ProcessChemicalID": 8048
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6092,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-04 00:00:00",
    "ERTrainingDate": "1999-06-04 00:00:00",
    "CoordinatingAgencyName": "Visalia Fire Department",
    "CoordinatingAgencyPhone": "5597347477",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6092,
      "SummaryText": "Risk & Process Safety Management Program\n\nExecutive Summary\n\nfor\n\nGeorge Brothers, Inc.\n10537 Boone Drive\nSultana, CA  93666\n(559) 591-3535\n(559) 591-6819\n\nJune 21, 1999\n\nPrepared by:\n\nSolutions Environmental Health & Safety, Inc.\n6687 N. Blackstone Avenue, Suite 103\nFresno, California 93710\n(559) 435-4244\nFAX (559) 435-8503\nwww.SEHS-Inc.com\n\nTable of Contents For Executive Summary\n\n1.  GEORGE BROTHERS, INC. RISK & PROCESS SAFETY MANAGEMENT PROGRAM - 1\n2. DESCRIPTION OF AMMONIA SYSTEM - 1\n3. AMMONIA RELEASE SCENARIOS - 1\n3.1 WORST CASE SCENARIO - 1\n3.2 ALTERNATIVE CASE SCENARIO - 2\n4. GENERAL ACCIDENT RELEASE & AMMONIA SPECIFIC PREVENTION STEPS - 2\n5. FIVE YEAR ACCIDENT HISTORY - 3\n6. EMERGENCY ACTION PLAN - 3\n7. PLANNED CHANGES TO IMPROVE SAFETY - 3\n\n1.  GEORGE BROTHERS, INC. RISK & PROCESS SAFETY MANAGEMENT PROGRAM\nThis is to inform all interested persons, including employees, that George Brothers, Inc. is preparing a unified Risk & Process Safety Management Program to comply with California's Accidental Release Prevention (CalARP) Program (in California CCR Title 19, Chapter 4.5, Program Level 3 Elements, and Federally Title 40 CFR Part 68) and California OSHA's Process Safety Management (PSM) of Acutely Hazardous Materials standard (in California CCR Title 8, Section 5189, Process Safety Management of Acutely Hazardous Materials and Federally Title 29 Code of Federal Regulations (CFR) 1910.119).  This program is being prepared to address the risks involved with the presence of anhydrous ammonia in an amount in excess of 10,000 lbs which is contained in our refrigeration system. \n\nOur program will promote overall plant, worker, and public safety. The program will enable our facility to prevent the occurrence, and minimize the consequences, of significant releases of anhydrous ammonia. Overall, the program is designed to prevent accidental fatalities, injuries and illnesses and avoid physical property damage.\n\nOur company has an exemplary safety record, one"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6092,
      "SummaryText": "that we are quite proud of.  Our program incorporates and brings together several existing safety programs which already set forth rules, procedures and practices which help our employees protect themselves and our neighbors.\n\n2. DESCRIPTION OF AMMONIA SYSTEM\nWe operate a commercial packinghouse of deciduous tree fruit - nectarines, peaches, plums, and kiwi fruit.  We store all of our packed product in cold storage.  Our facility has an ammonia system that provides refrigeration capacity to approximately ten cold rooms.  Each cold room is equipped with evaporator coils that contain chilled liquid ammonia.  High pressure liquid from our main receiver is piped to each cold room, where it passes through an expansion valve to the low pressure refrigerated area.  Low temperature and pressure gas from the coils is returned to our engine room, where it passes through a compressor.  The high pressure discharge from the compressor is sent to a water cooled condenser where the high pressure gas ammonia is liquified and returned to our receiver. \n\nThe ammonia system at our facility consists of vessels which are interconnected, or which are co-located such that a release of ammonia could impact the ability to operate vessels which are not directly connected.  Therefore, we are treating our facility as a single process.\n\n3. AMMONIA RELEASE SCENARIOS\n3.1 Worst Case Scenario\nOur worst case scenario is the failure of our high pressure receiver containing 14,000 lbs of ammonia.  If this were to happen the release would be passively mitigated by the fact that the vessel is enclosed in our engine room. The ammonia would be released over a ten minute period. Using RMP*Comp we estimate that the ammonia would travel 1.0 miles (urban conditions) before dispersing enough to no longer pose a hazard to the public.\n\nIn our opinion, it is extremely unlikely that the worst-case scenario will ever take place.  Our receiver meets industry standards for manufacture and quality control of pressure"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6092,
      "SummaryText": "discuss the preventative measures to take, such as evacuation, in order to not be affected by a release.\n\nOur ammonia refrigeration system was designed and built by professional refrigeration engineers in accordance with ANSI/IIAR 2-1992 Standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigerating Systems.  It was also built in compliance with the Uniform Building Code and Uniform Mechanical Code applicable at the time of construction.\n\nOur ammonia refrigeration system is equipped with safety relief valves.  These valves limit the operating pressures of the entire system, and prevent failures due to overpressurization.\n\n5. FIVE YEAR ACCIDENT HISTORY\nGeorge Bros., Inc., has not had any reportable accidents within the last five years.\n\n6. EMERGENCY ACTION PLAN\nThis facility's emergency response program is based on the Cal OSHA requirements for Emergency Action Plans (in California CCR Title 8, Section 3220, Emergency Action Plans and Federally Title 29 CFR 1910.38 and 1910.119) and HAZWOPER (standard (in California CCR Title 8, Section 5192, Hazardous Waste Operations and Emergency Response and Federally Title 29 CFR 1910.120). \n\nStrategically, we will respond Defensively to a release. Under this plan our employees will take whatever steps are necessary to bring a release under control.  The first priority will be to operate the ammonia system to bring a release under control safely, from a distance, without donning personal protective equipment.  Steps might include stopping the flow of ammonia to a leak point, or using the compressor to suck ammonia away from a leak point. Further response requiring the donning of personal protective equipment would be done in coordination an outside agency. All response activities would be coordinated with the local fire department and the Visalia Fire Department Hazardous Materials Response Team.\n\nSeveral employees have been trained to respond defensively (First Responder, Operations Level) as define"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6092,
      "SummaryText": "d in the HAZWOPER regulations.  Every year at the beginning of the season we review with our employees our evacuation procedures in the event of an emergency, including an ammonia release.  We have a windsock at our facility that employees can use to determine the upwind side of any point of release.  We have also coordinated with the nearest public receptor, an elementary school, and the school officials know to have the children shelter in place in the event we notify them of a release.\n\n7. PLANNED CHANGES TO IMPROVE SAFETY\nAs of June 21, 1999, the time that this Executive Summary is being submitted, our Risk & Process Safety Management Plan is not complete.  The reason is that in order to do it right a lot of work must be done.  We simply do not have enough qualified employees or resources to meet the initial deadline. Our company operates seasonally and we have found that our ability to allocate managerial and operator resources to prepare this plan depends upon our workload.  In addition, we have found it necessary to obtain help from outside vendors for some critical elements, such as preparing Piping & Instrumentation Diagrams and conducting a Process Hazard Analysis.  These vendors are attempting to meet the requests of numerous facilities such as ours at the same time, and have the same problem of only a limited number of people qualified to carry out the required tasks.  Thus, these vendors are setting completion dates for plan elements that we cannot entirely control.\n\nHowever, we have prepared the following milestones and allotted times for the completion of our plan:\n\nMilestone Allotted Time\n* Conduct Offsite Consequence Analysis -- Done\n* Prepare RMP*Submit showing status as of 6/21/99 -- Done\n* Collect Process Safety Information 60 days - By Sept 1, 1999\n* Conduct Process Hazard Analysis On or around Sept 1, 1999\n* Finish PHA documentation including Action List 30 days - By Oct 1, 1999\n* Prepare Process Prevention Program elements 90 days - By Oct"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6092,
      "SummaryText": "1, 1999\n* Prepare Standard Operating Procedures 90 days - By Oct 1, 1999\n* Compile all elements into Risk & Process Safety \n* Management Program, review internally, and submit 120 days - By Nov 1, 1999\n\nWe understand our obligations to consolidate our safety activities in a Risk Management Program under the CalARP regulation.  We are committed to preparing and implementing a Risk & Process Safety Management Program according to the above milestone and timeline chart."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6092,
      "SummaryText": "vessels; ammonia is not corrosive in this service; pressure safety relief valves limit the operating pressure in this vessel; and our operators are trained in the safe operation of our system. \n\n3.2 Alternative Case Scenario\nOur alternative release scenario is as follows.  A forklift swipes a high pressure liquid feed line in one of the cold rooms, and shears a hole 1/4 in diameter. Using the modeling program ALOHA the initial release rate can be estimated as 80 lbs/min.  We assume the leak would continue for 10 minutes until the flow of ammonia to the leak point could be stopped.  Under this scenario 800 lbs of ammonia would be released over a time period of 10 minutes. The release would be passively mitigated by the fact that the ammonia would be contained in the cold room. Using RMP*Comp we estimate that the ammonia would travel less than 0.1 miles (urban conditions) before dispersing enough to no longer pose a hazard to the public.\n\n4. GENERAL ACCIDENT RELEASE & AMMONIA SPECIFIC PREVENTION STEPS\nThe ammonia refrigeration system at George Bros., Inc., is an integral part of the overall business.  It has a system charge of approximately 14,000 lbs. It is extremely important that it is maintained and operated in a safe and efficient manner.  Management is committed to making sure that all employees are made aware of the potential danger of an ammonia leak.\n\nThe ammonia refrigeration system/process is constantly being monitored by our foreman.  In addition, the system/process is checked frequently by our outside refrigeration contractor, California Controlled Atmosphere.  Our foreman keeps a daily engine log, and performs scheduled maintenance on system/process equipment at the end of each season. We also contract with a chemical company to periodically check the water in our condensers to prevent scale buildup and corrosion.  \n\nWe inform our employees of the dangers of an accidental release of ammonia through monthly safety meetings.  During these meetings we also"
    }
  ]
}