{
  "FacilityID": 6111,
  "FacilityName": "Eagle Mountain Water Treatment Plant",
  "FacilityStr1": "6801 Bowman Roberts Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Fort Worth",
  "FacilityState": "TX",
  "FacilityZipCode": "76179",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48439",
  "LEPC": "Emergency Management Office",
  "FacilityLatDecDegs": "32.858889",
  "FacilityLongDecDegs": "-97.419167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G6",
  "LatLongDescription": "ST",
  "FacilityURL": "http://www.ci.fort-worth.tx.us",
  "FacilityEmailAddress": "WEP@ci.fort-worth.tx.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Fort Worth",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Fort Worth",
  "OperatorStr1": "1000 Throckmorton St.",
  "OperatorStr2": null,
  "OperatorCity": "Fort Worth",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76102",
  "OperatorZipCodeExt": null,
  "RMPContact": "Lee C. Bradley, Jr.",
  "RMPTitle": "Water Department Director",
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000077864",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-07-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 32.85889,
  "FRS_Long": -97.41917,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA ON)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7331,
      "AltID": "Chlorination System",
      "FacilityID": 6111,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7497,
          "ProcessID": 7331,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8071,
          "ProcessID": 7331,
          "ChemicalID": 62,
          "Quantity": 92000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508071,
          "ProcessID": 7331,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 7332,
      "AltID": "Ammoniation System",
      "FacilityID": 6111,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7498,
          "ProcessID": 7332,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8072,
          "ProcessID": 7332,
          "ChemicalID": 56,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508072,
          "ProcessID": 7332,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6111,
      "SummaryText": "                          EXECUTIVE SUMMARY\n\nThe EAGLE MOUNTAIN WATER TREATMENT PLANT (EMWTP) is owned and operated\nby the CITY OF FORT WORTH (CFW).  To comply with the requirements in\n40 CFR 68 Chemical Accident Prevention Provisions, the CITY OF FORT\nWORTH WATER DEPARTMENT (CFWWD) developed a Risk Management Program\n(RMProgram) for the EMWTP including Management System, Hazard\nAssessment, Accidental Release Prevention Program, and Emergency\nResponse Plan.  The RMProgram main goal is to reduce the employee and\npublic risk of injury, death or damage from accidental release of\nchemicals.\n\n1    MANAGEMENT SYSTEM\n\nThe CFW has the overall responsibility for implementing and\nintegrating the ARPProgram into their organization.  In accordance\nwith the Management System, the CFWWD Director is designated as the\nRMProgram Director, and the Assistant Water Director in charge of\nProduction is the RMProgram Manager.  Other qualified individuals are\nassigned responsibility for implementing each individual requirement\nset forth in the Accidental Release Prevention Program and/or\nEmergency Response Plan.  The RMProgram participants include the\nfollowing positions:\n\nA.   RMProgram Director\nB.   RMProgram Manager\nC.   Hazard Assessment/Offsite Consequence Analysis Update Officer\nD.   Safety Information Officer\nE.   Hazard Review Update Officer\nF.   Operation Manager/Assistant Operation Manager\nG.   Training Supervisor\nH.   Maintenance Supervisor/Assistant Maintenance Supervisor\nI.   Compliance Audit Officer\nJ.   Incident Investigation Officer\nK.   Emergency Planning and Response Officer\nL.   RMPlan Update Officer\n\nManagement system detailed descriptions and procedures are provided in\nthe Accidental Release Prevention Program to ensure every participant\nplaying a role in the RMProgram understands their responsibilities.\n\n2    REGULATED CHEMICALS AND PROCESSES\n\nRegulated toxic chemicals and processes at the EMWTP are:\n\nA.   Storage, transfer, and use of chlorine in the chlorination sys"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6111,
      "SummaryText": "tem\nB.   Storage, transfer, and use of anhydrous ammonia in ammoniation\n     system\n\nChlorine gas is stored as pressurized liquid in two (2) side-by-side\ntanks located outdoors.  Maximum liquid chlorine inventory in each\ntank is 46,000 lbs.  The maximum process quantity is 92,000 lbs.,\nignoring negligible quantities in the piping.\n\nAnhydrous ammonia gas is stored as a pressurized liquid in two (2)\nside-by-side tanks located outdoors.  Maximum liquid chlorine\ninventory in each tank is 12,000 lbs.  The maximum process quantity is\n24,000 lbs., ignoring negligible quantities in the piping.\n\n3    HAZARD ASSESSMENT\n\nThe Hazard Assessment has been completed for the EMWTP.  Offsite\nconsequence analysis modeling was performed based on the following\nprinciple elements:\n\nA.   Meteorological parameters for the dispersion modeling analysis\n     were determined using National Weather Service data collected at\n     the Dallas/Fort Worth International Airport.  Highest daily\n     maximum temperature and average relative humidity over the last\n     three-year period were used for worst-case scenarios.  Typical\n     meteorological conditions based on the data over the last \n     three-year period were used for alternative release scenarios.\n\nB.   Total quantity in the single largest tank was used for chlorine\n     and ammonia worst-case scenarios.  A leak from a liquid line near\n     the outdoor storage tank was assumed for either chlorine or\n     ammonia alternative release scenario.\n\nC.   No mitigation measure was considered in worst-case scenarios. \n     The excess flow valve, however, was considered for either\n     chlorine or ammonia alternative release scenario.\n\nD.   Distances to toxic endpoints for chlorine and ammonia worst-case\n     scenarios were modeled using a dense gas dispersion model,\n     DEGADIS.\n\nE.   Distances to the toxic endpoints for chlorine and ammonia\n     alternative scenarios involving vapor release were modeled using\n     the ALOHA model.\n\nF.   Distance t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6111,
      "SummaryText": "o the toxic endpoint for the ammonia alternative\n     scenario involving two phase release were modeled using a dense\n     gas dispersion model, DEGADIS.\n\nG.   Offsite impact was evaluated with LANDVIEW III for each release\n     scenario.\n\nThe accidental release of chlorine from a storage tank is considered\nthe worst-case scenario.  A distance of 6.4 miles between the release\nsource and the toxic endpoint was modeled in the offsite consequence\nanalysis.  The alternative scenario impact distance is 1.5 miles for\nchlorine and 0.38 miles for ammonia.\n\nFor the worst-case scenario, LANDVIEW III estimated a population of\n69,000 persons within the worst-case scenario impact radius of 6.4\nmiles.  Population are 2,300 and 130 persons for chlorine and ammonia\nalternative release scenarios, respectively.\n\nPublic receptors within the worst-case scenario impact area include\nschools, residences, hospitals, recreation areas, and commercial,\noffice, or industrial areas.  Public receptors within the alternate\nrelease scenario impact area are schools, residences, and commercial,\noffice, or industrial areas.  The only environmental receptor is an\nofficially designated refuge within the impact area of the worst-case\nscenario.\n\n4    ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nA comprehensive Accidental Release Prevention Program Manual was\ndeveloped.  The main purpose of the manual is to provide operation and\nmaintenance personnel detailed standard procedures to reduce employee\nand public risk to injury, death or property damage from accidental\nchemical releases.  The manual includes the following elements and\ncomplies with requirements set forth in 40 CFR 68 Chemical Accident\nPrevention Provisions.\n\nA.   Management\nB.   Safety Information\nC.   Hazard Review\nD.   Operating Procedures\nE.   Training\nF.   Maintenance\nG.   Compliance Audits\nH.   Incident Investigation\n\nDetailed procedures for the Accidental Release Prevention Program were\ndeveloped and are undergoing implementation and integrati"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6111,
      "SummaryText": "on into\nroutine operation and maintenance practices at the EMWTP.  Historical\nand future significant efforts focus on the following areas:\n\nA.   Development of a safety information database essential for the\n     successful implementation of other procedures, including\n     operation, maintenance, training, compliance audits, incident\n     investigation, and emergency planning and response.\n\nB.   Implementation of corrective actions recommended during the most\n     recent hazard review completed on April 22, 1999.  This effort is\n     one of the most important steps for preventing a chemical release\n     or minimize its effects on plant personnel or the public.\n\nC.   Regular review and revision of operating procedures to address\n     the safely operating procedures for regulated process systems,\n     including all eight (8) elements set forth in the regulation. \n     When combined with the operator training program, current\n     operating procedures are essential in  ensuring safe operation of\n     systems and preventing accidental releases.\n\nD.   Regular review and revision of training programs to ensure plant\n     personnel working on or near regulated processes are adequately\n     trained and understand both inherent process hazards and\n     appropriate response actions to accidental chemical releases. \n     Employees who have received adequate classroom and/or on-the-job\n     training and are currently qualified to safely operate the\n     regulated systems have received certifications in writing by the\n     RMProgram Manager.  A special training session will be provided\n     to plant personnel working on or near regulated processes as soon\n     as final revisions to operating procedures are completed.\n\nE.   Regular review and revision of the maintenance program to ensure\n     that current, accurate, and complete procedures are provided for\n     process equipment in regulated processes.  Efforts were and are\n     continuously made for the preventative maintenance"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6111,
      "SummaryText": " of equipment\n     per manufacturer's recommendations.  Effective maintenance\n     procedures are integral to preventing chemical releases that may\n     result from mechanical failure of improperly maintained\n     equipment.\n\n5    THE FIVE-YEAR ACCIDENT HISTORY\n\nNo accidental releases of regulated chemicals from a regulated process\nat the EMWTP has occurred in the past five years resulting in any\ndeath, injury, or property damage on site, or known offsite impacts\n(i.e., deaths, injuries, evacuations, sheltering-in-place or property\ndamages, or environmental damages).\n\n6    EMERGENCY RESPONSE PLAN\n\nCFWWD personnel do not respond to uncontrolled releases of chemicals\nfrom any regulated process at the EMWTP.  Plant employees are limited\nto responding only to incidental releases covered by maintenance\nprocedures.  Appropriate procedures have been developed and are in\nplace that provide clear instructions on 1) how to determine if a leak\nis considered an incidental release, and 2) how to notify local\nemergency responders in the event of an uncontrolled release.  Current\nprocedures were reviewed and revised to meet regulatory requirements,\nsuch as emergency notification, evacuation, training, documentation,\navailability, etc., under 29 CFR 1910.38(a).  Regulated processes at\nthe EMWTP are not included in the community emergency response plan\ndeveloped under 42 U.S.C. 11003.  The local emergency responder is\nthe Emergency Management Office in association with the City of Fort\nWorth Fire Department.  Adequate safety information regarding\nregulated processes has been provided to the Emergency Management\nOffice who has developed and implemented specific emergency response\nplans, provided suitable training, and conducted necessary drills in\nemergency response for regulated chemical releases from regulated\nprocesses.  Although it will not be the responsibility of the plant\nemployees to evacuate offsite areas, addresses and telephone numbers\nof major public receptors inside a on"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6111,
      "SummaryText": "e (1) mile radius are provided in\nthe plan.  The CFWWD will work closely with the Emergency Management\nOffice and document coordination activities and communications.\n\n7    ON-GOING AND UP-COMING SAFETY IMPROVEMENTS\n\nTo improve the safety of regulated facilities at the EMWTP, the\nfollowing plant expansion, process modification and facility upgrade\nprojects are under construction or are scheduled to begin soon:\n\nA.   Installation of additional warning signs\n\nB.   Installation of additional leak detectors\n\nC.   Implementation of modified leak detector testing and\n     documentation procedures\n\nD.   Implementation of revised operational, maintenance, and training\n     procedures\n\nE.   Modification of process pipe labeling\n\nF.   Implementation of revised contractor notification and monitoring\n     programs"
    }
  ]
}