{
  "FacilityID": 6123,
  "FacilityName": "VWR Scientific Products Corp.",
  "FacilityStr1": "200 Center Square Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Bridgeport",
  "FacilityState": "NJ",
  "FacilityZipCode": "08014",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34015",
  "LEPC": "Gloucester County OEM",
  "FacilityLatDecDegs": "39.800833",
  "FacilityLongDecDegs": "-75.347778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.vwrsp.com",
  "FacilityEmailAddress": "dcaria@vwrsp.com",
  "FacilityDUNS": 150982189,
  "ParentCompanyName": "VWR Scientific Products Corp.",
  "Company2Name": null,
  "CompanyDUNS": 150982189,
  "Company2DUNS": 0,
  "OperatorName": "VWR Scientific Products Inc.",
  "OperatorStr1": "200 Center Square Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Bridgeport",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08014",
  "OperatorZipCodeExt": null,
  "FTE": 325,
  "OtherEPAFacilityID": "NJD086435070",
  "EPAFacilityID": "100000078373",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-14 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Bridgeport, NJ",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-12-22 00:00:00",
  "DeRegistrationEffectiveDate": "2010-11-17 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.80083,
  "FRS_Long": -75.34778,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7351,
      "AltID": "Chemical storage",
      "FacilityID": 6123,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 8091,
          "ProcessID": 7351,
          "ChemicalID": 53,
          "Quantity": 6184.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7517,
          "ProcessID": 7351,
          "NAICSCode": "49311",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 3824,
              "Process_NAICS_ID": 7517,
              "SafetyReviewDate": "1999-06-21 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": "NFPA 30, NFPA 231, NFPA 231C",
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-21 00:00:00",
              "ChangeCompletionDate": "2000-06-21 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Colorimetric detector tubes",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-21 00:00:00",
              "TrainingReviewDate": "1999-02-06 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": "spill response drill",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-21 00:00:00",
              "EquipmentInspectionDate": "1999-06-21 00:00:00",
              "EquipmentTested": "forklifts (daily), order selectors, sprinkler system, reach trucks",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-06-21 00:00:00",
              "CBI_Flag": 0,
              "Description": "VWR has compiled information that is necessary for safe handling and storage of regulated chemical products.  This information includes:\n\n* Material safety data sheets (MSDSs) for each regulated chemical.  This information is available electronically or as a hard copy.  The last MSDS revision was 1998;\n\n* Maximum intended inventory of equipment in which regulated chemicals are stored.  (i.e., the maximum intended container size is 55 gallons.);\n\n* Acceptable storage temperatures and conditions. (Special conditions --   Acids to be stored separately from ammonium hydroxide.);\n\n* Equipment use and maintenance specifications (Use and maintenance specifications for forklifts, storage rack, and other equipment are maintained on file at the facility.);\n\n* Codes and standards used to design and build the facility:\n  NFPA 30 (Flammable & Combustible Liquids), NFPA 231 (Standard for General Storage), NFPA 231c (Standard for Rack Storage of Materials).\n\n\nHazard Review\n\nThe hazards associated with the regulated chemicals are:\n\n* Corrosivity\n* Toxicity\n\nVWR periodically reviews and audits its operations to identify and control potential hazards.  The most recent hazard review was completed June 21, 1999.  The review was conducted using, as a guide, the Chemical Manufacturer Association's Warehouse Assessment Protocol.  This document is cited, in EPA's guidance document Risk Management Program for Warehouses (40 CFR Part 68, as providing a suitable framework for conducting a hazard review.  Additionally, facility personnel and other persons familiar with warehouse operations provided input to the hazard review process.\n\nMajor hazards identified during this review were:\n\n* Toxic release\n* Fire or explosion\n* Equipment failure\n\n\nCurrent facility management practices were deemed appropriate to prevent a toxic release, fire or explosion.  For example, the existence of standard operating procedures and training programs help minimize the risk of human error associated with facility operations.  Similarly, daily inspection of forklifts and the use of a standard checklist, help ensure that forklifts do not fail while in use.  \n\nIf a chemical release were to occur, it would first be detected by an operator, either visually or by odor.  Once detected, the facility has direct-reading colorimetric detection equipment that can determine the concentration of the chemical in air (measured in parts per million, or percent).\n\nMitigation systems and equipment are available for use by trained VWR emergency response personnel, in the event of a release.  A corrosives spill can be controlled through a special neutralizing and absorbing material, which is applied to the spill.  Similarly, toxic substances can be absorbed and containerized for later disposal.  Mitigation systems for a fire or explosion include a system of sprinklers, dikes, fire walls, and blast panels.\n\nAlthough findings from the hazard review were favorable, action items were identified, as follows:\n\n* Label storage rack with maximum weight capacity to prevent overload and damage to the rack.\n\nThe anticipated completion date of the action items is June 21, 2000.\n\n\nOperating Procedures\n\nVWR maintains written procedures for most operations.  Appendix C of VWR's Risk Management Plan identifies procedures relating to normal start-up and routine operations; Section 2 for procedures relating to emergency shut-down, evacuation and emergency operations, and start-up following an emergency shut-down.   Section 2 includes procedures for temporary operations during an emergency. The issuance or revision date is shown on procedures to indicated the date of last review.\n\n\nTraining\n\nVWR provides employee training for routine operations and emergency situations.  The training process can include one or more instructional formats, such as: lecture; videotape; interactive computer-based training hands-on exercises, demonstrations and on the job training.  Training is conducted by a qualified instructor or other competent person.  Employee proficiency may be evaluated using one or more techniques, including classroom quiz, actual demonstration, or verbal assessment.\n\nVWR has reviewed the capabilities of existing employees as of June 21, 1999 and determined that the employees possess the knowledge, skill and ability to perform their duties in accordance with operating procedures.  A written certification to this effect has been prepared and is on file at VWR. \n\nNew employees and employees who are transferred to new responsibilities receive training prior to starting the job.  This ensures that all employees understand and can perform their duties in accordance with operating procedures.\n\nEmployees will be re-trained whenever operating procedures are significantly revised, and at least once every three years, even if procedures have not changed.  \n\nFor administrative efficiency, training under this section may be combined with any other employee training provided by VWR.\n\nVWR has formally asked each of its on-site contractors to certify in writing that their people working on-site have been trained in accordance with the proper safety and environmental health standards, and they currently adhere to all applicable regulations for the same.\n\n\nMaintenance\n\nVWR maintains a list of process equipment that requires routine inspection and maintenance.  There are written procedures relating to inspection and maintenance requirements.  Personnel responsible for inspection and maintenance are trained on these procedures.  The procedures are typically developed by VWR or are obtained from equipment manufacturers. \n\n\nCompliance Audits\n\nVWR will conduct an audit at least once every three (3) years to evaluate compliance with Prevention Program requirements.  The first audit will be completed no later than June 21, 2003.  Findings and recommended corrective actions will be put in writing, and corrective actions will be implemented in a timely manner.  Upon completion of corrective actions VWR will provide a written certification that the compliance evaluations has been completed.  All written records relating to compliance audits will be retained for at least (5) five years.\n\n\nIncident Investigation\n\nVWR's emergency procedures include a provision for conducting an investigation and analysis of each incident in which the emergency plan is activated .  Because VWR investigates all incidents, this procedure satisfies the requirement that VWR investigate each incident that \"resulted in, or could have resulted in a catastrophic release of a regulated substance.\"  \n\nEach incident report, and corrective actions, will be put in writing.  Corrective actions will be implemented promptly.  The results of the investigation will be reviewed with affected workers (VWR and vendors) whose job tasks are relevant to the incident.  The incident report will be retained for minimum of five (5) years.",
              "_chemicals": [
                {
                  "PrimaryKey": 3954,
                  "PreventionProgram2ID": 3824,
                  "ProcessChemicalID": 8091
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6123,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-04-22 00:00:00",
    "ERTrainingDate": "1999-02-06 00:00:00",
    "CoordinatingAgencyName": "Gloucester County OEM",
    "CoordinatingAgencyPhone": "6098450100",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "NJ TCPA, NJ DPCC/DCR"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6123,
      "SummaryText": "VWR Scientific Products, Inc. (VWR) is a distributor of high-quality chemicals and laboratory supplies.  The chemical products sold by VWR are received from manufacturers in Department of Transportation (DOT)-approved containers (typically ranging from 1 gallon to 55 gallons in volume).  VWR does not manufacture, formulate or otherwise engage in direct handling of chemicals outside of the containers in which the chemicals are received.  VWR operations consist of warehousing and distribution activities, and the risk of a serious chemical-related emergency is low.  However, VWR has a strong commitment to the safety and well-being of its employees, the environment and the surrounding community.  The company has established a management system, consisting of policies, procedures, training, inspection, maintenance and other elements, that are designed to prevent incidents from occurring, and in the event a minor or major emergency does occur, to enable facility personnel to effectively manage the incident. \n\nAll warehousing operations involving regulated chemicals are considered a single \"covered process\" for regulatory purposes.  The VWR facility is considered to be covered under the Program 2 eligibility requirements (per 68.10(c)) because New Jersey does not recognize Program 1 and VWR is not covered by one of the SIC codes listed under Program 3 nor OSHA's Process Safety Management requirements.  \n\nAt the present time, only Hydrochloric Acid solution (>36%) exceeds the Threshold Quantity (TQ) for that substance under the revised New Jersey Toxic Catastrophe Prevention Act (NJ TCPA) with an estimated maximum quantity of 6,184 lbs in 1998 as compared to the NJ TCPA TQ of 5,600 lbs.  \n\nThe worst case release scenario is based on a hypothetical incident in which the single largest container stored on site, a 55 gallon drum, is pierced by a forklift and the contents are spilled on the floor of the distribution center.  RMP Comp, a software program furnished by the U.S. En"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6123,
      "SummaryText": "vironmental Protection Agency (EPA), was used to determine the farthest distance from the facility that toxic effects may be anticipated, following the chemical release.  This is known as the distance to the \"toxic\" endpoint.  Results of the analysis indicate that all distances to endpoints are relatively small.  The estimated distance to the toxic endpoint for hydrochloric acid was determined to be approxiimately 0.2 miles.  There are no residences, schools or hospitals within that distance, although a few commercial industrial establishments exist within that radius.\n\nThe alternative release scenario is based on a more realistic hypothetical incident in which a single one-gallon container of chemical is dropped on the floor.   According to the analysis, the distance to the toxic endpoint was equal to one-tenth of one mile (0.1 mile) or less. \n\nAdministrative controls and active mitigation measures were not included as a factor of consideration during the worst case or alternative release scenarios.   However, passive mitigation measures (i.e., enclosures and berms) were included. \n\nVWR's prevention program consists of several key elements, including:\n\n* Safety Information - includes detailed information about the hazards of regulated chemicals, maximum intended inventory, facility design features, applicable standards, equipment use and maintenance.\n\n* Hazard Review - a process of evaluating facility operations, using warehouse industry checklists, to identify and control potential hazards.\n\n* Operating Procedures - written procedures to guide employees in safely conducting normal, temporary and emergency operations.\n\n* Training - includes training commensurate with the types of activities employees are expected to perform during normal and emergency situations.\n\n* Maintenance - required maintenance activities are performed by trained employees or qualified vendors.\n\n* Compliance Audits - conducted at least once every three years to verify compliance with regulato"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6123,
      "SummaryText": "ry requirements for Accidental Release Prevention.\n\n* Incident Investigation - conducted whenever an incident occurs that results in, or could have resulted in, a catastrophic release (i.e., a release that presents an imminent and substantial endangerment to public health and the environment).\n\nThe need for chemical specific prevention steps is very limited because chemicals are contained within sealed, DOT-approved containers, and the containers are not opened during handling.   Additionally, all chemicals are segregated and stored by hazard class, to ensure that incompatible chemicals are not stored together.\n\nThere have been no accidents in the previous five years that have resulted in any deaths or significant property damage on-site, or any off-site deaths, injuries, property damage, environmental damage, evacuations, or in-place sheltering from regulated substances or otherwise.  However, VWR has developed a detailed emergency response program that addresses small- and large-scale incidents, including coordination with outside agencies and responders.  This plan has been approved by the State of New Jersey Department of Environmental Protection under its Discharge Prevention, Containment and Countermeasures (DPCC) Plan and Discharge Cleanup & Removal (DCR) Plan requirements."
    }
  ]
}