{
  "FacilityID": 6154,
  "FacilityName": "City of Reidsville Water Treatment Plant",
  "FacilityStr1": "278 Reid Lake Road",
  "FacilityStr2": null,
  "FacilityCity": "Reidsville",
  "FacilityState": "NC",
  "FacilityZipCode": "27320",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37157",
  "LEPC": "Rockingham County LEPC",
  "FacilityLatDecDegs": "36.285",
  "FacilityLongDecDegs": "-79.660556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Reidsville, North Carolina",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Hydro Management Services, Inc.",
  "OperatorStr1": "P.O. Box 1279",
  "OperatorStr2": null,
  "OperatorCity": "Clemmons",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27012",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gary Stainback",
  "RMPTitle": "Director of Operations",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000077891",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-07-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-01-02 00:00:00",
  "DeRegistrationEffectiveDate": "2014-01-01 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 36.28676,
  "FRS_Long": -79.65813,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "The city of Reidsville will take over operations and submit a new RMP facility.",
  "_processes": [
    {
      "ProcessID": 7383,
      "AltID": "Water Treatment",
      "FacilityID": 6154,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7550,
          "ProcessID": 7383,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8132,
          "ProcessID": 7383,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508132,
          "ProcessID": 7383,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6154,
      "SummaryText": "Hydro Management Services\nReidsville, North Carolina\nWater Treatment Plant\n\nRMP Executive Summary\n\n\nHydro Management Services has implemented a comprehensive program to safely manage chlorine at its Reidsville Water Treatment Plant located in Reidsville, North Carolina. There have been no chlorine incidents in the most recent five-year history period.\n\nIn 1995, a Process Safety Management (PSM) program was initiated at the plants using a consulting organization. A PSM Compliance Manual was developed for the site. Key items included in the manual are:\n\n-Written site specific procedures for Employee Involvement, Management of Change, Incident Investigation, Pre-Startup Reviews and Self Audits;\n\n-Chlorine safety information as required by the regulations;\n\n-Standard Operating Procedures for chlorine management; and\n\n-Chlorine system maintenance procedures.\n\nAdditional steps have been implemented to complete the PSM program:\n\n-Training on PSM and its key components including Management of Change, Mechanical Integrity and Incident Investigation;\n\n-Conducting Process Hazards Analyses for the three chlorine processes;\n\n-Developing an initial Emergency Response Plan; and\n\n-Training in support of the certification of operators.\n          \nThe Plant Superintendent and company Safety Officer are meeting several times per year to review and update procedures and to maintain compliance with all aspects of the PSM/ RMP regulations.\n\nIn addition to PSM compliance, the plants have implemented a number of programs to improve the safe handling of chlorine and other chemicals.\n\n-The chlorine delivery system at the plant has been upgraded to a vacuum process over the past 10 years. This process has proven to reduce leaks by reducing the amount of equipment that is exposed to pressurized chlorine.\n\n-Plant inventories are controlled to maintain only two cylinders on site.\n\nThe site's Emergency Response Plans (ERP) have been significantly upgraded. In 1998, the ERP was revised to include "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6154,
      "SummaryText": "offsite response and communication. The County LEPC and other local response organizations have been incorporated into the ERP. Where necessary, communication plans have been developed to notify businesses or residences that may be impacted by a release. Chlorine Response Drills are routinely conducted.\n\nTo further understand chlorine risks, a consulting firm was contracted to conduct \"Offsite Consequence\" Modeling Analysis, as required by EPA's Risk Management Program. Both a \"Worst Case\" and an \"Alternative Case\" chlorine release scenarios were studied for each site.\n\nThe \"Worst Case\" modeling showed the potential impact of a full, 2000 pound cylinder of chlorine released in 10 minutes. This resulting chlorine plume extended 1.3 miles. For the \"Alternative Case,@ a more typical possible release of 180 pounds, three pounds/minute for 60 minutes, was modeled. The modeling indicated that a plume extending 0.1 miles would result.\n\nThe modeling showed that the risk of chlorine exposure is low due to the favorable location of the plant. The Water Treatment Plant is located southeast of the town on the shore of Lake Reidsville. Due to the topography and location of the plant, the most likely scenario would be for the chlorine to fall to Lake Reidsville, a creek and a swampland. These water bodies are all down gradient from the plant. Since chlorine is a heavier than air, it will tend to flow downhill toward the water, where it will be consumed by the surrounding trees, vegetation and surface waters. Thus, the impact of a chlorine release should result in no public exposure to minimum public exposure.\n\nIn addition to Process Safety Management, the organization has an active safety program. Hydro Management Services has an active Safety Committee. The committee meets monthly and its duties include reviewing new safety procedures, accident investigations, safety surveys and safety communications.\n\nAt the Water Plant, there are monthly safety meetings to review an OSHA subje"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6154,
      "SummaryText": "ct or discuss a safety issue. Routine training is conducted for topics such as:\n\n- Hazard Communications\n- Personal Protective Equipment\n- Lockout/Tagged\n- Confined Space\n \nAs a result of our programs, the plants have had an excellent safety record with no recordable injuries over the past three years. As mentioned earlier, there have been no reportable chlorine releases from the plants in the last five years.  The plant has worked extensively to upgrade its safety program.                                                                                                                                                                                                                                                                                                                                  Report by:\n\nGary Stainback                                                               \nDirector of Operations\nHydro Management Services, Inc."
    }
  ]
}