{
  "FacilityID": 6172,
  "FacilityName": "ARCTIC COLD STORAGE",
  "FacilityStr1": "4360 S. HAGGERTY",
  "FacilityStr2": null,
  "FacilityCity": "CANTON",
  "FacilityState": "MI",
  "FacilityZipCode": "48188",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26163",
  "LEPC": "Wayne County LEPC",
  "FacilityLatDecDegs": "42.284722",
  "FacilityLongDecDegs": "-83.465556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "DEAN PERAKIS",
  "OperatorStr1": "4360 S. HAGGERTY",
  "OperatorStr2": null,
  "OperatorCity": "CANTON",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48188",
  "OperatorZipCodeExt": null,
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000078328",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-10-12 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 42.27375,
  "FRS_Long": -83.44672,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7404,
      "AltID": " refrigeration system",
      "FacilityID": 6172,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 8154,
          "ProcessID": 7404,
          "ChemicalID": 56,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7572,
          "ProcessID": 7404,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3153,
              "Process_NAICS_ID": 7572,
              "SafetyReviewDate": "1999-05-01 00:00:00",
              "PHA_Date": "1999-02-16 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-03-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Computerized monitoring of system with repetive callout to different plant personnel when in alarm or failure condition",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Remote manual shutdown. Remote manual startup ventilation equipment",
              "OpProceduresReviewDate": "1999-05-01 00:00:00",
              "TrainingReviewDate": "1999-04-15 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Gas mask fitting",
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-01 00:00:00",
              "EquipmentInspectionDate": "1999-03-09 00:00:00",
              "EquipmentTested": "condenser tank and pumps, drained cleaned and inspected vibration analysis all compressors, done quarterly oil analysis all compressors, done bi-annualy roof equipment inspection, done weekly",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-05-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-15 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-15 00:00:00",
              "CBI_Flag": 0,
              "Description": "System Safety:   Computerized control system with repetitive callout to different plant personnel when in an alarm or failure condition. Remote shutdown of refrigeration system. Ammonia sensors automaticlly start ventilation equipment. Manual remote startup of venilation equipment.Ammonia compressor room is locked and off limits to all employees not trained or authorized for ammonia work.  Preventive Maintenance:      Vibration analysis quarterly oil analysis bi-annualy. Daily temperature and pressure logs. Visual inspections of all valves and piping recorded. Manufacture recommendations followed. International Institute of Ammonia Refrigeration guidelines followed.",
              "_chemicals": [
                {
                  "PrimaryKey": 3606,
                  "PreventionProgram3ID": 3153,
                  "ProcessChemicalID": 8154
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6172,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-04-15 00:00:00",
    "ERTrainingDate": "1999-04-15 00:00:00",
    "CoordinatingAgencyName": "wayne county lepc",
    "CoordinatingAgencyPhone": "7349425289",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6172,
      "SummaryText": "                                                               Arctic Cold Storage\n                                                               4360 S. Haggerty \n                                                               Canton Mi. 48188\n\n\n            Arctic Cold Storage is a public refrigerated warehouse and is a member of the IARW ( International Association of Refrigerated Warehouses) and TRRF (The Refrigeration Research Foundation) Total refrigerated space is 132,972 sq. ft. totaling 3.9 million cu. ft. Tempatures range from -20'F  to +30'F with a 45'F dock and 22 dock doors.\n\n            Ammonia is the refrigerant used in the refrigeration system. Ammonia safety is what this summary is about. Ammonia is an extremely hazardous substance that has been used in refrigeration since the late 1800.\nWhen ammonia systems are designed properly, maintained properly and  maintained by qualified personnel  they are extremely safe. As a good neighbor we want to exhibit to you that Arctic Cold Storage follows these important guidelines.\n\n            System design follows or exceeds codes set by the state of Michigan. We also follow guidelines set by the IIAR (International Institute of Ammonia Refrigeration). For example It is not required by code that the ventilation system can be started from a remote location outside of the compressor room. IIAR recomends this so we do. Emergency shutdown is also located outside of the compressor room. Emergency shutdown can also be done from off site by computer. The entire system is monitored by computer with a repetitive callout system to plant personnel when there is an alarm or failure. Remember that an alarm or failure does not mean a ammonia release. It only means that a safety in the system has worked.\n           \n            Some 100,000 ammonia refrigeration plants are operating in countries around the world. Man is producing approximately 120,000,000 tons of ammonia yearly for use as fertilizer, in the chemical industry, e"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6172,
      "SummaryText": "tc., which accounts for some 98% of all the ammonia used. The remainder is involved in refrigeration applications. The refrigeration charge at ACS is 16,000 lbs. at 5 lbs. to the gal. (lighter than air as a vapor) thats approximately 3200 gals. There have been no releases other than normal maintenance pumpdowns and no additional ammonia brought in. There have been no ammonnia related accidents at ACS.\n\n            In the event of a accidental release, that could have offsite consequences it is the policy of ACS that emergency shutdown takes place, calls are made to the Local Emergency Planning Committe, Fire Dept, and that all employees evacuate to emergency assembly areas. Only trained personnel will respond to the leak. Emergency shutdown stops all compressors all pumps and all solenoid valves go to the closed position. All this can be done with one switch located in the general managers office. Since all compressing of ammonia gas is stopped and all pumping of liquid ammonia is stopped a serious release is minimized. The alternative scenario is something more realalistic. This scenario would probably happen in the compressor room and would go as follows:\n\n            A seal fails on a pump or compressor or a worker makes a mistake while performing maintence. There are steps to prevent these kind of accidents. Basic preventive maintenace and training are the keys. Seals rarely fail without giving the operator notice, oil on the floor, the smell of ammonia that wasn't there yesterday, tells  the operator that steps need to be taken. Since ammonia is detectable at levels as low as 10 to 15 ppm small leaks can be found and repaired before they become serious. ACS as a no leak is tolerable policy. A review of the maintenance task to be done with the chief engineer is the first step. What drawings do we need to look at? What valves need to be closed? How do we get all the liquid ammonia out of that part of the system to be opened? Is safety equipment there in case we n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6172,
      "SummaryText": "eed to handle something unexpected? Most ammonia releases at refrigerated warehouses have happened while the system was either being added on to or maintenance was being done. The second most probable cause of ammonia release would be fork lifts. At ACS the compressor room is locked and off limits to hilos. From there all ammonia piping is on the roof. The penthouse evaporators cannot be reached by the hilos. Dock evaporators are hung over racks putting them out of the hilos path. We are required by OSHA to have a process safety management program in place and it must be followed. This is not a burden to ACS, but a helpfull tool to help us keep our equipment running, and are employees safe. \n\n            As the chief engineer at ACS I hold a first class refrigeration operators license from the city of Detroit, I've held this license for 20 years. It qualifies me to operate a refrigeration system of unlimited hp and unlimited lbs. of refrigerant. I have also attended several classes at the University of Wisconsin on the design and construction of freezers coolers and process room, ammonia refrigeration system safety and classes at the manufacture of our compressors plant for inspection, teardown and repair of our compressors. ACS also employs an assistant to the chief engineer. He holds a 3rd class refrigeration operators license and is presently attending school to obtain his \n\n\n\nfirst. This is not something that is required by the city of Canton, however it is required by OSHA that the employer protects its workers and by the EPA that we do not put the public at risk. The cold storage business is a very demanding one. The building and the equipment run 24 hrs. a day seven days a week. The refrigeration operators are on call the same. Lengthly breakdowns are not tolerated. Spare parts for all the equipment is mandatory. With inventories running between 11 and 16 million pounds of perishable product, you cannot afford to cut corners on the quality of maintenance, equ"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6172,
      "SummaryText": "ipment or safety.\n\n            I would like to close this summary with a breif review of ACS. This is not a process facility where we are taking ammonia in running it through a process, mixing it with other products to make a new product and sending it back out. The ammonia in this refrigeration plant is the same ammonia that was put in here in 1994. Using the same basic principles that the home refrigerator uses, evaporating the liquid to a vapor cools our building compressing the vapor and condensing it back to a liquid to be evaporated again, over and over the process goes day in and day out. There have been no accidental releases, no ammonia related injuries. We are also going to explore new mitigation devices that could help control a worst case scenario.  We welcome visits by anyone or any organization that would like to view our plant.\n\n\n\n\n                                                                                     Sincerely,\n\n\n\n                              \n                                                                                     Dennis O'Connor\n                                                                                     Chief Engineer \n                                                                                     Arctic Cold Storage"
    }
  ]
}