{
  "FacilityID": 6212,
  "FacilityName": "Mid Dakota Chemical Feed Building",
  "FacilityStr1": "20080 South Dakota Highway 1804",
  "FacilityStr2": null,
  "FacilityCity": "Pierre",
  "FacilityState": "SD",
  "FacilityZipCode": "57501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "46065",
  "LEPC": "Hughes County LEPC",
  "FacilityLatDecDegs": "44.478611",
  "FacilityLongDecDegs": "-100.402222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "mdtc@turtlecreek.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Mid Dakota Rural Water System",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Bill Sarringar",
  "OperatorStr1": "29120 Holly Road",
  "OperatorStr2": null,
  "OperatorCity": "Pierre",
  "OperatorStateFIPS": "SD",
  "OperatorZipCode": "57501",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bill Sarringar",
  "RMPTitle": "Treatment Plant Manager",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000077249",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-01-16 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 44.47861,
  "FRS_Long": -100.40222,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7450,
      "AltID": "Chlorine Storage",
      "FacilityID": 6212,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7618,
          "ProcessID": 7450,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8205,
          "ProcessID": 7450,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508205,
          "ProcessID": 7450,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6212,
      "SummaryText": "Mid Dakota Rural Water System\nChemical Feed Building\nRisk Management Plan Executive Summary\n\n\n1.0  Accidental Release Prevention and Emergency Response Policies\n\nAt the Mid Dakota Rural Water System Chemical Feed Building, we are committed to operating and maintaining all of our processes in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency action  planning to help ensure the safety of our employees and the public, as well as protection of the environment.  This executive summary provides a brief overview of the comprehensive risk management activities that we have implemented, including:\n\n     *     A description of our facility and use of substances regulated by EPA's RMP regulation\n     *     A summary of results from our assessment of the potential offsite consequences from\n           accidental chemical releases.\n     *     An overview of our accidental release prevention programs.\n     *     A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\n     *     An overview of the emergency response plan we rely on.\n     *     An overview of planned improvements at the facility to help prevent accidental chemical releases\n           from occurring and adversely affecting our employees, the public, and the environment.\n\n\n2.0  Stationary Source and Regulated Substances\n\nThe Mid Dakota Chemical Feed Building is where the first step of water treatment takes place as raw water from Lake Oahe is pumped enroute to our main  treatment plant.  The Chemical Feed Building provides enclosed storage for chemicals and the equipment used to feed them into the raw water pipe line.   In our treatment process, we use the following chemical that EPA has identified as having the potential to cause significant offsite consequences in the event of a substantial accidental release:\n\nToxics:  Chlorine\n\nChlorine is used as a disinfectant to inactivate disease causing organisms.  The maximum inv"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6212,
      "SummaryText": "entory of chlorine that can be stored on-site in the Chemical Feed Building chlorine storage room is 6,000 pounds, leaving one space for an empty container.  This amount of storage was designed for the ultimate design capacity of the plant.  Since we are a new facility, having started operation in 1997, we operate well below the ultimate design capacity and maintain a maximum chlorine inventory at the Chemical Feed Building of only 4,000 pounds.\n\nOur accidental release prevention program and our contingency planning efforts help us effectively manage the hazards posed to our employees, the public, and the environment by our use of chlorine.\n\n\n3.0  Key Offsite Consequence Analysis Scenarios\n\nEPA's RMP rule requires that we provide information about the worst-case release scenario and an alternate release scenario for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario:\n\nWorst Case Release Scenario - Regulated Toxic Chemical:  Chlorine\n\nThe worst case scenario for the Mid Dakota Chemical Feed Building would be catastrophic failure of one full 2,000 pound container of chlorine.  The worst case is assumed to be a direct release over a 10-minute period, as required by the regulation.  The assumed meteorological conditions are 1.5 meters per second wind speed, atmospheric stability Class F (very stable, calm evening conditions), and rural terrain. Because the chlorine containers are always stored in an enclosed storage room, the release rate to the atmosphere is reduced from 200 lb/min to only 110 lb/min.  The building enclosure provides passive mitigation of the chlorine release.  Under these conditions, the EPA OCA Reference Table 11 predicts a distance of 2.2 miles to the toxic endpoint (0.0087 mg/L) of the release.  The approximate population affected by this scenario is 100, based on 1990 U.S. Census data.\n\nThe public "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6212,
      "SummaryText": "receptors within this distance include residences, public recreation areas, and a hydroelectric power plant.  The environmental receptors within this distance include officially designated wildlife sanctuaries and refuges, federal lands, Lake Oahe, and farm fields.\n\nAlternate Release Scenario - Regulated Toxic Chemical:  Chlorine\n\nThe alternate release scenario for our facility describes a situation that would be more likely to occur than the worst case described above, and which would affect areas off-site.  This scenario assumes the release of gas chlorine from a one-ton chlorine container, through a 5/16-inch diameter valve body opening,  due to severed connection with the  tank mounted vacuum regulator. The release duration is assumed to be 60 minutes.   The container is assumed to release 900 pounds of chlorine, at a rate of 15 lb/min.  Because the chlorine containers are always stored in an enclosed storage room, the release rate to the atmosphere is reduced from 15 lb/min to 8.25 lb/min.  The closest release rate to 8.25 lb/min on the EPA Reference Table is 10 lb/min, so the 10 lb/min release rate is used.  The building enclosure provides passive mitigation of the chlorine release.  The assumed meteorological conditions are 3.0 meters per second wind speed, atmospheric stability Class D (neutral stability, overcast conditions), and rural terrain.  Under these conditions, the EPA OCA Reference Table 24 predicts a distance of 0.2 miles to the toxic endpoint (0.0087 mg/L) of the release.  The approximate population affected by this scenario is in the range of 0 to 20, based on 1990 U.S. Census data.  The actual population is about 5.\n\nThe public receptors within this distance include residences located on land adjacent to the Chemical Feed Building.  The environmental receptors include nearby farm fields and federal land along the Lake Oahe shoreline.\n\nWe are using this information to help ensure that our community emergency response plan addresses all reasonabl"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6212,
      "SummaryText": "e contingency cases.\n\nAdministrative controls that help prevent such releases from ever happening include proper training of all plant operators in the use of chlorination equipment.  Two operators are used whenever work is done in the chlorine room.  One operator acts as \"safety observer\", while the other works on the equipment.  Each time a new container is connected for use, the operator performs a leak check of all the connections to assure they are secure and properly installed.  We use an all-vacuum chlorine feed system, the safest type available, to deliver the chlorine gas from the connected containers into the treatment process.  If a feed line is accidently damaged or disconnected, the chlorine flow stops completely due to loss of vacuum.  We also use specialized instrumentation that provides continuous leak monitoring of the room where the chlorine is stored.  Even a small leak in the chlorine room would activate an alarm and alert the operators on duty. \n\n\n4.0  General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nWe maintain a number of programs to help prevent accidental releases and ensure safe operation.  The accident prevention programs in place include:\n\n          1.  Regular review of safety information such as Material Safety Data Sheets (MSDS), \n               routine documentation of chlorine inventory, and regular updating of safety information\n               to assure accuracy and completeness.\n          2.  Hazard review of the chlorination system using industry recommended checklists to assess\n               potential problems that could result in an accidental release, determine the safeguards needed\n               to control the hazards or prevent equipment malfunction.  \n          3.  Written operating procedures that address initial startup, normal operations, temporary operations,\n               emergency shutdown, emergency operation, normal shutdown, startup following a normal\n               or emergen"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6212,
      "SummaryText": "cy shutdown or a major change, consequences of deviations and steps required\n               to correct or avoid deviations, and routine equipment inspections.\n          4.  Regular employee training to assure that each plant operator has the required knowledge,\n               skills, and abilities to safely carry out the duties and responsibilities assigned.\n          5.  Written maintenance procedures and documentation to assure safe operation of critical \n               equipment.  Operators routinely review these procedures prior to beginning maintenance\n               procedures on the chlorination equipment.\n          6.  Compliance audits every 3 years to assure that the Mid Dakota Chemical Feed Building facility\n               and its operators implement the risk management program and comply with the regulations.\n          7.  Written plan for conducting an incident investigation, should even a minor release or near-miss\n               incident occur. \n\n\n5.0  Five-Year Accident History\n\nWe keep records for all significant accidental chemical releases that occur at our facility.  We have\nnot had an accidental release involving chlorine since our initial start-up in October, 1997.  If an accidental\nrelease occurs, we are fully prepared and committed to conducting a formal incident investigation to\nidentify and correct the root cause of the event.\n\n\n6.0  Emergency Response Program\n\nWe maintain an emergency action plan, which complies with the various federal, state, and local\nregulatory requirements for emergency response planning.  Our emergency action plan calls for us to immediately notify the Hughes County Dispatch (dial 911) and evacuate employees to a safe location.  The Hughes County Local Emergency Response Plan and the Pierre Fire Department Hazardous Materials Emergency Response Plan are then put in effect.  We have coordinated our action plan with the Hughes County and Pierre emergency responders.  We have also conducted a training drill with these a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6212,
      "SummaryText": "gencies to assure that we will be prepared in the event of an actual release.\n\n\n7.0  Planned Changes to Improve Safety\n\nThe following is a list of improvements that we are planning to implement at the Mid Dakota Chemical Feed Building to help prevent and/or better respond to accidental chemical releases:\n\n          1.  We will conduct regular training drills with the Hughes County and Pierre emergency \n               responders.\n          2.  We will provide more safety training and review workshops for our employees.\n          3.  We will maintain only the minimal chlorine inventories necessary for assuring proper disinfection\n               and treatment."
    }
  ]
}