{
  "FacilityID": 6253,
  "FacilityName": "DuPont Dow Elastomers L.L.C., Pontchartrain Site",
  "FacilityStr1": "560 Highway 44",
  "FacilityStr2": null,
  "FacilityCity": "LaPlace",
  "FacilityState": "LA",
  "FacilityZipCode": "70068",
  "Facility4DigitZipExt": "6908",
  "FacilityCountyFIPS": "22095",
  "LEPC": "St. John The Baptist Parish",
  "FacilityLatDecDegs": "30.056667",
  "FacilityLongDecDegs": "-90.513056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "DuPont Dow Elastomers L.L.C.",
  "Company2Name": null,
  "CompanyDUNS": 933194151,
  "Company2DUNS": 0,
  "OperatorName": "DuPont Dow Elastomers L.L.C.",
  "OperatorStr1": "560 Highway 44",
  "OperatorStr2": null,
  "OperatorCity": "LaPlace",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70068",
  "OperatorZipCodeExt": "6908",
  "RMPContact": "Guy D. Tenini",
  "RMPTitle": "Neoprene Unit Manager",
  "FTE": 233,
  "OtherEPAFacilityID": "70068DPNTD560HW",
  "EPAFacilityID": "100000084927",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "2249-VI",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 30.06624,
  "FRS_Long": -90.52293,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7499,
      "AltID": "Neoprene Process",
      "FacilityID": 6253,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7667,
          "ProcessID": 7499,
          "NAICSCode": "325212",
          "_desc": {
            "NAICS_CODE": "325212",
            "NAICS_DESCRIPTION": "Synthetic Rubber Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8256,
          "ProcessID": 7499,
          "ChemicalID": 120,
          "Quantity": 900000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 120,
            "ChemicalName": "1,3-Butadiene",
            "CASNumber": "106-99-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 8257,
          "ProcessID": 7499,
          "ChemicalID": 125,
          "Quantity": 86000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 8258,
          "ProcessID": 7499,
          "ChemicalID": 62,
          "Quantity": 1052000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 8259,
          "ProcessID": 7499,
          "ChemicalID": 160,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 160,
            "ChemicalName": "Nitrogen Tetroxide",
            "CASNumber": "10544-72-6",
            "Threshold": 250.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "LA"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508256,
          "ProcessID": 7499,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508257,
          "ProcessID": 7499,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508258,
          "ProcessID": 7499,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508259,
          "ProcessID": 7499,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 7500,
      "AltID": "Chlorine Storage",
      "FacilityID": 6253,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7668,
          "ProcessID": 7500,
          "NAICSCode": "325212",
          "_desc": {
            "NAICS_CODE": "325212",
            "NAICS_DESCRIPTION": "Synthetic Rubber Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8260,
          "ProcessID": 7500,
          "ChemicalID": 62,
          "Quantity": 9000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508260,
          "ProcessID": 7500,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6253,
      "SummaryText": "Executive Summary\nDuPont Dow Elastomers\nPontchartrain Site\nLDEQ Facility Number 25968\n\n\nIntroduction\n\nDuPont Dow Elastomers L.L.C. (DuPont Dow) is a 50/50 joint venture between DuPont and Dow formed on April 1, 1996.  DuPont Dow is a global supplier of specialty elastomer products and supporting technologies.  Headquarters are located in Wilmington, Delaware and employs approximately 1,500 people worldwide.\n\nDuPont Dow offers a wide variety of polymer products that have end-use applications in automotive systems, wire and cable, construction, chemical processing, the general rubber industry, and in high-performance parts with excellent temperature, oil, and chemical resistance.  Examples of the end products that are made with DuPont Dow materials include:\n\n* Coatings - from rainwear to liners for roofs and tanks,\n* Automotive products - from power steering pressure hoses to high performance timing belts,\n* Wire and cable insulation - from electrical wiring to nuclear power station cable, and\n* Industrial application - from microwave door enclosures to acid hoses.\n\nThe Environmental Protection Agency promulgated the Risk Management Plan (RMP) rule to comply with the Clean Air Act Amendments of 1990.  RMP is a communication process designed to help the public, emergency responders and regulatory agencies understand the risks associated with certain types of facilities.  This executive summary, one of the requirements under the RMP, is provided in compliance with 40 CFR ' 68.15.\n\nAccidental Release and Emergency Response Policies\n\nThe DuPont Dow Pontchartrain Site is committed to operating and maintaining all the processes in a safe and responsible manner.  The site is committed to the safety and well being of employees and the community.  Corporate and site's main goals are to prevent all accidental releases, process safety incidents and employee injuries.  Systems and procedures are in place to assure the safety of the working environment.  The progress against goals"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6253,
      "SummaryText": " is constantly assessed and communicated to the employees.  Achievement of these goals is recognized and rewarded, while failure to attain them is regarded as unacceptable performance.\n\nThe emergency response policy is to respond immediately to any accidental releases or process safety incidents to minimize impact on the employees, public and the environment.  The emergency response teams provide coverage 24 hours a day.  These employees are trained on how to handle emergency situations. \n\nThis document provides a brief overview of the comprehensive risk management activities that have been designed and implemented at this site, including:\n\n* A description of the facility and use of substances regulated by EPA's RMP regulation;\n* A summary of results from the assessment of potential offsite consequences from accidental chemical releases;\n* An overview of the accidental release prevention programs;\n* A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule;\n* An overview of the emergency response program;\n* An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting employees, the public, and the environment; and\n* The certification required by EPA's RMP rule.\n\n\nSite Identification and Regulated Substances\n\nDuPont Dow Pontchartrain Site operates on approximately 1,138 acres in Sections 90, 91, 92 and 93 of Township 115, Range 7 East in St. John the Baptist Parish, Louisiana, on property owned by DuPont.  Approximately 200 acres are used for actual manufacturing activities.  The site is located one mile west of LaPlace at 560 Highway 44 at approximately River Mile 136 on the Mississippi River.\n\nAt this site, DuPont Dow manufactures chloroprene, which is used as the raw material in the production of synthetic rubber, and Neoprene synthetic rubber that has been produced for nearly 70 years.  Some of Neoprene's end uses are: adhesives and sealant, power transm"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6253,
      "SummaryText": "ission belts and hoses for automobiles, and wire and cable jacketing.\n\nThis site uses the following chemicals listed under the RMP regulation: \n\nToxics\n\n* Chlorine\n* Nitrogen Tetroxide (Louisiana's list)\n\nFlammables\n\n* 1,3-Butadiene\n* Pentane\n\nConsequence Analysis Scenarios\n\nEPA's RMP rule requires information about worst-case release scenario(s) and alternative release scenario(s) for each covered process.  EPA defines the worst case scenario as a hypothetical release of the largest quantity of a regulated substance.  The scenario assumes the entire quantity is released in ten minutes, even if it is impossible to do so.  Since the worst case scenarios are very improbable the EPA has included the requirement for companies to report alternate case scenarios, in order to facilitate emergency response planning with the community.  These alternate case scenarios provide a more realistic picture of what could actually happen if the safety systems used by a facility were to fail.\n\nThe following are brief summaries of these scenarios.  These scenarios were developed using the guidance and technical data supplied by the EPA.  EPA's RMP*Comp(tm) was used to determine the offsite impact of chlorine and butadiene.  The TRACE dispersion modeling software from the SAFER program was used to determine the offsite impact of nitrogen tetroxide.\n\nWorst-case Release Scenario - Regulated Toxic Chemical - Chlorine\n\nThe worst-case release scenario for a toxic chemical is the failure of one chlorine storage tank.  This tank has a capacity of 253,000 pounds.  Per EPA's guidance no mitigation controls were considered.  This release has an off-site impact.  This scenario is unlikely to happen due to tank design and construction and extensive programs implemented to ensure the mechanical integrity of the tank and associated equipment.\n\nAlternate Release Scenario - Regulated Toxic Chemical - Chlorine\n\nThe alternate case scenario for chlorine is the failure of a 1.5\" corrugated liquid chlorine "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6253,
      "SummaryText": "unloading hose.  It assumes a hose ruptures at the fitting nearest to the tank car and releases 650 pounds of chlorine.  This release has an off-site impact.\n\nAlternate Release Scenario - Regulated Toxic Chemical - Nitrogen Tetroxide\n\nThe alternate case scenario for the nitrogen tetroxide is a small pipeline leak.  This release does not have an off-site impact.\n\nWorst-case Release Scenario - Regulated Flammable Chemical - Butadiene\n\nThe worst-case release scenario for a flammable substance is the failure of the butadiene storage tank. The maximum storage in this tank is 900,000 pounds.  Per EPA's guidance no mitigation controls were considered. This release has an off-site impact.  This scenario is unlikely to happen due to the tank location and the programs implemented to ensure its mechanical integrity.\n\nAlternate Release Scenario - Regulated Flammable Chemical - Butadiene\n\nThe alternate case scenario for the flammable substance is a butadiene pipeline leak from a blownout gasket.  The release duration for this scenario was assumed to be 4 hours.  This release does not have an off-site impact.\n\nGeneral Accidental Release Prevention Program and Chemical - Specific Prevention Steps\n\nDuPont Dow takes a systematic, proactive approach to preventing accidental releases of hazardous chemicals.  The Process Safety Management (PSM) program follows OSHA's Guidelines and is directed toward preventing serious, process-related incidents which might affect plant personnel, off-site communities, the environment, or result in significant property loss or loss of business.  It involves the application of systems and controls to chemical and manufacturing processes in a way that hazards are identified, understood and controlled so that process-related injuries and incidents are prevented.  The process safety management systems include the following items:\n\n* A thorough understanding of the process technology, including the safe limits of the processes and the proper materials of co"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6253,
      "SummaryText": "nstruction for equipment;\n* Proper design and installation of equipment;\n* Systematic process hazard reviews to identify and address process hazards;\n* Written operating and maintenance procedures;\n* Extensive training for all persons who operate or maintain chemical process equipment;\n* Mechanical integrity testing and preventive maintenance for early detection of potential equipment problems;\n* Mechanical quality assurance programs to ensure that the correct spare parts are installed whenever maintenance is performed;\n* Procedures to identify and manage both obvious and subtle changes in technology, equipment, and personnel, that could have an effect on the site's safety and environmental performance;\n* Pre-startup safety reviews for newly installed or modified equipment;\n* Compliance audits to ensure that process safety management principles, procedures, and regulations are effective and properly implemented;\n* Investigation of actual and potential incidents to identify and implement corrective actions;\n* Participation of all employees in the process safety management system;\n* Documented safe work practices, including hot work procedures requiring the issuance of hot work permits;\n* Contractor safety management system to ensure that work done by contractors is performed safely and in compliance with DuPont Dow Elastomers standards;\n* Storage of covered chemicals is minimized to meet business needs.  The maximum storage of chlorine tank cars and butadiene is used only rarely and for short periods because of differences between shipments and/or to accommodate supplier's production schedule.\n\nIn addition to the practices described above, processes are designed to include multiple layers of safeguards.  Examples of these include:\n\n* Automatic valves for rail cars, which isolate the supply of materials from the rail car in the event of a process upset; \n* Computer display and control of process parameters;\n* Interlocks to automatically shut down processes for certain"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6253,
      "SummaryText": " process deviations;\n* Low concentration chlorine detectors that  sound an alarm and provide an alarm signal to the computerized process control system when a leak is detected;\n* Emergency scrubber system to prevent emissions from reaching the environment; \n* Isolation valves which can be operated remotely from the process control system;\n* Deluge systems built into the process to quickly suppress chemical fumes or fires;\n* Check valves to prevent cross contamination of chemicals;\n* Fire prevention activities like electrical grounding, inerting flammables with nonflammable gases and hot work permitting; and\n* Operator surveillance during transfer of hazardous materials from shipping containers.\n\nFive Year Accident History\n\nRecords of all significant accidental chemical releases that occur are kept.  No off-site injuries, evacuations, sheltering in place, property damage or environmental damage has occurred involving materials and processes covered under the EPA's RMP rule since formation of this company.  Prior to Aril 1, 1996 DuPont operated the site and reported no off-site injuries, evacuations, sheltering in place, property damage or environmental damage.\n\nEmergency Response Plan\n\nThe site has an Emergency Response Plan, which establishes procedures and responsibilities for the various functions involved in handling any plant emergency, either internal or external to this site.  This plan consolidates all the federal, states, and local regulatory requirements for emergency response planning.  Drills are conducted on a regular basis and are coordinated with the Local Emergency Planning Committee.\n\nPlanned Changes to Improve Safety\n\nAs part of the site's process hazards review procedures, all of the processes are thoroughly studied on a periodic basis to identify risk reduction opportunities.  As a result of these studies, the site is currently implementing, or is planning to implement the following risk reduction activities.\n\n* Install remote shut-off valves on t"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 6253,
      "SummaryText": "he tank car side of the chlorine unloading hoses.  \n* Improve protecting equipment for the Emergency Response Team.\n* Improve the control of the process by installing better instrumentation, more automatic process shutdown interlocks, and upgraded computer control systems;\n* Improve preventive maintenance inspections and procedures;\n* Improve training programs; and \n* Conduct process safety audits to identify any deficiencies in the management systems.\n\n\nNote on Prevention Program ID 2 - Chlorine Storage\n\nThe Neoprene process uses chlorine as a raw material.  Chlorine usage at this process can require that four tanks be unloaded each day.  While the process is operating, the site tries to maintain twenty chlorine tank cars on-site with a stop order point at twenty-five tank cars.  Because the deliver time is seven days, the site may have thirty-five to forty tank cars when the process has a long unscheduled shutdown.  Chlorine storage of the tank cars was chosen as a process for RMP reporting purpose.\n\nThe chlorine tank cars are maintained, inspected and serviced by the chlorine supplier.  Once at the site, DuPont Dow performs visual inspections prior to unloading.  If a problem is found with the tank cars, the emergency response team will respond until the chlorine supplier arrives at the site.  \n\nSince DuPont Dow does not perform any type of work or maintenance on the tank cars sections 7.7 and 7.8 are not applicable.  The RMP submittal date (6/18/99) was entered on these two sections because leaving them blank will generate errors on the submittal.\n\nA PHA for this process was conducted during the first two weeks of June 1999.  No recommendations were issued in this report.  According to the RMP Submit instructions, if no recommendations are issued Item 7.4c can be left blank.  In our submittal it was found that leaving this item blank generated errors.  The submittal date of this report was used on this item to prevent errors."
    }
  ]
}