{
  "FacilityID": 6365,
  "FacilityName": "Lufkin Water Pollution Control Plant",
  "FacilityStr1": "FM 324 South",
  "FacilityStr2": null,
  "FacilityCity": "Lufkin",
  "FacilityState": "TX",
  "FacilityZipCode": "75902",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48005",
  "LEPC": "Angelina County LEPC",
  "FacilityLatDecDegs": "31.286667",
  "FacilityLongDecDegs": "-94.749722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "OT",
  "FacilityURL": "www.ci.lufkin.tx.us",
  "FacilityEmailAddress": "kwright@ci.lufkin.tx.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Lufkin",
  "OperatorStr1": "P.O. Drawer 190",
  "OperatorStr2": null,
  "OperatorCity": "Lufkin",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75902",
  "OperatorZipCodeExt": "0190",
  "RMPContact": "Deborah Cassidy",
  "RMPTitle": "Wastewater Treatment Plant Supt.",
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000084464",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 31.28667,
  "FRS_Long": -94.74972,
  "FRS_Description": "OTHER",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7638,
      "AltID": "Wastewater Treatment",
      "FacilityID": 6365,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7808,
          "ProcessID": 7638,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8407,
          "ProcessID": 7638,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 8408,
          "ProcessID": 7638,
          "ChemicalID": 49,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508407,
          "ProcessID": 7638,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508408,
          "ProcessID": 7638,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6365,
      "SummaryText": "Facility Description\nThe Lufkin Water Pollution Control, Hurricane Creek Plant is located in Lufkin, Texas at XXXX.  The facility is owned and operated by the City of Lufkin.  This facility is a conventional wastewater treatment plant and uses chlorine and sulfur dioxide as part of the treatment process.  Currently, a maximum of 16,000 pounds of chlorine and 8,000 pounds of sulfur dioxide are maintained on the site.  No other toxic or flammable substances, as listed in 40 CFR 68 are stored or utilized at the facility.  \n\nSafety Policies\nThe City of Lufkin is fully committed to safety at the wastewater treatment plant.  The Lufkin Utilities Department has long emphasized the importance of safety in storing and using regulated toxic substances and has used the 40 CFR 68 requirements as an opportunity to further refine its safety program.  The City has also used this opportunity to strengthen its emergency response procedures between the wastewater treatment plant and the City Fire Department.  The Fire Department is capable of responding to accidental releases of chlorine or sulfur dioxide, should a release occur.  Finally, the City will continue to improve its risk management program for chlorine and sulfur dioxide at the wastewater treatment plant.\n\nFive Year Accident History\nThe City's commitment to managing risks associated with chlorine and sulfur dioxide is demonstrated by its excellent track record with these substances.  The wastewater treatment plant has not experienced an accident related to chlorine or sulfur dioxide within the past five years.  The City is not aware of any such accidents prior to the past five years.\n\nOffsite Consequence Analysis\nFor the facility's offsite consequence analysis, sulfur dioxide was established as having the largest radius of impact, and was thus used for the worst-case scenario.  Public receptors do exist within this radius, including residences, educational facilities, parks, major commercial/office buildings, and one priso"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6365,
      "SummaryText": "n facility.  As required by the risk management regulations, the offsite consequence analysis also required development of alternative-release scenarios for both chlorine and sulfur dioxide.  Realistic potential alternatives were modeled, with consideration toward actual conditions at the site.  The resulting radii of impact are therefore useful tools for emergency response teams in planning for and responding to emergency situations.\n\nPrevention Program Description\nThe City's prevention program represents the core of the day-to-day means by which accidental releases of regulated substances into the air will be minimized.  This component will be used primarily by plant personnel responsible for the operation and maintenance of regulated processes at the facility.  The prevention program will also become a useful tool in ongoing training of plant personnel. \n\nThe Program 2 Prevention Program includes seven primary components:\n\n7 Safety Information: Up-to-date safety information has been compiled relating to regulated substances, processes, and equipment. Safety information will also be updated any time a major change occurs that would make the safety information inaccurate.\n\n7 Hazard Review: Regulated processes at the facility have been reviewed to identify potential hazards.  The results have been documented in a hazard review report.  Problems identified by the hazard review are being resolved in a timely manner.  \n\n7 Operating Procedures: Written operating procedures have been prepared providing instructions for safely conducting activities associated with regulated processes.  These procedures will also be updated should a major change in the handling or storage of regulated substances occur.\n\n7 Training:  Plant personnel responsible for operating regulated processes receive training in the processes.  Periodic refresher training is required.\n\n7 Maintenance:  Procedures have been implemented to ensure that the mechanical integrity of the process equipment is main"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6365,
      "SummaryText": "tained.  Ongoing training of personnel responsible for maintenance is also required.  Inspection and testing of regulated process equipment is a requirement as well.\n\n7 Compliance Audits: The prevention program will be audited at least once every three years to evaluate compliance with the risk management rules.  The results of the audit will be documented, and deficiencies corrected.\n\n 7 Incident Investigation: Should an incident involving a release, or near release, of a regulated substance occur, it will be investigated promptly.  The findings of any such incident investigation will be used to improve the safety of the process.\n\nEmergency Response Program\nThe City of Lufkin has determined that the Water Pollution Control, Hurricane Creek Plant will assume a non-responder status with respect to accidental releases of chlorine or sulfur dioxide.  The Fire Department for the City will instead be the appropriate local emergency response agency in such cases.  The Lufkin Fire Department has the necessary training to respond to chlorine and sulfur dioxide leaks.  The Lufkin Water Utilities Department has coordinated with the Fire Department to ensure that the facility is included in the community emergency response plan regarding response to a potential release.\n\nEven as a non-responding facility, the facility's employees have a significant role in the event of a release of chlorine or sulfur dioxide.  Should a release occur or be suspected when employees are at the facility, employees responsible for working with chlorine and sulfur dioxide will follow procedures for assessing the situation and attempting to safely stop the release using normal shutdown procedures.  Facility personnel will receive ongoing training in identification of potential releases, and in how to determine when emergency response personnel should be involved.\n\nThe Water Utilities Department will continue to work closely with the Fire Department to ensure that emergency response, should it become "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6365,
      "SummaryText": "necessary, is efficiently and safely carried out.  Coordination may include:\n\n7 periodic meetings between operators and Fire Department emergency responders to discuss emergency response measures\n\n7 periodic inspections of the facility by Fire Department emergency responders to ensure their familiarity with routes to the facility, ingress and egress routes at the facility, and layout of the chlorine and sulfur dioxide process areas\n\n7 periodic practice drills utilizing both Water Utilities and Fire Department personnel.\n\nImproving Safety\nThe City of Lufkin will continue to improve its risk management program for the wastewater treatment plant by responding to the recommended changes outlined in the Hazard Review, by ongoing training of personnel, and by continued coordination with emergency response officials.  As the wastewater treatment plant grows to meet the growing demands of the City, future plant expansions will consider further improvements in the treatment process to manage risks associated with these regulated substances."
    }
  ]
}