{
  "FacilityID": 6404,
  "FacilityName": "Hampton, South Carolina Plant",
  "FacilityStr1": "609 Nix Street",
  "FacilityStr2": null,
  "FacilityCity": "Hampton",
  "FacilityState": "SC",
  "FacilityZipCode": "29924",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45049",
  "LEPC": "Hampton County LEPC",
  "FacilityLatDecDegs": "32.876667",
  "FacilityLongDecDegs": "-81.109167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 120933791,
  "ParentCompanyName": "Georgia-Pacific Corporation",
  "Company2Name": null,
  "CompanyDUNS": 9020777,
  "Company2DUNS": 0,
  "OperatorName": "Georgia-Pacific Resins, Inc.",
  "OperatorStr1": "P.O. Box 258",
  "OperatorStr2": null,
  "OperatorCity": "Hampton",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29924",
  "OperatorZipCodeExt": null,
  "FTE": 11,
  "OtherEPAFacilityID": "SCD003349768",
  "EPAFacilityID": "100000079746",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-12-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2002-04-25 00:00:00",
  "DeRegistrationEffectiveDate": "2002-04-16 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.87712,
  "FRS_Long": -81.10734,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7684,
      "AltID": "Formaldehyde Manufacturin",
      "FacilityID": 6404,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 8456,
          "ProcessID": 7684,
          "ChemicalID": 1,
          "Quantity": 253440.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7855,
          "ProcessID": 7684,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3294,
              "Process_NAICS_ID": 7855,
              "SafetyReviewDate": "1997-06-12 00:00:00",
              "PHA_Date": "1996-02-28 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1997-10-20 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Plane Crash/sabotage",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "SOP Manual, Operator Training",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Operator Inspections, Inventory Control, 24 hour monitoring",
              "CH_ChemicalReduction": 1,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1996-06-12 00:00:00",
              "TrainingReviewDate": "1998-08-12 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1996-06-01 00:00:00",
              "EquipmentInspectionDate": "1997-01-21 00:00:00",
              "EquipmentTested": "01/21/97",
              "ChangeMgmtDate": "1999-06-11 00:00:00",
              "ChangeMgmtReviewDate": "1998-04-23 00:00:00",
              "PreStartupReviewDate": "1999-06-15 00:00:00",
              "ComplianceAuditDate": "1998-04-23 00:00:00",
              "AuditCompletionDate": "1999-04-30 00:00:00",
              "IncidentInvestigationDate": "1999-06-08 00:00:00",
              "InvestigationChangeDate": "1999-08-01 00:00:00",
              "ParticipationPlansReviewDate": "1998-04-23 00:00:00",
              "HotWorkPermitReviewDate": "1998-04-23 00:00:00",
              "ContractorSafetyReviewDate": "1998-04-23 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-11 00:00:00",
              "CBI_Flag": 0,
              "Description": "Formaldehyde Storage Tank",
              "_chemicals": [
                {
                  "PrimaryKey": 3759,
                  "PreventionProgram3ID": 3294,
                  "ProcessChemicalID": 8456
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6404,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-10-12 00:00:00",
    "ERTrainingDate": "1998-10-12 00:00:00",
    "CoordinatingAgencyName": "Hampton County Fire Department",
    "CoordinatingAgencyPhone": "8039432979",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6404,
      "SummaryText": " 1.  EXECUTIVE SUMMARY\n \n Georgia-Pacific Resins, Inc. (GPRI), a wholly owned subsidiary of Georgia-Pacific Corporation, owns and operates a formaldehyde manufacturing facility in Hampton, SC.  The facility is located on Nix Street and is adjacent to a Medical Waste Incinerator and an International Paper plant.  The GPRI facility consists of a plant that manufactures formaldehyde, which was constructed in 1958  Overall, the facility employs 11 full-time employees.\n \n GPRI is committed to operating the Hampton, South Carolina plant in a manner that is safe for its workers, the public, and the environment.  As part of this commitment, GPRI  has established a system to help ensure safe operation of the processes at this facility.  One component of this system is a risk management program (RMP) that helps manage the risks at the Hampton Plant and that complies with the requirements of the Environmental Protection Agencys (EPA's) regulation 40 CFR part 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule).  One of the requirements of the RMP rule is to submit a risk management plan (RMP Plan) describing the risk management program at the Hampton Plant. This document is intended to satisfy the RMP Plan requirement of the RMP rule and to provide the public with a description of the risk management program at the Hampton Plant.\n \n The risk management program at the Hampton Plant consists of the following three elements:\n \n7 a hazard assessment to help understand (a) the potential offsite consequences of hypothetical accidental releases and (b) accidents that have occurred during the last five years associated with the use of substances regulated by the RMP rule (regulated substances).\n \n7 a prevention program to help maintain and safely operate the processes containing more than a threshold quantity of a regulated substance (covered processes).\n \n7 an emergency response program to help respond to accidental releases of regulated substances"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6404,
      "SummaryText": " from covered processes\n \n Information further describing these elements is provided in this RMP Plan.\n \n Although the risk management program at the Hampton Plant helps provide assurance that the facility is maintained and operated in a safe manner, it is only one component of the safety program at the Hampton Plant.  In fact, the Hampton Plant has a comprehensive safety program in place establishing many levels of safeguards against release of a hazardous substance and injuries and damage from a release of a hazardous substance.\n\n GPRI limits the use of hazardous substances.  Before using a hazardous substance at the Hampton Plant, less hazardous alternatives are considered. When a hazardous substance is used at the Hampton Plant, GPRI considers the potential for this substance to adversely affect plant workers, the public, and the environment and takes steps to prevent any such effects.\n \n GPRI prevents releases of the hazardous substances used at the facility.  When a hazardous substance is used at the Hampton Plant, the equipment is carefully designed, built and operated to reduce the likelihood of an accidental release. Industry and government standards are closely adhered to in the design, construction, and operation of the equipment. \n \n GPRI limits damage from a release, if such a release occurs.  GPRI trains its workers to respond to an accidental release, reducing the consequences of a release if it occurs.  In addition, GPRI works with the local fire department and with the local emergency planning committee (LEPC) to help prevent injuries and/or environmental damage if a release does occur.\n \n The safety program at the Hampton Plant consists of a number of elements, only some of which are required by the RMP rule. This RMP Plan is primarily intended to describe those parts of the safety program at the Hampton Plant that are required by the RMP rule.\n \n 1.1 Accidental Release Prevention and Emergency Response Policies\n \n GPRI is committed to the safety o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6404,
      "SummaryText": "f workers and the public, and the preservation of the environment, through the prevention of accidental releases of hazardous substances.  GPRI implements reasonable controls to prevent foreseeable releases of hazardous substances.  These controls include training programs for personnel, programs to help ensure safety in the design, installation, operation, and maintenance of processes at the Hampton Plant; and programs to evaluate the hazards at the plant.\n \n In the event of an accidental release, the Hampton Plant controls and contains the release in a manner that will be safe for workers and will prevent injury to the public and the environment.  GPRI provides response training to its personnel, designates an emergency response coordinator to oversee response activities, and coordinates response efforts with the local fire department.  Response activities have also been discussed with the LEPC.  \n \n In order to effectively implement these policies, GPRI established a management system headed by the Safety Manager to oversee safety related activities.\n\n 1.2 Regulated Substances\n \n The Hampton Plant handles formaldehyde solution in sufficient quantity to be covered by the RMP rule, as shown in the following list of RMP-covered Program Level 3 processes at the plant.\n \n  Regulated Substance     Process     Process Quantity*, lbs     RMP Threshold, lbs*\n Formaldehyde Solution (50%)     Storage in Unpressurized Tanks     126,720     15,000\n \n * Process and threshold quantity is the quantity of pure chemical, not of the solution\n \n 1.3 Offsite Consequence Analysis\n \n The Hampton Plant performed an offsite consequence analysis to estimate the potential for an accidental release of a regulated substance to affect the public or the environment.  The offsite consequence analysis evaluates a worst case release scenario and an alternative release scenario.  GPRI does not expect a worst case release scenario to ever occur.  The alternative release scenarios were selected to help the LEPC"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6404,
      "SummaryText": " improve the community emergency response plan.  An alternative release scenario represents a release that (1) might occur at a facility like the Hampton Plant and (2) would result in the greatest potential offsite consequences if the release occurred.\n \n The main objective of performing the offsite consequence analysis is to determine the distance at which certain effects might occur to the public because of an accidental release (called the endpoint distance).  The following effects could occur at the endpoint distance.  At distances less than the endpoint distance, the effects would be greater; at distances greater than the endpoint distance, the effects would be less.\n \n When considering the release of a toxic substance, most people at the endpoint distance would be able to walk away from the exposure without any long term health consequences, although some short term consequences (e.g., strong eye or throat irritation) are possible.  Some people who are particularly susceptible to the substance released could be incapacitated.\n \n The RMP rule includes specific requirements for the worst case and alternative release scenarios that must be reported by GPRI.  These requirements are:\n \n7 one worst case release scenario for the class of toxic substances in Program 3 processes\n \n7 one alternative release scenario for each of the toxic substances in a Program 3 process\n \n7 one worst case and one alternative release scenario for the class of flammable substances in Program 3 processes\n\n The following information summarizes the offsite consequence analysis performed by the Hampton Plant:\n \n 1.3.1 Program 3 Processes-Toxic Substances - Formaldehyde Solutions\n \n The worst case release scenario for a 50% solution of formaldehyde is the release of the entire contents of the largest storage tank, a 26,400 gallon (126,720 lbs of pure formaldehyde) tank.  A concrete diked area contains the released formaldehyde solution which evaporates and forms a vapor cloud.  The maximum "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6404,
      "SummaryText": "distance to the toxic endpoint concentration based on modeling is 0.8 mile.  The U.S. Census indicates that 1,255 people live within this distance from the location of the storage tank; several public receptors are also located within this distance, including the adjacent Medical Waste Incinerator, the International Paper Plant, nearby residences, two elementary schools, and three daycare facilities.  No environmental receptors are located within this distance.\n \n The alternative case release scenario for a 50% solution of formaldehyde is the overfilling of a formaldehyde storage tank and the spillage of 100 gallons (480 lbs of pure formaldehyde) of solution into the concrete diked area.  Modeling this scenario indicates a toxic endpoint distance of 0.1 mile.  The U.S. Census indicates that 20 people live within this distance from the storage tank; several public receptors are also located within this distance, including the adjacent Medical Waste Incinerator, the International Paper Plant, and nearby residences.  No environmental receptors are located within this distance.\n \n 1.3.2 Program 3 Processes-Flammable Substances\n \n There are no regulated flammable substances in quantities above the threshold quantities at the plant.  Propane is stored on-site in a 100 pound cylinder, however, this quantity is less than the threshold quantity of 10,000 pounds.\n \n 1.4 Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n \n Since 1989, the Hampton Plant has used a prevention program to help prevent accidental releases of hazardous substances.  Beginning in 1992, the plant formalized this prevention program for the formaldehyde manufacturing and storage process to comply with the 14 elements of the OSHA process safety management (PSM) prevention program. In 1996, the EPA RMP rule established two levels of prevention requirements:\n \n Program 3essentially the same as OSHA PSM, except that the program also focuses on protecting the public and the envir"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6404,
      "SummaryText": "onment\n \n Program 2requires simplified versions of 7 of the 12 elements of the Program 3 prevention program (not applicable for Hampton Plant)\n \n The following sections briefly describe the elements of the Hampton Plants Program 3 prevention program that address EPAs RMP rule prevention program requirements.\n\n 1.4.1 Program 3 Prevention Program\n \n The Hampton Plants Program 3 prevention program consists of the following 12 elements:\n \n 1.4.1.1 Process Safety Information-the Hampton Plant maintains a variety of technical documents that are used to help ensure safe operation of the plant processes.  These documents address (1) physical properties of hazardous substances handled at the plant, (2) operating parameters of the equipment used at the plant, and (3) design basis and configuration of the equipment at the plant.  GPRI ensures that this process safety information is available to all employees, the LEPC, the Hampton Fire Department, the Hampton Regional Medical Center, and the County Sheriffs Office.\n \n Material safety data sheets (MSDSs) document the physical properties of the hazardous materials handled at the plant, including regulated substances in covered processes.  The information available for each hazardous substance typically includes:\n \n7 toxicity information and permissible exposure limits\n7 physical data (e.g., boiling point, melting point, flash point)\n7 reactivity and corrosivity data\n7 thermal and chemical stability data \n7 hazards of mixing substances in the process \n \n MSDSs for hazardous substances handled in each process are available in the process control room so that the operators have ready reference to this information.  In addition, MSDSs are provided to the LEPC and the fire department for use in helping formulate emergency response plans.\n \n The engineering design documents include the operating parameters and the design basis and configuration of the equipment in each covered process.  The available information includes:\n \n7 ope"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 6404,
      "SummaryText": "rating parameters\n7 block flow or simplified process flow diagrams \n7 process chemistry\n7 maximum intended inventories\n7 safe upper and lower limits for parameters such as temperature, pressure, or flow\n7 consequences of deviations from established operating limits\n7 design basis and configuration of equipment\n7 piping and instrumentation diagrams, including materials of construction\n7 electrical classification\n7 safety systems \n7 applicable design codes and standards\n7 design basis for relief and ventilation systems\n \n\n When important information was not available, from the design documents, it was developed through special projects or, in the case of operating parameters, during process hazard analyses of the process. Many of the operating parameters are included in the operating procedures to help with the safe operation of the process. These documents are used to (l) train employees, (2) perform process hazards analyses, and (3) help maintain the equipment.\n \n 1.4.1.2 Process Hazard Analysis\n \n The Hampton Plant performs and periodically updates process hazard analyses (PHAs) of the covered processes to help identify process hazards and generate recommendations that might improve the safe operation of the process.  A team composed of personnel with engineering and process operating experience and a leader with process hazard analysis experience is assembled to analyze the hazards of the process.  The plant primarily uses the what-if checklist technique to perform this analysis.  The PHA team prepares a written report describing the results of the analysis, including a list of recommendations.  Responsibility to resolve the recommendations is assigned to unit personnel and, when appropriate, changes to enhance the safety of the process are implemented.\n \n 1.4.1.3 Operating Procedures\n \n Hampton Plant process engineers, operators, and supervisors work together to develop and maintain operating procedures to define how tasks related to process operations should b"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 6404,
      "SummaryText": "e safely performed. The operating procedures (1) are used to train employees and (2) serve as reference guides for appropriate actions to take during both normal operations and process upsets.  Operating procedures include:\n \n7 steps for safely conducting activities\n7 applicable process safety information, such as safe operating limits and consequences of process deviations\n7 safety and health considerations, such as chemical hazards, personal protective equipment     requirements, and actions to take if exposure to a hazardous substance occurs\n \n Plant personnel develop and maintain operating procedures that cover all phases of operations, including initial startup, normal operations, normal shutdown, emergency shutdown, startup following a turnaround or emergency shutdown, and temporary operations. The operating procedures are used both to help in operating the plants processes and as a training guide.\n \n 1.4.1.4 Training\n \n The Hampton Plant trains its workers to safely and effectively perform their assigned tasks.  The training program includes both initial and refresher training that covers (1) a general overview of the process, (2) the properties and hazards of the substances in the process, and (3) a detailed review of the process operating procedures and safe work practices.  Oral reviews and written tests are used to verify that an employee understands the training material before the employee can resume work in the process. The operators are consulted annually at safety meetings to evaluate the effectiveness and frequency of the training.  Recommendations from the operators are reviewed, and changes to the training program are implemented as appropriate.\n \n 1.4.1.5  Mechanical Integrity\n \n The Hampton Plant maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  The mechanical integrity program includes (1) an inspection and testing program to help identify equip"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 6404,
      "SummaryText": "ment deterioration, and damage before the equipment fails and (2) a quality assurance program to help ensure that new and replacement equipment meets the design standards required for service in the plants processes.  The mechanical integrity program includes:\n \n7 specifications for inspection and testing of process equipment\n7 specifications for replacement parts and equipment\n7 procedures for inspecting, testing, and maintaining process equipment\n7 procedures for safe work practices such as lockout/tagout, hot work, confined space entry, and line or equipment opening\n7 training of maintenance personnel\n7 documentation of maintenance activities\n \n 1.4.1.6 Management of Change\n \n The Hampton Plant management of change program evaluates and approves all proposed changes to chemicals, equipment, and procedures for a covered process to help ensure that the change does not negatively affect safe operations.  Process changes that are determined to be a replacement in kind (e.g., replacing a valve with an identical valve) are allowed without completing a full management of change program. All other changes must be confirmed through the full management of change program to help ensure that inadvertent consequences of process changes are prevented, safety consequences of changes are addressed, affected process safety information and procedures are updated, and affected employees are notified of the changes.\n \n 1.4.1.7 Pre startup Review\n \n The Hampton Plant performs a safety review of a new or modified process before the process is placed into service to help ensure that the process has been prepared to operate safely. This review confirms that:\n \n7 construction and equipment are in accordance with design specifications\n7 adequate safety, operating, maintenance, and emergency procedures are in place\n7 employee training has been completed\n7 for a covered process, a PHA has been performed if the process is new or management of change     requirements have been completed if an e"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 6404,
      "SummaryText": "xisting process has been modified\n \n A pre startup review checklist is completed to document the review and to ensure that appropriate issues have been addressed.\n \n 1.4.1.8 Compliance Audit\n \n The Hampton Plant audits covered processes to be certain that the prevention program is effectively addressing the safety issues of operations at the plant.  The plant assembles an audit team that includes personnel knowledgeable in the RMP rule and in the process, and this team evaluates whether the prevention program satisfies the requirements of the RMP rule and whether the prevention program is sufficient to help ensure safe operation of the process. The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n \n 1.4.1.9 Incident Investigation\n \n The Hampton Plant investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented in the future.  The plant trains employees to identify and report any incident requiring investigation.  An investigation team is assembled, and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n \n 1.4.1.10 Employee Participation\n \n The Hampton Plant developed a written employee participation program for all covered processes to help ensure that the safety concerns of the plants workers are addressed.  The plant encourages active participation of personnel in the prevention program activities of all processes at the plant. Employees are consulted on, and informed about, all aspects of the RMP rule prevention program, including PHAs and operating procedures.\n\n 1.4.1.11 Hot Work Permits\n \n The Hampton Plant established a hot work permit program to control spark or flame producing activities that could result in fires or"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 6404,
      "SummaryText": " explosions in covered processes at the plant.  The plant reviewed OSHA's fire prevention and protection requirements in 29 CFR 1910.252(a) and created a Hot Work Permit Form to comply with these requirements.  Personnel who are to perform hot work are required to fill out the Hot Work Permit Form.  The Shift Supervisor reviews the completed form before work can begin.  Training in the use of the Hot Work Permit Form is included in the plants safe work practices orientation.\n \n 1.4.1.12 Contractors\n \n The Hampton Plant established a program to help ensure that contractor activities at the plant are performed in a safe manner.  The program reviews the safety record of all contractors to help ensure that the plant only hires contractors who can safely perform the desired job tasks.  The plant explains to the contract supervisors the hazards of the process on which they and their employees will work, the plants safe work practices, and the plants emergency response procedures.  The plant requires that the contractor supervisors train each of their employees who will work at the plant before that worker begins work at the plant site.  The plant periodically reviews contractors' training documents and work performance to help ensure that safe practices are followed.\n \n 1.4.2 Chemical specific Prevention Steps\n \n In addition to the required prevention program elements, the Hampton Plant has implemented safety features specific to the hazardous substances used at the plant.  The following paragraphs describe some of these features.\n \n Formaldehyde solution-Industry standards are followed at the plant to help ensure safe handling of formaldehyde. The formaldehyde stored in the plants storage vessels is piped directly from the formaldehyde plant.  The storage tank(s) design and construction are consistent with ANSI standards.  Workers who perform operations involving formaldehyde receive training emphasizing safe handling procedures for formaldehyde developed by the plan"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 6404,
      "SummaryText": "t.  The storage tank(s) is surrounded by a concrete dike which is large enough to contain 100% of the volume of the tank should its entire contents be spilled.  All air emissions from the storage tank(s) and truck loading are recycled back into the process.\n \n \n 1.5 Five Year Accident History\n \n The Hampton Plant has completed a five year accident history that indicates no off-site releases of toxic compounds.\n \n                 Year     Number of Reported Accidents     Substance Released     Consequences\n                \n 1994     0     None     No Offsite Impacts\n 1995     0     None     No Offsite Impacts\n 1996     0     None     No Offsite Impacts\n 1997     0     None     No Offsite Impacts\n 1998     0     None     No Offsite Impacts\n \n \n 1.6 Emergency Response Programs\n \n The Hampton Plant has established a written emergency response program to help safely respond to accidental releases of hazardous substances. The emergency response plan includes procedures for the following:\n \n7 informing the local fire department and the public about accidental releases that could reasonably result in offsite consequences\n \n7 providing proper first aid and emergency  medical treatment to treat accidental human exposure to hazardous substances at the plant\n \n7 controlling and containing accidental releases of hazardous substances, including the use of emergency response equipment\n \n7 inspecting and maintaining emergency response equipment\n \n7 reviewing and updating the emergency response plan\n\nThe Hampton Plant employees are  trained in these emergency response procedures.  All plant personnel are trained in evacuation procedures.  The plant periodically conducts emergency response drills, including annual drills coordinated with the local fire department.  The written emergency response plan complies with other federal contingency plan regulations (e.g., the OSHA regulations 29 CFR 1910.38(a), 29 CFR 1910.120(a)) and has communicated to local emergency response officials through the local fire department.  The plant maintains a regular "
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 6404,
      "SummaryText": "dialogue with the local fire chief, and the plant provides appropriate information to the fire chief.\n\nA copy of the plants Emergency Response Plan is attached to this RMP Plan.\n\n1.7 Planned Changes to Improve Safety \n\nThe Hampton Plant constantly strives to improve the safety of the processes at the facility through both the incident investigation program and a program soliciting safety suggestions from the workers.."
    }
  ]
}