{
  "FacilityID": 6408,
  "FacilityName": "Latrobe Brewing Company, LLC",
  "FacilityStr1": "119 Jefferson Street",
  "FacilityStr2": null,
  "FacilityCity": "Latrobe",
  "FacilityState": "PA",
  "FacilityZipCode": "15650",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42129",
  "LEPC": "Westmoreland County LEPC",
  "FacilityLatDecDegs": "40.319806",
  "FacilityLongDecDegs": "-79.391222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 4393211,
  "ParentCompanyName": "Labatt USA",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Latrobe Brewing Company, LLC",
  "OperatorStr1": "119 Jefferson Street",
  "OperatorStr2": null,
  "OperatorCity": "Latrobe",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "15650",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bill Allison",
  "RMPTitle": "Refrigeration Engineer",
  "FTE": 230,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000079951",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-01-20 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-09-01 00:00:00",
  "DeRegistrationEffectiveDate": "2006-08-07 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.31946,
  "FRS_Long": -79.39092,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7688,
      "AltID": "Refrigeration",
      "FacilityID": 6408,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7859,
          "ProcessID": 7688,
          "NAICSCode": "31212",
          "_desc": {
            "NAICS_CODE": "31212",
            "NAICS_DESCRIPTION": "Breweries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8460,
          "ProcessID": 7688,
          "ChemicalID": 56,
          "Quantity": 52401.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508460,
          "ProcessID": 7688,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6408,
      "SummaryText": "A Risk Management  (RMP) has been developed and  prepared for use and storage of anhydrous ammonia in the Latrobe Brewing Company, Latrobe, PA refrigeration system.  The Risk Management Program and RMP meet and address the requirements of Title 40 Code of Federal Regulations Part 68.\n\nThis Executive Summary briefly describes the following elements:\n\nThe accidental release prevention and emergency response policies at the stationary source;\nThe stationary source and regulated substances handled; \nThe worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario; \nThe general accidental release prevention program and chemical-specific prevention steps; \nThe five-year accident history; \nThe emergency response program; and\nPlanned changes to improve safety.\n\nTo address concerns of an accidental release prevention and emergency response all plant and field personnel are trained in ammonia emergency response procedures and use of appropriate protective equipment.  Refresher training and emergency response drills are conducted on a periodic basis to ensure personnel are equipped, trained, prepared, and practiced in responding to ammonia emergencies.  \n\nAs a result of information gathered during preparation of this Risk Management Program, Latrobe Brewing Company (LBC) is committing additional resources to further increase employee awareness and equipment reliability and to establish operator training and preventive maintenance programs.  As a demonstration of the LBC's high degree of commitment to public safety and service, LBC is taking action to decrease the risk of ammonia exposure to the public by implementing recommendations made during the Process Hazards Analysis and Off-site Consequence Analysis.\n\nAnhydrous ammonia is used as a refrigerant in the LBC Latrobe facility refrigeration system.  The liquid is circulated as needed to the air units, shell a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6408,
      "SummaryText": "nd tube chillers or the CO2 Liquefing systems where heat is absorbed and removed from the medium.  The anhydrous ammonia refrigeration system is a closed loop industrial refrigeration system.  The ammonia is not used or mixed in any manner with other chemical processes.\n\nA \"Worst-Case Scenario Offsite Consequence Analysis\" and an \"Alternative Scenario Offsite Consequence Analysis\" were performed identifying the public and environmental receptors within the toxic endpoint concentration radius of 200 ppm.  The results are mitigated by the fact that all the vessels and majority of the piping are inside the Latrobe facility's building. \n\nEmergency response is discussed in Section 5 of the RMP.  Latrobe Brewing Company has a detailed Emergency Response Plan (ERP) for their facility (Located in the Program Element Binder Section 12).  The purpose of this plan is to provide the means for rapidly determining the appropriate response for any emergency that may develop at the facility such as an accidental release of anhydrous ammonia.  LBC conducts scheduled drills of the emergency response plan.\n\nTo address the five year accident history is not an issue, since the facility for the past 5 years has no history of ammonia releases.  To prevent and/or minimize any potential future release of anhydrous ammonia, Latrobe Brewing Company is implementing a detailed Process Safety Management program (Preventative Program 3) originally developed September 1995 for their facility in Latrobe, PA.  The Preventative Program 3 provides an extensive maintenance and operator/mechanic training to ensure the  system's mechanical integrity is maintained for the life of the covered process.  Program 3 also incorporates administrative controls when modifications are made to the covered process (ammonia refrigeration system), so the training and preventative programs are updated as the system expands and changes.\n\nLatrobe Brewing Company will incorporate or address any recommendations resulting fr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6408,
      "SummaryText": "om the Process Hazard Analysis, Offsite Consequences, incident investigations and program audits.  The flexibility of the program allows LBC to respond effectively to prevent or minimize any potential of exposing LBC employees, the surrounding public, and/or the environment to a release of anhydrous ammonia."
    }
  ]
}