{
  "FacilityID": 6423,
  "FacilityName": "Springfield Regional Wastewater Treatment Facility",
  "FacilityStr1": "2 Bondi Island Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Agawam",
  "FacilityState": "MA",
  "FacilityZipCode": "01001",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25013",
  "LEPC": "Statewide LEPC-SERC",
  "FacilityLatDecDegs": "42.087222",
  "FacilityLongDecDegs": "-72.588056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "AB",
  "FacilityURL": "www.waterandsewer.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Springfield Water & Sewer Commission",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Springfield Water&Sewer Commission",
  "OperatorStr1": "P O Box 995",
  "OperatorStr2": null,
  "OperatorCity": "Springfield",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01101",
  "OperatorZipCodeExt": "0995",
  "FTE": 95,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000082251",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-09-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.08556,
  "FRS_Long": -72.58722,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7707,
      "AltID": "Sewage Treatment",
      "FacilityID": 6423,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 8481,
          "ProcessID": 7707,
          "ChemicalID": 62,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7878,
          "ProcessID": 7707,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 4004,
              "Process_NAICS_ID": 7878,
              "SafetyReviewDate": "1999-04-01 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Chlorine Institute Standards",
              "FR_Comments": null,
              "HazardReviewDate": "1999-04-01 00:00:00",
              "ChangeCompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "moved ventilation switches to exterior of bldg.",
              "OpProceduresReviewDate": "1999-06-01 00:00:00",
              "TrainingReviewDate": "1999-03-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-26 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "Piping, valves, alarm systems, evaporators, PP, air monitoring systems",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-04-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Sewage treatment plant",
              "_chemicals": [
                {
                  "PrimaryKey": 4145,
                  "PreventionProgram2ID": 4004,
                  "ProcessChemicalID": 8481
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6423,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-01 00:00:00",
    "ERTrainingDate": "1998-09-29 00:00:00",
    "CoordinatingAgencyName": "Agawam Fire Department & District 4",
    "CoordinatingAgencyPhone": "4137862662",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6423,
      "SummaryText": "A.  The Springfield Water & Sewer Commission has prepared this accidental release prevention program in response to the Risk Managment Plan Rule as promulgated by the Environmental Protection Agency (EPA).  The Commission has followed the procedures set forth in the rule and has utilitized guidance materials provided by EPA.  In addition an emergency response plan relating to an accidental chlorine release at the Wastewater Treatment Plant on Bondi's Island outlines emergency response procedures at the plant and coordination with local emergency response services.\n\nB.  The stationary source this Risk Management Plan (RMP) applies to is the chlorination facility located at the Springfield Regional Wastewater Treatment Plant on Bondi's Island in Agawam, Massachusetts.  This plant serves eight municipalities with a population of 240,000.  The RMP regulated substance handled at this facility is chlorine, which is used for disinfection of  the plant effluent.  The chlorine building for the facility is comprised of four separate rooms:  (1) a chlorine storage room containing one ton cylinders, scales, electric hoist, chlorine gas sensor alarms and a ventilation system;  (2) a chlorinator room housing two floor mounted evaporators, four chlorine gas sensor alarms, four chlorinators and feed water pipes;  (3) a chlorine control room, and; (4) air handling room that houses the compressors for the vacuum system.  The structure is designed to be fire proof and there are no combustible materials in the various chlorine handling or storage areas.  During normal operations one cylinder is connected to the system.  All rooms are equipped with alarmed chlorine gas sensors connected to the plant alarm system in the main building as well as a main alarm at the chlorine building.  The facility is staffed twenty-four (24) hours/day by certified operators.\n\nC.  The offsite consequences analysis consists of two separate chlorine release scenarios, a \"worst case\" release and an \"alternate"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6423,
      "SummaryText": " scenario\" release.  The worst case is defined by EPA as that in which the maximum quantity in the largest vessel is released as a gas in ten (10) minutes due to an unspecified failure.  The alternate scenario release is defined by EPA as more likely to occur than the worst case.  Calulations for both cases were taken from EPA's Risk Managment Plan (RMP) Guidance for Wastewater Treatment Plants reference tables or equations.  In the worst case it is assumed that a single one ton cylinder of liquid chlorine catastrophically fails, releasing the entire 2,000 pounds of chlorine within a ten (10) minute period.  Given a wind speed of 1.5 meters per second (approximately 3 miles per hour), the distance to endpoint is 1.3 miles.  The estimated residential population affected by such a release would be approximately 34,041.  The radius also includes schools, hospitals, correction facilities, recreation areas, and major office-commercial  uses, and a national park and wildlife preserve are also within the radius.\n\nThe situation used for the alternate case release is a pipe leak (i.e. a hole or rupture of the 3/8\" transfer line connected to the one ton cylinder).  In the alternate case, the content of the cylinder would be released over a period of 23.8 minutes.  Using a wind speed of 3 meters per second (approximately 6 miles per hour) the distance to the end point becomes 0.2 miles and affects no residential population.  It however does include a public recreation area.  \n\nPassive mitigation relies on the building itself as an enclosure to trap most if not all escaping chlorine gas inside so that it does not reach the outside environment and move toward receptors.  One active mitigation is the use of a water curtain which can be set up by the responding fire departments to further reduce the amount of chlorine reaching receptors.  The chlorine building has fire hydrants strategically located around it.  Both methods, entrapment and a water curtain, are suitable containment"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6423,
      "SummaryText": " measures for both worst and alternate case scenarios.\n\nD.  The general accident release prevention program is comprised of several interrelated elements.  The operators have received a high level of training through on the job instruction, attendance of appropriate seminars,  and a certified on-site refresher course presented by the plant's chlorine vendor each spring.  The chlorine feed system was last updated in 1991 with the latest controls designed to simplfy dosage control and minimize accidental releases.  The Instrument Technician follows a preventative maintenance program to avert sudden equipment breakdowns.  Written operating procedures are available to operators.  The most recent hazard review of equipment and safety procedures was performed during March of 1999.  Chemical specific prevention steps include the use of self-contained breathing apparatus (SCBA) by plant emergency response personnel, which are stored upwind from the prevailing wind direction in the main building, and the use of B-Kit (cylinder leak plugging kit).   Each spring plant personnel are instructed in the use of SCBAs and related emergency procedures.   Personnel training includes the awareness of the hazardous properties of chlorine, the use and functioning of chlorine detectors and the alarm systems used at the site.  In addition, plant personnel participate in exercises with the local fire departments and hazardous material teams to both familiarize the local emergency responders with the plant and plant personnel with the capabilities of local responders.\n\nE.  There have been no accidental releases of chlorine at this facility in the previous five years.\n\nF.  The wastewater treatment plant has an emergency response plan for emergency situations at the plant.  The plan includes emergency contact names and telephone numbers for plant and community response personnel.  The Agawam Fire Department conducts annual on-site inspections to review and update emergency response procedures "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6423,
      "SummaryText": "specific to an accidental chlorine release.  Plant personnel receive training in the use of the emergency plan upon hiring and annual refreshers.  Instruction is also provided when new equipment or procedures are instituted.\n\nG.  After the review in March of 1999 the following change was recommended. Each of the three ventilation systems in the chlorine building currently has on/off switches installed on the interior of the chlorine buliding.  On/off switches are expected to be installed on the exterior of the chlorine building to control the three ventilation systems.  This change will allow the operator to control a potential release from the exterior of the building."
    }
  ]
}