{
  "FacilityID": 6474,
  "FacilityName": "Knoxville Utilities Board - Kuwahee WWTP",
  "FacilityStr1": "2015 Neyland Drive",
  "FacilityStr2": null,
  "FacilityCity": "Knoxville",
  "FacilityState": "TN",
  "FacilityZipCode": "37916",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47093",
  "LEPC": "Knoxville/Knox County LEPC",
  "FacilityLatDecDegs": "35.949028",
  "FacilityLongDecDegs": "-83.927667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": "http://www.kub.org",
  "FacilityEmailAddress": "wloveday@kub.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 626000324,
  "Company2DUNS": 0,
  "OperatorName": "Knoxville Utilities Board",
  "OperatorStr1": "P.O. Box 59017",
  "OperatorStr2": null,
  "OperatorCity": "Knoxville",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37950",
  "OperatorZipCodeExt": "9017",
  "RMPContact": "Wayne Loveday",
  "RMPTitle": "Manager Plant Operations",
  "FTE": 39,
  "OtherEPAFacilityID": "TND99065200",
  "EPAFacilityID": "100000081859",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.945,
  "FRS_Long": -83.92917,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7763,
      "AltID": null,
      "FacilityID": 6474,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7935,
          "ProcessID": 7763,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8540,
          "ProcessID": 7763,
          "ChemicalID": 62,
          "Quantity": 42000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508540,
          "ProcessID": 7763,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6474,
      "SummaryText": "Accidental Release Prevention & Emergency Response Policies\nIn accordance with the provisions of Title 40 Code of Federal Regulations, Part 68 of the Clean Air Act Amendments, the Knoxville Utilities Board's (KUB's) Risk Management Plan (RMP) is an integrated approach to identify and manage the hazards posed by an accidental chlorine release. This plan consists of three major components: a Hazard Assessment, a Prevention Program, and an Emergency Response Plan. \n\nFacility Information & Regulated Substances\nKuwahee Wastewater Treatment Plant\nThe Kuwahee Wastewater Treatment Plant is an advanced wastewater treatment facility that includes primary sedimentation, a combined secondary and nitrification system, anaerobic sludge digestion, and high pressure filter press dewatering. The average daily dry weather design flow of the facility is 40 million gallons (MGD) per day. The maximum chlorine storage capacity at this facility is 42,000 pounds.\n\nOff Site Consequence Analysis\nEach hazard assessment consisted of worst-case and alternative scenarios in order to evaluate the potential impacts of accidental releases of chlorine on the public health and environment. \n\n     Worst Case Release Scenario \n    Kuwahee uses chlorine in one (1) ton cylinders, therefore the worst case scenario was based on the assumption that approximately 2,000 pounds of chlorine would be released. All calculations for air dispersion modeling were performed with RMP Comp Version 1.06 and results were mapped by using the Cameo Suite (Cameo, Marplot, and Aloha).  The worst case scenario was evaluated at a release duration of 10 minutes and at a release rate of 110 pounds/minute.  Air dispersion modeling resulted in a distance to endpoint of 0.9 miles.\n\n     Alternative Release Scenario \n    KUB's process hazard analysis (PHA) indicated a chlorine release would most likely occur due to a failure in the chlorination system piping; therefore, modeling for the alternative scenario was based on this assumption. All cal"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6474,
      "SummaryText": "culations for the air dispersion modeling were performed with RMP Comp Version 1.06 and results were mapped by using the Cameo Suite (Cameo, Marplot, and Aloha).  The alternative scenario was evaluated at a release duration of 10 minutes and at a release rate of 2,110 pounds/minute. Modeling resulted in a distance to endpoint of 0.5 miles.\n\nFive Year Accident History\nIn addition to the off-site consequence analysis, a five (5) year accident history was compiled.  In the past five years, there have been no accidents related to chlorine releases at Kuwahee. \n\nPrevention Program\nKUB's accidental release prevention program is based on OSHA's Process Safety Management Standard, 29 CFR 1910.119 and addresses the following 10 elements tailored to our facility's operations. In accordance with the Process Safety Management provisions incorporated into the Risk Management Program, KUB promotes prevention programs in each of the major areas listed below: \n\n     Management System\n     Process Hazard Analysis\n     Process Safety Information\n     Standard Operating Procedures (SOPs)\n     Employee Training\n     Mechanical Integrity\n     Pre-startup Safety Review\n     Management of Change\n     Compliance Audits\n     Incident Investigation\n\nEmergency Response Program\nKUB's Emergency Response Program is based on the Chlorine Institute's \"Pamphlet 64 - Emergency Response Plans for Chlorine Facilities\" and is designed to address the specific emergency needs associated with a chlorine leak. Even though Kuwahee has mitigation systems to minimize the likelihood of a release, KUB has a comprehensive emergency response plan that is complete, up-to-date, and supplemented with emergency response training and drills for employees. KUB's Plan has been submitted to and reviewed by the City of Knoxville Local Emergency Response Committee (LEPC). In the event of an off-site release, the Plan prepares KUB and the Community for a response to and mitigation of accidental chlorine releases in order to limit the severity of such re"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6474,
      "SummaryText": "leases and their impact on both public health and environment.\n\nPlanned Changes to Improve Safety\nKUB has recently purchased a work management system called the Mincom Information Management System (MIMS).  Use of this system will help ensure that all chlorine feed systems, including emergency monitoring systems, are properly maintained.  Preventive maintenance work orders will be generated automatically and routed to the designated crew.  In addition, MIMS will easily track and record the use of all KUB equipment (trucks, lab equipment, chlorine cylinder repair kits, emergency response equipment) and schedule service appointments periodically to ensure that employees are using the most reliable equipment for each task."
    }
  ]
}