{
  "FacilityID": 6550,
  "FacilityName": "Village of Northbrook, IL - Water Filtration Plant",
  "FacilityStr1": "750 Dundee Road",
  "FacilityStr2": null,
  "FacilityCity": "Northbrook",
  "FacilityState": "IL",
  "FacilityZipCode": "60062",
  "Facility4DigitZipExt": "2704",
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "42.141111",
  "FacilityLongDecDegs": "-87.798889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.northbrook.il.us",
  "FacilityEmailAddress": "tpapreck@northbrook.il.us",
  "FacilityDUNS": 969544717,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Village of Northbrook, IL",
  "OperatorStr1": "1225 Cedar Lane",
  "OperatorStr2": null,
  "OperatorCity": "Northbrook",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60062",
  "OperatorZipCodeExt": "4582",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000083526",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-02-09 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Chlorine",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.140278,
  "FRS_Long": -87.799167,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7861,
      "AltID": "Chlorination",
      "FacilityID": 6550,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 8651,
          "ProcessID": 7861,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8043,
          "ProcessID": 7861,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3386,
              "Process_NAICS_ID": 8043,
              "SafetyReviewDate": "1999-04-01 00:00:00",
              "PHA_Date": "1999-04-20 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-01 00:00:00",
              "TrainingReviewDate": "1999-06-01 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-01 00:00:00",
              "EquipmentInspectionDate": "1999-02-04 00:00:00",
              "EquipmentTested": "All chlorination process equipment.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-06-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3866,
                  "PreventionProgram3ID": 3386,
                  "ProcessChemicalID": 8651
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6550,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Northbrook Fire Department",
    "CoordinatingAgencyPhone": "8472722141",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6550,
      "SummaryText": "1.  Accidental Release Prevention and Emergency Response Policies '                                                                                                                                                                            We at the Village of Northbrook, Illinois, Water Filtration Plant (the Facility) are strongly committed to employee, public and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at the Facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  However, if such an accidental release does occur, we will coordinate with emergency responders to provide trained emergency response personnel to control and mitigate the effects of the release.\n\n2.  The Stationary Source and the Regulated Substances Handled\n                                                                                                                                                                            Northbrook 's primary activities encompass production of potable water.  Disinfection of water via chemical means is of utmost importance in the water production process.  To assist in the disinfection process, the following regulated substance(s) are present at the Facility.\n\n          Substance:  Chlorine\n          Maximum Inventory:  14,000 pounds (seven one-ton containers)\n          Exceeds 40 CFR Part 68 Threshold:  Yes\n\n3.  The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6550,
      "SummaryText": "ractor, an evaluation of safety performance of the contractor is carried out.  The Facility has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n5.  Five-year Accident History\n                                                                                                                                                                            The Facility has had an excellent record of preventing accidental releases over the last five years.  Due to stringent release prevention policies, no accidental releases have occurred during this period.\n\n6.  Emergency Response Plan\n                                                                                                                                                                            The Facility carries a written emergency action plan to deal with accidental releases of hazardous materials.  The plan includes aspects of emergency response including adequate first aid and medical treatment, evacuations, and notification of local emergency response agencies and the public.  \n\nThe chlorine process is included in the community emergency response plan.  The Northbrook Fire Department is the first responder to any chlorine emergencies.  All Northbrook firefighters/parametics are qualified as first responders.  In addition, Northbrook is one of seventeen communities included in a mutual aid agreement known as MABAS Division III.  MABAS Division III has a state-certified hazardous material rsponse team.  To ensure proper functioning, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nIn addition, both the chlorine storage room and the chlorinator room are monitored by Chloralert alarm devices.  In the event of"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6550,
      "SummaryText": "a leak, the Chloralert system sets off both an audible and visual alarm within the filtration plant.  The alarm system is connected to the Regional Emergency Dispatch Center via a telephone line."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6550,
      "SummaryText": "To perform the required offsite consequence analysis for the Facility, material provided by the U.S. Environmental Protection Agency (EPA) in their Risk Management Program (RMP) Guidance for Waste Water Treatment Plants was used.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for chlorine involves a catastrophic release from a one-ton cylinder, which would result in the release of 2000 pounds of chlorine in a gaseous form over 10 minutes.  Under worst case weather conditions, namely Class F atmospheric stability and 1.5 m/s windspeed, the maximum distance of 1.3 miles is obtained corresponding to a toxic endpoint of 0.0087 mg/L.\n\nOne alternative release scenario has been submitted for chlorine as well.  This alternative involves a release from piping used in the disinfection process.  The scenario involves the release of 1,300 pounds of chlorine in a gaseous form over 15 minutes.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.0087 mg/L is 0.2 miles.\n\n4.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n                                                                                                                                                                            Northbrook has taken all the necessary steps to comply with the accidental release prevention requirements set out under both 40 CFR part 68 of the EPA and the OSHA Process Safety Management (PSM) standard under 29 CFR 1910.119.  The following sections briefly describe the elements of Northbrook's prevention program that are in place at the Facility.\n\nProcess Safety Information\nThe Facility maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment desig"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6550,
      "SummaryText": "ns associated with all processes.\n\nProcess Hazard Analysis\nThe Facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is a combination of what-if questions and a detailed checklist.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of every five years, or more frequently if necessary.  Any findings related to each analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities related to the covered process, the Facility maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved with the process.\n\nTraining\nThe Facility has a comprehensive training program in place to ensure that employees operating the process are competent in the operating procedures associated with the process.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided annually and more frequently as needed.\n\nMechanical Integrity\nThe Facility carries out highly documented maintenance checks on process equipment to ensure proper functions.  Process equipment examined by these checks includes among others; storage tanks, piping systems, relief and vent systems, alarms, controls and pumps.  Maintenance operations are carried out by qualified personnel with training in maintenance practices.  These personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are correc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6550,
      "SummaryText": "ted in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at the Facility to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a standard practice at the Facility.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nThe Facility conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every three years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nThe Facility promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of five years.\n\nEmployee Participation\nAll staff believe that process safety management and accident prevention is a team effort.  Employees are strongly encouraged to express their views concerning safety and accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the Facility's implementation to both the PSM standard and RMP rule.\n\nContractors\nOn occasion, the Facility hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a cont"
    }
  ]
}