{
  "FacilityID": 6552,
  "FacilityName": "PSNH Merrimack Generating Station",
  "FacilityStr1": "97 River Road",
  "FacilityStr2": null,
  "FacilityCity": "Bow",
  "FacilityState": "NH",
  "FacilityZipCode": "03304",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "33013",
  "LEPC": "Bow LEPC",
  "FacilityLatDecDegs": "43.140556",
  "FacilityLongDecDegs": "-71.468056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.nu.com",
  "FacilityEmailAddress": "NUCommunications@nu.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Public Service NH, Division of Northeast Utilities",
  "Company2Name": null,
  "CompanyDUNS": 6953418,
  "Company2DUNS": null,
  "OperatorName": "Public Service of New Hampshire",
  "OperatorStr1": "P.O. Box 330",
  "OperatorStr2": null,
  "OperatorCity": "Manchester",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03105",
  "OperatorZipCodeExt": null,
  "FTE": 97,
  "OtherEPAFacilityID": "NHD981068778",
  "EPAFacilityID": "100000079309",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 43.140833,
  "FRS_Long": -71.467778,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7863,
      "AltID": "MK2 SCR DeNOx",
      "FacilityID": 6552,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 8653,
          "ProcessID": 7863,
          "ChemicalID": 56,
          "Quantity": 480000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8045,
          "ProcessID": 7863,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3388,
              "Process_NAICS_ID": 8045,
              "SafetyReviewDate": "1999-03-16 00:00:00",
              "PHA_Date": "1999-06-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "water hydrants and fog nozzles are available",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "operator rounds each shift",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-01 00:00:00",
              "TrainingReviewDate": "1999-03-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-11-13 00:00:00",
              "EquipmentInspectionDate": "1999-06-12 00:00:00",
              "EquipmentTested": "MK1SCR ammonia vaporizer skid",
              "ChangeMgmtDate": "1996-08-27 00:00:00",
              "ChangeMgmtReviewDate": "1998-11-13 00:00:00",
              "PreStartupReviewDate": "1999-06-13 00:00:00",
              "ComplianceAuditDate": "1998-11-13 00:00:00",
              "AuditCompletionDate": "1999-01-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-11-13 00:00:00",
              "HotWorkPermitReviewDate": "1998-11-13 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3868,
                  "PreventionProgram3ID": 3388,
                  "ProcessChemicalID": 8653
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 7864,
      "AltID": "MK1 SCR DeNOx",
      "FacilityID": 6552,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 8654,
          "ProcessID": 7864,
          "ChemicalID": 56,
          "Quantity": 280000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8046,
          "ProcessID": 7864,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6552,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-11-13 00:00:00",
    "ERTrainingDate": "1998-12-10 00:00:00",
    "CoordinatingAgencyName": "Bow Fire Department",
    "CoordinatingAgencyPhone": "6032284320",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6552,
      "SummaryText": "Merrimack Station is a fossil fueled electric power generating facility owned and operated by Public Service Company of New Hampshire, a wholly owned subsidiary of Northeast Utilities.\n\nThe application of Selective Catalytic NOx Reduction Technology (the process) reduces nitrogen oxide air emissions from the station in excess of 80%.  The process uses anhydrous ammonia, a regulated substance, as the reagent.  This Risk Management Plan covers the storage, handling and use of anhydrous ammonia at Merrimack Station.\n\nA. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe toxic nature of anhydrous ammonia makes it necessary to observe certain safety precautions to prevent human exposure.  Safety depends upon the manner in which we handle anhydrous ammonia combined with the safety devices inherent in the design of the process, the safe handling procedures that we use and the training of our personnel.\n\nIt is Merrimack Station's policy to fully comply with both the OSHA Process Safety Management and the EPA Risk Management Regulations by implementing their framework into the routine operation of our facility.\n\nNORTHEAST UTILITIES ENVIRONMENTAL POLICY\n\nIn conducting our business and operating our facilities, Northeast Utilities is committed to protecting the environment.  NU is committed to:\n\n1. Maintaining compliance with both the letter and spirit of the law for protection of the environment;\n2. Demonstrating leadership by pursuing creative, innovative initiatives, and new technologies that protect the environment and are consistent with our corporate mission;\n3. Being accountable, open and responsive to our employees, customers, shareholders and the public; and\n4. Practicing stewardship by managing our operations with genuine care and being aware of the impact our activities have on the environment.\n\nEvery Northeast Utilities employee is responsible for understanding the environmental impacts pertaining to his or her job.  Line management is responsible f"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6552,
      "SummaryText": "or implementing the policy.  The Executive Environmental, Health and Safety Committee is responsible for overseeing the implementation of this policy.\n\nMichael G. Morris\nChairman, President and Chief Executive Officer\n\n1999 MERRIMACK STATION ENVIRONMENTAL ACTION PLAN\n\nMerrimack Station management is committed to environmental compliance and the continued development of a workforce which maintains a heightened level of environmental awareness as they conduct their day-to-day business.  To support this effort, the following action plan will be administered during the year 1999 :\n \n1. The station's Environmental Management Plan and/or Emergency Response Plan will be reviewed at the Safety Meetings.\n2. Employees will complete required environmental training by December 31, 1999. \n3. Quarterly site observations will be conducted to ensure proper labeling of hazardous chemicals consistent with the OSHA HAZCOM program.  Feedback will be shared during  Safety Meetings consistent with a June 30, September 30, and December 30, 1999 audit schedule.\n4. The OSHA Process Safety Management Program Audit will be satisfactorily completed by July 1, 1999.\n5. SPCC rounds will be conducted on a weekly basis.  Results will be documented and retained.     \n6. Reportable NPDES discharges will be reduced 10% from 1998 levels given a 1998 count of 6 and a 1999 goal of 5.  \n7. The EPA QA/QC program results received before May 1, 1999 will score better than 95%.\n8. A plan, which further encourages a \"reduce, reuse, recycle\" philosophy specific to copier paper,  waste cardboard, waste cans and bottles, waste drinking cups, scrap metal waste, treated wood, oils and greases etc. will be developed by October 30, 1999.  \n9. Aboveground petroleum storage tanks (AST) will be brought into compliance with new April 25, 2000 requirements.  The effort will include the inspection of and sampling valve replacements on the combustion turbine fuel tanks.  \n10. The Unit 1 SCR will be successfully constructed"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6552,
      "SummaryText": "and be available for operation during the 1999 ozone season (June 1 through September 30, 1999), and contract obligations including any known performance deficiencies will be initiated with the Vendor by December 1, 1999.\n\nB. THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nThe primary purpose of this facility is to generate electric power for sale via transmission and distribution lines to customers.  There are four separate units with a net claimed capacity of 478.1 megawatts.  Units 1 & 2 use coal fired cyclone boilers to produce steam that powers turbine driven generators capable of 113.5 and 320 megawatts respectively. The units use wet bottom boilers with cyclone furnace firing arrangement and 100% ash re-injection. Undesirable oxides of nitrogen (NOx) form during the combustion process.\n\nSelective Catalytic Reduction Technology was installed to remove most of the NOx.  In the process, liquid ammonia is drawn from the storage tanks and converted to vapor which is injected into the flue gas upstream of the reactor.  There, the ammonia vapor combines with the NOx in the presence of a catalyst to form elemental nitrogen and water vapor.\n\nThe ammonia storage system consists of five storage tanks that are inter-connected through the off loading station.  Ammonia is stored as a liquid under pressure at atmospheric temperature.  The storage facility includes 3 tanks each @ 35,000 gallons for Unit 2 and 2 tanks each @ 30,000 gallons for Unit 1.  This provides capacity for approximately 10 days operation at full load.  A 13,000 gallon tank is used to retain 50% ammonia and water solution that is drawn off from the main storage tanks.  All of the ammonia is consumed in the process.\n\nThe maximum amount of anhydrous ammonia storage at this site is 410 tons with additional capacity for 640 tons in up to 8 rail cars awaiting offloading.  The average on site storage is 660 tons including 3 rail cars.\n\nAnhydrous ammonia delivery to the site is primarily by rail car an"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6552,
      "SummaryText": "d secondarily by tank truck.  A compressor is used to off load rail cars.  The ammonia unloading, storage areas and equipment buildings are equipped with permanently mounted leak detection equipment that alarms locally and to the main control room.  Water sources (hydrants) for fog nozzle leak suppression are in place.\n\nAccess to the site is restricted to authorized facility employees, authorized management personnel and authorized contractors.\n\nC. WORST-CASE RELEASE SCENARIO AND THE ALTERNATIVE RELEASE SCENARIO, INCLUDING ADMINISTRATIVE CONTROLS AND MITIGATION MEASURES TO LIMIT THE DISTANCES FOR EACH REPORTED SCENARIO\n\n* All modeling was done using the ALOHA software distributed by the National Safety Council,  NOAA and EPA.  Population estimates were developed using Landview software provided by the EPA, NOAA, USGS and Bureau of Census.\n* Worst-Case Scenario - This scenario is defined by the regulation 40 CFR 68.25 as the failure of the largest storage tank when filled to the greatest amount allowed.  It is unrealistic that such a failure would occur.  The largest vessel contains 160,000 pounds of anhydrous ammonia.  It is assumed that the entire tank contents are released in 10 minutes.  Administrative controls include a limit on the maximum filling capacity of anhydrous ammonia storage tanks to 90.6% volume at 60 F based on standards set by ANSI K61.1 and CGA G-2.1.\n* A circle drawn around the point of release out to the toxic endpoint of 200 ppm for the worst-case scenario would be 3.6 miles across.  Census data estimates that 9,500 people live within that area.\n* Alternative Scenario - A leak in the liquid pipe nipple connection at the bottom of the tank releases liquid ammonia from an opening estimated at 1/2 inches by 1/8 inches.  The release over one hour is 1,936 pounds at 32 lb/minute.\n* The distance to the endpoint for the alternative scenario is 260 yards or 0.15 miles.  This area is mostly over company property and the Merrimack River.  The estimated p"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6552,
      "SummaryText": "opulation within that radius to the endpoint is 21 people only due to the method that Landview uses to estimate population density.\n\nD. THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC PREVENTION STEPS. \n\nThe ammonia storage and handling facility complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  The ammonia systems were designed \n\nand constructed in accordance with ANSI K61.1 Safety Requirements for the Storage and Handling of Anhydrous Ammonia and the ASME Pressure Vessel Code to ensure design integrity.\n\nOur accident prevention program is based on the OSHA Process Safety Management Plan which is a 13 point program for preventing or minimizing the consequences of catastrophic releases.  The Plan includes: routine maintenance and inspections, written operating procedures, training of employees in the hazards and handling of anhydrous ammonia and the operation and maintenance of subsystems, and facility audits.  Annual refresher training is provided to all employees.\n\nThe equipment is visually inspected daily and trouble reports are submitted when action is required.  Preventative maintenance pedigrees have been created on all safety related and critical components to initiate maintenance activities based on the manufacturers recommendations' or experience.  Pressure vessels are inspected according to the ASME and NACE guidelines.\n\nAny changes to the covered processes follow a management of change procedure that requires conducting a process hazard analysis on the proposed change and implementing the study group recommendations prior to operating the system.\n \nE. FIVE-YEAR ACCIDENT HISTORY\n\nMerrimack Station went into commercial operation in 1960.  The first use of anhydrous ammonia on site was in 1991.  There have been no reportable releases of ammonia or related impacts from the use of anhydrous ammonia to the health and safety of employees or the surrounding community.\n\nF.  THE EMERGENCY"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6552,
      "SummaryText": "RESPONSE PROGRAM\n\nThe station has a written Emergency Response Plan that covers potential emergencies including those requiring the evacuation of employees and those relating to a release of ammonia.  The details of the plan have been reviewed with the Bow Fire Department including a joint training exercise with the Capitol Area Mutual Aid on May 21, 1995.  A representative of the Bow Fire Department visited this plant on December 9, 1998 to review the most recent changes to the ammonia systems.\n\nSpecific response scenarios have been developed based on the consequence assessment required by 40 CFR 68.165.  The plan includes :\n* Procedures for informing the Bow Fire Department, the National Response Center and the NH DES about releases and coordination with responding agencies\n* Emergency escape procedures and routes\n* Procedure for employees who remain to operate critical operations before they evacuate\n* Procedure for employees who remain to respond to a hazardous materials incident.\n* Employee accountability procedures after evacuations\n* Medical and rescue duties\n* Alarm system\n* Organization, responsibilities and training of responsible persons\n* Fire response guidelines\n* Ammonia response guidelines\n* Emergency valve closures and equipment shutdown; operator training in foreseeable\n emergencies\n* Containment of releases\n* Fixed fire protection equipment and its operation\n* Protective gear; training in its use\n* Provisions for communication\n* Shelter in place and/or offsite evacuation\n* Drills and critiques\n* Spill cleanup\n\nG. PLANNED CHANGES TO IMPROVE SAFETY\n1999 MERRIMACK STATION SAFETY MANAGEMENT PLAN\n\nMerrimack Station management is committed to the continued development of a strong, proactive safety culture among all employees.  To support this effort, the following action plan will be administered during the year 1999:\n\n1. Safety meetings will be conducted regularly to review pertinent safety issues.  Tailboards will be conducted daily to address immediat"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 6552,
      "SummaryText": "e safety issues.  Meeting minutes will be issued subsequent to each safety meeting.  \n2. Employees will complete required safety training.    \n3. Quality Incident Investigations will be completed within 15 working days of a reported incident.  Station Management will continue to emphasize the effective management of injuries by utilizing the Injury Management Program.   \n4. The reporting of all Near Misses will continue to be encouraged.  All reported Near Misses Investigations will also be completed within 15 working days.   \n5. Contractor safety review meetings will be conducted prior to major construction or maintenance outage efforts which includes for the year 1999 the Unit 1 Maintenance Outage, the Unit 2 Maintenance Outage, the Unit 1 SCR Construction Project, and the Unit 2 Precipitator Construction Project.       \n6. Monthly safety inspections will be conducted by the Operating Department.  Results will be forwarded to the Safety Meeting for review and included in the meeting minutes.  The inspection list will be examined periodically to ensure that pertinent items are included.\n7. An emergency/fire drill will be satisfactorily completed by December 31, 1999. \n8. The station's eyeglass and goggle selection policy will be reviewed and updated to ensure the very best options are available to employees by September 1, 1999.  \n9. Safety observations will be conducted with appropriate manager/supervisor (monthly) accompanying employees (2 each per year) to review job sites, activities, walk-downs, etc.  \n10. Each employee will complete at least one distinct safety participation effort, consistent with his or her interests and strengths by December 31, 1999.\nRMP Reporting Center\nD14524/Attachment/Page 6\nJune 16, 1999"
    }
  ]
}