{
  "FacilityID": 6559,
  "FacilityName": "United Grocers, Inc.",
  "FacilityStr1": "800 Pescadero Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Tracy",
  "FacilityState": "CA",
  "FacilityZipCode": "95376",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06077",
  "LEPC": null,
  "FacilityLatDecDegs": "37.760639",
  "FacilityLongDecDegs": "-121.412778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "P2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 57005092,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Clarence (J.R.)  Earls",
  "OperatorStr1": "800 Pescadero Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Tracy",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95376",
  "OperatorZipCodeExt": null,
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000080244",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-11-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.76153,
  "FRS_Long": -121.41134,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7874,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 6559,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 8667,
          "ProcessID": 7874,
          "ChemicalID": 56,
          "Quantity": 18000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8059,
          "ProcessID": 7874,
          "NAICSCode": "42242",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3394,
              "Process_NAICS_ID": 8059,
              "SafetyReviewDate": "1993-12-01 00:00:00",
              "PHA_Date": "1993-12-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1993-12-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1993-12-01 00:00:00",
              "TrainingReviewDate": "1993-12-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1993-12-01 00:00:00",
              "EquipmentInspectionDate": "1999-04-29 00:00:00",
              "EquipmentTested": "Southeastern Safety Valves",
              "ChangeMgmtDate": "1993-12-01 00:00:00",
              "ChangeMgmtReviewDate": "1993-12-01 00:00:00",
              "PreStartupReviewDate": "1993-12-01 00:00:00",
              "ComplianceAuditDate": "1993-12-01 00:00:00",
              "AuditCompletionDate": "1993-12-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1993-12-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-12-01 00:00:00",
              "ContractorSafetyReviewDate": "1993-12-01 00:00:00",
              "ContractorSafetyEvalDate": "1993-12-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3876,
                  "PreventionProgram3ID": 3394,
                  "ProcessChemicalID": 8667
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6559,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "SJC Office of Emergency Services",
    "CoordinatingAgencyPhone": "2094683962",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6559,
      "SummaryText": "The United Grocers, Inc. refrigerated warehouse facility is located in Tracy, California in San Joaquin County.  The site is located southeast of the intersection of North Macarthur Drive and West Pescadero Avenue.  It is approximately one-quarter mile southeast of the intersection of U.S. Highway 205 and North Macarthur Drive.\n\nThe refrigeration system for United Grocers' refrigerated warehouse facility utilizes anhydrous ammonia in a controlled pressure system.  Ammonia is commonly used as a coolant for cold storage warehouses.  The system contains approximately 18,000 pounds of ammonia.  Ammonia travels from the discharge of the compressors to the evaporative condenser through a low/high pressure receiver and then distributed though the deli/freezer.   \n\nThe refrigeration system is controlled by a Data Acquisition and Control Program (DAQ), which is loaded in the Central Processing Unit (CPU) and is utilized to perform the following functions:\n\n1. Acquire data;\n2. Make decisions to maintain cooling;\n3. Start, stop, open, and/or close the necessary motors and valves to implement the control decisions;\n4. Send information to the graphics interface;\n5. Provide an operator interface for changing setpoints, defrost schedules, timing valves, etc.; and\n6. Provide the operator with a secondary source for operation status through displays about compressors, condensers, area temperatures and sensor values.\n\nThe DAQ is designed to monitor and control the air temperature in the various storage areas of the warehouse facility.  The safety system will shut the system down should an ammonia leak be detected.  Sensing devices are have been installed in the following locations.\n\n7 Freezer Zones 1A, 1B, 2A, and 2B\n7 Deli Zones 3A and 3B\n7 Dock Zones 4, 5, 6, 7, and 8\n7 Machine Room\n\nThe sensing devices are calibrated to detect ammonia at levels of 100 parts per million.  These devices are tested to assure that they are functional.  In the event of a power failure, there is a back-"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6559,
      "SummaryText": "up generator.  In case of an ammonia leak, there are two air packs located in the engine room, with two other breathing devices located throughout the plant.  The air packs are tested annually. \n\nThe computer system also monitors the engine compressors and condensing tower.  The computer system will detect a malfunction and shut the affected area down should performance exceed pre-set tolerances.  Additionally, should a malfunction occur, the computer will automatically shut down the affected area and call the Engineer and Plant Manager, notifying them of the specific problem.  Using access codes, specific employees can obtain equipment performance information and make adjustments from offsite.  \n\nThe ammonia storage tank rarely needs replenishing and has only received a total of 600 gallons in one deliver since first opened in 1990.\n\nWORST-CASE RELEASE SCENARIO                                                                                                                  The capacity of the storage vessel was used as the quantity of ammonia to be modeled in the worst-case release scenario.\n\nALTERNATIVE RELEASE SCENARIO-PIPE PUNCTURE\nDuring the HazOp study, it was determined that the greatest potential for a release would occur with a release of anhydrous ammonia from a supply line with an average diameter of 1= inches, 768 feet in length, which was ruptured by a forklift truck at the Deli and Freezer Dock area.  A pipe release was postulated, resulting in anhydrous ammonia being released directly to the atmosphere.  It was assumed that the line was full of anhydrous ammonia.  Anhydrous ammonia was at a pressure of 50 psi pressure and a temperature of 340F at the postulated release point.  At this temperature and pressure, anhydrous ammonia is in liquid form.  It was assumed that the liquid ammonia would be released from the overhead pipe and quickly form an evaporating pool. \n\nLEVELS OF CONCERN\nThe Levels of Concern (LOC) used for ammonia was assumed to be 200 ppm"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6559,
      "SummaryText": ".  This value corresponds to the Emergency Response Planning Guidelines Level 2 (ERPG-2) toxic endpoint for ammonia. \n\nMODEL, DISPERSION CONDITIONS, PHYSICAL AND CHEMICAL PROPERTIES\nComputer dispersion modeling used SLABView (version 1.72) which is a Windows based version of SLAB.  SLAB is a computer-aided model capable of simulating the atmospheric dispersion of denser-than-air releases over flat terrain.  SLAB, in its calculation of plume geometry, takes into consideration the spilled material's physical characteristics, atmospheric conditions, and circumstances of the release (Table 3).  \n\nSLAB is limited in its inability to account for complex topographical features, long-duration (stack) emissions, and low-level (fugitive) emissions.  Atmospheric dispersion of a release is calculated by solving the conservation equations of mass, momentum, energy, and species.  SLAB uses a Gaussian computation to predict the movement of a neutrally buoyant gaseous ammonia plume and a heavy gas computation to predict the movement of a heavy gas ammonia plume.\n\nDISPERSION MODELING RESULTS\nAppendix I includes SLAB text summaries for each modeling output generated for the worst-case and alternative release scenarios.\n\nWORST-CASE RELEASE SCENARIO-STRUCTURAL FAILURE\nThe maximum distance to the LOC (200 ppm) using an evaporative pool release and the atmospheric conditions summarized in Table 3 is 5,820 feet.  The concentration at the nearest off-site receptor is 600 ppm.  This receptor is located approximately 670 feet directly to the west of the ammonia storage vessel across North Macarthur Drive. \n\nThe worst-case release scenario assumes an instantaneous release of an entire storage vessel volume (18,000 pounds of liquid ammonia).  This highly unlikely scenario is consistent with CalARP RMP guidelines which state that the worst-case release scenario should assume the entire content of stored substances is released under conservative atmospheric conditions.  This scenario maximizes t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6559,
      "SummaryText": "he distance of impacts, and as a result should be used for informational purposes only and should not be the basis for alarm or concern.  The likelihood of such a catastrophic failure occurring is highly unlikely.  This is a result of the many safety features and administrative controls that were implemented with the design and operation of the ammonia refrigeration system.  The ammonia tank was shop tested at pressures both far exceeding the design pressures of safety relief valves and design pressures of the tank walls.  In addition, a maintenance schedule ensures the tank will not become weakened without replacement or repair.  Many other safety features are included in the ammonia refrigeration system which can be found primarily in Section 2.0.  Furthermore, the intent of the CalARP regulation and the required RMP is to prevent such catastrophic, as well as more realistic accidents, from occurring through a system of owner/operator understanding and identification of the hazards inherent to the RS system and ownership of solutions. \n\nEFFECTS ON SENSITIVE POPULATIONS\nUsing the Tracy General Plan, the approximate residential population residing within the worst-case scenario circumferential area was determined to be 260.  Included in this area are two schools and a care center:  Banta Elementary School, Seventh Day Adventist Church School and New Hope Care Center.  No environmental receptors reside within this impact area.  Environmental receptors are defined in 40 CFR 68.3 as natural areas such as national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preserves, refuges, or areas; and Federal wilderness areas.\n\nALTERNATIVE RELEASE SCENARIO-PIPE PUNCTURE\n\nThe maximum distance to the LOC (200 ppm) using an evaporative pool release and the atmospheric conditions summarized in Table 3 is 150 feet.  There are no off-site receptors within the LOC.  The concentration at the nearest off-site receptor is 10 ppm.  This receptor is"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6559,
      "SummaryText": "located approximately 670 feet directly to the west of the ammonia storage vessel across North Macarthur Drive. \n\nThe alternative-release scenario assumes a release would occur from a supply line with an average diameter of 1= inches, 768 feet in length, which was ruptured by a forklift truck at the Deli and Freezer Dock area.  A total of 375 pounds of anhydrous ammonia would be released during a 5 minute duration. \n\nEFFECTS ON SENSITIVE POPULATIONS\nNo public or environmental receptors reside within the circumferential areas of the alternative release."
    }
  ]
}