{
  "FacilityID": 6562,
  "FacilityName": "A Diamond Pool, Inc.",
  "FacilityStr1": "21411 North 11th Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Phoenix",
  "FacilityState": "AZ",
  "FacilityZipCode": "85027",
  "Facility4DigitZipExt": "2835",
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.681528",
  "FacilityLongDecDegs": "-112.085972",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PP",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 37612124,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Bob Morris",
  "OperatorStr1": "1341 East Ruth Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Phoenix",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85020",
  "OperatorZipCodeExt": "3265",
  "RMPContact": "Bob Morris",
  "RMPTitle": "Owner",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000082064",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-01-23 00:00:00",
  "DeRegistrationEffectiveDate": "2005-12-16 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.68139,
  "FRS_Long": -112.08617,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7877,
      "AltID": "Chlorine transfer",
      "FacilityID": 6562,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8062,
          "ProcessID": 7877,
          "NAICSCode": "56179",
          "_desc": {
            "NAICS_CODE": "56179",
            "NAICS_DESCRIPTION": "Other Services to Buildings and Dwellings"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8670,
          "ProcessID": 7877,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508670,
          "ProcessID": 7877,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6562,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nA Diamond Pool, Inc. has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n1.) To save lives.\n2.) To minimize and avoid injuries.\n3.) To protect the environment.\n4.) To minimize property damage.\n\nThe Plan provides the response organization and notification procedures, evacuation routes, chlorine health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  \n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nStartup of the chlorine system occurred in November 1993.  The process is located at 21411 North 11th Avenue, Phoenix, AZ 85027.  The chlorine transfer process for A Diamond Pool, Inc. consists of chlorine one-ton containers which are the storage vessels.  Chlorine liquid is dispensed from the one ton container through a filling manifold to a 20 pound cylinder.  The system is operated manually; therefore, someone is present when ever the container valve is open.  During off-hours, the container valve is closed and the system is shut down.\n\nThe maximum quantity of chlorine on site is 8000 pounds.\n\nHAZARD ASSESSMENT SUMMARY\n\nWorst Case Release Result Summary\nThe worst case release for this facility was that of the maximum quantity of chlorine that can be stored in the largest vessel in 10 minutes.  The largest vessel at this facility is a one ton chlorine container which holds a maximum of 2,000 pounds of chlorine.  This vessel is stored outside, therefore, no passive mitigation measures were used.  The most pessimistic meteorological conditions were used: 1.5 meters/second wind speed and F stability.  The facility is locatd in an urban setting. The reference table, Exhibit 4-4, from EPA's RMP Guidance for Wastewater Treatment Plants was used to find the potential d"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6562,
      "SummaryText": "ownwind distance to 3 ppm as a result of this worst case release scenario.  The release reaches off-site and may affect population receptors.  No environmental receptors were affected by this potential release scenario.\n\nAlternative Release Result Summary\nThe alternative release was that of a 5/16 inch diameter leak from a pipeline containing liquid chlorine.  Based on the pressure in the tank, the release rate was calculated to be 72 pounds/minute.  Since there is no accident history at this facility, this release scenario was based on the possibility of a leak in the pipeline or a flange seal leak.  The meteorological conditions used were 3 meters/second wind speed, and D stability.  The facility is located in an urban setting.  The reference table, Exhibit 4-12, from EPA's RMP Guidance for Wastewater Treatment Plants was used to find the potential downwind distance to 3 ppm for the alternative release scenario.  This release reaches off-site and may affect population receptors.  No environmental receptors were affected by this potential release scenario.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nA Diamond Pool, Inc. has a Process Safety Management program to manage the handling of chlorine.  In addition, common industry standards, policies, and procedures are utilized to ensure safe practices are being performed.  This includes common practices outlined by the Chlorine Institute and the National Association of Gas Chlorinators.  \n\nThe owner and operator of the facility has over 30 years of experience in the gas chlorination industry with a perfect history of no chlorine releases.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no releases of chlorine at this facility since it started operations in November 1993.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe A Diamond Pool, Inc. has an emergency response plan in effect at the facility.  The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6562,
      "SummaryText": " document.  The basis of the Plan is for the facility to contact the Fire Department (9-1-1) in the event of an emergency.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazard Analysis provided the mitigation measures outlined below to improve safety at A Diamond Pool, Inc.  The following recommendations are scheduled to be implemented on or before December 1, 1999:\n\nR01:    Prepare a call list to notify neighbors in the event of a chlorine release. Verify and update the neighborhood emergency telephone list once per year.\n\nR02:    Test the chlorine sensor as per manufacturer's recommendations and document this test.  See Mechanical Integrity Section of PSM/RMP manual.\n\nR03:    Review the operating procedures to ensure that they are an accurate representation.  Review the operating procedures annually and certify that they are accurate.  Use the operating procedures to train employees. See Operating Procedures section of PSM/RMP manual.\n\nR04:    Add warning to operating procedures that the Vent Valve should be closed during transfer process.  Also include instructions for how to proceed if Vent Valve is left open and liquid chlorine flows into the PVC pipeline.\n\nR05:    Prepare a certification for the existing operators to satisfy the initial training requirements (Grandfather Clause).  See Employee Training section of PSM/RMP manual.\n\nR06:    Prepare training forms for on-the-job training certification for new operators.\n\nR07:    Provide procedures for gravity bleed in Operating Procedures. \n\nR08:    Review the sign requirements for the area to warn of the presence of chlorine (i.e. Hazard Diamond, Emergency Telephone numbers, etc.)\n\nR09:    Repair and/or replace the existing chlorine sensor.\n\nR10:    Install an eyewash/safety shower station near the Fill Yard.\n\nR11:    Update the MSDS book to include all chemicals on site.\n\nR12:    Install a wind sock in the Fill Yard.\n\nR13:    Post emergency telephone numbers near the telephone."
    }
  ]
}