{
  "FacilityID": 6563,
  "FacilityName": "Aurora Water Treatment Plant",
  "FacilityStr1": "1111 Aurora Ave",
  "FacilityStr2": null,
  "FacilityCity": "Aurora",
  "FacilityState": "IL",
  "FacilityZipCode": "60505",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17089",
  "LEPC": "Kane County LEPC",
  "FacilityLatDecDegs": "41.78",
  "FacilityLongDecDegs": "-88.308444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 948407416,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Aurora",
  "OperatorStr1": "44 E. Downer Place",
  "OperatorStr2": null,
  "OperatorCity": "Aurora",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60507",
  "OperatorZipCodeExt": "2067",
  "RMPContact": "Arnold W. Eggleston",
  "RMPTitle": "Water Production Superintendent",
  "FTE": 24,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000082117",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-04-24 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-04-14 00:00:00",
  "DeRegistrationEffectiveDate": "2007-05-07 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.78679,
  "FRS_Long": -88.31283,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "liquid chlorine use was discontinued",
  "_processes": [
    {
      "ProcessID": 7878,
      "AltID": "Water Treatment",
      "FacilityID": 6563,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8063,
          "ProcessID": 7878,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8671,
          "ProcessID": 7878,
          "ChemicalID": 62,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508671,
          "ProcessID": 7878,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6563,
      "SummaryText": "The Aurora Water Treatment Plant is dedicated to safe disinfection of the City's water supply.  Chlorine cylinders are carefully inspected upon arrival, and are stored in an isolated, flame-resistant room away from flammable materials.  All personnel who work with the Chlorine equipment are trained in safe operating procedures.  The facility was built and is operated according to applicable federal, state, and industry standards.\nIn the event of an accidental release, facility personnel are directed to contact the Hazardous Materials team of the Aurora Fire Department.  The Water Treatment Plant is included in the Fire Department's Emergency Response Plan, and the Fire Department drills regularly at the facility to maintain a working familiarity with the facility and emergency procedures.  The Fire Department's Hazardous Materials team held its most recent drill at the facility on July 12-14, 1998.\nThe Aurora Water Treatment Plant has a 28 million gallon per day capacity to treat raw water and supply it to the City's water system.  Chlorine is used to disinfect the water, and the plant has capacity to store 36,000 pounds of chlorine.  Administrative controls are in place to limit the amount of chlorine stored at the facility to that which is necessary to accommodate seasonal fluctuations in chlorine demand.\nThe US Environmental Protection Agency's Off-site Consequence Analysis Guidance was used to determine the off-site effects of an accidental release.  In the facility's worst-case scenario, a one-ton chlorine cylinder would be damaged outside the building enclosure, and the rupture would be large enough that the entire contents would empty from the container within ten minutes.  The off-site impact of such a scenario would reach as far as 1.3 miles from the facility.\nSince the probability of such a large release is extremely low, an alternate release scenario was also modeled.  This scenario involves rupture of a liquid chlorine line.  This release would empty a o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6563,
      "SummaryText": "ne-ton container in 23 minutes.  The building enclosure was considered as mitigation in calculating the off-site impact.  Again using the USEPA Off-Site Consequence Analysis Guidance, the impact of this release would reach 0.25 miles from the facility.\nIn order to minimize the potential for accidental release, the facility hires operators who are trained to handle chlorine and are knowledgeable of the hazards involved with this chemical.  All chlorine equipment is inspected and receives preventative maintenance as per the manufacturers' specifications.  Chlorine gas monitors are installed wherever chlorine gas has the potential to escape, and each alarm is to be dealt with swiftly and carefully according to facility regulations.\nThe Aurora Water Treatment Plant has not had a reportable accident within the last five years.  Since the plant went on-line in 1992, there have been no incidents involving injury or property damage.\nThe facility continues to train its employees in safe handling and operations practices, and the Aurora Fire Department drills regularly at the plant.  Currently, design is underway for an expansion of the water treatment facility.  It is proposed that the chlorine disinfection system be replaced with sodium hypochlorite, thus eliminating the potential for accidental chlorine gas release.  The new sodium hypochlorite system is projected to begin operation in 2001."
    }
  ]
}