{
  "FacilityID": 6612,
  "FacilityName": "OSU Water Treatment Plant",
  "FacilityStr1": "Virginia",
  "FacilityStr2": "Pioneer",
  "FacilityCity": "Stillwater",
  "FacilityState": "OK",
  "FacilityZipCode": "74078",
  "Facility4DigitZipExt": "8026",
  "FacilityCountyFIPS": "40119",
  "LEPC": "Payne County LEPC",
  "FacilityLatDecDegs": "36.121667",
  "FacilityLongDecDegs": "-97.096667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.pp.okstate.edu",
  "FacilityEmailAddress": "stevea@pp.okstate.edu",
  "FacilityDUNS": null,
  "ParentCompanyName": "Oklahoma State University",
  "Company2Name": null,
  "CompanyDUNS": 49987720,
  "Company2DUNS": null,
  "OperatorName": "Oklahoma State University",
  "OperatorStr1": "101 Power Plant",
  "OperatorStr2": null,
  "OperatorCity": "Stillwater",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74078",
  "OperatorZipCodeExt": "8026",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000081421",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-19 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-05-17 00:00:00",
  "DeRegistrationEffectiveDate": "2004-01-01 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.121667,
  "FRS_Long": -97.096667,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7939,
      "AltID": "Water Treatment",
      "FacilityID": 6612,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 8733,
          "ProcessID": 7939,
          "ChemicalID": 62,
          "Quantity": 6500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8127,
          "ProcessID": 7939,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 4093,
              "Process_NAICS_ID": 8127,
              "SafetyReviewDate": "1999-06-02 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "Chlorine Institute Standards",
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-09 00:00:00",
              "ChangeCompletionDate": "1999-12-10 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-08 00:00:00",
              "TrainingReviewDate": "1999-06-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-14 00:00:00",
              "EquipmentInspectionDate": "1999-06-11 00:00:00",
              "EquipmentTested": "Chlorine vacuum regulators",
              "ComplianceAuditDate": "1999-06-15 00:00:00",
              "AuditCompletionDate": "1999-06-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4236,
                  "PreventionProgram2ID": 4093,
                  "ProcessChemicalID": 8733
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6612,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-29 00:00:00",
    "ERTrainingDate": "1999-05-05 00:00:00",
    "CoordinatingAgencyName": "OSU Environmental Health and Safety",
    "CoordinatingAgencyPhone": "4057447241",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6612,
      "SummaryText": "EXECUTIVE SUMMARY - OKLAHOMA STATE UNIVERSITY WATER TREATMENT PLANT RISK MANAGEMENT PROGRAM\n\n\n\nThe Oklahoma State University Water Treatment Plant is located on the west side of both the campus and the City of Stillwater.  The plant is near the intersection of Pioneer Street and Virginia Street, 4/10 of a mile north of Oklahoma Highway 51.  The plant furnishes drinking water for the university and the City of Stillwater, operating to augment the city water plant.  Originally constructed in 1950, for 35 years it furnished all the water used by both the university and the city of Stillwater.  Currently it operates in cooperation with the Stillwater Water Treatment Plant to furnish water for the two communities.  \n\nA major part of any water treatment operation is the disinfection process which destroys bacteria in the water.  The only treatment process which meets the EPA requirements for maintaining disinfection throughout the water system is the use of chlorine. \n\nChlorine is an element which is part of every person's daily life.  Every household contains chlorine compounds, in foods, cleaning supplies and many other forms. In pure gaseous state, chlorine is a greenish-yellow color and is 2= times heavier than air.  In commercial applications, it is available as a compressed liquid that is amber colored and is approximately 1= times as heavy as water.  If liquefied chlorine is unconfined, it rapidly vaporizes to gas.  One cubic foot of  liquefied chlorine will produce around 450 cubic feet of chlorine gas.  Under specific conditions chlorine will react with most elements.  It is neither flammable nor explosive, but like oxygen it is capable of supporting combustion of certain substances.  In pure form, chlorine is not corrosive.  When moistened, it becomes extremely corrosive to most metals and organic compounds.  Chlorine gas is primarily a respiratory irritant, and concentrations in air above 3 ppm by volume can usually be detected by smell.  Chlorine causes varyin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6612,
      "SummaryText": "g degrees of irritation of the skin, particularly in the presence of moisture.  It also attacks mucus membranes and the respiratory system, with the severity depending on the concentration and duration of exposure.  In severe cases, death can occur from suffocation.  Because of the severe irritating nature of chlorine exposure, this would usually happen only if the person is trapped or unconscious.  Chlorine produces no known cumulative effects and complete recovery usually can be expected to occur shortly after mild short-term acute exposure.\n\nA water plant requires chlorine because it is the only known disinfectant that can maintain the ability to kill bacteria over long periods of time. The gas is mixed with water and then injected into the water supply at the beginning and the end of the treatment process.  At the beginning of the process the chlorine is used to destroy bacteria in the supply water.  The chlorine will act on this water for several hours to remove all the harmful bacteria.  At the end of the treatment process, additional chlorine is added to maintain a bacteria free environment throughout the distribution system.  This is very important since water may travel several days before reaching all the customers. \n\nAt the OSU Water Plant, the disinfection process uses liquefied chlorine gas in one-ton containers.  Each container holds 1600-1700 pounds of chlorine.  The plant normally has four containers in stock. Of these, two or three of the containers will be full and at least one container will be empty or almost empty.  The OSU Water Plant, like most larger water plants, uses liquefied chlorine gas because it is the most chemically stable form of chlorine to use.  The OSU plant may use from 75-200 pounds of chlorine gas each day of operation.  The use of ton containers allows the maximum time between container changes and the minimum potential for hazard in a leak.  Traditionally, the most dangerous part of chlorine operation occurs during container"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6612,
      "SummaryText": "changes. Because of this, plant regulations allow only the plant superintendent or the Chief Operator to oversee the replacement of containers.  If either of these people are not available, the containers will not get changed until they become available.  (The system is designed to permit waiting several days before the empty containers must be replaced)  A minimum of two people are required to perform the task, which is performed under strict guidelines. This is one of the main reasons that there has not been a reportable incident at the OSU plant.\n\nTo maximize the safety of the disinfection process at the OSU Water Plant, the chlorine containers are kept inside an enclosure separated from the other plant operations.  Only one container is in use during operations, with a second container held in standby reserve.  The feeder system has two components which must work properly to allow chlorine flow.  The chlorine is introduced into the water via a chemical injector system.  The injector uses water flow through an orifice to produce a vacuum, which then mixes the chlorine and water at a controlled rate.   The injector system is connected to a vacuum regulator. This is a safety device which is connected to the chlorine containers.  It allows the gas to flow only when sufficient vacuum is produced by the chemical feeder to overcome the spring loaded valves.  If the supply line from the regulator to the chemical feeder is damaged, or any problems occur with the mixing water flow, the gas supply is immediately shut down.  If a leak does occur, gas detector alarms in the chlorine storage and chemical feeder rooms will alert the operator on duty.  The plant operators are trained on the proper response to all problems that could occur, in addition to how to prevent a mishap from occurring in the first place.  Before operators are allowed to operate the plant they must be certified knowledgeable about the processes and afterwards receive annual training to maintain their pr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6612,
      "SummaryText": "oficiency.  No operator is authorized to enter the storage area without another operator knowing about it. \n\nUnder the EPA worst-case scenario, the maximum area that could be affected would be within a .9 mile radius from the plant. Such an event is considered by many to be physically impossible.  Even so, the OSU plant is uniquely situated to minimize the potential of damage from a catastrophic leak.  The natural terrain around the plant is well-suited to minimize dispersion flow of a heavier than air gas, such as chlorine.  The plant is located in a low area with numerous trees and two creeks to the west, a flood plain to the south and a hill with trees and storage barns to the north.  The only residences are to the east of the plant.  To threaten the residential area, escaping gas would have to rise above a natural berm, by-pass a row of evergreen trees and then travel over = -mile.   With the low wind speeds of the worse-case scenario, any escaping gas will be more inclined to settle into the flood plains to the south and eventually dissipate into the creek. \n\nThe EPA defined alternative-case scenario release, while more likely than the worst-case scenario, is still considered very remote. This is based on the what may happen during a catastrophic failure-a situation which may be unlikely, but is not impossible.  Such an event would normally be the result of a fitting or connector failure on a chlorine container.  The area affected by such a leak would be less than a two hundred yards radius from the container.  To prevent such an event, all the OSU Water Plant equipment is checked frequently in accordance with the manufacturer's recommendations.  In addition, all the chlorine feed equipment is rebuilt or replaced according to a strict regular maintenance schedule to insure minimal chance of failure. \n\nThe OSU Water Plant has not had a reportable accident in the past five years and is taking every precaution to avoid having one in the future.  But even with all"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6612,
      "SummaryText": "the precautions that are taken, a leak could occur.  That is why the university has an extensive emergency preparation plan in place.  This plan has existed for many years, and is continually being reviewed and updated.  While the OSU goal is to prevent an accident from happening in the first place, even the best of prevention programs is not 100% perfect.  Even a new fitting can fail or a connector may not seal properly, causing a minor leak.  If that happened, gas detection alarms in the storage room and feed room would immediately alert the plant operators, who would then notify the campus Safety Department, who would have a Hazardous-Materials response team dispatched to contain the leak. Depending on the severity of the leak, the campus police and the Stillwater police have assigned traffic control locations would limit access to the area affected until the problem was resolved.  Once the area is secured, trained Hazardous-Materials technicians and special trained plant operators don protective equipment and enter the storage area. Depending on the incident, they will then repair or contain the leak.\n\nOSU is also investigating the feasibility of installing additional methods of preventing a chlorine gas leak from escaping the confines of the plant, even under worst-case conditions  The most common method of control is to utilize a chemical scrubber system.  These systems will detect the smallest gas leaks and immediately create suction on the storage room, drawing the gas into a reaction chamber.  Here, the chlorine is sprayed with caustic soda or another chemical that will quickly absorb the chlorine into a neutral substance.  We are also investigating new technologies would not need the extensive maintenance that a conventional scrubber system requires."
    }
  ]
}