{
  "FacilityID": 662,
  "FacilityName": "City of Winfield Municipal Swimming Pool",
  "FacilityStr1": "300 N. Main",
  "FacilityStr2": null,
  "FacilityCity": "Winfield",
  "FacilityState": "KS",
  "FacilityZipCode": "67156",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20035",
  "LEPC": "Cowley County LEPC",
  "FacilityLatDecDegs": "37.246972",
  "FacilityLongDecDegs": "-96.9975",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": "http://skyways.lib.ks.us/kansas/towns/Winfield/index.html",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "NA",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Winfield",
  "OperatorStr1": "P.O. Box 646",
  "OperatorStr2": null,
  "OperatorCity": "Winfield",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67156",
  "OperatorZipCodeExt": "0646",
  "RMPContact": "Russ Tomevi",
  "RMPTitle": "Director of Public Works",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000006575",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-05-10 00:00:00",
  "ErrorReportDate": "1999-05-10 00:00:00",
  "ReceiptDate": "1999-05-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-05-08 00:00:00",
  "RMPCompleteFlag": 0,
  "DeRegistrationDate": "2007-06-21 00:00:00",
  "DeRegistrationEffectiveDate": "2007-06-09 00:00:00",
  "AnniversaryDate": "2004-05-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0.5e",
  "FRS_Lat": 37.24697,
  "FRS_Long": -96.9975,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 749,
      "AltID": "Disinfection of wate",
      "FacilityID": 662,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 756,
          "ProcessID": 749,
          "NAICSCode": "71399",
          "_desc": {
            "NAICS_CODE": "71399",
            "NAICS_DESCRIPTION": "All Other Amusement and Recreation Industries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 830,
          "ProcessID": 749,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 500830,
          "ProcessID": 749,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 662,
      "SummaryText": "RISK MANAGEMENT PLAN FOR THE CITY OF WINFIELD MUNICIPAL SWIMMING POOL\n\nExecutive Summary\nThe accidental release prevention and emergency response policies at the stationary source\nThe City of Winfield is committed to secure handling of chlorine gas at the municipal swimming pool.  It is recognized that while chlorine is an indispensable part of public health protection, it poses significant hazards if not handled properly.  The City of Winfield will abide by all pertinent EPA RMP regulations to guard against accidental releases of chlorine at the municipal swimming pool, and, if they do occur, to minimized their harm to the surrounding community and environment.  Additionally, the City of Winfield will always be on the look out for more efficient, safer methods of handling chlorine and, as circumstances and budget allow, for a less toxic alternative disinfection regime (i.e., ozone, etc.).\nThe stationary source and regulated substances handled\nStationary source:\nThe City of Winfield\nMunicipal swimming pool\nPhysical location: At the northwest corner of Main Street and Highway 77, northwest edge of town.\nRegulated substance:\nChlorine\nWorst case release scenario\nScenario\nRelease of the contents of an entire one ton chlorine cylinder.\nAdministrative controls and mitigation measures to limit the distance affected by the release\nMuch of the chlorine process is on a vacuum system, particularly in the filter room adjacent the chlorine room.  If there is a break in the line in this area, the vacuum will minimize the escape of chlorine.\nIf there is a problem, there is a master switch in the managers office, which can be thrown to shut off all chlorine pumps.\nA chlorine sensor is located at the south end of the chlorine room near the floor.  If it detects chlorine it feeds a signal to a Tox-Alarm in the filter room, which then routes it on to a Simplex system in the next room which automatically sets off an audible alarm at the fire department and at the swimming pool itsel"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 662,
      "SummaryText": "f.\nIn the event of a release, 911 will be notified immediately.  The possible need for public evacuation will be stressed to 911.\nAlternative release scenario\nFor detailed information on the alternative release scenario, refer to page 23.\nScenario\nThe most likely source of a leak would be in the PVC line running from the chlorinator (a regulator affixed to the chlorine cylinder itself) to the manifold in the adjoining filter room.  This line is made of 3/8 flexible PVC and is placed inside a more rigid, outer PVC sleeve (conduit).  The PVC may become brittle over time.  This pinhole progresses to a full break in the line.\nAdministrative controls and mitigation measures to limit the distance affected by the release\nMost of the chlorine line is on a vacuum system, if there is a break in the line, the vacuum will minimize the escape of chlorine.\nA chlorine sensor is located at the south end of the chlorine room near the floor.  If it detects chlorine it feeds a signal to a Tox-Alarm in the filter room, which then routes it on to a Simplex system in the next room which automatically sets off an audible alarm at the fire department and at the swimming pool itself.\nIf there is a problem, there is a master switch in the managers office that can be thrown to shut off all chlorine pumps.\nIn the event of a release, 911 will be notified immediately.\nThe general accidental release prevention program and chemical specific prevention steps\nGeneral accidental release prevention program\nSelected swimming pool employees receive ongoing training in chlorine hazards and response to emergencies. \nGenerally, employees use the buddy system when engaged in hazardous or potential hazardous tasks.\nEquipment is maintained or replaced as needed to ensure no mishaps occur to equipment failure.\nChemical specific prevention steps\nAll swimming pool employees are subject to ongoing training in chlorine handling.\nChlorine safety information is centralized and available to employees.  See page 4"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 662,
      "SummaryText": "5.\nA hazard review has been conducted. See page 46.\nOperating procedures for handling the chlorine cylinders. See page 49.\nMaintenance procedures for chlorine equipment have been developed. See page 51.\nCompliance audit procedures have been developed. See page 53.\nInvestigation procedures have been developed. See page 53.\nThe five year accident history\nNo chlorine accidents have occurred in the five years prior to the date of this RMP plan.\nThe emergency response program\nEmergency response program description and the emergency response plan, can be found at page 56.\nPlanned changes to improve safety\nNo changes are planned at this time."
    }
  ]
}