{
  "FacilityID": 6638,
  "FacilityName": "South Martin Regional Utility North WTP",
  "FacilityStr1": "7500 SE Osprey Street",
  "FacilityStr2": null,
  "FacilityCity": "Hobe Sound",
  "FacilityState": "FL",
  "FacilityZipCode": "33455",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12085",
  "LEPC": null,
  "FacilityLatDecDegs": "27.099528",
  "FacilityLongDecDegs": "-80.154861",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "CO",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": "usfpkeath@aol.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Town of Jupiter Island",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Town of Jupiter Island (Owner)",
  "OperatorStr1": "9000 SE Athena Street",
  "OperatorStr2": null,
  "OperatorCity": "Hobe Sound",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33455",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000084053",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Chlorine",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-04-27 00:00:00",
  "DeRegistrationEffectiveDate": "2002-12-31 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 27.10124,
  "FRS_Long": -80.15256,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7965,
      "AltID": "Chlorine system",
      "FacilityID": 6638,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 8761,
          "ProcessID": 7965,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8154,
          "ProcessID": 7965,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3445,
              "Process_NAICS_ID": 8154,
              "SafetyReviewDate": "1999-05-25 00:00:00",
              "PHA_Date": "1999-05-26 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-20 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Vacuum regulators",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-25 00:00:00",
              "TrainingReviewDate": "1999-05-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-25 00:00:00",
              "EquipmentInspectionDate": "1999-04-15 00:00:00",
              "EquipmentTested": "Rebuilt Regal chlorinators.  (All equipment inspected daily)",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-05-25 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-25 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-25 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3930,
                  "PreventionProgram3ID": 3445,
                  "ProcessChemicalID": 8761
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6638,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-25 00:00:00",
    "ERTrainingDate": "1999-05-01 00:00:00",
    "CoordinatingAgencyName": "Martin County Fire Department",
    "CoordinatingAgencyPhone": "5610000911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6638,
      "SummaryText": "EXECUTIVE SUMMARY\n\nPurpose\n\nChlorine is used as a disinfectant in water treatment.  Raw water contains microorganisms that are harmful to human health.  Several treatment processes are utilized at the plant to treat the raw water and a chlorination system provides disinfection of the water prior to transfer into the distribution system.\n\nStorage\n\nChlorine is delivered to the treatment plant in one-ton containers.  A maximum of 4 one-ton containers of liquid chlorine are stored on site in the chlorine storage room.\n \nOverview of the Water Treatment Plant\n\nThe South Martin Regional Utility (SMRU) North Water Treatment Plant treats approximately 10 million gallons per day (MGD) of raw water at the treatment plant.  The chlorine used for disinfection is supplied from one-ton containers.  This is the only chemical substance at this facility that is regulated under U. S. EPA's Accidental Release Prevention Program.\n\nChlorine gas is primarily a respiratory irritant.  In sufficient concentrations, the gas irritates the mucous membranes, the respiratory tract and the eyes.  In extreme cases, difficulty in breathing may increase to the point where death can occur from respiratory collapse or lung failure.  The characteristic, penetrating odor of chlorine gas usually gives warning of its presence in the air.  At high concentrations, it is visible as a greenish yellow gas.  Liquid chlorine in contact with the skin or eyes will cause chemical burns and/or frostbite.\n  \nChlorine containers are thoroughly inspected for mechanical integrity and leaking valves prior to leaving the supplier's premises.  At the facility, the off-loaded containers are inspected again by SMRU personnel. \n\nThe liquid chlorine leaves the ton container as a gas.  There are two containers that are both connected to a manifold and equipped with vacuum regulators.   The chlorine gas valves on both containers are normally open.  There are two chlorinators connected to the manifold and they regulate the flow o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6638,
      "SummaryText": "f chlorine gas to the water.  The capacity of one chlorinator is more than adequate to supply the required amount of chlorine to the water.  The chlorine gas flows from the container to the manifold and then to the chlorinator.  The chlorine gas is drawn from the chlorinator by inducing a vacuum in the line after the chlorinator.  The flow of water through an ejector creates a vacuum in the line and also mixes the chlorine gas with the water.  If the water supply to the ejector is stopped, or the operating vacuum is lost for any other reason, the vacuum regulator immediately closes and stops the flow of chlorine gas from the container.\n\nAccidental Release Prevention\n\nAccidental releases of chlorine are prevented by routine training and adhering to the written operating procedures that cover the chlorination system from the ton-container unloading through the mixing of the chlorine gas with the water.  These procedures cover normal operations and emergency operations where personnel may have to respond to an accidental release of chlorine.  The chlorine system is inspected daily and leak testing is performed on the valves and fittings when ton-containers are changed-out and at other times if a leak is suspected.  Employees that are responsible for disconnecting empty containers and connecting filled containers to the chlorination system have been trained on the operating procedures, inspection of valves, fittings, and the connected piping, and leak testing with an aqueous ammonia solution.  Aqueous ammonia reacts with chlorine gas to form a very visible white cloud.  This daily inspection insures that worn or damaged parts are replaced and necessary routine maintenance is performed on the chlorinators and other equipment.  These preventive measures have resulted in the absence of any accidental release of chlorine that resulted in personal injury or property damage in the last five years.\n\nThe water treatment plant maintains two sets of Self-Contained Breathing Appar"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6638,
      "SummaryText": "atus (SCBA) and The Chlorine Institute's Emergency Kit \"B\" for ton containers.  SMRU personnel receive annual training on the use of the breathing apparatus and the emergency kit.  Kit \"B\" contains the necessary tools and other equipment to contain valve leaks and repair small holes in a ton container, and capping devices for the fusible plugs in each end of the container.  Ton containers are equipped with six fusible metal plugs, three in each end.  The fusible metal is designed to melt between 158 F and 165 F to relieve pressure and prevent rupture of the container in case of fire or other exposure to high temperature.  \n\n\nEmergency Response Plan\n\nThe SMRU and the Martin County Fire Department have developed an Off-Site Response Plan in the event of an accidental release of chlorine at the treatment plant.  This plan was developed in accordance with the provisions set forth in Title III of the Superfund Amendments and Reauthorization Act of 1986.  The plan assigns release response procedures to the emergency coordinator at the SMRU,  Martin County Fire Department, Local Police, and Emergency Medical Services.  The plan is updated as necessary, including the list of emergency telephone numbers. \n\nIf a chlorine leak develops in a ton-container or in the connected piping, valves, or other equipment, a chlorine monitor in the chlorine storage area will activate an auto-dialer alarm that will call an answering service.  The answering service will contact SMRU personnel.  The treatment plant emergency operating procedures will be followed to determine the severity of the chlorine release and whether or not the gas may migrate offsite.  If the chlorine release may travel offsite, then the Offsite-Response Plan will be activated.  If the chlorine release does not pose a threat to the general public, SMRU personnel will repair the leak.  SMRU personnel have installed a windsock near the chlorine storage building so that the area that is likely to be affected by a chlorine"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6638,
      "SummaryText": "release can be determined.      \n\n\nWorst-Case and Alternate-Case Accidental Release Scenarios\n\nWorst-Case Release Scenario\nThe worst-case release scenario as postulated in the regulation (40 CFR 68.25) is the release of the greatest quantity (of chlorine) in a single vessel.  The entire contents of this vessel are assumed to be released as a gas over a 10-minute period.  The largest single vessel at the treatment plant is a one-ton container; therefore, 2,000 pounds of liquid chlorine will be released as a gas over a 10-minute period.  A release of this magnitude would only be possible if the shell of the container failed and the liquid chlorine formed a pool and vaporized over a 10-minute period.  The likelihood of this type of catastrophic release is very minimal.  The off site consequence of this release was determined by use of U. S. EPA's RMP*Comp software.  The RMP*Comp results indicate that the chlorine concentration will exceed 3 parts per million (ppm) out to a radial distance of 3.0 miles from the chlorine storage room. This is the distance to the toxic endpoint. Beyond 3.0 miles the chlorine concentration will be less than 3 ppm. Short-term exposure to chlorine concentrations less than 3 ppm is not considered to be a health hazard. Based on the guidance provided in the regulation and U. S. EPA's Risk Management Program Guidance for Wastewater Treatment Plants, the area surrounding the treatment plant was classified as rural due to the presence of relatively flat terrain.  The meteorological conditions associated with the worst-case release scenario, as prescribed in the regulation, is a wind speed of 1.5 meters per second (3.36 miles per hour) and very stable atmospheric conditions. These stable atmospheric conditions will limit the mixing of the chlorine gas with the ambient air as the gas travels downwind from the point of release.  The cloud formed by the chlorine release will grow in size and decrease in concentration as it travels downwind. \n\nAlterna"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6638,
      "SummaryText": "te-Release Scenario\nThe alternate release scenario is one that is more likely to occur than the worst case release scenario.  For this scenario, it was assumed that the gas valve on the ton container was leaking and mitigation occured in one hour.   This assumption is based on the alternate release scenarios listed in Edition 3 of The Chlorine Institute Pamphlet No. 74 - Estimating the Area Affected by a Chlorine Release, April 1998.  More than one-third of the contents of the ton-container (762 pounds) is released over a one-hour period.  For this scenario, the meteorological conditions prescribed in the regulation are neutral atmospheric stability conditions and a wind speed of 3 meters per second (6.7 miles per hour).   RMP*Comp was also used to determine the radial distance at which the chlorine concentration falls off to less than 3 ppm.  This distance to the toxic endpoint, as determined by RMP*Comp, is 0.20 miles (1,056 feet).  There are only residences, no schools or hospitals, within this radial distance.  It is unlikely that the entire contents of a ton-container would be released prior to SMRU personnel closing the shutoff valve on the ton container.  Actual response time to shut off the valve is estimated to be 30 minutes. \n\nThe worst-case and alternate release scenarios are summarized in the following table along with some additional information regarding population estimates, schools, hospitals and other building or recreation areas within the radial distance to the toxic endpoint.  Census data and the location of schools, hospitals, etc. were obtained from the LandView III mapping system that includes database extracts from U. S. EPA, the Bureau of Census, the U. S. Geological Survey, the Nuclear Regulatory Commission, the Department of Transportation, and the Federal Emergency Management Agency and were confirmed by SMRU personnel.\n \n\n                                                                                Table 1"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6638,
      "SummaryText": "Summary of the Worst-Case and Alternate Release Scenarios\n\n                                                                            Worst-Case Release                 Alternate Release\nType of Accidental Release                               Rupture of ton-container            Valve leak\nQuantity of Chlorine Released                            2,000 pounds                             762 pounds\nDuration of Chlorine Release                              10 minutes                                  60 minutes\nRate of Release of Chlorine Gas                        200 pounds per minute               12.7 pounds per minute\nWind Speed                                                         1.0 m/s (3.36 mph)                     3.0 m/s (6.7 mph)\nAtmospheric Stability Class                                 F (very stable)                           D (neutral)\nMethod used to determine toxic endpoint            RMP*Comp                                 RMP*Comp\nChlorine concentration at the endpoint               3 parts per million (ppm)             3 parts per million (ppm)\nRadial distance to the toxic endpoint                  3.0 miles (6,900 feet)                 0.2 miles (1,056 feet)\nEstimated population within radial distance        11,740                                        397\nNumber of residences                                        5198                                           180\nNumber of hospitals                                            0                                                 0 \nNumber of schools                                              1                                                 0"
    }
  ]
}