{
  "FacilityID": 6657,
  "FacilityName": "Pacific Diazo Products Inc. \u0016 Fontana",
  "FacilityStr1": "6183 Sierra Avenue,  Units 7 & 8",
  "FacilityStr2": null,
  "FacilityCity": "Fontana",
  "FacilityState": "CA",
  "FacilityZipCode": "92336",
  "Facility4DigitZipExt": "1215",
  "FacilityCountyFIPS": "06071",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "34.137444",
  "FacilityLongDecDegs": "-117.743472",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "PACIFICDIAZO.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 24083029,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "David Rubenstein",
  "OperatorStr1": "6183 Sierra Avenue,  Units 7 & 8",
  "OperatorStr2": null,
  "OperatorCity": "Fontana",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92336",
  "OperatorZipCodeExt": "1215",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000083116",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-07-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2008-09-11 00:00:00",
  "DeRegistrationEffectiveDate": "2008-09-01 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.141389,
  "FRS_Long": -117.4325,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7987,
      "AltID": "Ammonia store,distribute",
      "FacilityID": 6657,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 8785,
          "ProcessID": 7987,
          "ChemicalID": 56,
          "Quantity": 46440.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 8786,
          "ProcessID": 7987,
          "ChemicalID": 57,
          "Quantity": 318429.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8176,
          "ProcessID": 7987,
          "NAICSCode": "42269",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3458,
              "Process_NAICS_ID": 8176,
              "SafetyReviewDate": "1999-05-15 00:00:00",
              "PHA_Date": "1999-01-29 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-09-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-21 00:00:00",
              "TrainingReviewDate": "1999-05-06 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-15 00:00:00",
              "EquipmentInspectionDate": "1999-05-03 00:00:00",
              "EquipmentTested": "anhydrous to aqua ammonia converter; cylinder filling equipment; aqua ammonia manifold;",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-05-15 00:00:00",
              "PreStartupReviewDate": "1999-05-01 00:00:00",
              "ComplianceAuditDate": "1998-07-23 00:00:00",
              "AuditCompletionDate": "1999-05-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-15 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-01 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3944,
                  "PreventionProgram3ID": 3458,
                  "ProcessChemicalID": 8785
                },
                {
                  "PrimaryKey": 3945,
                  "PreventionProgram3ID": 3458,
                  "ProcessChemicalID": 8786
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6657,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-15 00:00:00",
    "ERTrainingDate": "1999-05-15 00:00:00",
    "CoordinatingAgencyName": "SAN BERNARDINO CNTY FIRE DEPT",
    "CoordinatingAgencyPhone": "9093874631",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "OSHA PSM REGULATIONS"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 6657,
      "SummaryText": "nt lock-out,\n6) Receipt of ammonia at Pacific Diazo:  Quality Process Checklist,\n7) Delivery of ammonia by Pacific Diazo employees:  Quality Process Checklist,\n8) Receiving anhydrous ammonia from a bulk delivery tank wagon,\n9) The filling of anhydrous ammonia cylinders,\n10) Loading and unloading anhydrous ammonia cylinders on delivery trucks,\n11) Receiving aqua ammonia from a bulk delivery tank wagon, \n12) Operation of the aqua ammonia converter, \n13) Cleaning and filling totes, drums, and bottles of aqua ammonia, \n14) Delivery of aqua ammonia to Pacific Diazo customers,\n15) Management System Procedures,\nHot work procedures performed by Pacific Diazo employees (rare) or by on-site contractors require a Hot work permit, which describes all of the steps needed to obtain clearance to start the work, protect others who may have been using the equipment being acted upon, and to provide closure for those that need to know the job is completed and equipment and work activities can return to normal.  Were there to be an unexpected release or a threatened release of aqua ammonia or anhydrous ammonia, the next four items would take effect:\n16) Release reporting procedure.  The facility has an approved Emergency Response Procedure which was submitted to the San Bernardino County Fire Department (to which all such plans must be submitted in San Bernardino County).  It has been updated to reflect current employee responsibilities.  The individual responsible for reporting any unexpected release is the Company's Director of Operations.  If it is not possible for him to do so, the Company's Safety Director acts to make a report.  However, we note here that all company employees are trained to make a report should this ever be necessary.  \t\n\nNote that the reporting procedure and documentation exists in both English and Spanish.  There are usually more than three cellular telephones at the facility, an extra safeguard if the local wired telephone lines should not be operating.\n17)"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 6657,
      "SummaryText": "Procedures for temporary operations,\n18) Procedures for emergency operations.  This SOP governs the actions taken during extreme operating activities.  Prior approval for their use must be given by the Director of Operations or the Company President.  All emergency operating pro-cedures are performed by two (2) people at all times unless specifically authorized by the Company President, or if that person is unavailable, the Director of Operations.  Prior to conducting any emergency operation, the Emergency Response procedure shall be reviewed and all safety-related equipment to be used shall be checked and confirmed fully operational.  After any emergency operation is conducted, a written report shall be written to record why the operation had to be undertaken.\n19) Procedure for Emergency Shutdown of Operations.  This procedure does not require advance authorization.  The procedure states that first attention is to be paid to any injured person and to the notification of all responsible regulatory agencies who notification must be given to.  Any required regulatory report is to be made within the time frame stated in the applicable regulation.\nIf a release were to occur, an incident investigation is begun within 48 hours.  This investigation and the consequential written report are to be guided by the Guidelines for Investigating Chemical Process Incidents (Center for Chemical Process Safety of the American Institute of Chemical Engineers; 1992), the Guide for Fire and Explosion Investigations (NFPA 921) National Fire Protection Association, and the accident report format required in the Risk Management Program:.\n20) Topics covered include:  Date & Time of accident; NAICS code of process involved;  chemical name, CAS number, and percentage of toxic chemical present if the chemical is in a mixture (as aqua ammonia, for example); release duration and quantity released;  release source;  release event;  weather conditions;  on-site and known off-site impacts;  ini"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 6657,
      "SummaryText": "tiating event;  contributing factors;  which off-site responders and which others were notified; and changes instituted or required as a result of the accident .\n21) A copy of the report is to be placed in company files and a second copy is to be forwarded to the Company President. \n\nPERSONNEL TRAINING\nOn-site personnel are trained in many topics.  For example, the training given to the staff on November 9, 1998 in English and in Spanish included:  1) Fork lift training, 2) Back injury prevention, 3) First aid and CPR, 4) Respirator fit and testing, and 5) Earthquake Safety.  In June 1999, additional refresher training will be given in Material Safety Data and the hazards of exposure to ammonia, emergency response activities, and still other training will be given in July, 1999.  Maintenance and use of equipment training is an ongoing activity.\nAll on-site personnel are trained in the proper use of equipment before they are allowed to use it.\nRepeat and refresher training is scheduled as required or more frequently.  New employees are trained before they are allowed to begin work activities.  \n \nRECENT FACILITY CHANGES AND THE MANAGEMENT OF CHANGE\nAt the end of 1998, Pacific Diazo performed a seismic review and a process hazard analysis at the Fontana facility. \nThe seismic review used a Registered Seismic Engineer and completely fulfilled the special requirements of the San Bernardino Fire Department, the U.S. EPA, and the state of California.  Very few changes were needed as a result of this review. All of the recommended changes have been completed.\nIn this discussion, the definition of change includes all modifications to equipment, procedures, raw materials, and processing conditions other than replacement in kind.  Any such change is identified and reviewed prior to implementation.  Any new process at the facility would be treated in the same manner.  Any existing process shutdown for modification (other than replacement in kind) is also treated in the sam"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 6657,
      "SummaryText": "e manner.  \nThe Hazard Analysis review was conducted by one of the individuals who reviews risk management plan submissions made to the City of Los Angeles.  It fully complied with the Hazards Analysis required by the U.S. EPA and the State of California.  Several changes were recommended, many of which had to do with improving the existing standard operating procedures. Nearly all of the changes recommended in this review have been accomplished.  The remaining recommended changes, or equivalent changes, will be completed within the next few months.  An inspection of the facility will be performed at that time to confirm that all recommended changes described in the hazard analysis review have been satisfactorily completed.\n\nTHE REQUIRED U.S. EPA  WORST-CASE SCENARIO\nThe distance calculated under a worst case scenario is intended to be used to provide a conservative estimate of the maximum possible area that might be effected under catastrophic conditions.  It is not intended to represent a public danger zone.  \nAmong the reasons that the exposed area may be overestimated, according to the U.S. EPA, are that the weather conditions used in the estimate are uncommon and would probably not last as long as any release would take to travel the estimated distance.  If weather conditions are different, the distance would be much shorter.  For example, if the wind speed is higher or the atmosphere is more unstable, an ammonia release would be dispersed more quickly, the exposure distance would be much smaller, and the exposure duration would be shorter.  Generally, only people downwind from the facility would be at risk if a release occurred.  \nThe worst-case scenario presented in this portion of the submission is for the simultaneous and complete release of the anhydrous ammonia over a ten minute period from the single large container holding this material at the premises.  Please remember that a catastrophic vessel failure is a rare event.  For example, the tank's e"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 6657,
      "SummaryText": "CORPORATE COMMITMENT TO THE COMMUNITY\nPacific Diazo Products Inc. (Pacific Diazo) receives and supplies ammonia in various forms and containers to ammonia users within the wholesale and retail industrial work sectors.  Its products are used by architects and by the blueprint industry, by firms which have combustion systems but want to reduce NOx emissions, and by the janitorial and facility cleaning industry.  Pacific Diazo works only with companies which themselves commit to transport, store, use, and handle ammonia responsibly and shall do so itself.\nPacific Diazo is committed to providing:\n1) A safe working environment for its employees,\n2) A safe living environment for all of the people, including the youngest and oldest inhabitants, and a safe ecology for plants and animals, in each community in which its facilities are located.\nThe process performed at the Fontana facility of Pacific Diazo which is regulated by the U. S. EPA Risk Management Program is:\nThe receipt, storage, and sale of anhydrous ammonia, the use of anhydrous ammonia to make various concentrations (between 19% and 30%) of aqueous ammonia  as well as the receipt, storage, and sale of aqueous ammonia. \nPacific Diazo is committed to ensuring process safety in its operations.  All risk management component elements are integrated together.  They are implemented on an ongoing basis.  All employees understand their responsibilities, the company's internal and external lines of responsibility, and how to communicate within the company and to the external community.  \nPacific Diazo herein restates its policy commitment to reviewing, and as needed, revising the current Accidental Release Prevention and Emergency Response documentation and programs in force at the facility.  If there is a staff, procedure, regulated hazardous material, or equipment change at the facility, the revision guidelines issued by the cognizant agencies shall be followed.  Any revisions made will be promptly communicated to the c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6657,
      "SummaryText": "ognizant regulatory and Emergency Response agencies.  (For example:  to the San Bernardino County Fire Department, the Region VI Local Emergency Response Committee, and the U.S. EPA.)\nIn this summary;  1) We accept the public as a legitimate partner in safety concerns;  2) We shall listen to all expressed concerns;  3) We shall show that we have planned carefully to minimize the public's concerns;  and 4) We are willing to be evaluated and to address any concerns which we have not yet met.\n\nTHE FACILITY\nPacific Diazo occupies the two rear buildings of an eight  building site located at 6183 Sierra Drive;  Fontana, CA, about 0.5 mile NE of the intersection of Highland Avenue (Highway 30) and Sierra Avenue.  Pacific Diazo occupies Buildings 7 and 8, the two furthest from Sierra Avenue.  (The distance to Sierra Avenue is approximately 0.2 mile.)  The anhydrous ammonia tank is located in the rear of Building 8, the furthest building from Sierra Avenue.  The aqueous ammonia tanks and the ammonia converter (i.e., which converts from anhydrous ammonia to aqua ammonia or which dilutes aqua ammonia) are located between the two buildings.  The buildings are used for storage of filled and empty containers, offices, rest rooms, and small quantities of related sanitation and maintenance supplies.\n\nWHAT WE DO AND HOW WE DO IT\nPacific Diazo receives, stores, and distributes anhydrous ammonia and aqua ammonia.  Bulk shipments of anhydrous ammonia and aqua ammonia are received.  DOT-approved cylinders of anhydrous ammonia are filled and sold to clients.  All aqua ammonia containers used are DOT-approved.  These include: totes, drums, carboys, and plastic bottles.  The filled containers are distributed to ammonia users such as blueprint firms, architects, and janitorial firms.  Bulk deliveries of aqua ammonia are also made to specific Pacific Diazo customers.\nPacific Diazo's Safety Standards, Practices, and Procedures meet or exceed those required by the U.S. EPA, OSHA, Cal-OSHA.  Th"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 6657,
      "SummaryText": "arthquake restraints fully satisfy the worst case scenario required by the Seismic Engineer and the rigorous San Bernardino County regulations for protection against seismic upsets.  In this scenario, a catastrophic vessel failure has also been combined with worst-case weather conditions.  This release, if it was to occur as the scenario presents, could have serious off-site consequences.  The ammonia gas plume would go in the direction of the prevailing wind for about four miles.  This event could happen but it is quite unlikely.  \nIn any case, the tank which holds anhydrous ammonia is never filled to capacity, by federal and by state law.  If there were any overfilling attempted, the tank would not accept the excess amount.  The amount used in the worst-case calculation is the amount to which the tank will accept ammonia liquid.  \nMuch of the anhydrous ammonia which escapes from the tank would immediately be absorbed by the soil onto which it runs and it would immediately soak in.  The EPA calculation method does not allow this decrease in the amount vaporized in this worst-case calculation but if this occurs and only half of the released liquid anhydrous ammonia immediately soaks in, the gas plume travel distance decreases to 2.9 miles under worst case weather conditions and to only 0.9 miles with more common weather conditions with a 6.7 mph wind instead of a 3.4 mph wind.\nWe also note that the facility is complying with OSHA and Cal-OSHA Process Safety Management requirements in its anhydrous as well as its aqua ammonia handling because these requirements, while primarily protecting workers, also serve to minimize the chances of an unexpected release of anhydrous or of aqua ammonia.  \n\nMORE REASONABLE ALTERNATIVE SCENARIOS\nThe alternative scenarios considered allow the consideration of a break in an anhydrous ammonia delivery line at the location where anhydrous ammonia cylinders are filled and weighed, and a loss due to a line break in a line coming"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 6657,
      "SummaryText": "from a single aqua ammonia tank (the largest aqua ammonia tank was used in this scenario).  These scenarios were used since they do not minimize the potential impact but are much more likely than the worst-case scenarios.  The ammonia gas plume does not reach as far in these more likely alternative scenarios.  \nIf half of the largest aqua ammonia tank were to be released inside the building where smaller containers are filled, because of delivery pipe corrosion or breakage, with an exterior wind speed of 6.7 mph and an air temperature of 77:F, the plume would extend about 0.7 mile.  If the air temperature were higher, the plume would go a shorter distance.\nIf there were a break or corrosion in the piping or valves which deliver anhydrous ammonia to the inside location at which ammonia cylinders are filled, the plume would also extend about 0.7 mile.  Because there is an excess flow valve in this delivery line, the flow rate is at most 55 gallons per minute.  This release was assumed to extend over a five minute period, since, were it to occur while cylinders are being filled, the immediate (certainly within five minutes) mitigation action would be to close the valve on the delivery line at the outside tank location.  This plume would also travel in the wind direction about 0.9 miles.\n\nSUMMATION\nIt is Pacific Diazo's intent and commitment to be fully in compliance with all applicable regulations and to operate safely.  \nPacific Diazo Products Inc. (Pacific Diazo) repeats its commitment to providing:\na) A safe working environment for its employees,\nb) A safe living environment for all of the people, including the youngest and oldest inhabitants, and a safe ecology for plants and animals, in each community in which its facilities are located.\nPacific Diazo shall endeavor to answer all questions put to it in any public meeting held on this topic."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6657,
      "SummaryText": "20%) when present in amounts greater than 20,000 pounds are subject to the Risk Management Program requirements of the U. S. EPA.  California's Accidental Release Prevention program (CalARP) requires additional risk management actions when even smaller quantities are present.  OSHA and Cal-OSHA require fulfillment of a Process Safety Management (PSM) program when amounts in excess of 10,000 lbs. of anhydrous ammonia are present.  (The OSHA and Cal-OSHA PSM REQUIREMENTS do not include aqua ammonia at concentrations <44%.).\nAmmonia is toxic when inhaled or ingested.  It is an irritant and it attacks mucous membranes, the eyes, and the lungs.  Ammonia is not known to cause chronic effects such as cancer or birth defects.  Immediate First aid for exposure to ammonia is removal to fresh air with a cool or tepid water shower or wash which continues for fifteen (15) minutes.\nLuckily, ammonia has good warning properties.  Most human beings can smell ammonia at concentrations between 5-25 parts of ammonia per million parts of air .  Although the very young and the old and those with certain chronic illnesses (e.g., emphysema) may show effects at somewhat lower levels, healthy adults can be exposed for at least one hour without suffering any irreversible health effects or other symptoms that would make it difficult for the exposed person to escape at the designated exposure level (IDLH) of 500 ppm.  At exposure levels greater than 1,000 ppm of ammonia, more severe reactions or death can occur.\nPacific Diazo Products is proud to say that there has never been an accident with a release of ammonia at any of its facilities which has led to any employee injury or any off-site health or ecological consequence.  The only release of ammonia at the Fontana facility of Pacific Diazo occurred more than five years ago when an attempt by an unknown person was made to steal equipment at the site, with an apparent release of several hundred gallons of aqua ammonia.  The stolen valves were"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6657,
      "SummaryText": "replaced with improved stainless steel valves and the fence-line security was improved.  \nEvery company should continue strive to improve the ways in which it does business.  This is particularly true if its business activities are growing.  Pacific Diazo has, over the past eight months, undertaken additional activities which substantially re-establish, augment, and improve the staff training, equipment quality, and procedures in use at its facilities.  Senior staff has been added to increase the level of experienced support which the company can provide.\n\nPROCEDURES WHICH HELP TO ENSURE SAFE PERFORMANCE OF WORK\nMaterial Safety Data Sheets for anhydrous ammonia and for aqua ammonia are kept at the Fontana facility in the each of the two buildings.  All employees have been instructed in their contents.  Contractors at the site (other than those from ammonia suppliers) are given copies of these MSDSs and the MSDSs are discussed with them prior to permitting them to perform work.  \nThe use of personal protective equipment is required whenever aqua or anhydrous ammonia is being worked with.  (Should this equipment not be in fully functional and excellent working order, the work activity or procedure is not performed.)  The facility is not permitted to operate if electrical power and flowing water are not immediately available.  If either the electrical power supply or the water supply were to stop operating, the facility would immediately cease operation until both are restored to full operating capability.  \nStandard Operating Procedures (SOPs) are also kept at the facility and their use is required by Pacific Diazo employees and by on-site contractors or by suppliers in performance of the following work activities:\n1) Procedure for establishing new standard operating procedures,\n2) Opening up and shutting down activities at the Fontana facility,\n3) Repair and maintenance of aqua and anhydrous ammonia handling equipment,\n4) Monthly preventative maintenance,\n5) Equipme"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6657,
      "SummaryText": "e equipment used at the Fontana facility meets or exceeds the standards of every organization which regulates or sets standards on tanks, valves, lines, detection devices, electrical equipment, and mechanical equipment for use with anhydrous or aqua ammonia.  Delivery vehicles and drivers of Pacific Diazo as well as those of suppliers and customers of Pacific Diazo are required to fulfill the safety standards, practices, and procedures of Pacific Diazo and to have the on-truck safety equipment required by Pacific Diazo's Standard Operating Procedures.  \nAmmonia delivered by Pacific Diazo's suppliers is brought in by tank trucks which deliver it to the rear of the eighth building on the site.  Aqua ammonia is delivered to Pacific Diazo between buildings  7 & 8.  Almost empty cylinders of anhydrous ammonia and filled cylinders of anhydrous ammonia are sent out from all entrances of building 8.  Bulk shipments of aqua ammonia are loaded from between Buildings 7 & 8.  Filled containers of aqua ammonia are sent out from all entrances of both buildings.  In Building 8, cylinders are filled to a tared weight and drums, totes, and other containers are filled to a tared weight.  Building 7 is primarily used for storage and for office space.  Empty containers used for aqua ammonia are washed before being stored for re-use.\n\n\n\nREGULATIONS BEING ADDRESSED AND FULFILLED\nThe activities and processes regulated by the U. S. EPA Risk Management Program at the Fontana facility of Pacific Diazo are the receipt, storage, and sale of anhydrous ammonia, and the use of anhydrous ammonia to make various concentrations (between 19% and 30%) of aqueous ammonia as well as the receipt, storage, and sale of aqueous ammonia.\nAnhydrous ammonia is classified as an Extremely Hazardous Substance by the federal government and by the state of California.  Anhydrous ammonia when present in amounts greater than 10,000 pounds and aqua ammonia (with a concentration of dissolved ammonia gas in excess of"
    }
  ]
}