{
  "FacilityID": 6733,
  "FacilityName": "City of Cloverdale Wastewater Treatment Plant",
  "FacilityStr1": "700 Asti Road",
  "FacilityStr2": null,
  "FacilityCity": "Cloverdale",
  "FacilityState": "CA",
  "FacilityZipCode": "95425",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06097",
  "LEPC": null,
  "FacilityLatDecDegs": "38.795833",
  "FacilityLongDecDegs": "-123.009444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "mitch@netdex.com",
  "FacilityDUNS": 959157157,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Cloverdale",
  "OperatorStr1": "124 North Cloverdale Blvd",
  "OperatorStr2": null,
  "OperatorCity": "Cloverdale",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95425",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tony Villa",
  "RMPTitle": "Treatment Plant Operator",
  "FTE": 2,
  "OtherEPAFacilityID": "SIC CODE 9511",
  "EPAFacilityID": "100000086248",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Dept of Emergency Services",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.79528,
  "FRS_Long": -123.00667,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8104,
      "AltID": "Chlorine",
      "FacilityID": 6733,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8294,
          "ProcessID": 8104,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8911,
          "ProcessID": 8104,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 8912,
          "ProcessID": 8104,
          "ChemicalID": 49,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508911,
          "ProcessID": 8104,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508912,
          "ProcessID": 8104,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6733,
      "SummaryText": "The City of Cloverdale treatment and disposal facilities have been deigned to serve the incorporated community of Cloverdale.  The wastewater treatment plant is a biological treatment type, secondary treatment facility designed for an average dry weather flow of 1.0 million gallons per day.  The treatment plant facilities consist of a headworks, aeration ponds, storage ponds, chlorination equipment, effluent pumping facilities, dechlorination equipment and and effluent outfall.\n\nAs part of the treatment process two regulated substances are used.  They include chlorine and sulfur dioxide.  Clorine is used as part of the treatment process to properly disinfect the plant effluent.  Because of the volume used, chlorine is delivered to the plant in 1 ton cylinders.  The containers are stored inside the plants control building where the gas is piped and mixed with water.  Once mixed the solution is added to  to the plants effluent flow as a disinfecting agent.  Surfur dioxide is used to dechlorinate the chlorinated effluent prior to discharging to the Russian River.  This is only done in times of an emergency when the plant is overburdened with heavy rains and it is projected that the storage ponds will overflow.  The plant is required to obtain State approval prior to river discharge.   Sulfur dioxide is also delivered to the plant in 1-ton cylinders and is stored inside the dechorination building.  As with Chlorine, the sulfur dioxide is mixed with water and the solution is then added to the flow stream.  The removal of the chlorine is necessary to meet Regional Water Quality Control Board requirements established to assure river habitat is not affected.\n\nThe City of Cloverdale aggresively pursues the best practices available when preparing safety and risk management plans for regulated substances as those mentioned above.  In the past five years the wastewater treatment plant has only had minor issues with handling these substances.  One of these included a minor leak "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6733,
      "SummaryText": "of a chlorine container.  It occured when removing the safety cap on a chlorine cylinder to connect it to the outlet piping.  During this process a chlorine smell was noticed.  The plant operaters corrected the minor leak by tightening a loose valve and had the cylinder removed from the site by the supplier for testing. \n\nIn an effort to assure that plant personnel are aware of emergncy procedures when handling regualted substances the City has on site training sessions with the experts from the chemical supply companies.  In addition, included in the plants operation manual is a listing of the emrgency operations to follow in the event of a chlorine or sulfur dioxide leak.  The following outlines the City's emergency response program for the two chemicals:\n\n1.  Get Help.  Never enter the area where chlorine or sulfur dioxide is leaking alone an without notifying  authorities.  Call the police department and fire district.  Notify the Public Works Foreman and the City Manager of the situation.  If the leak is large all persons in adjacent areas should be warned and evacuated by the police.\n2.  Obtain proper safety equipment including self contained air or oxygen supply, tools for repairs and an emergency repair kit.\n3.  Locate a leak by tying a cloth soaked in 26% solution ammonia to the end of a stick and holding it close to the suspected area.  A white cloud will result if there is any chlorine leakage.  Avoid contact of ammonia with brass.  \n4.  Never use water on a chlorine leak.  The corrosive action of chlorine and water will always make the leak worse.\n5.  Describes processes to follow to control leaks in equiipment and pipes, valves and the containers.\n6.  Describes processes to follow to apply first aid to a slight exposure to chlorine or sulfur dioxide.\n7.  Describes processes to follow to apply first aid to a serious exposure to chlorine or sulfur dioxide.\n\nWe have included a worst case scenario which includes a total release of a 1-ton cylinder of chlori"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6733,
      "SummaryText": "ne.  We have also included the same case for the sulfur dioxide which is similar in toxic levels, but is located approximately 1200 feet away.  Under the worst case scenario the 1-ton chlorine cylinder will leak 2000 pounds of chlorine into the buiding over a 10 minute period.  The storage room is not fitted with windows that can be opened and the doors are always closed.  The 4576 cf room does have one manually operated fan which is capable of exchanging the air in the room 13 times per hour.  Following EPA RMP guidelines this leak will release 40 pounds of chlorine per minute and cover a theoretical area of approximately 0.6 miles until its end point is reached.   Within this coverage approximately 1200 people could be affected.\n\nThe reason we state that the coverage area is theoretical is because of a few factors.  First, the treatment facility is located down gradient from neighboring residences.  Since both chlorine and sulfur dioxide are heavier than air they tend to travel along the ground to reach the lowest point which in this case is away from houses and downtown. In addition, in 1995 Caltrans completed the highway 101 bypass of Cloverdale which included a raised section of highway between the plant and populated areas.  Secondly, prevailing winds travel from northwest to southeast.  With the plant being located southeast of residences it is also located down wind.\n\nIncluded in our alternative release scenario is a look at what the coverage area would be if the manual exhaust fans, which are located in both the chlorine room and the dechlorination building, were not turned on.  In this case the same spill would slowly vent through the floor vents in those buildings.  The air exchanges in the rooms would drop significantly to possibly one per hour.  In this scenario the guidlines indicate that the chemicals endpoint would be reached at approximately 0.4 miles and include approximately 500 people.  Again, this coverage area is theoretical and does not take i"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6733,
      "SummaryText": "nto account the factors mentioned above."
    }
  ]
}