{
  "FacilityID": 6737,
  "FacilityName": "Price's Creameries",
  "FacilityStr1": "600 N. Piedras",
  "FacilityStr2": null,
  "FacilityCity": "El Paso",
  "FacilityState": "TX",
  "FacilityZipCode": "79903",
  "Facility4DigitZipExt": "4023",
  "FacilityCountyFIPS": "48141",
  "LEPC": "El Paso City/County LEPC",
  "FacilityLatDecDegs": "31.780222",
  "FacilityLongDecDegs": "-106.460056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 88887757,
  "ParentCompanyName": "Dean Foods",
  "Company2Name": null,
  "CompanyDUNS": 5104815,
  "Company2DUNS": 0,
  "OperatorName": "Price's Creameries",
  "OperatorStr1": "P.O.Box 3008",
  "OperatorStr2": null,
  "OperatorCity": "El Paso",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79923",
  "OperatorZipCodeExt": "3008",
  "RMPContact": "Steve Tullius",
  "RMPTitle": "Plant Manager",
  "FTE": 107,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000089842",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-27 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 31.77994,
  "FRS_Long": -106.46134,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8111,
      "AltID": "Liquid",
      "FacilityID": 6737,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8301,
          "ProcessID": 8111,
          "NAICSCode": "311511",
          "_desc": {
            "NAICS_CODE": "311511",
            "NAICS_DESCRIPTION": "Fluid Milk Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8919,
          "ProcessID": 8111,
          "ChemicalID": 56,
          "Quantity": 13400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508919,
          "ProcessID": 8111,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6737,
      "SummaryText": "\nEXECUTIVE SUMMARY\nDescription of Facility and Regulated Substance Handled:\nPrice's Creameries in El Paso, Texas processes Fluid milk and juices. The facility utilizes anhydrous ammonia as a refrigerant to maintain the proper temperature of milk, yogurt, and milk products within the facility. Anhydrous ammonia is an effective refrigerant that has been used for many years by most food processing facilities. Ammonia is normally a gas at ambient temperatures but is handled as a gas liquefied under pressure. The refrigeration system consists of a high-pressure receiver, evaporators, compressors, piping, and valves. \nAccidental Release Prevention and Emergency Response Policies: Price's Creameries is committed to promoting safety for the plant, its employees and the surrounding area. The facility is complying with OSHA's Process Safety Management Standard (PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA's Risk Management Program regulations (RMP), Title 40 CFR Part 68. The purpose of these programs is to ensure that the refrigeration system is operated safely in order to prevent releases of ammonia from the system. In addition, these programs serve to develop procedures to minimize releases in the event that they do occur and to outline appropriate emergency response steps to take in the event of a release.\nWorst Case Release Scenario: EPA's \"Risk Management Program Guidance for Ammonia Refrigeration\" (November 1998) and the International Institute of Ammonia Refrigeration's (IIAR) Risk Management Guidelines (1998) were the primary documents used to develop the worst case release scenario. The worst case release is one that is unlikely to occur. The purpose of the worst case release analysis is to support a dialogue with the community on release prevention. It is a conservative analysis and is not to serve as a rational basis for actual emergency response planning.\nThe worst case release scenario (as defined by EPA) is the release of the largest quanti"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6737,
      "SummaryText": "ty of ammonia from a vessel or process line failure that results in the greatest distance to a toxic endpoint. The worst case release scenario for the refrigeration process is assumed to be a case where the total quantity of ammonia in our largest vessel is released.  We would never have our largest vessel filled to capacity because of our current administrative controls.  Current administrative controls only allows us to fill the largest vessel to 79% of its capacity.  There are no passive mitigation systems (dikes, berms, drains, sumps or enclosures).\n\n In addition, Dean Foods has installed a sophisticated system of ammonia sensors that can remotely close certain isolation valves in the event of a small release and thereby limit an accidental release of ammonia. These sensors are capable of detecting releases of ammonia at low levels, and are connected to a computer that will shut certain valves to the system if ammonia is detected. In this way, potential releases of ammonia are minimized.\n\nA possible release scenario is one in which the oil level indicating tube, sight glass is broken and the stop check valve fails to operate as designed.   \n\nThe toxic endpoint used for this scenario must be where the ambient concentration of ammonia is 0.14 mg/L or less. This endpoint is a concentration below which nearly all individuals could be exposed to for one hour without serious health effects. Based on RMP Comp. Ver1.06, a release from the largest vessel would result in a situation where public receptors would be within the distance to the toxic endpoint.\nAlternative Case Release Scenario: The alternative case release scenario selected is one in which a liquid level sight tube gets broken. EPA's \"Risk Management Program Guidance for Ammonia Refrigeration\" (November 1998) and the International Institute of Ammonia Refrigeration's (IIAR) Risk Management Guidelines (1998) were the primary documents used to develop the alternative release scenario. The alternative release sc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6737,
      "SummaryText": "enario is one that is more likely to occur than the worst case release scenario.\nThe alternative release scenario must meet two criteria:\n1)     Must be more likely to occur than the worst case scenario, and\n2)     Must reach an endpoint off site, unless no such criteria exist.\n\nThe toxic endpoint used for this scenario must be where the ambient concentration of ammonia is 0.14 mg/L or less. Based on EPA's guidance, the alternative release scenario would result in a situation where public receptors would be within the distance to the toxic endpoint.\n\n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps: As a part of its PSM Program, Price's Creameries has established numerous programs that serve to prevent accidental releases of ammonia. These programs include:\n \nProcess Safety Information\n7 Process Hazard Analysis\n7 Operating Procedures\n7 Training\n7 Mechanical Integrity\n7 Management of Change\n7 Pre-Startup Review\n7 Compliance Audits\n7 Incident Investigations\n7 Employee Participation\n7 Hot Work Permits\nEmergency Response Information: As a part of the PSM Program, the facility maintains an Emergency Response Plan that was prepared in order to improve responsiveness to an emergency incident, and to increase the reliability of actions taken during an incident. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations,notification of local emergency response agencies as well as the public.\n\n"
    }
  ]
}