{
  "FacilityID": 6770,
  "FacilityName": "Kentucky Glass Plant",
  "FacilityStr1": "200 West Loudon Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Lexington",
  "FacilityState": "KY",
  "FacilityZipCode": "40508",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21067",
  "LEPC": "Fayette LEPC",
  "FacilityLatDecDegs": "38.061111",
  "FacilityLongDecDegs": "-84.486944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6386395,
  "ParentCompanyName": "GE Lighting",
  "Company2Name": "General Electric Company",
  "CompanyDUNS": 1367961,
  "Company2DUNS": 0,
  "OperatorName": "Kentucky Glass Plant",
  "OperatorStr1": "200 West Loudon Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Lexington",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "40508",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kim Clawson",
  "RMPTitle": "Manager, EHS",
  "FTE": 172,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000086462",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "Not yet assg'd",
  "SafetyInspectionDate": "1998-05-15 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-09-27 00:00:00",
  "DeRegistrationEffectiveDate": "2010-08-28 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.06139,
  "FRS_Long": -84.48694,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8146,
      "AltID": "HF Acid Storage, etc.",
      "FacilityID": 6770,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8337,
          "ProcessID": 8146,
          "NAICSCode": "32721",
          "_desc": {
            "NAICS_CODE": "32721",
            "NAICS_DESCRIPTION": "Glass and Glass Product Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8954,
          "ProcessID": 8146,
          "ChemicalID": 55,
          "Quantity": 140000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508954,
          "ProcessID": 8146,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6770,
      "SummaryText": "\nINTRODUCTION\n\nThis Risk Management Plan is part of GE Lighting's continuing commitment to minimize the potential impact from our facility on our workers, our community neighbors, or the environment.  It is the stated policy of GE Lighting to safely manage our site operations.  In addition, we have prepared contingency plans to be used in the unlikely event that a major accident should occur. \n\nWe believe it is important for all interested parties to have access to information that can help them better understand our business and our facility.  If you have any questions about this document, or any other aspect of our company or our plans, please contact our Community Relations Representative at (606) 425-1224.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nOur company is committed to operating safe and environmentally sound manufacturing facilities everywhere we do business.  Protection of our neighbors and workers is the highest priority.  This ongoing commitment to worker and public safety is demonstrated through resources invested for safe design, operation, and maintenance of our facilities.  \n\nIn order to provide top quality products for our customers, the GE Lighting Kentucky Glass Plant uses in its manufacturing process a chemical, hydrofluoric acid (HF) that is classified as toxic.  We are committed to complying with governing laws, regulations, and engineering standards as well as systematic assessments to manage and maintain a safe operation when using this chemical.   Our operating practices and procedures ensure that numerous controls are implemented to prevent an accidental release of a chemical.  However, under the unlikely event that a major release would occur, we immediately notify the local Emergency Response Team of the Fire Department. \n\nDESCRIPTION OF THE FACILITY AND REGULATED SUBSTANCES\n\nThe GE Lighting facility located at 200 West Loudon Avenue in Lexington, Kentucky produces glass for light bulbs of various applications in co"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6770,
      "SummaryText": "mmercial and residential use.  One step in producing one line of light bulbs is to \"frost\" the glass in order to provide an opaque type surface on the inside of the bulb to aid in diffusing light from the filament  The Kentucky Glass Plant uses aqueous hydrofluoric acid (HF) in the frosting of light bulb glass.  Hydrofluoric acid is diluted to produce the solutions that are sprayed into the inside of the bulbs. Several steps are required in the frosting operation to initially etch, rinse and then properly fortify the bulbs for strength.\n\nThe HF is received by tanker truck and is transferred to a storage tank that is contained in a totally enclosed building.  When needed, HF is pumped from the storage tank to mixing tanks for dilution to the concentrations needed to produce the proper frosting solutions.  Other ingredients are also added at this time to the solutions.  The solutions are then pumped to holding tanks that supply the spray heads used to frost the glass bulbs.  Spent solutions are neutralized on site. \n\nHAZARD ASSESSMENT RESULTS\n\nAs part of our risk management planning, we have specifically identified the type of event that, should it ever occur, could have the most negative impacts on our workers and our neighbors.  This is known as the Worst-Case Scenario (WCS).   As defined by EPA, we are required to assume that the numerous engineering and administrative safety controls we have in place to prevent or mitigate such accidents have all failed at once. \n\nThis worst-case scenario would involve the release of 70% HF acid from a delivery tank truck at the off-loading area.  A worst-case scenario assumes a catastrophic failure that essentially results in the instantaneous release of the entire tank truck contents.  In this event, that volume is 40,000 pounds of 70% HF acid which would be released into the containment dike.  Under this scenario, the acid is assumed to evaporate and the vapors disperse in the direction of the prevailing wind.  According to EPA"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6770,
      "SummaryText": " guidelines, exposure to HF at levels above 20 parts per million (20 part HF in a million parts of air) approximately one hour can result in serious health effects.   The worst-case scenario estimates that this level of HF concentration could reach public receptors from our site as a result of this quantity of HF being instantaneously released from the delivery tank truck.\n\nA scenario using more realistic assumptions involves the failure of a chemical hose used to transfer the 60% HF fortifying acid solution from a holding tank.  EPA defines this as the Alternative Release Scenario (ARS).  The contents of the tank would drain through the failed hose onto the floor of the mixing room forming a pool that would evaporate. Travel of the vapors would be limited in this scenario due to the building enclosure.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM/ CHEMICAL-SPECIFIC PREVENTION STEPS\n\nGE Lighting has a comprehensive program to prevent accidental releases of highly hazardous chemicals at its Kentucky Glass Plant.  This prevention program is an integral part of working safely at GE Lighting.  The prevention program ensures that proper safety information is in place; operating procedures are followed; chemical hazards are identified; employees and contractors are trained; and critical equipment is properly inspected and maintained.  Our prevention program meets all aspects of the accidental release prevention program requirements of the EPA's Risk Management Program.\n\nGE Lighting is engaged in an aggressive and comprehensive effort to identify and address Year 2000 issues.  We are in the process of inventorying our equipment at the site, interviewing suppliers, putting into place corrective actions where necessary, and developing a contingency plan.  We are on track to complete this process prior to the critical roll-over date and believe we have addressed the systems and equipment necessary for safe site operation.\n\nIn addition to assuring that all aspects of our ope"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6770,
      "SummaryText": "ration are Year 2000 compliant, there are many specific safety features in place at the facility.  Some of the features in place at the Lexington GE Lighting facility to prevent a chemical accident include:\n\nSafety procedures that reduce the potential for human error which could lead to a storage tank overfill;\nSecondary containment dike at the tank truck off-loading area to contain the full content of the tank truck;\nSecondary containment dikes around the chemical storage tanks to contain a spill;\nFull enclosure of the storage tanks in a separate on-site building;\nOperation of four fume scrubbers which serve vents located within the chemical storage and working areas;  \nDocumented maintenance and replacement histories for chemical hoses;\nExtensive safety information about the processes available to employees;\nWritten operating procedures that identify plant policies on emergency response actions;\nComprehensive employee and contractor training programs to promote consistently safe work-practices;\nScheduled maintenance programs to ensure equipment reliability - includes equipment testing and inspection;\nCompliance auditing to ensure standards are being followed;\nA safety procedure to review proposed plant modifications before they are implemented for possible hazards; and\nSafety reviews prior to startup of our processes. \n\nFIVE YEAR ACCIDENT HISTORY\n\nThe Kentucky Glass Plant has an outstanding record of accident prevention which demonstrates its commitment to public and worker safety.  Even minor incidents are investigated to identify what went wrong and to learn how to prevent future occurrences.  \n\nThe RMP requires that all incidents involving regulated chemicals that resulted in any off-site impact or significant on-site impact be reported in this document.  GE Lighting has had no releases of HF acid within this 5-year history that resulted in any on-site or off-site impacts as defined by EPA. \n\nPARTICIPATION IN EMERGENCY RESPONSE \n\nThe Kentucky Glass Plant is inc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6770,
      "SummaryText": "luded in the community response plan of the local fire department and its emergency response team.  Also, we are represented on the Local Emergency Planning Committee (LEPC).  The Plant has participated and will continue to participate with these entities in mock emergency response drills at the plant in order to facilitate any future response needs.    \n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nGE Lighting is committed to continuously improving the overall safety and environmental performance record at the Kentucky Glass Plant.  Some of the specific planned changes aimed at improving safety are:  \nContinuing development of best management practices as we pursue recognition under OSHA's Voluntary Protection Program (VPP); \nEvaluation of the current fume scrubber system and repair and replacement as needed;\nEvaluation of additional ventilation in the mixing area and other areas of the Frost Department that will allow for enclosing this area to mitigate exposure both on-site and off-site under the unlikely event of a worst-case release; and\nUse of hard piping in place of hoses where possible."
    }
  ]
}