{
  "FacilityID": 6886,
  "FacilityName": "City of Manhattan Water Treatment Plant",
  "FacilityStr1": "330 Bertrand",
  "FacilityStr2": null,
  "FacilityCity": "Manhattan",
  "FacilityState": "KS",
  "FacilityZipCode": "66502",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20161",
  "LEPC": null,
  "FacilityLatDecDegs": "39.2",
  "FacilityLongDecDegs": "-96.566667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": "www.ci.manhattan.ks.us",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Manhattan",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Manhattan",
  "OperatorStr1": "1101 Poyntz Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Manhattan",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66502",
  "OperatorZipCodeExt": "5497",
  "RMPContact": "Ronald R. Fehr",
  "RMPTitle": "Assistant City Manager",
  "FTE": 15,
  "OtherEPAFacilityID": "KS2016112",
  "EPAFacilityID": "100000086612",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-03-17 00:00:00",
  "SafetyInspectionBy": "Oak River Insurance Co.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-12-30 00:00:00",
  "DeRegistrationEffectiveDate": "2011-12-07 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.2,
  "FRS_Long": -96.56667,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8283,
      "AltID": null,
      "FacilityID": 6886,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8474,
          "ProcessID": 8283,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9113,
          "ProcessID": 8283,
          "ChemicalID": 62,
          "Quantity": 11000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509113,
          "ProcessID": 8283,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6886,
      "SummaryText": "Release prevention and emergency response policies\n The City of Manhattan takes an active role in preventing accidental releases at this facility by ensuring that its employees are properly trained in the safe operation and maintenance of processes subject to the Part 68 rule.  They are also trained in the safe handling of all chemicals that are regulated substances under the rule.\nThe City has also developed and maintained a risk management policy that contains general safety rules.  Although these general rules do not specifically address the covered processes and their regulated substances, compliance with the general rules will significantly reduce the potential for accidental release of these substances.  \nAs for emergency response, the City has established and maintained procedures for emergency notification and response.  These are reviewed with employees on a periodic basis and revised to accommodate changes in staffing when they occur.  Employees at this facility would not respond to a significant release of the regulated substance (chlorine) but would immediately notify the Fire Department.  Employees of the facility would take measures to stop very small leaks.\nCity management understands its duty to provide a safe working environment at this facility and to take measures to prevent accidents that may have an effect on the surrounding community.  This understanding is reflected in procedures described and referenced in this document.\n\nFacility and regulated substance\nThe City of Manhattan WTP treats ground water from a wellfield near the Big Blue River to provide drinking water to the community.  It does this through a series of physical and chemical treatment operations that include flocculation and sedimentation, disinfection, and final filtration.  The treated water, now ready for use by the public, is transferred to a large reservoir and pumped into the distribution system.  The design capacity of the treatment plant is 20 million gallons per day. \nTh"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6886,
      "SummaryText": "e regulated substance stored, handled, and used at this facility is chlorine.  The chlorine is stored in 150-pound cylinders with a maximum intended inventory of 74 cylinders on site.  All of the cylinders are stored inside of a building.\n\nWorst-case and alternative release scenarios\nThe worst-case release scenario involves the largest storage container on site, one of many 150-pound cylinders of chlorine.  The scenario assumes that the cylinder is full at the time of release, the release occurs outside, there is no passive mitigation to consider, and release duration is ten minutes.\nFor the analysis, the EPA's Risk Management Program Guidance for Wastewater Treatment Plants was used.  The results were verified using RMP*Comp, which is based on the formulae used in the guidance document.  The distance to endpoint for this worst-case release is calculated at 0.4 mile.  Residential population within the radius of the endpoint distance is 280. \nThe alternative release scenario assumes the same physical parameters except that the release duration is sixty minutes.  Under this scenario, the distance to endpoint is calculated at 0.1 mile.  Residential population within the radius of the endpoint distance is 60.  The same guidance documents were used. \n\nAccidental release prevention program\nThe prevention program elements that are most critical in preventing accidental releases in this facility include on-the-job employee training, written operating procedures for all to use who operate or maintain the covered process; and a process equipment preventive maintenance program. \nShould the prevention program fail to prevent a release, the facility is equipped with engineering controls designed to minimize the affect of the release on the surrounding community.  These include a vacuum regulator close to the storage containers and an alarm to warn employees of a leak.  The chlorine storage containers are kept inside of a building to mitigate the effects of a release.\n\nFive-year "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6886,
      "SummaryText": "accident history\nThere has been no accidental release of a regulated substance from this facility in the past five years that meets the requirements of 40 CFR 68.42(a).\n\nEmergency response program\nThis facility has established and maintains an emergency action plan that is coordinated with local response agencies.  The goals of the program are to protect onsite employees from the hazardous effects of the releases and to minimize the effects of releases on the general public.  The program is routinely reviewed and updated to reflect personnel and regulatory changes.\nThe action plan includes procedures for emergency recognition, continuation of critical plant operations, and employee evacuation.\n\nPlanned changes to improve safety\nIdeas for changes to improve safety are actively sought from employees.  Employee meetings that focus on safety issues are held at this facility, and employees are trained to recognize hazards and present ideas to eliminate them or to minimize the potential consequences of those hazards.\nDuring the development of this RMP document, a hazard review was conducted with key employees to meet the prevention program requirements.  During these sessions, recommendations were made for the purpose of improving safety and preventing accidental chemical releases.  Each recommendation has been or will be considered for implementation.  Though not all recommendations may be implemented, the exercise will provide all affected employees with a heightened awareness of safety issues related to the covered process."
    }
  ]
}