{
  "FacilityID": 6902,
  "FacilityName": "Magnolia Waste Water System",
  "FacilityStr1": "72 Columbia 300",
  "FacilityStr2": null,
  "FacilityCity": "Magnolia",
  "FacilityState": "AR",
  "FacilityZipCode": "71753",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05027",
  "LEPC": "Columbia County LEPC",
  "FacilityLatDecDegs": "33.266667",
  "FacilityLongDecDegs": "93.266667",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "OT",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "www.mwws@magnilia-net.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Magnolia, Arkansas",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Magnolia",
  "OperatorStr1": "72 Columbia 300",
  "OperatorStr2": null,
  "OperatorCity": "Magnolia",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "71753",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Richards",
  "RMPTitle": "Safety Officer",
  "FTE": 7,
  "OtherEPAFacilityID": "AR0043613",
  "EPAFacilityID": "100000086033",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-05 00:00:00",
  "SafetyInspectionBy": "AR DEQ",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.26583,
  "FRS_Long": -93.27278,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8302,
      "AltID": null,
      "FacilityID": 6902,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8493,
          "ProcessID": 8302,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9137,
          "ProcessID": 8302,
          "ChemicalID": 62,
          "Quantity": 4150.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509137,
          "ProcessID": 8302,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 8303,
      "AltID": null,
      "FacilityID": 6902,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8494,
          "ProcessID": 8303,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9138,
          "ProcessID": 8303,
          "ChemicalID": 49,
          "Quantity": 4150.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509138,
          "ProcessID": 8303,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6902,
      "SummaryText": "The Magnolia Wastewater Treatment Plant facility uses both Chlorine and Sulfur Dioxide, which are considered hazardous by EPA.  The same properties that make Chlorine and Sulfur Dioxide valuable as water treatment chemicals also make it necessary to observe certain safety precautions in handling both materials.   The prevention of unnecessary human exposure reduces the threat to the health and safety of employees as well as to nearby members of the community.  The primary goal of this Risk Management Plan is to ensure the safety of the employees of this facility and all residents that may be impacted by a release from this facility.\n\nIt is the policy of the City of Magnolia to adhere to all applicable federal and state rules and regulations.  Safety depends upon the manner in which Chlorine and Sulfur Dioxide are handled, the safety devices inherent in the design of the facility, and the training of the personnel.\n\nThis Risk Management Program, including the  Emergency Response Program, was developed with the assistance of ALTEC Environmental Consultants, Inc. and NRS Consulting Engineers, Inc.  The Emergency Response Plan includes procedures for notification of the appropriate agencies and potentially affected members of the community.  In addition, it provides procedures for mitigating any releases that may cause harm to the community.\n\nThe primary purpose of this facility is to treat the wastewater by utilizing chemicals such as Chlorine and Sulfur Dioxide.  Chlorine and Sulfur Dioxide are received in individual one-ton cylinders and stored until needed.  Chlorine and Sulfur Dioxide are injected into the wastewater treatment system by automatic feeders. The feed system uses a vacuum \"shut-off\" system which is designed to automatically shut the system down if a leak occurs. \n\nAccess to the site is restricted to authorized facility employees, authorized management personnel and authorized contractors.\n\nThe regulated substances handled at this facility are Chlorine "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6902,
      "SummaryText": "and Sulfur Dioxide.  The maximum amount of both Chlorine and Sulfur Dioxide stored at this facility is 4,150 pounds.\n\nThe worst-case scenario is failure of and total release from the largest storage tank when filled to capacity, resulting in a release of 2,000 pounds of Chlorine.  Both Chlorine and Sulfur Dioxide create a hazard when released.  They are both toxic materials, with the same distances to their endpoint based on EPA's document entitled \"Back Up Information For The Hazard Assessment in the RMP Offsite Consequence Analysis Guidance.\"   However, as Chlorine is the more toxic of the two chemicals, a worst-case scenario for Chlorine has been used.  \n\nActive mitigation has been considered for this scenario.  The Chlorine storage tanks are located in the Chlorine Cylinder Room which is constructed of a concrete wall on two sides and two open sides.  It is assumed that the entire contents of a tank are released as a vapor.  The distance to the endpoint of 0.0087 mg/l for the worst-case scenario is 1.3 miles.\n\nAn alternative scenario was determined for this facility.  However, the alternative release should be minimal due to the type of control system in place.  The vacuum \"shut-off\" system has been determined to be effective in preventing greater than small quantities of Chlorine and Sulfur Dioxide from being released.  Estimations based on the line capacity for the feeder lines would be approximately 10 pounds released into the atmosphere under this scenario.  This quantity of Chlorine or Sulfur Dioxide vapor release would result in a distance to endpoint of approximately 0.1 of a mile.\n\nThis wastewater treatment facility complies with EPA's Accidental Release Prevention Rule and with all applicable State of Arkansas codes and regulations.\n\nThere have been no accidental releases of Chlorine or Sulfur Dioxide in the last five years.\n\nThe Emergency Response Program was developed for the City of Magnolia and the surrounding areas with the assistance of NRS Consul"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6902,
      "SummaryText": "ting Engineers, Inc.  This program has been discussed with the Arkansas Office of Emergency Preparedness and the Magnolia Fire Department.  \n\nThe Chlorine and Sulfur Dioxide feed systems were constructed at this facility in 1987 and meet all design requirements for and comply with all applicable regulations for wastewater treatment facilities."
    }
  ]
}