{
  "FacilityID": 6919,
  "FacilityName": "Lewisburg Wastewater Treatment Plant",
  "FacilityStr1": "401 Woodside Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Lewisburg",
  "FacilityState": "TN",
  "FacilityZipCode": "37091",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47117",
  "LEPC": "Marshall County LEPC",
  "FacilityLatDecDegs": "35.452889",
  "FacilityLongDecDegs": "-86.780861",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PP",
  "FacilityURL": null,
  "FacilityEmailAddress": "lww@tnweb.com",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Gerald Greggs",
  "OperatorStr1": "P.O. Box 2787",
  "OperatorStr2": null,
  "OperatorCity": "Lewisburg",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37091",
  "OperatorZipCodeExt": null,
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000087461",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-01-06 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2013-10-17 00:00:00",
  "DeRegistrationEffectiveDate": "2013-07-01 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.452889,
  "FRS_Long": -86.780861,
  "FRS_Description": "PLANT ENTRANCE (PERSONNEL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA OFF)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8320,
      "AltID": null,
      "FacilityID": 6919,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 9156,
          "ProcessID": 8320,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 9157,
          "ProcessID": 8320,
          "ChemicalID": 49,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8511,
          "ProcessID": 8320,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3644,
              "Process_NAICS_ID": 8511,
              "SafetyReviewDate": "1997-09-30 00:00:00",
              "PHA_Date": "1997-09-30 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1997-09-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1997-09-30 00:00:00",
              "TrainingReviewDate": "1998-07-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1997-09-30 00:00:00",
              "EquipmentInspectionDate": "1999-05-12 00:00:00",
              "EquipmentTested": "chlorination equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1995-02-22 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1997-09-30 00:00:00",
              "HotWorkPermitReviewDate": "1997-09-30 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4159,
                  "PreventionProgram3ID": 3644,
                  "ProcessChemicalID": 9156
                },
                {
                  "PrimaryKey": 4160,
                  "PreventionProgram3ID": 3644,
                  "ProcessChemicalID": 9157
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6919,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1997-09-30 00:00:00",
    "ERTrainingDate": "1999-05-12 00:00:00",
    "CoordinatingAgencyName": "Marshall Co. Emergency Management",
    "CoordinatingAgencyPhone": "9313595810",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6919,
      "SummaryText": "LEWISBURG WASTEWATER PLANT\n\tEXECUTIVE SUMMARY\n\n\n\nA.  The Lewisburg Wastewater Treatment plant (LWW) accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices.\nAll applicable procedures of the U.S. Environmental Protection Agency (EPA) Prevention Program are adhered to.  The LWW emergency response policy involves the preparation of response plans which are tailored to the facility and to the emergency response services available in the community, and is in compliance with the EPA Emergency Response Program requirements.\n\nB.  The LWW treatment system has been installed to disinfect the flow into the Lewisburg Wastewater System Plant located at 401 Woodside.  The wastewater comes into LWW Plant, is treated, and flows out into Rock Creek.  The treatment process includes the use of chlorine and sulfur dioxide. Both chlorine and sulfur dioxide are housed together in an enclosed building.  The building contains three (3) ton cylinders of chlorine, and three (3) ton cylinders of sulfur dioxide.  Various types of safety equipment, monitoring devices, and control devices are housed within the building, as well as access to safety equipment inside and outside the building.  The facility is monitored eight (8) hours daily by on site personnel and on computer telemetry monitoring 24 hours, 7 days a week.\n\nC.1  The offsite consequence analysis includes consideration of two (2) chlorine scenarios identified as \"worst case release\" and \"alternative release\" as well as consideration of two (2) sulfur dioxide scenarios also identified as \"worst case release\" and \"alternative release\"\nThe first scenario as defined by EPA, which states the \"the owner or operator shall assume that the...maximum quantity in the largest vessel...is released as a gas over 10 minutes\", due to an unspecified failure.  The alternative scenario is defined as \"more likely to occur than the worst case scenario.\"\n\nAtmospheric dispersion mo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6919,
      "SummaryText": "deling has to be performed to determine the distance traveled by the chlorine and sulfur dioxide released before its concentration decreases to the \"toxic endpoint\" selected by EPA of 3 ppm, which is the emergency Response Planning Guideline Level 2 (ERPG-2).  This is defined by the American Industrial Hygiene Association (AIHA) as the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\"  \nThe residential population within a circle with a radius corresponding to the toxic endpoint distance has to be defined,\"to estimate the population potentially affected.\"\n\nThe worst case scenario at the Lewisburg Wastewater Plant involves total loss of ton cylinder during delivery of chlorine, dropping a one ton cylinder onto concrete from 5 feet during unloading, shearing valve.  The offsite worst consequence analysis for this scenario was performed by EPA's RMP Comp Program including worst case scenarios for chlorine.  The conditions pre-defined by EPA, namely release of the entire amount as a gas in 10 minutes, use the one hour average as the toxic endpoint, and consideration of the population residing within a full circle radius corresponding to the toxic endpoint distance.  EPA mandated meteorological\nconditions, namely Stability F, wind speed of l.5m/sec, and 77 F.\n\nC1.1 When atmospheric dispersion modeling for the worst case scenario was performed on chlorine using the EPA assumptions, a distance to toxic endpoint of 0.9 miles (1.4km) and an estimate of residential population potentially affected of 3,893 was obtained.\n\nC1.2 The alternative release scenario involves a leaking valve on a one (1) ton chorine cylinder.  The chlorine released is 1800 pounds, at an average rate of one hour, of 30 pounds/minute.  Toxic endpoints were obtained using EP"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6919,
      "SummaryText": "A RMP COMP Program.  The EPA mandated meteorological conditions used were Stability Class D, wind speed 3 meters/second, average air temperature of 77 F.  The estimated distances traveled to toxic endpoint 0.1 miles (0.2km).\n\nActivation of the two (2) chlorine detectors is an active mitigation measure that should be considered.  Both chlorine monitors will detect chlorine and give an alarm at 1 ppm and above.  Both monitors are connected to the telemetry system for a remote monitoring system. A fixed chlorine monitor is located in the chlorine cylinder storage room and  the feeding room.  \n\nAn additional active  mitigation system installed is the conversion of the existing chlorinators to a remote vacuum type with all pressurized chlorine piping replaced with vacuum piping.  This will almost eliminate a release of chlorine( <5 lbs.) in case of pigtail rupture.  The vacuum regulator on chlorine cylinders is designed by the manufacturer to automatically shut off flow of gas upon detection of a vacuum leak within the process feed system.\n\nC2  The worst case scenario at the LWW involves the loss of one (1) ton cylinder during delivery of sulfur dioxide, dropping a one ton cylinder onto concrete from five (5) feet, shearing the valve.  The offsite worst consequence analysis for this scenario was performed by EPA's RMP COMP Program including worst case scenario for sulfur dioxide.  The conditions pre-defined by EPA, namely the release of the entire amount as a gas in 10 minutes, use the one (1) hour average as the toxic endpoint, and consideration of the population residing within a full circle radius corresponding to the toxic endpoint distance.  EPA mandated meteorological conditions namely Stability F, wind speed of 1.5 m/sec, and 77 F.\n\nC2.1 When atmospheric dispersion modeling for the worst case scenario was performed on sulfur dioxide using the EPA assumptions, a distance to toxic endpoint of 0.9 miles (1.4km) and an estimate of residential population affected of 3,"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6919,
      "SummaryText": "893 was obtained.\n\nC2.2 The alternative release scenario involves a leaking valve on a one (1) ton sulfur dioxide cylinder.  The sulfur dioxide release is 1800 pounds, at an average rate of one hour, of 30 lbs./minute.  Toxic endpoints were obtained using  EPA's RMP COMP Program.  The EPA mandated meteorological conditions used were Stability Class D, wind speed 3 meters/second, average air of temperature 77 F.  The estimated distance traveled 0.1 miles(0.2km).\n\nActivation of the sulfur dioxide detector is an active mitigation measure that should be   considered. The sulfur dioxide monitor located in cylinder storage room will detect sulfur dioxide and give warning at 2ppm and alarm at 5ppm.  This monitor is connected to the telemetry system for a remote monitor capability.  \n\nAn additional mitigation system installed is the conversion of the existing sulfur dioxide to remote vacuum type, with all pressurized chlorine gas piping replaced with vacuum piping.  This will almost eliminate the amount of sulfur dioxide released in case of pigtail rupture.  The vacuum regulator in sulfur dioxide cylinders is designed by the manufacturer to automatically shut off the flow of gas upon detection of a vacuum leak within the process feed system.\n\nD.  The general LWW accidental release prevention program is based on the following key elements:\n\n     -High level of training of the operators\n     -Preventative maintenance programs\n     -Use of state-of-the- art process and safety equipment\n     -Use of accurate and effective operating procedures, written with the participation of the                operators.\n     -Performance of a hazard review of equipment and procedures\n     -Implementation of an auditing and inspection program.\n\nChemical specific prevention steps include availability of self-contained breathing apparatus (SCBA), awareness of the hazardous and toxic properties of chlorine and sulfur dioxide, as well as proper training of on site personnel in case of release."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6919,
      "SummaryText": "E.  No accidental releases of chlorine or sulfur dioxide have occurred at this facility in the past 5 years.\n\nF.  The facility has an emergency response program coordinated with LEPC, Fire Department, and Police Department depending upon the size of the leak, weather conditions, wind speeds and direction.  If advanced level of technical assistance is deemed necessary to control leak, Chemtrec may be called to give advice and assistance via 24 hour emergency number.  PB & S\nChemical has a team that can be activated with a one hour notice 24 hours a day.  A mock emergency response drill for chlorine loss has been conducted on site, where current response and emergency operations were utilized.\n\nG.  We have in place a chlorine and sulfur dioxide emergency action and process safety management plan dated September 30, 1997.  No revisions have been found necessary at this time.  Mock emergency drills proved the plan in place was efficient and thorough."
    }
  ]
}