{
  "FacilityID": 6935,
  "FacilityName": "Johnson Controls, Inc",
  "FacilityStr1": "1147 N. Washington",
  "FacilityStr2": null,
  "FacilityCity": "Greenfield",
  "FacilityState": "OH",
  "FacilityZipCode": "43160",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39071",
  "LEPC": "Highland County LEPC",
  "FacilityLatDecDegs": "39.355556",
  "FacilityLongDecDegs": "-83.388889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6556849,
  "ParentCompanyName": "Johnson Controls, Inc",
  "Company2Name": null,
  "CompanyDUNS": 199558404,
  "Company2DUNS": 0,
  "OperatorName": "Johnson Controls, Inc",
  "OperatorStr1": "49200 Haylard Drive",
  "OperatorStr2": "PO Box 8010",
  "OperatorCity": "Plymouth",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48170",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael Meadows",
  "RMPTitle": "Environmental Coordinator",
  "FTE": 250,
  "OtherEPAFacilityID": "45123JHNSN1147N",
  "EPAFacilityID": "100000085169",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0536010034",
  "SafetyInspectionDate": "1998-09-01 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Greenfield",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-09-09 00:00:00",
  "DeRegistrationEffectiveDate": "2009-07-17 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.35556,
  "FRS_Long": -83.38889,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8344,
      "AltID": "TDI",
      "FacilityID": 6935,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8537,
          "ProcessID": 8344,
          "NAICSCode": "33636",
          "_desc": {
            "NAICS_CODE": "33636",
            "NAICS_DESCRIPTION": "Motor Vehicle Seating and Interior Trim Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9181,
          "ProcessID": 8344,
          "ChemicalID": 77,
          "Quantity": 430000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 77,
            "ChemicalName": "Toluene diisocyanate (unspecified isomer)  [Benzene, 1,3-diisocyanatomethyl-]",
            "CASNumber": "26471-62-5",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509181,
          "ProcessID": 8344,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6935,
      "SummaryText": "\nJOHNSON CONTROLS INC. GREENFIELD, OHIO\n\n1.    EXECUTIVE SUMMARY\n\nJohnson Controls, Inc. (JCI) owns and operates a foam seat manufacturing facility located in Greenfield, Ohio (JCI-Greenfield).  On site, JCI-Greenfield has four 5,000, two 3,500 gallon storage tanks and three 60 gallon day tanks which store Toluene Diisocyanate (TDI), a regulated hazardous substance, for the manufacturing of polyurethane foam car seats.  In addition, JCI-Greenfield may have a 20,000 gallon rail car on site also storing TDI.  The maximum intended inventory of TDI on site is above the threshold quantity of 10,000 pounds listed in 40 C.F.R. ' 68.130.\n\nSince the quantity of TDI exceeds the threshold quantity, JCI-Greenfield is required to implement a Risk Management Program (RMP).  JCI-Greenfield is subject to Program Level 2 requirements.  This submission of RMPSubmit presents the details of the RMP compliance measures conducted by JCI-Greenfield.  The required RMP information was electronically submitted to the United States Environmental Protection Agency (U.S. EPA) in a timely manner before the deadline of June 21, 1999.\n\nRMP Submit defines minimum and maximum values that can be entered.  Specifically, limitations exist for the release rate (Section 2.6), release duration (Section 2.7), toxic endpoint distance (Section 2.11).  Due to these limitations, JCI-Greenfield was forced to use the default (inaccurate) value for the release duration for this submittal rather than the more accurate values utilized by the ISCST3 model.  The following table compares this value.\n\nTable 1.  Difference Between RMP Submit Values and Actual Modeled Parameters\n\n\n            RMP Submit Default Value    Actual (Correct) Modeled Value\n\nRelease Duration        9999.9 min                6.46x10+5 min\n\n\n1.1    Accidental Release Prevention and Emergency Response Policies\nAt JCI-Greenfield, certain precautions, such as implementing engineering controls, and wearing appropriate personal protective equipment, including respiratory protection if e"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6935,
      "SummaryText": "xposure limits may be exceeded, are taken when handling TDI itself or equipment that has been in contact with the chemical.  In order to prevent accidental release of the chemical from various sources, numerous safety procedures have been enacted to ensure the maximum safety of the employees working with TDI and the population surrounding the plant.  Employees of the plant have been trained in the proper handling of TDI and in the actions to be taken in case of an accidental release.\n\nThe JCI-Greenfield facility has a maximum intended on-site inventory of 426,905 lbs of TDI.  The largest spill would be a release from the rail car.  The rail car unloading area is designed such that a release will be directed to grates that would transfer the liquid release to a holding pond approximately 27 meters from the unloading area.  The pond is designed to contain the entire contents of a rail car.  In addition, safety measures that have been taken include informing the plant population of the hazards of the chemical, and making sure that proper procedures in the maintenance of the TDI equipment, such as pumps, filters, and valves, have been followed and adhered to.\n\nJCI-Greenfield's emergency response policies have been designed to comply with all applicable state and federal regulations.  These policies also summarize the actions that need to be taken in response to a chemical release.\n\n1.2    Description of JCI-Greenfield and the Regulated Substance Handled\nJCI-Greenfield, a QS-9000 certified facility, produces molded polyurethane foam for automotive seating applications.  Foam production is a result of a specific blend of chemicals, including TDI, which are poured into specially designed molds.  Once the foam is inspected for imperfections, it is moved to the cloth covering area by a conveyor system, where it is covered by cloth and attached to the metal frame of the seat and then packed and shipped to JCI customers.\n\nThe regulated substance handled at this facility is Toluen"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6935,
      "SummaryText": "e Diisocyanate (unspecified isomers) [Benzene, 1,3-diisocyanatomethyl-].  The maximum amount of TDI that can be stored in the plant (i.e., not including the rail car) is 407,905 pounds.\n\n1.3    Worst Case and Alternate Release Scenarios\nSection ' 68.25 of the RMP Regulation defines a worst-case scenario as a release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to a specified endpoint.  All releases are assumed to take place at ground level for the worst-case and alternate case scenarios.\n\nAt JCI-Greenfield, the worst-case scenario is identified to be the release of the largest tank of TDI.  The rail car is assumed to instantaneously release the entire contents in a worst-case accidental release scenario. The TDI will be directed to grates that would transfer the liquid release to a holding pond and volatilize into the atmosphere.  The rate of vaporization into the atmosphere was found to be 0.294 lb/min.\n\nModeling of this release was performed using the EPA's dispersion modeling software ISCST3 and shows that the toxic endpoint will affect residential populations.  Because the worst case release of TDI has offsite impact, JCI-Greenfield qualifies for Program Level 2 of the Risk Management Program.\n\nThe alternative release scenario is based on the rupture of the rail car unloading line.  This failure will assume that TDI would be released from the line forming a liquid pool.  The characteristics of the release are the same as for the worst case release scenario (i.e., storage and chemical properties).  Further, the same methods for determining evaporation rate and endpoint distance will be used for the alternative case.  The alternative case release scenario does not result in any offsite impacts. \n\n1.4    The General Accidental Release Prevention Program and Chemical Specific Prevention Steps\nJCI-Greenfield has specific process controls in place to minimize the risks of spills.  All chemical s"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6935,
      "SummaryText": "torage tanks are located indoors, above ground with secondary containment.  Tanks critical to the process have level sensors to prevent any tank from being overfilled.  Fill duration is also monitored during the transfer of TDI to the process lines and if not satisfied within a set time period, auto filling ceases and an alarm is activated.  Chemical wet systems are equipped with high and low-pressure switches to shut down in the event of a line rupture.  Critical valves are monitored electronically as to open/closed positioning.\n\nJCI-Greenfield has a preventative maintenance software program in place to address maintenance of all vital parts of the plant's day to day operations.  Specific environmental issues are also addressed with this computer driven program.\n\nJCI-Greenfield has established an Air Monitoring Program that monitors the airborne concentration of  TDI within the production facility.\n\nProperty Conservation and Risk Management audits are conducted annually by Factory Mutual Risk Appraisers as well as Environmental audits by the JCI corporate environmental department located  in Plymouth, Michigan.\n\n1.5    Five-Year Accident History\nIn the past five years, there have been no accidental releases of TDI at JCI-Greenfield.\n\n1.6    The Emergency Response Program\nJCI-Greenfield's emergency response policies have been designed to comply with all applicable state and federal regulations.  These policies summarize the actions to be taken in response to a chemical release.  In the event of a release, the HazMat Team will respond using appropriate actions, as described in the Environmental Spill Contingency Plan, in association with the local fire department and Clean Harbors Environmental Services Companies.\n\nJCI-Greenfield has established a spill response team (HazMat Team) and has assigned specific duties and responsibilities to specific individuals, like the spill Incident Commander, who have been selected and trained to respond to in-house chemical releases.  If "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6935,
      "SummaryText": "necessary, the appropriate outside facilities, such as the hospital or nearby residences and businesses, will be notified.  Employees are and will be trained in the safe handling and management of hazardous materials, respiratory protection, confined space entry, transportation of dangerous goods, and in the emergency response procedures to be taken in the event of an accidental release.\n\nAll spills that take place at the Greenfield facility must be documented and reported to the appropriate personnel.  The reporting allows the number and type of spills that occur to be tracked.  This in turn allows measures to be implemented to prevent similar spills from occurring in the future.  Spills exceeding the reportable quantity must be reported to certain regulatory agencies.\n\nIf a release of 10 gallons or more of TDI has occurred, JCI informs Bayer Corporation, the supplier of TDI, of the accidental release and inquires about assistance and advice.\n\n1.7    Planned Changes to Improve Safety\nJCI-Greenfield is committed to continuous improvement in all aspects of its operation, including safety.  As such, JCI-Greenfield strives to take a proactive approach to ensure employee safety, health and wellness and to protect the environment.\n\nJCI-Greenfield conducts routine inspections and audits to ensure safe work conditions and compliance to applicable regulations.  These inspections and audits may be conducted by internal personnel from various levels of the organization (line employee to plant manager), by JCI personnel from other locations, or by outside consultants.  Results of the inspections and audits are documented and communicated, and action plans are developed to correct noted deficiencies.\n\nA Process Hazard Analysis (PHA) was recently performed at the Greenfield facility.  Recommendations from that PHA are being implemented which will improve the safety of the TDI process, as well as reduce the likelihood and magnitude of any TDI spill.\n\n"
    }
  ]
}