{
  "FacilityID": 6988,
  "FacilityName": "Brennan Water Treatment Plant",
  "FacilityStr1": "3651 LPGA Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Daytona Beach",
  "FacilityState": "FL",
  "FacilityZipCode": "32115",
  "Facility4DigitZipExt": "2451",
  "FacilityCountyFIPS": "12127",
  "LEPC": "District 6 LEPC",
  "FacilityLatDecDegs": "29.186028",
  "FacilityLongDecDegs": "-81.117639",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.ci.daytona-beach.fl.us/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Daytona Beach",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Daytona Beach",
  "OperatorStr1": "3651 LPGA Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Daytona Beach",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32115",
  "OperatorZipCodeExt": "2451",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000087513",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-04-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Chlorination",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2002-04-29 00:00:00",
  "DeRegistrationEffectiveDate": "2000-12-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.18525,
  "FRS_Long": -81.1105,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8408,
      "AltID": "Chlorination",
      "FacilityID": 6988,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 9249,
          "ProcessID": 8408,
          "ChemicalID": 62,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8601,
          "ProcessID": 8408,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3685,
              "Process_NAICS_ID": 8601,
              "SafetyReviewDate": "1998-07-01 00:00:00",
              "PHA_Date": "1998-07-15 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 1,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-07-15 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Partial vacuum system",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-07-01 00:00:00",
              "TrainingReviewDate": "1998-07-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-07-01 00:00:00",
              "EquipmentInspectionDate": "1999-04-30 00:00:00",
              "EquipmentTested": "Chlorine detector",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1998-07-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-07-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-07-01 00:00:00",
              "ContractorSafetyReviewDate": "1998-07-01 00:00:00",
              "ContractorSafetyEvalDate": "1998-07-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Chlorine is used at the Brennan Water Treatment Plant for disinfection",
              "_chemicals": [
                {
                  "PrimaryKey": 4204,
                  "PreventionProgram3ID": 3685,
                  "ProcessChemicalID": 9249
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6988,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1993-01-15 00:00:00",
    "ERTrainingDate": "1999-06-03 00:00:00",
    "CoordinatingAgencyName": "City of Daytona Beach",
    "CoordinatingAgencyPhone": "9042583150",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6988,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe City of Daytona Beach owns and operates the Brennan Water Treatment Plant, located at 3651 LPGA Boulevard in Daytona Beach, Florida. \n\nLike the majority of municipal water treatment plants in the United States, gaseous chlorine is used at the Brennan plant as a disinfectant to destroy pathogenic organisms that could enter the filtered water distributed by pipe to customers.  The popularity of chlorine as a water disinfectant is mainly due to its effectiveness, relatively low cost, and ability to produce a measurable residual in the finished water. \n\nThe same properties that make chlorine valuable as a disinfectant also make it necessary to observe certain safety precautions in handling chlorine as a safeguard to our workers, our community, and the environment.  Chlorine is notably irritating to the eyes, nose, throat and lungs.  More serious human health effects could result from much higher chlorine exposure, such as intense coughing, chest pains, and in extreme cases, death.\n\nThe City's commitment at the Brennan Plant is to store, handle and use chlorine in a manner that achieves the needed benefits of disinfection while minimizing both onsite and offsite risks.  This is accomplished by designing a safe process, maintaining the process in optimum working condition, operating safely through documented procedures and extensive training, and arranging for the Fire Department to provide an emergency response capability to minimize the consequences of a chlorine release, should a process accident ever occur.  \n\nAccidental Release Prevention and Emergency Response Policies\n\nIt is The City's commitment to adhere to all applicable Federal, State of Florida and local rules and regulations.  This specifically includes compliance with the Occupational Safety and Health Administration (OSHA) and Environmental Protection Agency (EPA) rules for chlorine accidental release prevention and emergency response.\n\nThe primary measures for accidental chlorine rel"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6988,
      "SummaryText": "ease prevention are contained in the document Process Safety Management Program for Brennan Treatment Plant.  This process safety management (PSM) document was prepared in conformance with the OSHA and EPA risk management rules, as well as industry-specific guidelines and best management practices relevant to release prevention.  Brennen's Plant Manager has the responsibility for ensuring that this program is implemented in the workplace as written.\n\nStationary Source and Regulated Substances Handled\n\nChlorine is received by the facility by truck and is stored in one-ton chlorine cylinders fabricated to Department of Transportation (DOT) specifications.  Upon arrival at the site, all chlorine cylinders are thoroughly inspected and if there is any doubt about the integrity of the cylinder, it is promptly refused.  Once accepted, the cylinders are stored on a storage pad equipped with a chlorine detector that immediately notifies the operators of a release should a leak occur.  The standby cylinders will automatically switchover when the in-use cylinders become empty, ensuring continuous disinfection.  The maximum intended chlorine inventory at Brennan is 18 cylinders, or 36,000 pounds of chlorine stored in the building.\n\nThe Worst-Case and Alternative Chlorine Release Scenarios\n\nAs part of Brennan's emergency prevention and response efforts, a hazard assessment was conducted in compliance with EPA requirements contained in 40 CFR 68, Subpart B.  The hazard assessment included the development of worst-case and alternative release scenarios.\n\nEPA defines a worst-case release as a scenario involving the greatest amount held in a single vessel or pipe.  In Brennan's case, this involves the release of the entire contents of a one-ton chlorine cylinder.  The release is assumed to occur over a 10-minute period.  Applying the worst-case parameters to the Brennan situation results in a distance to chlorine endpoint (defined as 0.0087 milligrams per liter) of 1.3 mile.  In oth"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6988,
      "SummaryText": "er words, any human or environmental receptors within 1.3 mile of the chlorine storage building are within the worst-case distance.\n\nEPA defines an alternative release as a scenario more likely than the worst-case, but that nevertheless results in an impact offsite (unless no such release is possible).  Passive and active mitigation measures (chlorine detection, operator response, etc.) are considered in this scenario.  Without an accident history on which to base a more likely scenario, a scenario was selected based on information provided in the Chlorine Institute Pamphlet 74, Estimating the Area Affected by a Chlorine Release.  The scenario involved the release of chlorine gas from a broken 0.25 inch whip connected to the cylinder .  Response time is conservatively assumed to occur in 45 minutes.  This scenario results in a distance to chlorine endpoint of less than 0.1 mile.  There are no public or environmental receptors affected by this release.\n\nThe distance to endpoint calculations were performed using EPA's RMP*Comp model.  The RMP*Comp model was developed specifically for compliance with the accidental release prevention requirement for predicting the travel distance of an accidental release.        \n\nGeneral Accidental Release Prevention Program and Specific Prevention Steps\n\nThe City's PSM document contains 13 essential release prevention elements.  Some of the key accidental release prevention elements of the PSM program are as follows:  \n\n* Process hazard analysis: This analysis was performed for each step in the chlorine process, to identify potential process failure scenarios and the appropriate prevention or response measures.  The process hazard analysis will be updated every 5 years.\n\n* Operating procedures review: The review was conducted to ensure that operators are given clear, written instructions for safely operating the chlorine process.\n\n* Training programs: Training is given to each employee assigned to the process with continuing operator"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6988,
      "SummaryText": " training thereafter, with an emphasis on safe chlorine handling and emergency response.  \n\n* Contractors:   Brennan ensures through its contract provisions that contractors supplying or working with chlorine are held to a standard of safety performance that complies with the City's safety goals and objectives, and also meets relevant agency requirements.  For example, The City's personnel make visits to the supplier's site to ensure that rules and guidelines concerning chlorine and cylinder integrity are being followed.\n\n* Mechanical integrity: The integrity and reliability of the process is maintained by implementing preventive maintenance and routine inspection and testing procedures.\n\n* Management of Change: The management of change procedures provide a systematic approach to evaluate and control the safety and health aspects of any significant change to the process chemicals, technology, equipment and operating procedures.\n\n* Incident Investigation: The City investigates within 48 hours any accidents or \"near misses\" that could have resulted in a chlorine release, in order to develop measures to prevent a recurrence.\n\nThe above elements are only part of City's aggressive safety program.  In addition to the 13 PSM elements, the City  has established related OSHA safety programs such as hot work and confined space.  These OSHA safety programs apply to both City and contractor employees. \n\nFive-year Accident History\n\nThere have been no serious accidents involving chlorine at the Brennan plant in the past five years.  \n\nEmergency Response Program\n\nPlant personnel also review the emergency response  plan on an annual basis.  The emergency response plan covers all aspects of emergency response including escape procedures, notification procedures, and response procedures for spills or leaks.  If a major chlorine leak were to occur, the emergency plan requires immediate notification of the Daytona Beach Fire Department teams for assistance, including orderly evacuation"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6988,
      "SummaryText": " or sheltering-in-place of the surrounding community."
    }
  ]
}