{
  "FacilityID": 6999,
  "FacilityName": "Fort Leavenworth, WTP, Bldg 25",
  "FacilityStr1": "1 Hastings Road",
  "FacilityStr2": null,
  "FacilityCity": "Fort Leavenworth",
  "FacilityState": "KS",
  "FacilityZipCode": "66027",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20103",
  "LEPC": null,
  "FacilityLatDecDegs": "39.354028",
  "FacilityLongDecDegs": "94.914083",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "HARRODR@LEAV-EMH1.ARMY.MIL",
  "FacilityDUNS": 0,
  "ParentCompanyName": "DOD",
  "Company2Name": "TRADOC",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Directorate of Public Works",
  "OperatorStr1": "820 McClellan Ave",
  "OperatorStr2": null,
  "OperatorCity": "Fort Leavenworth",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66027",
  "OperatorZipCodeExt": "2326",
  "RMPContact": "Ronald D. Guenther",
  "RMPTitle": "Environmental Specialist",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000088362",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-28 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2000-08-08 00:00:00",
  "DeRegistrationEffectiveDate": "2000-07-31 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.354,
  "FRS_Long": -94.9149,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ZIP+4 CENTROID",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8420,
      "AltID": null,
      "FacilityID": 6999,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8613,
          "ProcessID": 8420,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9261,
          "ProcessID": 8420,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509261,
          "ProcessID": 8420,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6999,
      "SummaryText": "\nFort Leavenworth, Kansas is located approximately 30 miles northwest of Kansas City Missouri, overlooking the Missouri River on the border between Kansas and Missouri.   The installation comprises approximately nine square miles or 5,226 acres, and has a populationof approximately7,523 active duty military and family members.   Fort Leavenworth is a U.S. Army Training and Doctrine Command (TRADOC) installation, and the home of the Command and General Staff Officers College (CGSOC).   CGSOC is the Army'a senior tactical school responsible for the development of officers to lead fighting units at the tactical and operational levels of war.   Also located at Fort Leavenworth is the United States Disciplinary Barracks, which is the only long-term maximum security confinement facility in the DOD.   Other Fort Leavenworth tennants include: National Simmulations Center, Foreign Military Studies Office, TRADOC Analysis Center, Requirements Documentation Directorate, Force DesignDirectorate, Threat Support Directorate, Headquarters 35th Infantry Division (Mechanized), and the 5th Brigade, 75th Division (Exercise).\n\nFort Leavenworth is committed to being a safe neighbor and employer.  Prevention of accidents, employee safety and emergency response are all operations which have Command support and visibilty.  Fort Leavenworth follows applicable regulations, requirements and policies designed to provide a safe work environment.\n\nThe Fort Leavenworth Water Treatment Plant (WTP) uses a conventional process of lime softening with flow through sedimention, recarbonation, chlorine disinfection, and fluoridation.   The installation obtains water from three wells.   The quantity of chlorine stored and used at the WTP is in excess of threshold quantities.   Chlorine is used at the plant for water disinfection purposes at a rate of approximately 85 pounds pre day, or a one ton container every  20 to 30 days.   The Water Treatment Plant treats an average of 1.8 million gallons per day ("
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6999,
      "SummaryText": "MGD) and is designed to treat 4.0 MGD.\n\nThe WTP is covered as a result of the quantity of chlorine potentially present on site which is approximately 8,000 pounds.   Chlorine is stored in one ton containers.   Typically, four containers are stored on site at any given time.\n\nChlorine will be treated as a Program Level 3 substance due to water treatment operation being subject to OSHA PSM.   As such, the Risk Management Plan at Fort Leavenworth mirrors the OSHA PSM requirements.   Accordingly, the Risk Magement Prevention Program will be maintained by the Fort Leavenworth Safety Office.   The Safety Office is responsible for meeting all applicable OSHA requirements.   The off-site consequence analysis shows a potential impact to the public under the required conditions of a worst-case release scenario for chlorine, and involves EPA recommended parameters of a 10-minute release of all amterial in a single vessel to the air.   No passive mitigation is assumed.   The alternative release scenario for chlorine would involve valve failure at the container head.\n\nFort Leavenworth has had no reported accidents involving the Water Treatment Plant 's use of chlorine during the past 5 years.\n\nThe Fort Leavenworth Fire Department consists of two fire stations with 24 full-time responders.   The Fort Leavenworth Fire Department has a reciprical agreement with the City of Leavenworth's Fire Department when assistance is needed.   The emergency response program will be operated and maintained by the Fort Leavenworth Fire Department.   Fire Department procedural changes may be expected with the additional participation and attendance at the ECCC RMP subcommittee.\n\nThe PHA requested by Fort Leavenworth as a part of the RMP initial implementation has been completed and is included in this document.   The document represents the compendium of program information and procedures, many previously in existence, at the installation.   The EQCC RMP Subcommittee will be briefed on the content"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6999,
      "SummaryText": "s of the PSA and will then take responsibility for prioritizing and addressing PHA concerns."
    }
  ]
}