{
  "FacilityID": 7047,
  "FacilityName": "General Mills, Inc.",
  "FacilityStr1": "4800 Edgewood Road Southwest",
  "FacilityStr2": null,
  "FacilityCity": "Cedar Rapids",
  "FacilityState": "IA",
  "FacilityZipCode": "52406",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19113",
  "LEPC": null,
  "FacilityLatDecDegs": "41.937222",
  "FacilityLongDecDegs": "-91.72",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7296056,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "General Mills, Inc.",
  "OperatorStr1": "4800 Edgewood Road Southwest",
  "OperatorStr2": null,
  "OperatorCity": "Cedar Rapids",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52406",
  "OperatorZipCodeExt": null,
  "FTE": 650,
  "OtherEPAFacilityID": "IAD062777180",
  "EPAFacilityID": "100000088175",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Cedar Rapids, Iowa",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.93368,
  "FRS_Long": -91.71648,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8473,
      "AltID": "Ammonia",
      "FacilityID": 7047,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 9316,
          "ProcessID": 8473,
          "ChemicalID": 56,
          "Quantity": 75000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8667,
          "ProcessID": 8473,
          "NAICSCode": "31123",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3720,
              "Process_NAICS_ID": 8667,
              "SafetyReviewDate": "1998-05-01 00:00:00",
              "PHA_Date": "1998-03-01 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-03-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-03-01 00:00:00",
              "TrainingReviewDate": "1999-03-01 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-05-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "compressors, pressure vessels, pumps, condensers, chillers, refrigeration tunnels and system piping",
              "ChangeMgmtDate": "1998-03-01 00:00:00",
              "ChangeMgmtReviewDate": "1998-01-01 00:00:00",
              "PreStartupReviewDate": "1998-03-01 00:00:00",
              "ComplianceAuditDate": "2002-06-01 00:00:00",
              "AuditCompletionDate": "2002-07-01 00:00:00",
              "IncidentInvestigationDate": "1998-04-01 00:00:00",
              "InvestigationChangeDate": "1998-04-01 00:00:00",
              "ParticipationPlansReviewDate": "1998-06-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-03-01 00:00:00",
              "ContractorSafetyReviewDate": "1998-07-01 00:00:00",
              "ContractorSafetyEvalDate": "1998-07-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Program 3",
              "_chemicals": [
                {
                  "PrimaryKey": 4241,
                  "PreventionProgram3ID": 3720,
                  "ProcessChemicalID": 9316
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7047,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-06-01 00:00:00",
    "ERTrainingDate": "1998-08-01 00:00:00",
    "CoordinatingAgencyName": "Cedar Rapids Emergency Response",
    "CoordinatingAgencyPhone": "3192885200",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": "CAA Title V"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7047,
      "SummaryText": "Executive Summary (Ammonia)\n\nAccident Release Prevention Program and Emergency Response Policy\n\nIt is the policy of the General Mills Operations, Cedar Rapids, Iowa, facility management to implement the requirements of this Risk Management Program (RMP) in accordance with the USEPA regulations under 40 CFR Part 68 and with the corresponding regulations under OSHA's Process Safety Management (PSM) program. The objective is to minimize the risk of a release of a hazardous material and if a release occurs, to minimize the potential impact to General MIlls Operations employees, the public and the environment. This objective will be accomplished by utilizing general good operating procedures, providing appropriate training to all employees, and coordinating response activities, as necessary with the local emergency response providers.\n\nGeneral MIlls Operations' management is committed to providing the resources necessary to implement this policy.\n\nFacility Description\n\nGeneral Mills Operations Cedar Rapids facility produces food products including cereal, cake mixes, frosting, fruit rollups, and fruit gushers. The raw materials used in the processes are grains, sugars, molasses, honey, fruits, and oils. Support operations include cold storage operations, a quality assurance/control laboratory and administrative offices. Figure 1-1 presents a site location map and Figure 1-2 presents the site map\n\nTwo chemicals are utilized at the facility in sufficient quantities to be subject to the requirements of 40 CFR Part 68, Risk Management Program. These chemicals are ammonia and propane.  Ammonia is used as a refrigerant throughout the facility, and propane is used as a backup fuel supply.\n\nThis document presents the Risk Management Plan for the ammonia system. The RMP for propane is presented in a separate document.\n\nWorst-Case and Alternative Release Scenarios\n\nAmmonia\n\nThe worst-case release scenario for an anhydrous ammonia release included a release of all the contents of t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7047,
      "SummaryText": "he Suction Accumulator No. 1 SA-1 in a 10-minute period (per EPA guidelines). This release translates to a release of 25,016 pounds of ammonia in 10 minutes or 2,501.6 lbs/min.  Other assumptions included in the worst-case assessment are:  the ammonia is a liquefied gas; the suction accumulator is not diked; the release does not take place indoors; the nearfield dispersion environment is characterized as urban; 10-minute averaging period; the windspeed is 1.5 meters/sec and the atmospheric stability is classified as F (stable). The results of the worst-case assessment for ammonia show that the plume must travel 2.0 miles (3.2 kilometers) before dispersing to the endpoint concentration of 201 ppm. Figure 1-3 shows the worst-case release radius for an ammonia release.\n\nThe selected alternative release scenario for the ammonia systems is a release from a relief valve due to overpressure of the Suction Accumulator #1 in the Fruit Area. The largest relief valve in the system was used in this scenario. The largest relief valve has a release rate of 159 pounds of air per minute. The ammonia refrigeration document provides calculated endpoint distances for typical meteorological conditions (3 m/s wind speed, D atmospheric stability, and 50% relative humidity). This facility has not had a significant release of ammonia during its operational history. Therefore, an arbitrary assumption has been made that the relief valve will operate for 60 minutes before the release is stopped. The total release in this scenario will be 6,840 pounds of ammonia. Other assumptions include, no active or passive mitigation measures are currently in place and an urban dispersion environment in the nearfield. The results of the alternative release scenario for an ammonia release indicates that the endpoint concentration of 201 ppm is reached at 475 feet from the release. Figure 1-4 shows the alternative case release radius for an ammonia release.\n\nGeneral Accidental Release Prevention Program and "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7047,
      "SummaryText": "Chemical Specific Prevention Steps\n\nThe Cedar Rapids facility is governed by a set of OSHA and USEPA regulations that require planning and facility activities intended to prevent a release of hazardous material, or if a release inadvertently occurs, to minimize the consequences of a release to the employees of the facility, the public and to the environment.  These regulations include:\n\n* 40 CFR Part 68, Accidental Release Prevention\n* 40 CFR Part 112, Spill Prevention, Control and Countermeasure\n* 40 CFR Part 264, Hazardous Waste Contingency Plan\n* 29 CFR Part 119, Process Safety Management\n\nThe key concepts in General Mills Operations release prevention program are employee participation, appropriate design and maintenance of equipment, and appropriate training of all employees.\n\nEmployee participation in the release prevention program is encouraged and supported by General Mills Operations' management. Key personnel are responsible for conducting and implementing the findings from the Process Hazard Analysis (PHA) for the ammonia system. General Mills Operations' employees are also members of the facility emergency response team.\n\nGeneral Mills Operations' policy is to construct all new equipment, systems, and facilities in accordance with the most current building and safety codes. This ensures the appropriate safety and release prevention systems are included from the beginning of each project. General Mills Operations maintains a computerized program of maintenance activities to ensure that key systems are maintained appropriately to minimize the risk of a release.\n\nGeneral Mills Operations is committed to providing appropriate training to all employees regarding safety procedures. New employees are provided comprehensive safety training during their initial orientation for the facility. In addition, General Mills Operations conducts regularly scheduled safety training for all employees each year. Additional training is provided to maintenance personnel for th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7047,
      "SummaryText": "e systems they are responsible for. Members of General Mills Operations' emergency response team receive semiannual training to ensure that response actions are promptly and safely completed.\n\nFive Year Accident History\n\nGeneral Mills Operations has not had a release of ammonia from Cedar Rapids that has affected the public or the environment.\n\nEmergency Response Program\n\nGeneral Mills Operations has personnel trained in emergency response at the facility 24 hours per day, seven days per week. These personnel receive semiannual training on emergency procedures and response techniques.\n\nPlanned Changes to Improve Safety\n\nGeneral Mills Operations completes a thorough review of the ammonia systems each time a design change is implemented.  Each of the systems are also evaluated each time the PHA is revised.  General Mills Operations is committed to using these methods to identify and implement ways to improve the safety of these systems.\n\nExecutive Summary (Propane)\n\nAccident Release Prevention Program and Emergency Response Policy\n\nIt is the policy of the General Mills, Cedar Rapids, Iowa, facility management to implement the requirements of this Risk Management Program (RMP) in accordance with the USEPA regulations under 40 CFR Part 68 and with the corresponding regulations under OSHA's Process Safety Management (PSM) program. The objective is to minimize the risk of a release of a hazardous material and if a release occurs, to minimize the potential impact to General Mills' employees, the public and the environment. This objective will be accomplished by utilizing general good operating procedures, providing appropriate training to all employees, and coordinating response activities, as necessary with the local emergency response providers.\n\nGeneral Mills' management is committed to providing the resources necessary to implement this policy.\n\nFacility Description\n\nGeneral Mills Cedar Rapids facility produces food products including cereal, cake mixes, frosting, frui"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7047,
      "SummaryText": "t rollups, and fruit gushers. The raw materials used in the processes are grains, sugars, molasses, honey, fruits, and oils. Support operations include cold storage operations, a quality assurance/control laboratory and administrative offices. Figure 1-1 shows the site location. Figure 1-2 shows the plot plan.\n\nTwo chemicals are utilized at the facility in sufficient quantities to be subject to the requirements of 40 CFR Part 68, Risk Management Program. These chemicals are ammonia and propane.  Ammonia is used as a refrigerant throughout the facility, and propane is used as a backup fuel supply.\n\nThis document covers the propane system only. A separate document presents the RMP for ammonia.\n\nWorst-Case and Alternative Release Scenarios\n\nPropane\n\nThe worst-case release scenario for propane is defined as a release of all the contents of one of the propane storage tanks (223,350 pounds). For the worst-case release of propane, the release rate is not considered. The total quantity of the propane is assumed to form a vapor cloud. The entire contents of the cloud are assumed to be within the flammability limits, and the cloud is assumed to explode. For the worst-case analysis, 10 percent of the flammable vapor in the cloud is assumed to participate in the explosion (i.e., the yield factor is 0.10). Consequence algorithms \nwere used to determine the endpoint at an overpressure level of 1 pound per square inch (psi).  Other assumptions for the worst-case propane analysis included: \n\n* The propane is a flammable gas;\n* The storage vessel is not diked; \n* No passive mitigation system are in place; \n* The nearfield dispersion environment is characterized as urban; \n* The windspeed is 1.5 meters/sec; and \n* The atmospheric stability is classified as F (stable).\n\nThe results of the worst-case assessment for propane show that the 1-psi overpressure endpoint occurs at a distance of 0.48 miles (790 meters) from the release point. Figure 1-3 shows the worse-case radius.\n\nThe select"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 7047,
      "SummaryText": "ed alternative release scenario for the propane system is a release resulting from a hose rupture due to a pull-away during tank filling. It is assumed that the excess flow valves work as designed and limit the release to the contents of the hose. The hose is 3 inches in diameter and 25 feet long.  This results in a total release of 38.6 pounds of propane. The propane is assumed to vaporize and cause a vapor cloud explosion. The entire contents of the cloud are assumed to be within the flammability limits, and the cloud is assumed to explode. For the alternate-case analysis, 10 percent of the flammable vapor in the cloud is assumed to participate in the explosion (i.e., the yield factor is 0.10). Consequence algorithms were used to determine the endpoint at an overpressure level of 1 psi. Other assumptions for the alternate-case propane analysis include:\n\n* The propane is a flammable gas;\n* The storage vessel is not diked;\n* No passive mitigation system are in place;\n* The nearfield dispersion environment is characterized as urban;\n* The windspeed is 3.0 meters/sec; and \n* The atmospheric stability is classified as D. \n\nThe results of the alternate-case assessment for propane show that the 1-psi overpressure endpoint occurs at a distance of 0.02 miles (44 meters) from the release point. Figure 1-4 shows the alternate-case radius.\n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nThe Cedar Rapids facility is governed by a set of OSHA and USEPA regulations that require planning and facility activities intended to prevent a release of hazardous material, or if a release inadvertently occurs, to minimize the consequences of a release to the employees of the facility, the public and to the environment. These regulations include:\n\n* 40 CFR Part 68, Accidental Release Prevention\n* 40 CFR Part 112, Spill Prevention, Control and Countermeasure\n* 40 CFR Part 264, Hazardous Waste Contingency Plan\n* 29 CFR Part 119, Process Safety Management"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 7047,
      "SummaryText": "\n\nThe key concepts in General Mills' release prevention program are employee participation, appropriate design and maintenance of equipment, and appropriate training of all employees.\n\nEmployee participation in the release prevention program is encouraged and supported by General Mills' management. Key personnel are responsible for conducting and implementing the findings from the Process Safety Review for propane system. General Mills' employees are also members of the facility emergency response team.\n\nGeneral Mills' policy is to construct all new equipment, systems, and facilities in accordance with the most current building and safety codes. This ensures the appropriate safety and release prevention systems are included from the beginning of each project. General Mills maintains a computerized program of maintenance activities to ensure that key systems are maintained appropriately to minimize the risk of a release.\n\nGeneral Mills is committed to providing appropriate training to all employees regarding safety procedures. New employees are provided comprehensive safety training during their initial orientation for the facility. In addition, General Mills conducts regularly scheduled safety training for all employees each year. Additional training is provided to maintenance personnel for the systems they are responsible for. Members of General Mills' emergency response team receive semiannual training to ensure that response actions are promptly and safely completed.\n\nFive Year Accident History\n\nGeneral Mills has not had a release of propane from Cedar Rapids that has affected the public or the environment.\n\nEmergency Response Program\n\nGeneral Mills does not have emergency response capability on site to respond to a propane emergency. It is General Mill's policy to contact off-site emergency responders for assistance in the event of an accidental release of propane. General Mills' employees will attempt to extinguish small fires with fire extinguishers if they ha"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 7047,
      "SummaryText": "ve been properly trained. General Mills' employees, trained in the safe operation of the propane system, will close manual shutoff valves to terminate the flow of propane if the valves can be safely approached. For all other scenarios, General Mills' employees will evacuate the area and allow off-site responders to respond to the propane emergency. General Mills has met with the local fire department and the Local Emergency Response Commission to review the propane system and to establish coordination and communication procedures.\n\nPlanned Changes to Improve Safety\n\nGeneral Mills has completely rebuilt their propane system including the addition of a new storage tank, a new vaporizer system, and a new blending system.  The new system was designed and built to NFPA 58, 1998 Edition guidelines. The two older storage tanks were upgraded to meet the same guidelines. Facility personnel received operation and maintenance training on the new system. No additional changes are planned for this system."
    }
  ]
}