{
  "FacilityID": 7074,
  "FacilityName": "North Charleston Sewer District WWTP Herbert Site",
  "FacilityStr1": "1000 Herbert Street",
  "FacilityStr2": null,
  "FacilityCity": "Charleston",
  "FacilityState": "SC",
  "FacilityZipCode": "29405",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45019",
  "LEPC": "Charleston County LEPC",
  "FacilityLatDecDegs": "32.829722",
  "FacilityLongDecDegs": "-79.946389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "North Charleston Sewer Distrtict",
  "Company2Name": null,
  "CompanyDUNS": 73732083,
  "Company2DUNS": null,
  "OperatorName": "North Charleston Sewer District",
  "OperatorStr1": "P.O. Box 63009",
  "OperatorStr2": "7225 Stall Road",
  "OperatorCity": "Charleston",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29419",
  "OperatorZipCodeExt": null,
  "FTE": 57,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000088488",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "TV-0560-190",
  "SafetyInspectionDate": "1998-10-29 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2007-08-31 00:00:00",
  "DeRegistrationEffectiveDate": "2007-08-20 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.8294,
  "FRS_Long": -79.9456,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8507,
      "AltID": "Chlorination of Waste Wat",
      "FacilityID": 7074,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 9353,
          "ProcessID": 8507,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8710,
          "ProcessID": 8507,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3740,
              "Process_NAICS_ID": 8710,
              "SafetyReviewDate": "1998-10-12 00:00:00",
              "PHA_Date": "1999-04-28 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-04-28 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-28 00:00:00",
              "TrainingReviewDate": "1999-04-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-07 00:00:00",
              "EquipmentInspectionDate": "1999-03-24 00:00:00",
              "EquipmentTested": "Auto Shut Off; Control Devices Internal & External; I/A Alarms; Displays",
              "ChangeMgmtDate": "1998-09-30 00:00:00",
              "ChangeMgmtReviewDate": "1998-02-05 00:00:00",
              "PreStartupReviewDate": "1999-04-28 00:00:00",
              "ComplianceAuditDate": "1998-02-05 00:00:00",
              "AuditCompletionDate": "1998-02-05 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-02-05 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-11 00:00:00",
              "ContractorSafetyReviewDate": "1998-02-05 00:00:00",
              "ContractorSafetyEvalDate": "1998-02-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4264,
                  "PreventionProgram3ID": 3740,
                  "ProcessChemicalID": 9353
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7074,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "City of Charleston Fire Department",
    "CoordinatingAgencyPhone": "8435777070",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 7074,
      "SummaryText": "s.  The Assistant\nDistrict Manager assigns the members of this committee.  Currently, the members of the\nPSM/RMP Steering Committee include the following:\n\n     Assistant District Manager\n     Chief of Plant Operations\n     Systems Maintenance Superintendent \n     Safety and Training Coordinator\n     \nThe following sections identify the specific responsibilities for each aspect of the risk\nmanagement and process safety management programs.\n\n\nHAZARDS ASSESSMENT\n\nThe Assistant District Manager has the responsibility for (1) ensuring that offsite consequence\nanalysis for each regulated process are consistently performed and documented in accordance\nwith Sections 68.20 through 68.38 and (2) selecting the scenarios that will be reported in the\nfacility RMPlan as required under Section 68.165.  The Assistant District Manager also is\nresponsible for ensuring that the accident history for each covered process is appropriately\ndocumented and maintained in accordance with Section 68.42 and 68.168 of the RMP rule.\n\n\n\nPREVENTION PROGRAMS\n\nThe Assistant District Manager has the responsibility for ensuring that the facility has an\nintegrated, effective, and compliant prevention program that meets EPA RMP (Sections 68.65\nthrough 68.87 of the RMP rule) and OSHA PSM requirements.  Although the Assistant District\nManager has some specific individual responsibilities, many of the responsibilities for specific\nprogram elements are assigned to other members of the PSM/RMP Steering Committee (as listed\nin the following sections).\n\n     Process Safety Information\n\nThe responsibility for process safety information (PSI) (Section 68.65 of the RMP rule) is\ndivided into three areas.  The Chief of Plant Operations has responsibility for process chemical\ninformation and responsibility for process technology information, and the Maintenance\nSuperintendent has responsibility for equipment information.  The Chief of Plant Operations has\nthe responsibility of ensuring that all of this information i"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7074,
      "SummaryText": "s readily accessible for use.\n\n     Process Hazard Analysis\n\nIn accordance with Section 68.67 of the RMP rule, the Chief of Plant Operations has the\nresponsibility for ensuring that process hazard analyses (PHAs) are scheduled, conducted, and\ndocumented by trained personnel for all regulated processes.  The Chief of Plant Operation\nidentifies candidate PHA team leaders from within the facility and ensures that they receive\nappropriate training before leading PHAs.  The Chief of Plant Operations also uses outside\ncontractors to lead PHAs when appropriate.  The other members of the PSM/RMP Steering\nCommittee are responsible for (1) ensuring that the information and personnel necessary to\nconduct PHAs are available according to the PHA implementation schedule and (2) resolving\nrecommendations that are assigned to their respective areas.\n\n     Operating Procedures\n\nIn accordance with Section 68.69 of the RMP rule, the Chief of Plant Operations has the\nresponsibility for ensuring that complete and accurate operating procedures are in place for all\nregulated processes.  The Chief of Plant Operations works closely with the Maintenance\nSuperintendent to develop and maintain the facility's safe work practices.\n\n     Training\n\nIn accordance with Section 68.71 of the RMP rule, the Chief of Plant Operations has the\nresponsibility for (1) ensuring that operations employees receive and understand training\napplicable to their specific jobs and the associated processes and (2) documenting the training. \nThe Chief of Plant Operations also has the responsibility for (1) ensuring that all facility\nemployees receive and understand training in safe work practices applicable to their jobs and (2)\ndocumenting the training.  (The Maintenance Superintendent addresses training for maintenance\nworkers under the mechanical integrity program.)\n\n     Mechanical Integrity\n\nIn accordance with Section 68.73 of the RMP rule, the Maintenance Superintendent has the\nresponsibility for the overall mecha"
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 7074,
      "SummaryText": "of the Hot Work Permit System.  All\npermits shall be posted at the sight of the work for the duration of the job.  The Fire Watch shall\nreturn the Permit to the Maintenance Superintendent upon final inspection of the work area.\n\nContractors\n\nIn accordance with Section 68.87 of the RMP rule, we have a contractor screening procedure to\nhelp ensure that we hire and use only contractors who accomplish the desired job tasks without\ncompromising the safety of our plant employees, the public, or the environment.\n\n\n\n\n     Contractor Details\n\nContractors working on or adjacent to the chlorine or sulfur dioxide processes must be aware of\nthe hazards involved in working on or near such areas.  The Sewer District shall: obtain, review,\nand evaluate the contractor(s) safety performance and programs, ensure the Contractor informs\nhis employees of the hazards associated with the work, obtain injury and illness records of\ncontracted employees working in these areas.  This information shall be included in all bid\nspecifications to workers bidding on the Plant site work."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7074,
      "SummaryText": "ility of ensuring that only trained personnel lead the investigations.  The\nOperations Shift Supervisors and Maintenance Superintendent each have responsibility for\nensuring that all incidents in their areas are reported and investigated, and the investigations\nfindings are resolved, documented, and communicated to affected personnel.\n\n\n     Employee Participation\n\nIn accordance with Section 68.83 of the RMP rule, the Chief of Plant Operations working with\nthe Operations Shift Supervisors, has the responsibility of involving employees in the planning\nand implementation of the facility's prevention program elements.\n\n     Hot Work Permits\n\nIn accordance with Section 68.85 of the RMP rule, the Maintenance Superintendent working\nclosely with the Chief of Plant Operations, has the responsibility of developing and maintaining\nthe facility's hot work permit program.\n\n     Contractors\n\nIn accordance with Section 68.87 of the RMP rules, the Maintenance Superintendent has the\noverall responsibility for the contractor program; however, the Maintenance Superintendent and\nthe Chief of Plant Operations are responsible for ensuring that the requirements of the program\nare implemented in their areas of responsibility.\n\n\nEMERGENCY RESPONSE PROGRAM\n\nIn accordance with Sections 68.90 and 68.95 of the RMP rules, the Chief of Plant Operations,\nwith assistance from the Assistant District Manager, is responsible for designing, implementing,\nand maintaining the facility's emergency action plan and ensuring that all associated training is\nconducted and documented as necessary.  Coordinating the site emergency action plan with the\ncommunity emergency response plan and responding to local emergency planners/responders\nwhen questions arise in the responsibility of the Assistant District Manager.\n\n\nRMP PLAN PREPARATION AND SUBMISSION\n\nThe Assistant District Manager is responsible for preparing and submitting the RMPlan for the\nfacility (after review and approval by the District Manager) as req"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 7074,
      "SummaryText": "uired under Sections 68.150\nthrough 68.185 of the RMP rule.\n\n\n\nRMP PLAN COMMUNICATION\n\nThe NCS District Manager, with assistance from the Assistant District Manager, has the\nresponsibility of providing RMPlan information (other than the required EPA submission) to the\npublic and all employees as required under Section 68.210 of the RMP rule.\n\n\n                                      RISK MANAGEMENT PLAN\n\n\n                                                          FOR\n\n\n                          NORTH CHARLESTON SEWER DISTRICT\n                                                       WWTF\n\n\n\n                                   1000 HERBERT STREET SITE\n\n\n\n                                                         BY\n\n\n\n\n                          FAGGERT CONSULTING ASSOCIATES INC.\n                                             RICHMOND, VA\n                                 \n                                                        AND\n\n                          NORTH CHARLESTON SEWER DISTRICT\n\n         \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE\n\nThe North Charleston Sewer District (WWTF) Herbert Street site is committed to operating and\nmaintaining all of its processes (especially those using hazardous substance) in a safe and\nresponsible manner.  We use a combination of our Process Safety Management (PSM) of Highly\nHazardous Chemicals program, our Accidental Release Prevention (RMP) program and\nEmergency Action program (EAP) to help ensure the safety of our employees, the surrounding\npublic and to provide protection for the environment.  This document presents a brief overview\nof the comprehensive risk management program that have been developed and implemented,\nincluding:\n\n     A description of our site and use of the chemical covered by the RMP regulation\n\n     A summary of the potential offsite consequences from accidental chemical releases from\n     our facility\n\n     An overview of our accidental release prevention program\n\n     A five-year accident"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 7074,
      "SummaryText": "t on the PHA from\nemployees to be relayed to the PHA development team through the Chief of Plant Operations.\n\nThe Plant Maintenance department shall hold safety meetings for a minimum of (1) hour per\nmonth and cover the same topics as above in addition to regularly scheduled topics.  Employee\ninput shall be directed through the Maintenance Superintendent to the Chief of Plant Operations\nfor consideration by the PHA development team.\n\nThe minimum (1) one-hour safety meetings for Plant Operations and for Plant Maintenance shall\ninclude the PHA and development of all other elements of the PSM/RMP standard.  These are\nstandard requirements of each department and are included here only for employee\nparticipation purposes.  Employees shall have access to all information developed as required\nby the PSM/RMP standard.  Upon full compliance and development of the PSM/RMP standard,\ntraining shall be conducted in accordance with 1910.119(g).\n\nAdditionally, employees shall be involved in the development and maintenance of all safe work\npractices including Lock out, Tag out, Hot Work, etc.  All information related to the PSM/RMP\nshall be maintained in a readily accessible location for those employees who operate and\nmaintain the Process.\n\nHot Work Permits\n\nIn accordance with Section 68.85 of the RMP rule, we use our hot work permit program to\nensure that OSHA's fire prevention and protection precautions, specified in 29 CFR 1910.252(a),\nare in place before hot work (work involving electric or gas welding, cutting, brazing, or similar\nflame or spark-producing operation) begins on or near an RMP-covered process.\n\n     Hot Work Permits Details\n\nThe North Charleston Sewer District has developed a Hot Work Permit form under the direction\nof the North Charleston District Fire Chief and NFPA Standard 51B.  This form is used at any\ntime hot work is planned on or in the direct vicinity of the chlorine system.  The Maintenance\nSuperintendent is responsible for ensuring the effective use"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7074,
      "SummaryText": "nical integrity program, with specific emphasis on written\nprocedures, maintenance training, the equipment and instrumentation inspection/test program\nand documentation, and equipment deficiency resolution.  The Chief of Plant Operations and the\nSafety and Training Coordinator work with the Maintenance Superintendent to define and\nmaintain appropriate quality assurance procedures for all types of equipment\nacquisitions/installations/repairs.\n\n     Management of Change\n\nIn accordance with Section 68.75 of the RMP rule, the Chief of Plant Operations has the\nresponsibility for the overall management of change (MOC) program; however, the Operations\nShift Supervisors, the Maintenance Superintendent and the Safety and Training Coordinator each\nhave responsibility for ensuring that the overall MOC program is effectively implemented in\ntheir areas.\n\n     Pre-Start-Up Review\n\nIn accordance with Section 68.77 of the RMP rule, the Chief of Plant Operations has the\nresponsibility for the overall pre-startup review program, which is closely related to the MOC\nprogram.  The Chief of Plant Operations, through the Operations Shift Supervisors, has the\nprimary responsibility for ensuring that this program is effectively implemented before affected\noperations begin.\n\n     Compliance Audit\n\nIn accordance with Section 68.79 if the RMP rule, the Assistant District Manager has the\nresponsibility for ensuring that compliance audits regularly occur (and are documented) to verify\nthat the prevention program is working and meets EPA/OSHA requirements.  Each member of\nthe PSM/RMP Steering Committee has responsibility for resolving any identified deficiency in\ntheir area.\n\n     Incident Investigations\n\nIn accordance with Section 68.81 of the RMP rule, the Chief of Plant Operations has the\nresponsibility for designing and managing the incident investigation program, including tracking\nresolution of investigation findings and recommendations.  The Chief of Plant Operations also\nhas the responsib"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 7074,
      "SummaryText": "am.  This program helps ensure that inadvertent or unintended changes are\nprevented, that any safety and health impacts are addressed, that affected procedures are updated,\nand that our employees and contract employees are informed of and trained in the approved\nchanges.  We use this close scrutiny of all changes to help ensure that changes do not adversely\nimpact employees, public safety, or the environment.\n\n     Management of Change Details\n\nA Process Change Authorization is required for all changes to ensure the operation procedures\ncontain the operating parameters (pressure limits, temperature ranges, flow rates, etc.) And the\nimportance of operating within the limits.  In addition, prior to startup of the changed process or\naffected part of the process, all employees involved in operating a process, maintaining a process,\nand contract employees affected by the change will be informed of and trained in the change(s). \nWritten procedures to ensure the proper management of change have been developed and include\nsections on Initiating the Change Process, Design of Change, Design Review, Installation of\nChange, Pre-Startup Review, and Startup, as well as a Management of Change checklist.\n\nPre-Start-Up Review\n\nIn accordance with Section 68.77 of the RMP rule, we perform a pre-startup review as a final\ncheck to ensure the safety of a new or modified process before it is placed in service.\n\n     Pre-Start-Up Review Details\n\nPrior to starting the chlorine system after a change or modification, the PHA team shall review\nand approve a MANAGEMENT OF CHANGE checklist.  The Pre-Start Up Safety Review shall\nconsist of the completion of the following essential items to be completed/considered prior to the\ncompletion of such change:\n\n-    Management of Change procedures\n-    Design specs followed\n-    Evaluation of any deviations from existing safety procedures created\n-    PHA reviewed and updated if necessary\n-    PHA team walk-through of system including inspection of safet"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 7074,
      "SummaryText": "y measures\n-    Documented employee training on safety ramifications of change\n\nCompliance Audit\n\nIn accordance with Section 68.79 of the RMP rule, we audit our RMP-covered processes to be\ncertain that our prevention programs are effective.  Our compliance audit program seeks to\nconfirm that RMP prevention program practices for the covered process are consistent with\nwritten programs, that the programs adequately address all requirements of the RMP regulations,\nand that management systems are in place to ensure continued compliance.\n\n\n     Compliance Audit Details\n\nThe PHA team shall conduct a compliance audit at least every three years.  This audit shall\ncertify that all provisions of the RMP Section 68.79 and the OSHA 1910.119 standard are in\ncompliance and are being followed.  A report of the findings as a result of this audit shall be\nsubmitted to the Assistant District Manager.  The next Compliance Audit shall be scheduled to\nbegin no later than January 15, 2001.\n\nOur audit teams consist of a team leader and an appropriate number of team members based on\nthe size and complexity of the processes to be audited.\n\nWe have a plant management committee that promptly reviews the audit findings, determines an\nappropriate response for each finding, assigns responsibility for implementation of a corrective\naction, and assigns a target completion date.  The corrective actions are placed in a tracking\nsystem and progress is monitored quarterly until open issues are resolved.  We retain the two\nmost recent audit reports.\n\nIncident Investigations\n\nIn accordance with Section 68.81 of the RMP rule, we perform incident investigations to help\nensure that incidents with catastrophic magnitude or potential are thoroughly investigated, root\ncauses are identified and corrected, and relevant findings are communicated throughout our\norganization to help prevent a recurrence.\n\n     Incident Investigations Details\n\nAn incident investigation team has been formed comprising the following"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 7074,
      "SummaryText": "personnel: Chief of\nPlant Operations, Safety and Training Coordinator, and Maintenance Superintendent.  All\nincidents, which caused or could have caused release of chlorine liquid/gas shall be investigated\nno less than 48 hours after the incident occurred.  At the conclusion of the investigation, a report\nshall be prepared by the Chief of Plant Operations and reviewed by the team.  The report shall\ninclude at a minimum: the date of the incident, the date the investigation began, a description of\nthe incident, the factors that contributed to the incident, and any recommendations resulting from\nthe incident.\n\nThe recommendations resulting from the incident shall be presented to the Safety committee at\nthe next regularly scheduled meeting for review.  The Safety Committee shall make a formal\nrecommendation to the Chief of Plant Operations.  The Chief of Plant Operations will review the\nfinal report with the Assistant District Manager; at which time a course of action will be\ndetermined.\n\nAll recommendations and facts relevant to the incident shall be reviewed with all affected\npersonnel whose job tasks are related to the incident or the chlorine system.  The incident\ninvestigation report shall supplement the supervisor's report of accident and be retained by the\nHuman Resources Department for five years.\n\nEmployee Participation\n\nIn accordance with Section 68.83 of the RMP rule, our employee participation plan helps ensure\nthat all employees have appropriate involvement in developing and implementing RMP.\n\nEmployee Participation Details\n\nThe Plant Operations department shall hold safety meetings for minimum of (1) hour per month\nto cover the development and implementation of the PSM/RMP standard compliance guidelines\nas well as other safety topics as needed.  These meetings shall be conducted by each shift\nsupervisor during the course of their normal shift duties and shall include the latest developments\non the PSM/RMP standard, the PHA, and provide opportunity for inpu"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 7074,
      "SummaryText": "ands and national parks.\n\nAdministrative Controls and Mitigation Measures To Minimize Exposure Distance - Area\nsensors/interlocks; employee emergency response training; selectively located water sprays;\n\n\nALTERATIVE RELEASE SCENARIO - Regulated Toxic Chemicals \n(MORE LIKELY ACCIDENTAL RELEASE CASE)\n\nEVENT - CHLORINE\n\nRelease of 250 pounds over 1 minute period due to pipe failure at rail car unloading station.\n\nEstimated Exposure Distance - 0.3 miles\n\nPotentially Impacted Receptors - Industrial, residential and recreational areas.\n\nAdministrative Controls and Mitigation Measures To Minimize Exposure Distance - Isolation\nof leaking piping by operator, operation of excess flow valves; area chlorine sensors; scheduled\nPM on transfer hose;\n\n\nACCIDENT RELEASE PREVENTION PROGRAM AND\nCHEMICAL-SPECIFIC PREVENTION STEPS\n\nNCSD takes a systematic, proactive approach to preventing accidental releases of hazardous\nchemicals.  Our management systems address each of the key features of successful prevention\nprograms including:\n\n     Process safety information\n     Process hazard analysis\n     Operating Procedures\n     Training\n     Mechanical integrity\n     Management of change\n     Pre-startup review\n     Compliance audits\n     Incident investigation\n     Employee participation\n     Hot work permit\n     Contractors\n\nAs part of our prevention efforts, we have implemented the following chemical-specific\nprevention steps:\n\n     Chlorine leak detection sensors/alarms\n\n     Safety relief valve protects rail car from over pressure\n\n     No pumps are used in chlorine service\n\n     Equipment and piping designed to meet Chlorine Institute recommendations\n\n     Process hazard analysis completed every 5 years\n\n     Operational reviews completed for all process changes\n\n     Annual review of operating procedures\n\n     Hazard communications training provided for all personnel - operational and\n     maintenance\n\n     \nPeriodic testing and inspection of equipment and piping\n\n     Facility emerge"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 7074,
      "SummaryText": "ncy action program in place\n\n     Formal investigations conducted for all significant releases\n\n     Formal facility audits \n\nThese individual elements of our prevention program work together to prevent accidental\nchemical releases.  NCSD and our employees are committed to the standard that these\nmanagement systems set for the way we do business, and we have specific accountabilities and\ncontrols to ensure that we are meeting our own high standards for accident prevention.\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nNCSD keeps records for all significant accidental chemical releases that occur at our sites.  The\nfollowing is a brief summary of accidental chemical releases involving materials covered under\nEPA's RMP rule (releases that result in deaths, injuries, or significant property damage on site,\nor known offsite deaths, injuries, evacuations, sheltering in place, property damage, or\nenvironmental damage) during the past five years:\n\nYEAR/S    CHEMICAL       EVENT               RESULT\n\n1994 - No covered chemical release has occurred that would meet the above criteria.\n1999\n\n\nEMERGENCY ACTION PLAN\n\nNCSD has in place a facility emergency action plan, which consolidated all of the various\nfederal, state, and local regulatory requirements for emergency response planning.  Our program\nprovides the essential planning and training for effectively protecting workers, the public, and the\nenvironment during emergency situations.  Furthermore, we coordinate our plan with the\ncommunity emergency response plan.\n\nA summary of our Emergency Action Program is included in the Appendix of this report.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe following is a list of improvements that NCSD is planning to implement at the site to help\nprevent and/or better respond to accidental chemical releases:\n     Annual Certification of Injection/Equipment by Manufacturer.\n\n\n\n\n\n\n\n\n\n\nCERTIFICATION\n\nFor all covered processes at this facility, the undersigned certifies that, to the best of my\nknowledge, informa"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 7074,
      "SummaryText": "our PHAs are resolved appropriately, and we\nensure that information from our PHAs (including recommendation resolutions) is\ncommunicated to all potentially affected employees.\n\n\n     Process Hazard Analysis Details\n\nWe conduct systematic PHAs of the regulated processes at our facility according to an\nestablished schedule.  This schedule ensures that we (1) address each process in a prioritized\norder (based on the extent of process hazards, the number of potentially affected employees\nand/or offsite population, the age of the process, and the operating history of the process) and (2)\nupdate/revalidate each PHA at least every five years (or more often if necessary because of\nprocess changes).\n\nInitial and updated/revalidated PHA reports, which document the required regulatory items, will\nbe included at a later time once the recommended changes have been approved and implemented. \nThere are no documents which show cradle to grave resolution of PHA recommendations. \nThese documents will be available at such time as these recommendations are approved and\nimplemented including all phases of implementation.\n\nA Chlorine System Process Hazard Analysis document representing a walk through of the entire\nchlorine system, potential problems noted, alarm conditions, and emergency action steps which\nmust be taken to ensure employee and public safety has been developed.  This walk through was\nconducted with the assistance of several lead operators and all operators were consulted on the\ndevelopment of this PHA.  A What If Check List approach was used in the creation of the\nHazard Analysis document.\n\nOur PHA teams are composed of personnel with engineering and process operating experience,\nincluding at least one person who has knowledge and experience in the process to be evaluated\nand a PHA team leader trained in the application of the hazard evaluation technique used for the\nPHA.\n\nOperating Procedures\n\nIn accordance with Section 68.69 of the RMP rule, we use operating procedur"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 7074,
      "SummaryText": "RISK MANAGEMENT PLAN\n\n\n                                                            FOR\n\n\n                             NORTH CHARLESTON SEWER DISTRICT\n                                                          WWTF\n\n\n\n                                      1000 HERBERT STREET SITE\n\n\n                                                             BY\n\n\n                         FAGGERT CONSULTING ASSOCIATES INC.\n                                              RICHMOND, VA\n                                                         AND\n                          NORTH CHARLESTON SEWER DISTRICT\n\n\n                                                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                         RMP MANAGEMENT SYSTEM\n\n                              NORTH CHARLESTON SEWER DISTRICT\n\n                                            NORTH CHARLESTON, SC\n\n\n     OVERALL RESPONSIBILITY\n\nThe Chief of Plant Operations (CPO) has the overall responsibility for ensuring that the North\nCharleston Sewer District Waste Water Treatment Facility (NCSD WWTF) (two sites, Herbert\nStreet and Greenleaf Street) operates in a safe and reliable manner.  However, initially the\nAssistant District Manager, NCSD (the CPO's supervisor) will have the responsibility for\noverseeing the implementation of the elements of the risk management program (RMP) at this\nsite.  This activity will include the development, implementation, and integration of the EPA\nRMP elements and the elements of OSHA's PSM program (where applicable) as required under\nSection 68.15 of the RMP rule.  Once the facility RMP is in place, the Chief of Plant Operations\nwill assume responsibility for compliance and on-going maintenance of the program.\n\nThe Assistant District Manager will serve as the chairman of the facility's PSM/RMP Steering\nCommittee.  This committee comprises members with responsibilities for developing and\nmanaging specific elements of the risk management and process safety program"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 7074,
      "SummaryText": "history for accidental releases of chemicals covered by the RMP rule\n\n     A summary of our emergency action program\n\n     An listing of planned improvements at this site to help prevent accidental chemical\n     releases\n\n     The certification that the RMP rule requires us to provide\n\n     The detailed information (called data elements) about our risk management program\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe NCSD facility is a wastewater treatment operation (WWTF) located in Charleston , SC on\ntwo sites - the 1000 Herbert Street site and the 1400 Greenleaf Street site.  At this Herbert Street\nsite wastewater is disinfected.  In so doing, we use the following toxic chemical that EPA has\nidentified as having the potential to cause significant off site consequences in the event of a\nsubstantial accidental release:\n\nCHEMICAL NAME                 USE\n\nChlorine                           Disinfection of waste water\n\nNo covered flammable chemicals are utilized at this site.\n\nOur above mentioned PSM, RMP and EAP programs help us effectively manage the hazards that\nare posed to our employees, the public, and the environment by our use of this chemical.\n                                 \n\nKEY OFFSITE CONSEQUENCE ANALYSIS SCENARIOS\n\nThe RMP rule requires that NCSD provide information about the worst-case release scenario and\none alternative release scenarios for our site.  The following are brief summaries of these\nscenarios, including information about the key administrative controls and mitigation measures\nto limit the exposure distances for each scenario:\n\nWORST-CASE RELEASE SCENARIO - Regulated Toxic Chemicals\n\nEVENT - CHLORINE\n\nChlorine rail car rupture releasing entire contents (180,000 lbs.) To the ground in a ten minute\ntime period.  This scenario release mandated by EPA.\n\nEstimated Exposure Distance- 14 miles\n\nPotentially Impacted Receptors - Industrial, residential and recreational areas; schools, hospitals;\nas well as, environmental receptors such as wetl"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 7074,
      "SummaryText": "tion, and belief, formed after reasonable inquiry, the information submitted\nin this RMPlan is true, accurate, and complete.\n\nSignature:\n\n\nTitle:\nDate:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                              NCSD RELEASE PREVENTION PROGRAM\n                                                         LEVEL 3\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                   NCSD PREVENTION PROGRAM - LEVEL 3\n\n\nIntroduction\n\nNCSD takes a systematic approach to preventing accidental releases of hazardous chemicals. \nOur management systems address each of the key features of an accidental release prevention\nprogram including:\n\n     Process safety information (PSI)\n     Process hazard analysis\n     Operating procedures\n     Training\n     Mechanical integrity\n     Management of change\n     Pre-startup review\n     Compliance audits\n     Incident investigation\n     Employee participation\n     Hot work permit\n     Contractors\n\nThese individual elements of our accidental release prevention program work together to prevent\naccidental chemical releases.  NCSD and our employees are committed to the standard that these\nmanagement systems set for the way we do business, and we have specific accountabilities and\ncontrols to ensure that we are meeting our standards for accident prevention.\n\nProcess Safety Information\n\nIn accordance with Section 68.65 of the RMP rule, we systematically control the development,\nupdating, and retention of documentation associated with our process chemicals, process\ntechnology, and process equipment.  This information is essential for supporting all of the other\nelements of our risk management program.  We also use this information directly to ensure that\nour equipment is suitable for its intended use.\n\n     Process Safety Information Details\n\nWe maintain the following chemical process information for each regulated substance in a\ncovered process as well as for other hazardous materials in both covered and noncovered\nprocesses:\n\n     Tox"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 7074,
      "SummaryText": "icity information\n     Permissible exposure limits\n     Physical data\n     Reactivity data\n     Corrosivity data\n     Thermal and chemical stability data\n     Hazardous effects of inadvertent mixing of different materials that could forseeably occur\n\nThe above information may be found in Attachment 1 Material Safety Data Sheets (MSDS)\nwhich comply with OSHA's Hazard Communication Standard 29 CFR 1910.1200.\n\nWe maintain the following required process technology information:\n\n     Block flow or simplified process flow diagram\n     Process chemistry\n     Maximum intended inventory\n     Safe upper and lower limits for parameters such as temperature, pressure, flow, or\n     composition\n     Evaluation of the consequences of deviations from established operating limits \n     Materials of construction\n     Piping and instrument diagrams (P&IDs)\n     Electrical classification\n     Relief system design and design basis\n     Ventilation system design\n     Design codes and standards employed\n     Material and energy balances for processes built after 6/21/99\n     Safety systems (interlocks, detection, or suppression systems)\n\nThe information required above is included, as appropriate, in a document titled Chlorination\nSystem which is maintained at the Herbert Street site.  This document includes a general\ndescription of the Chlorination process and system, as well as sections on Chlorine chemistry,\nChlorine Supply, Chlorine Evaporators, Pressure Reducing Valves, Chlorinators and Ejectors,\nChlorine Control System, Chlorine Gas Detection System, Instrument Diagrams, Block\nDiagrams, and Equipment/System Design Specifications.\n\nProcess Hazard Analysis\n\nIn accordance with Section 68.67 of the RMP rule, we use process hazard analyses (PHAs) to\nsystematically identify, evaluate, and control process hazards.  The most important products of\nour PHAs are recommendations for reducing the most significant risks of accidental chemical\nreleases.  We ensure that all recommendations from"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 7074,
      "SummaryText": "es to define how\nprocess-related job tasks assigned to our personnel should be performed to avoid incidents.  We\nuse these procedures to (1) train our employees/contractors before they perform tasks in the field,\n(2) serve as reference guides for personnel performing tasks, and (3) specify what to do if a\nprocess upset or operating emergency occurs.\n\n     Operating Procedures Details\n\nStandard Operating Procedures have been developed and revised to reflect the findings of the\nPHA> these procedures contain the required steps to run the process for all modes of operations. \nAlso included are documents, which show operator and mechanic certifications for those who are\nresponsible for the chlorine system.  These Operating Procedures shall be updated at least\nannually or whenever a change in the operation of the system occurs.  The Chief of Plant\nOperations shall be the only employee who is authorized to make changes in these procedures\nwith the guidance and approval of the remaining PHA team members.\n\nTraining\n\nIn accordance with Section 68.71 of the RMP rule, we train our employees to safely perform\ntheir assigned tasks.  Our training program includes initial training as well as periodic refresher\ntraining and training updates when major process/equipment changes are made.  As part of our\ntraining, we include provisions for ensuring that employees understand the training (written tests,\nfield demonstrations, etc.).\n\n     Training Details\n\nThe North Charleston Sewer District currently has an employee-training program in effect for the\nWastewater Treatment Facility sites.  This program combines the training programs and material\navailable from the Chlorine Institute, WEF, Vendors and Suppliers of the Chlorination\nEquipment and the knowledge and expertise of facility personnel.  This section describes the\nmanagement's role and responsibilities and gives an overview of the program elements.  The\ncurrent outline of the training program is available.\n\nThe North Charleston Se"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 7074,
      "SummaryText": "wer District's Wastewater Treatment Plant's employee training program\nis administered by the Chief of Plant Operations and Maintenance Superintendent for each of\ntheir respective departments.  Both of these positions are under the direction and guidance of the\nAssistant District Manager.  The responsibility for ensuring that the employees are properly\ntrained and aware of all safety practices, hazards, emergency procedures, and maintenance\nprocedures associated with their jobs is shared between the above individuals.  Keeping the\nemployee informed and trained will only help to minimize the potential for an on site accident. \nImportant elements of the training program include initial training, additional training, and\ndocumentation.\n\nMechanical Integrity\n\nIn accordance with Section 68.73 of the RMP rule, we maintain the mechanical integrity (MI) of\nour process equipment using an inspection and testing program and a quality assurance program,\nand we ensure that our equipment is designed and installed correctly so that it operates properly. \nWe train our maintenance personnel in the hazards of the process, and we also provide additional\ntraining on procedures for maintaining the ongoing integrity of our process equipment so that job\ntasks are performed safely.\n\n     Mechanical Integrity Details\n\nAn ongoing mechanical integrity program is used to ensure safe process operation.  The elements\nof the mechanical integrity program include the identification and categorization of equipment\nand instrumentation, inspections and tests, testing and inspection frequencies, development of\nmaintenance procedures, training of maintenance personnel and criteria for acceptable test\nresults, documentation of test and inspection results, and documentation of manufacturer's\nrecommendations as to the mean time for failure of equipment and instrumentation.\n\nEquipment used to process, store, or handle chlorine are designed, constructed, installed, and\nmaintained to minimized releases.  To ac"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 7074,
      "SummaryText": "complish this, an effective mechanical integrity program\nhas been established to ensure the continued integrity of the process equipment.\n\nThe priority for safe process equipment operation is:\n\n     Primary Line of Defense\n     \n     1.   Operate and maintain the process as designed and keep chemicals contained.\n\n     2.   Controlled release of chemicals through venting to appropriate areas designed to \n          Minimized exposure to employees.\n\n     Secondary Line of Defense\n\n     3.   Fixed alarm equipment such as Chlorine leak detectors, computer monitoring of \n          system pressures and temperatures and continuous monitoring of parameters.\n\nThe mechanical integrity program protects the above lines of defense and ensures effective\nhighly hazardous chemicals control.\n\nIn order to maintain the mechanical integrity of the process equipment, written procedures have\nbeen established for the preventive maintenance of process equipment, as well, as inspection and\ntesting procedures.  These written procedures must be implemented and performed on process\nequipment in order to maintain the on going integrity of the process equipment.  Documents\nwhich show the computerized preventive maintenance system currently in place including the\ntests/inspections to be performed, and frequency of tests/inspections are in place.  Permanent\nrecords of the results of these tests/inspections are located in the Maintenance Superintendent's\noffice.  Also, mechanic certification documents are located in the section entitled Operating\nProcedures.  This information is in accordance with the equipment vendor technical manuals\nlocated in the section entitled Process Safety Information.\n\nManagement of Change\n\nIn accordance with Section 68.75 of the RMP rule, we evaluate and approve all proposed\nchanges (i.e., modifications that are not replacements in kind) to covered process chemicals,\ntechnology, equipment, and procedures prior to implementation through our management of\nchange (MOC) progr"
    }
  ]
}