{
  "FacilityID": 7088,
  "FacilityName": "Puritan Ice Company",
  "FacilityStr1": "4585 West Main Street",
  "FacilityStr2": null,
  "FacilityCity": "Guadalupe",
  "FacilityState": "CA",
  "FacilityZipCode": "93434",
  "Facility4DigitZipExt": "1659",
  "FacilityCountyFIPS": "06083",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.957639",
  "FacilityLongDecDegs": "-120.593694",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 8371122,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Puritan Ice Company",
  "OperatorStr1": "P.O. Box 59",
  "OperatorStr2": null,
  "OperatorCity": "Guadalupe",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93434",
  "OperatorZipCodeExt": null,
  "RMPContact": "Rennie Pili",
  "RMPTitle": "President",
  "FTE": 471,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000089897",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-23 00:00:00",
  "SafetyInspectionBy": "Santa Barbara County HazMat",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-02-16 00:00:00",
  "DeRegistrationEffectiveDate": "2006-11-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.95766,
  "FRS_Long": -120.59369,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8535,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 7088,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8741,
          "ProcessID": 8535,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9382,
          "ProcessID": 8535,
          "ChemicalID": 56,
          "Quantity": 17000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509382,
          "ProcessID": 8535,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7088,
      "SummaryText": "Puritan Ice Company, Apio, Inc., and Coastal Valley Packing (Facility) are three separately owned facilities that utilize the same ammonia refrigeration system to refrigerate storage space and process equipment (i.e. chillers, ice makers, etc.). These facilities are situated on contiguous properties that share the same ammonia refrigeration system (both equipment and ammonia).  The following three companies make up one stationary source based on the fact that they are situated on contiguous properties and are in the same industrial group:\n\n1.        Puritan Ice Company, 4585 West Main Street, Guadalupe, California\n           DUNS:  00-837-1122\n           Contact:  Rennie Pili (805) 343-1514\n\n2.        Apio, Inc., 4575 West Main Street, Guadalupe, California\n           DUNS:   03-755-3864\n           Contact:  Randy Ford (805) 343-2835\n\n3.        Coastal Valley Packing, Inc., 151 Obispo Street, Guadalupe, California\n           DUNS:    04-363-7537\n           Contact:  Corky Chojnacky (805) 343-1101\n\nPuritan Ice Company and Apio, Inc. own and operate their respective equipment.  Puritan Ice Company owns and operates the ammonia refrigeration equipment located at the Coastal Valley facility.  In addition, Puritan Ice Company owns and operates the \"common\" engine rooms that provide the liquid ammonia for both Apio, Inc. and Coastal Valley Packing, Inc.\n\nThe facilities prepared a common Process Safety Management Program as well as a common Risk Management Program.  The following topics summarize these common programs for all three facilities.\n\nA.    ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE\n    POLICIES\n\nThe emergency response procedures for the facilities are included as part of the Process Safety Management/Risk Management Program manual.  These procedures were designed to meet the following objectives:\n\n    1.    To save lives.\n    2.    To minimize and avoid injuries.\n    3.    To protect the environment.\n    4.    To minimize property damage.\n\nThe \"Hazardous Materials Emergency Respons"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7088,
      "SummaryText": "e Plans and Procedures\" (Response Plan) was designed to provide the facility and its employees with the procedures required for responding to hazardous materials incidents, and minimizing or avoiding hazards to human health and the environment.  In the event of an emergency, the Emergency Coordinator or designated alternate will ensure that the emergency response procedures are enforced.  The Emergency Coordinator is familiar with the Response Plan, the facility operating procedures, and the properties of ammonia.\n\nAll area personnel adhere to specific emergency operations as detailed in the Response Plan.  The Response Plan provides the response and authority notification, evacuation, and mitigation procedures which are implemented to respond effectively to emergency situations that may arise at the facility.  These emergency procedures are summarized in the following three subsections.  \n\n\nB.    STATIONARY SOURCE AND REGULATED SUBSTANCE\n\nPuritan Ice Company, Apio, Inc. and Coastal Valley Packing (Facility) are the three facilities that utilize the same ammonia refrigeration system.  The system is a closed system that cycles the refrigerant, or ammonia, from liquid to gas and back again.  The system has a low pressure or low side, where the refrigerant absorbs heat as it evaporates, and a high pressure or high side, where the refrigerant vapor gives off heat as it is condensed back into a liquid.  (In operation the system basically moves heat from the low side to the high side.)  Refrigeration is maintained by isolating the low side in some form of insulated enclosure where goods are processed, chilled, or frozen.  \n\nAmmonia is the regulated substance of concern.  There is 17,000 pounds of ammonia in this single process.\n\n*Puritan Ice Company*\n\nThe ammonia used by all three facilities originates at the Puritan Ice liquid receiver.  This vessel has a 1500 gallon capacity and is the location for loading ammonia.  Liquid ammonia from this vessel is used in the Block Plan"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7088,
      "SummaryText": "t ice tanks and ice storage room.  Large blocks of ice are produced and stored until ready for delivery at this facility.  \n\nThe Block Plant also has the capability to compress and condense the ammonia vapor from the ice tanks, ice storage room, and various other equipment used by the two other facilities.  This ammonia vapor is condensed to its liquid form and recycled back to the liquid receiver.\n\nThe Puritan Ice Company owns and maintains a two additional compressor stations, Compressor Room #1 and #2, next to Apio, Inc.  Compressor Rooms #1 and #2 work together to supply Apio, Inc. and Coastal Valley with ammonia for their process equipment.  These rooms are equipped with a 750 gallon liquid receiver and have the capability to compress and condense the ammonia vapor from the various refrigerated devices throughout the three facilities.  This ammonia vapor is similarly condensed and recycled back to the Compressor Room liquid receiver.\n\n*Coastal Valley*\n\nThe Coastal Valley Packing Company receives liquid ammonia from the Block Ice Plant liquid receiver with the Compressor Room liquid receiver acting as a backup.  The ammonia is delivered to two accumulators that supply liquid ammonia to 22 evaporators and two hydro-coolers.  The evaporators are located in several cooler rooms within a large warehouse.  These cooler rooms are used to store vegetables.  The two hydro-coolers are located outside of the warehouse next to one of the evaporators.  The two hydro-coolers are used to pre-cool vegetables.\n\n*Apio, Inc.*\n\nApio receives liquid ammonia from the Puritan Ice Company Block Plant receiver and stores it in the Compressor Room receiver.  This high pressure liquid is delivered to accumulators through expansion valves, for various refrigeration needs.  Apio utilizes this low pressure liquid ammonia to maintain temperature at the \"cooler\" rooms and generate cold temperatures using a \"hydro-vac\" process.  The  equipment Apio consists of evaporators, 100-300 gallon accum"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7088,
      "SummaryText": "ulators, and tunnel pressure coolers.  Unlike Coastal Valley, Apio's cooling system is normally operated independent of the Block Plant.\n\nC.  HAZARD ASSESSMENT SUMMARY\n\nWorst Case Release Result Summary\n\nThe worst case release for this facility was that of the maximum quantity of ammonia that can be stored in a vessel.  The largest vessel is the high pressure receiver located in Compressor Room #1. This vessel can hold 3000 gallons (16,500 pounds).  This quantity was released in 10 minutes.  Since the vessel is located inside the engine room, the enclosure was included as a  passive mitigation measures when calculating the release rate to the outside atmosphere (908 lbs/min). The most pessimistic meteorological conditions were used: 1.5 meters/second wind speed, and F stability.  The facility is located in a rural setting.  \n\nThe downwind distance to 200 ppm was determined using Exhibit 4-4 from the EPA \"Risk Management Program Guidance for Ammonia Refrigeration\", November 1998.  The release reaches off-site and may affect population receptors.  No environmental receptors are affected by this potential scenario.\n\nAlternative Release Result Summary\n\nThe alternative release scenario was that of a 0.25 inch diameter leak of a low pressure liquid ammonia for one hour.  This release was chosen because there are ammonia lines external to the facility and a 0.25 inch leak could be caused by a flange seal leak or a valve packing leak.  The quantity of ammonia released in one hour at this rate and at 30 psig is 3,300 pounds.  The meteorological conditions used were 3 meters/second wind speed, and D stability. The facility is located in a rural setting.  \n\nThe downwind distance to 200 ppm was determined using Exhibit 4-5 from the EPA \"Risk Management Program Guidance for Ammonia Refrigeration\", November 1998.  The release reaches off-site and may affect population receptors.  No environmental receptors are affected by this potential scenario.\n\nD.  ACCIDENTAL RELEASE PREVENTIO"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7088,
      "SummaryText": "N PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nAdministrative Measures\nThe facilities have implemented a Process Safety Management program for compliance with the Cal-OSHA 5189 regulation. The training program at the Puritan Ice Company encompasses an assortment of personnel with varying degrees of responsibilities.  Therefore, the training  differs depending on the type of position an employee holds.  The minimum amount of training provided the facility employees, includes the following:\n\n1.  Safe handling of hazardous materials including the health hazard associated with the hazardous material(s) used, proper handling procedures and precautions, and personal protective equipment which must be worn or used.  This is be achieved by introducing and explaining the Material Safety Data Sheets (MSDS).\n\n2.  Procedures for notifying and coordinating local emergency response organizations.\n\n3.  Use of emergency response equipment and supplies under control of the handler for spills, fire, disposal and first aid.\n\n4.  The emergency response plan and procedures specified in the Process Safety Management document.\n\nThe training program for emergency response team members is designed to ensure the safe operation of the facility.  This is accomplished by providing the necessary training to ensure that these personnel are able to respond to emergencies and are familiar with the company emergency response procedures, emergency equipment, and emergency systems at the facility.  This specialized training is provided to employees annually as a refresher course and within six months of their employment or assignment to a  hazardous waste handling position or to the emergency response team.  Hazardous waste handlers are not permitted to work unsupervised until they have received this training.\n\nEngineering Measures\nThe Puritan Group facilities were designed to generate ice and provide cold room storage through the use of ammonia refrigeration systems.  Most of the ammonia systems a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 7088,
      "SummaryText": "re based on a time monitoring operation.  Some are manually monitored while others are automatically operated by use of a computer controller system.  These control systems and safety features are described in the following subsections.\n\nBuilding and structures were constructed according to local, state and federal codes at the time of construction.  The Puritan Ice Compressor Rooms #1 and #2 refrigeration equipment and construction has been designed to conform with the UBC, UPB, UMC ANSI B15 and ANSI B31.5 latest addition codes.  Particularly, Compressor Room #1 conforms to the 1988 Edition of the UFC, Article 63, Mechanical Refrigeration and Compressor Room #2 conforms to the 1991 UFC.  The piping was tested prior to start up with compressed air for ten minutes.  All joints were inspected with a soap solution.  In addition, all structural steel conforms to the American Society of Testing and Materials (ASTM) Specification A-36 and all structural tubing conforms to \n\nASTM A-500, Grade A.  All concrete work at the facility complies with the Uniform Building Code (UBC) Chapter 26.\n\nThe alarm and monitoring systems at the Puritan Group facilities consist of numerous equipment status indicators (pressure, temperature, liquid level and electrical power).  Some of the equipment indicators are remote and monitored by operators during daily rounds whereas others are controlled and monitored by a computer system.  There are several types of equipment status indicators throughout the facility: pressure, temperature, level, and flow.  These indicators monitor the status of the different devices.  Some status indicators send an alarm to the control system, others trigger another device to start up or shut off, and some are remote indicators that are monitored on a routine basis during operations.\n\nThe screw compressors in the Puritan Compressor Rooms are linked to a Compressor Control System (CCS) which is accessible through a computer modem connection.  The CCS was developed "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 7088,
      "SummaryText": "by M&M Refrigeration, Inc., the manufacturer of the compressors.  All information regarding the CCS was provided by the \"Compressor Control System Operations Manual\", written by M&M Industrial Refrigeration Computer Control Systems, 1990.  This system is designed to provide \"continuously updated information\" as to the status of the compressors and allow the operator to make operational changes to the compressors from a remote location.  \n\nThe CCS is equipped with a \"STOP\" key that acts as a remote shut down button and safely terminates operation of the compressor.  This key is active \"regardless of which Screen or Menu is currently displayed\".  \n\nThe CCS is also equipped with alarm and failure messages and include the following conditions (\"Compressor Control System Operations Manual\", written by M&M Industrial Refrigeration Computer Control Systems, 1990):  Low Suction Pressure, High Discharge Pressure, High/Low Oil Pressure, High Oil Filter Pressure Drop, High Discharge Temperature, High Oil Temperature, Motor Starter Failure, and Starting Sequence Failure.  These alarm conditions are preset and operator adjustable.  In the event of an alarm, the Alarm Output will show on the screen and be recorded in the Operational Log and Alarm History for recordkeeping purposes.  If the condition persists and exceeds the Failure Set Point, the compressor will automatically shut down.\n\nE.  FIVE YEAR ACCIDENT HISTORY\n\nThe five year accident history investigation (June 1994 through June 1999) revealed that there have been no releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds. In addition, there have been no injuries resulting from an ammonia release.  \n\nF.  EMERGENCY RESPONSE PROGRAM\n\n*PURITAN ICE COMPANY*\nPuritan's \"Hazardous Materials Emergency Response Plans and Procedures\" (Response Plan) was designed to provide Puritan and its employees with the procedures required for responding to hazardous materials incidents, and minimizing or avoiding hazard"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 7088,
      "SummaryText": "s to human health and the environment.  In the event of an emergency, the Emergency Coordinator or designated alternate will ensure that the emergency response procedures developed by Puritan are enforced.  The Emergency Coordinator is familiar with the Response Plan, the facility operating procedures, and the properties of ammonia.\n\nAll Puritan personnel will adhere to specific emergency operations as detailed in the Response Plan.  The Response Plan provides the response and authority notification, evacuation, and mitigation procedures which are implemented to respond effectively to emergency situations that may arise at the facility.  These emergency procedures are summarized in the following three subsections. \n\nResponse Organization and Notification Procedures \nIn the event of an emergency (fire, ammonia release or spill), the operator will immediately notify the Emergency Coordinator or alternate response personnel.  The Emergency Coordinator or response personnel on duty will determine whether immediate notification of local emergency response agencies is necessary.  For emergencies they will call 911.  For non-emergencies they will initiate response procedures and then contact the necessary agency.  \n\nEmployees are notified of emergency conditions by use of the telephone speaker feature.  The Emergency Coordinator or alternate response personnel will notify the Puritan employees of the conditions and give instructions as to whether or not to evacuate and if so, which route is the safest.\n\nThe State of California requires that any release or threatened release must be immediately reported to the proper agencies immediately unless the release poses no significant potential hazard to human safety, health, property or process equipment.  The exact location of release, name of person reporting the incident, type of material involved, estimated quantity, and potential hazards due to release must be reported to the agencies.\n\nEvacuation Routes and Procedures\nIn the"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 7088,
      "SummaryText": " event of an emergency, the Emergency Coordinator or alternate emergency response personnel will initiate an evacuation of the facility.  Puritan is equipped with an evacuation horn to notify all personnel to commence evacuation procedures that are outlined in the Response Plan.  Emergency evacuation routes are posted in the main office, the employee lunch room, and the maintenance shop.  Once evacuated, all employees will congregate at the gathering point located on the north west part of the property.  Due to the fact that there are several facilities located in the same general area, there is an evacuation area call list to notify these companies of the emergency situation.\n\nMitigation Measures\nNumerous emergency response equipment is located throughout the facility to aid in the prevention of emergency conditions.  A fire hydrant, fire extinguishers, and gas masks are located throughout the facility to aid in fire fighting, ammonia neutralization, repairs, and emergency escape.  Also available in the employee room and engineer room are personal protection equipment including neoprene gloves, rubber boots, pants and jackets, full face shields, and eyewash and shower.  \n\nThe gas masks available at Puritan are compact air purifying units used during maintenance of ammonia equipment or if there is an excessive concentration of ammonia present.  Maintenance personnel are required to wear gas masks when installing, adjusting, or repairing refrigeration equipment and there is a possibility of an accidental release of liquid or vapor ammonia.  Puritan has implemented a Respiratory Inspection Program to ensure that all necessary personnel are fitted and familiar with the masks.  This program also ensures that all respiratory equipment is maintained in safe working condition by regularly inspecting, cleaning, and repairing the equipment. \n\nEmergency Action Plans for earthquakes and Hazardous Materials Containment are included in the Response Plan.  The MSDS for ammonia is"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 7088,
      "SummaryText": " also provided in the Response Plan.  The Response Plan also contains a Hazardous Materials Emergency Medical Plan which includes procedures for ammonia burns and ammonia poisoning by inhalation, eyes, or internally.  The Puritan Ice Company performs annual fire and ammonia spill drills both with and without the participation of the local fire department.\n\n*COASTAL VALLEY PACKING COMPANY*\n\nCoastal Valley's emergency response procedures are outlined in the Business Plan.  There is a designated emergency response team that will respond in the event of an ammonia release.  The Puritan Ice Company will also be available to aide in responding to an ammonia release.  Below is a summary of the Coastal Valley emergency response procedures.\n\nNotification and Evacuation Procedures\nIn the event of an ammonia release, the first witness will notify the shift supervisor.  The shift supervisor will alert the employees to evacuate by use of the voice activated intercom system.  He will be responsible for designating the evacuation route and assembly area.  Typically, this is up wind or at the northwest corner of the facility (as for Puritan).\n\nMitigation Measures\nThe Coastal Valley facility is equipped with a respirator which is located in the dispatch office for emergency response.  Fire extinguishers are located in various locations throughout the plant along with two fire hoses at critical locations.\n\n*APIO, INC.*\n\nApio's \"Injury and Illness Prevention Program\" (Prevention Program), was designed to ensure a safe and healthful working environment.  The policy at Apio is to identify and correct unsafe conditions and work practices before an incident can occur.  The Prevention Program outlines the company safety policy, responsibilities, accident investigation, and proper safety training procedures required to provide a safe work place.  \n\nApio's Emergency Response Plan is outlined in the Standard Operating Procedures and focuses on responding to ammonia releases.\n\nResponse Organiz"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 7088,
      "SummaryText": "ation and Notification Procedures \nIn the event of an accident, the operator should immediately notify his supervisor.  During the first few moments of the event, the witness should assess the situation as follows:\n\n    1)    How severe is the problem?\n    2)    Is there any personnel in danger?\n    3)    What is running at the time?\n    4)    Where is the leak source?    \n    5)    What can be done about the leak?\n    6)    Has the hazard communication process been initiated?\n\nIf the operator was able to extinguish the emergency, then the accident investigator should be notified.  The accident investigator then proceeds to consider sever questions as to the incidents surrounding the emergency.  The questions are numerous and include finding out key elements as to the occurrence of the accident.  Some key questions include the following:  \n\n    1)    Who was involved?  \n    2)    What was the accident? \n    3)    When did it occur? \n    4)    Why did the operator react the way he did? \n    5)    Where did the accident occur? How did he get injured? \n    6)    How could this be avoided in the future?\n\nAll ammonia leaks, regardless of size, are reported to the Santa Barbara County Fire Department.  Finally, the refrigeration service organization is notified to assist in putting the plant back on-line following an ammonia release.\n\nEvacuation Routes and Procedures\nIn the event of an emergency requiring evacuation, personnel will be instructed to vacate the premises to the designated assembly area.  This is upwind of the release and typically at the northwest corner of the facility (as for Puritan and Coastal Valley).  \n\nMitigation Measures\nA group response team will be established and responsible for controlling the leak.  They will be trained as to the use of personal protective equipment and ammonia leak control.  The control procedures include stopping the flow of high pressure liquid ammonia and decreasing the pressure in the pipeline.  This is accomplished by raising the demand requirements on the accumulator.\n\nThe response team is train"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 7088,
      "SummaryText": "ed and fitted with personal protective equipment to be able to respond to an ammonia leak.\n\nG.  PLANNED CHANGES TO IMPROVE SAFETY\n\nAn initial Process Hazard Analysis study was conducted at the facility in 1992.  In addition, a Seismic Risk Assessment was conducted by a structural engineering firm that same year.  On March 23, 1999, a  Process Hazard Analysis Revalidation study was performed to review these two previous studies, examine new equipment and modifications, and conduct additional analyses for compliance with the new CalARP Program and EPA Risk Management Program regulations.\n\nThe recommendations from this latest study are summarized below.  It is expected that these recommendations will be implemented by December 2000.\n\n\nHAZOP Recommendation Review\n\nR01    Consider training additional on-site personnel (from Apio or Coastal Valley) in the proper use of SCBAs.\n\nR02    Consider implementing a daily log program for the Apio equipment and each engine room at Puritan Ice.\n\nR03    Implement a formal lockout/tagout program and maintain the appropriate documentation.\n\nR04    Establish a policy to change all relief valves in the ammonia system every 5 years or any time one is exercised.\n\nR05    Bolt down the two existing Hydro-Vac refrigeration containers to the concrete slab at Apio Cooling.\n\nWhat-If Walkthrough\n\nR06    Consider: 1) installing a check valve (or another way to prevent backflow from the HPR) in the ammonia fill line; or 2) locking closed the hand valve at the fill connection.\n\nR07    Ensure that all ammonia sensors in the system are tested and calibrated based on manufacturer recommendations (or at least annually).\n\nR08    Determine and document what all ammonia detector setpoints are and the associated actions taken.\n\nR09    Perform a manual test on the high level shut down switches on all the accumulator vessels in the system on an annual basis.\n\nPHA Revalidation\n\nR10    Establish a policy to clean up a low pressure liquid pool of ammonia with an absorbent material.\n\nR11    Veri"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 7088,
      "SummaryText": "fy and document that the high level shut down switches on the suction accumulator vessels and pump recirculator vessels shut down the appropriate compressors to prevent liquid slugging.\n\nR12    Perform and document a detailed periodic inspection of the piping around the facility, especially in the Apio processing areas.  Replace piping as needed.\n\nR13    When maintenance is performed on the valving in the VA attic, ensure that the operator uses a mask and alerts somebody of expected return time.\n\nR14    Ensure that a water treatment program is in place on all the condensers at the facility.\n\nR15    Ensure that the relief valves on the compressors are set at significantly higher pressures than the compressor safety cutouts.\n\nSafety Checklists\n\nR16    Establish a procedure to make all employees at each company on the facility aware of the presence of and the hazards associated with anhydrous ammonia.\n\nR17    Ensure that all employees at each company on the facility are aware of ammonia emergency evacuation procedures.  Hold at least annual evacuation drills to which the local fire department is invited.\n\nR18    Ensure that all employees at each company on the facility are aware of how to report an ammonia emergency.\n\nR19    Label key valves that are used regularly including oil draining valves.\n\nR20    Install a wind sock or other wind direction indicator at Coastal Valley or Point Sal.\n\nR21    Use a third party engineer to investigate and verify seismic adequacy of all portions of the ammonia system.  Revalidate Seismic Assessment conducted as part of the RMPP."
    }
  ]
}