{
  "FacilityID": 7142,
  "FacilityName": "Occidental Chemical Corp. - Pottstown Plant",
  "FacilityStr1": "375 Armand Hammer Blvd",
  "FacilityStr2": "P.O. Box 699",
  "FacilityCity": "Pottstown",
  "FacilityState": "PA",
  "FacilityZipCode": "19464",
  "Facility4DigitZipExt": "0699",
  "FacilityCountyFIPS": "42091",
  "LEPC": "Montgomery County LEPC",
  "FacilityLatDecDegs": "40.229167",
  "FacilityLongDecDegs": "-75.611111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "AV",
  "FacilityURL": "www.oxychem.com",
  "FacilityEmailAddress": "pottstown_plant_p&p@oxy.com",
  "FacilityDUNS": 47865340,
  "ParentCompanyName": "Occidental Petroleum Corporation",
  "Company2Name": null,
  "CompanyDUNS": 6908354,
  "Company2DUNS": 0,
  "OperatorName": "Occidental Chemical Corp.",
  "OperatorStr1": "375 Armand Hammer Blvd",
  "OperatorStr2": "P.O. Box 699",
  "OperatorCity": "Pottstown",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19464",
  "OperatorZipCodeExt": "0699",
  "RMPContact": "Scott R. Harp",
  "RMPTitle": "Programs Manager",
  "FTE": 301,
  "OtherEPAFacilityID": "19464CCDNTARMAN",
  "EPAFacilityID": "100000091697",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "Not Available",
  "SafetyInspectionDate": "1999-03-30 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Occidental Chemical Corporations' Pottstown Plant",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-04-25 00:00:00",
  "DeRegistrationEffectiveDate": "2005-05-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.23208,
  "FRS_Long": -75.61417,
  "FRS_Description": "OTHER",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8596,
      "AltID": "Anhydrous Ammonia Storage",
      "FacilityID": 7142,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8802,
          "ProcessID": 8596,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9450,
          "ProcessID": 8596,
          "ChemicalID": 56,
          "Quantity": 19500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509450,
          "ProcessID": 8596,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 8597,
      "AltID": "Vinyl Acetate Storage",
      "FacilityID": 7142,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8803,
          "ProcessID": 8597,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9451,
          "ProcessID": 8597,
          "ChemicalID": 29,
          "Quantity": 412600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509451,
          "ProcessID": 8597,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 8598,
      "AltID": "Vinyl Chloride Storage",
      "FacilityID": 7142,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8804,
          "ProcessID": 8598,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9452,
          "ProcessID": 8598,
          "ChemicalID": 101,
          "Quantity": 9351300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 101,
            "ChemicalName": "Vinyl chloride  [Ethene, chloro-]",
            "CASNumber": "75-01-4",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509452,
          "ProcessID": 8598,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7142,
      "SummaryText": "Occidental Chemical Corporation (OxyChem), a wholly owned subsidiary of Occidental Petroleum Corporation, owns and operates a polyvinyl chloride (PVC) and PVC copolymer resins manufacturing facility in Pottstown, PA. The facility, or stationary source, is located at 375 Armand Hammer Blvd. and consists of a processing plant and supporting operations. OxyChem's Pottstown Plant employs approximately 301 full time individuals.\n\n\n1) Accidental release prevention and emergency response policies at the stationary source  (' 68.155a):\n\nOxyChem is committed to the safety of workers, the public and the preservation of the environment through the prevention of accidental releases of hazardous substances. OxyChem implements reasonable controls to prevent foreseeable releases of hazardous substances. These controls include programs to train personnel, to help ensure safety in the design, installation, operation, maintenance of processes, and to evaluate the hazards at the Pottstown plant. The Pottstown plant participates in auditing processes like the OSHA Voluntary Protection Programs (VPP) to measure and enhance its prevention program.\n\nIt is our policy to adhere to all applicable federal, state and local rules and regulations, industry standards and best practices. In order to implement these policies effectively, OxyChem established a management system headed by the Health, Environmental, and Safety (HES) Departments to oversee safety and environmental-related activities.\n\nOxyChem is committed to operating the plant in a manner that is safe for its workers, the public and the environment. As part of this commitment, OxyChem has established a system to help ensure safe operation of the processes at the Pottstown Plant. One component of this system is a risk management plan (RMP) that:\n\n        helps manage the health, environmental, and safety risks at the plant\n\n        complies with the requirements of the United States Environmental Protection Agency's (EPA's) \n        "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7142,
      "SummaryText": " regulation 40 CFR Part 68, Accidental Release Prevention Requirements Risk Management Programs \n         under Clean Air Act Section (r)(7) (the RMP rule) and the Occupational Safety and Health \n         Administration's (OSHA's) regulation 29 CFR 1910.119, Process Safety Management (PSM)\n\nThis document is intended to satisfy the requirements of the RMP rule and to provide the public with a description of the risk management program at the Plant.\n\nThe risk management program at the Pottstown Plant consists of the following three elements:\n\n         A hazard assessment to help understand (a) the potential off-site consequences of hypothetical \n          accidental releases and (b) accidents that have occurred during the last five years associated with \n          the use of substances regulated by the RMP rule (regulated substances).\n\n         A prevention program to help maintain and safely operate the processes containing more than a \n          threshold quantity of a regulated substance (covered processes).\n\n         An emergency response program to help respond to accidental releases of regulated substances \n          from covered processes.\n\nFurther information describing these elements is provided in this RMP.\n\nAlthough the risk management program at the Pottstown Plant helps to provide assurances that the facility is maintained and operated in a safe manner, it is only one component of the safety program at the Plant. In fact, the Plant has a comprehensive safety program in place, establishing many levels of safeguards against a release of a hazardous substance as well as injuries and damages from a release of a hazardous substance.\n\nOxyChem's policy on the use of hazardous substances: Before using a hazardous substance, less hazardous alternatives are considered. When a hazardous substance is used, OxyChem considers the potential for this substance which could adversely affect the plant workers, the public and the environment through the management of chan"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7142,
      "SummaryText": "ge and the process hazard analysis processes and takes steps to prevent any such effects.\n\nOxyChem strives to prevent accidental releases of the hazardous substances used at the facility: OxyChem implements reasonable controls to prevent foreseeable releases of hazardous substances. When a hazardous substance is used, the equipment is carefully designed, built, operated, and maintained to reduce the likelihood of an accidental release. Industry and government standards are closely adhered to in the design, construction and operation of the equipment. OxyChem uses the Corporate Fire, Safety and Environmental (FS&E) Guidelines when designing new or modifying existing processes. Each project is thoroughly reviewed before approval. In addition, OxyChem requires the documentation of standard operating procedures and the training of affected employees with regard to these procedures as part of the management of change process. OxyChem's mechanical integrity program provides an ongoing process to verify the mechanical integrity of the equipment, piping, and instruments to prevent the release of hazardous substances.\n\nOxyChem's goal is to minimize impact from an accidental release: In the event of an accidental release, the Pottstown Plant controls and contains the release in a manner that will be safe for workers and will minimize impact to the public and the environment. OxyChem provides response training to its personnel, designates an emergency response coordinator to oversee response activities, conducts regular drills to review response activities and coordinates response efforts with the local emergency response agencies. OxyChem trains its workers to respond to an accidental release, reducing the consequences of a release if it occurs. In addition, OxyChem works with the local fire department, and the Montgomery County local emergency planning committee (LEPC) to help prevent injuries and/or environmental damage if a release does occur. Response activities have been"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7142,
      "SummaryText": " discussed with the LEPC.\n\nOxyChem is an active participant in the community: As part of OxyChem's Responsible Care. efforts, the Pottstown Plant has voluntarily been involved in a Community Advisory Panel (CAP) since 1992. The purpose of this group is to share information about plant operations with members of the community and to discuss their health, environmental, and safety concerns. The group meets monthly and covers topics of interest to the members including plant safety and environmental performance, emergency response programs, health issues, and process safety performance. Through this outreach effort, as well as other community involvement, the plant stays abreast of community concerns and works to address them.\n\nThe safety program at the Pottstown Plant consists of a number of elements, only some of which are required by the RMP rule. This RMP is primarily intended to describe those parts of the safety program at the Pottstown Plant that are required by the RMP rule.\n\nOver the past five years the Pottstown Plant has received the following safety and environmental awards:\n \nEnvironmental Awards:\n\nOccidental Chemical Corporation\n\n         1994 to present             Environmental Merit Award (received for the past four years)\n\n         1995                              Most Improved Environmental Performance Award\n\n         1995                              Environmental Awareness Award\n\n         1996 and 1997              Pollution Prevention Award (received four awards for various projects)\n\n         1997                              Environmental Improvement Award\n \nSafety Awards:\n\nSociety of the Plastics Industry, Inc.\n\n         1997                              Merit Safety Award\n \n \n2) The stationary source and the regulated substances handled (' 68.155 b):\n \nOxyChem's Pottstown Plant is located on a 267-acre site and began manufacturing PVC in 1947 under Firestone Tire and Rubber Company. Hooker Chemical Corporation purchased the site from Fi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7142,
      "SummaryText": "restone Tire Company in 1980 and Hooker Chemical became Occidental Chemical Corporation in 1982. The Pottstown Plant produces polyvinyl chloride homopolymer and copolymer resins. Chemicals used in the process include vinyl chloride (VC), vinyl acetate (ViAc), and ammonia, along with various soaps and additives. The stationary source consists of one resin manufacturing area and support facilities. Raw materials arrive via railcar or tanker truck. Finished products are shipped via rail or truck. \n\nThe Pottstown Plant handles several regulated substances in sufficient quantity to be covered by the RMP rule and falls under the Level 3 Program at the plant. The largest vessel quantities are:\n\n \n       Regulated                    Process Quantity          RMP Threshold\n       Substance                         (pounds)                    (pounds)\n\n    Anhydrous Ammonia             17,500                      10,000\n    Vinyl Acetate                        340,300                      15,000\n    Vinyl Chloride                    1,694,200                      10,000\n\n\n\nThe following is a description of the RMP listed materials used at OxyChem's Pottstown Plant:\n\nAnhydrous Ammonia is a listed toxic under RMP that, as a raw material entering the Plant is used to produce the resins. The ammonia is delivered via tanker truck and stored in a large storage tank or a process tank.\n\nVinyl Acetate is a listed toxic under RMP that, as a raw material entering the Plant is used to produce PVC copolymer resins. The vinyl acetate is delivered via railcar or tanker truck and stored in one of two storage tanks.\n\nVinyl Chloride is a listed flammable under RMP that, as a raw material entering the Plant is used to produce the PVC homopolymer and copolymer resins. The vinyl chloride is delivered via railcar and stored in one of six storage tanks.\n\n\n3) The worst-case release scenarios and the alternate release scenarios, including administrative controls and mitigation measures to limit the di"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 7142,
      "SummaryText": "stances for each reported scenario (' 68.155c):\n \nThe Pottstown Plant performed off-site consequence analysis to estimate the potential for accidental release of a regulated substance to affect the public or the environment. The RMP rule requires the off-site consequence analysis to evaluate a \"worst-case release scenario\" (WCS) and an \"alternative release scenario\" (ARS) for each toxic and one for all flammables.  In reality, however, OxyChem does not expect a worst-case release scenario to ever occur. The alternative release scenarios are developed to help the LEPC improve the community emergency response plan. \n\nThe TRACE modeling program was used for evaluating the ARS and WCS impact distances for each regulated substance (i.e., the toxic endpoint for the toxics substances and the radiant heat distances and the 1-psi overpressure distances for flammable substances). OxyChem's Pottstown plant uses Emergency Information System (EIS) system for emergency response determination. The meteorological data used for the WCS and ARS modeling were the EPA default data. The EPA recommended LandView III program was utilized to estimate the number of people living within this distance from the location of the storage tanks. United States Geological Survey (USGS) maps and LandView (including MARPLOT. Mapping System) were utilized to identify the public, industrial, and environmental receptors located within this distance. Note the impact area for each RMP chemical was determined by using the center location of each chemical storage tank/ area.\n\nThe following information summarizes the off-site consequence analysis performed by the Pottstown Plant:\n\n3.1 Toxic Substances\n\nAnhydrous Ammonia\n\nThe \"worst-case release scenario\" involves the release of the entire contents of the large storage tank and its subsequent vaporization within a 10-minute period as mandated by EPA. Under the EPA default worst weather conditions, this worst case toxic release impacts a distance of 1.7 miles "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 7142,
      "SummaryText": "before the concentration of ammonia was reduced to below 0.14 mg/L (which is the \"endpoint\" Emergency Response Planning Guideline value established in the RMP rule). The U.S. Census indicates that approximately 13,600 people live within this distance from the ammonia storage tank location. Several public receptors including schools, residences, parks, hospitals and commercial areas are located within this distance. USGS maps and LandView indicate that no environmental receptors are located within this distance.\n\nThe \"alternative case release scenario\" involves the release from a flexible 2 inch diameter transfer hose connection. The release duration was chosen to be 30 minutes based on a reasonable response time to shut-off the tank outlet nozzle. The amount of ammonia released is 3,540 pounds. The ammonia cloud would travel 0.2 miles before reaching a concentration of 0.14 mg/L (based on a wind speed of 6.7 mph (3 meters/sec), a D stability class, and urban topography). A neighboring warehouse building (located behind OxyChem's production employee parking lot) is the only public receptor that would potentially be affected by a leak.\n\n\nVinyl Acetate\n\nA \"worst-case release scenario\" was performed for vinyl acetate. However, the potential impact area was less than impact area for ammonia. Therefore, as per USEPA guidance, only the worst-case toxic substance release (ammonia) is discussed in the RMP.\n\nThe \"alternative case release scenario\" involves the failure of a 2 inch diameter railcar unloading line. A release duration of 30 minutes was used based on a reasonable response time to react and shut off the leak. The vinyl acetate concentration released would be diluted to reduce its volatility with deluge and sprinkler systems (active mitigation). The vinyl acetate cloud would travel 0.1 miles before reaching a concentration of 0.26 mg/L (based on a wind speed of 6.7 mph (3 meters/sec), a D stability class, and urban topography). This distance will affect onsite recep"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 7142,
      "SummaryText": "tors only; no public receptors would be affected by a leak.\n\n\n3.2 Flammable Substances\n\nVinyl chloride\n\nThe \"flammable worst case scenario\" was performed in accordance with USEPA guidance and involved the vaporization of 1.6942 million pounds of vinyl chloride contained in the largest on-site tank. For the flammable worst case the RMP listed component of vinyl chloride with the highest overall heat produced (based on heat of combustion and quantity stored in covered source). No passive mitigation or administrative controls were considered in the worst case determination. The worst case flammable release impacts a distance from the source of the release of 0.5 miles. The U.S. Census indicates that 300 people live within this distance from the center of the storage vessels. USGS maps indicate that while public receptors such as residences, parks, and commercial areas are located within this distance; no environmental receptors are located within this distance.\n \nThe \"flammable alternative scenario\" involves the release from a 2 inch diameter unloading hose connection from a railcar. A release duration of 30 minutes was used based on a reasonable response time to react and shut off the leak. The vinyl chloride concentration released would be diluted to reduce its volatility with deluge and sprinkler systems (active mitigation). The radiant heat distance based on an exposure of 5 kW/m2 would impact an area 0.1 miles from the source. This distance will affect onsite receptors only; no public receptors would be affected by a valve leak.\n\n\n 4) The general accidental release prevention program and chemical specific prevention steps (' 68.155d):\n \nThe facility complies with the EPA's Accidental Release Prevention Rule (40 CFR part 68) and OSHA's Process Safety Management Rule (29 CFR 1910.119). Program 3 is essentially the same as OSHA PSM, except that the program also focuses on protecting the public and the environment outside the plant's fenceline. The Pottstown Plant's P"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 7142,
      "SummaryText": "rogram 3 prevention program consists of the following 12 elements:\n\n\nA) Process Safety Information \n\nThe Pottstown Plant maintains a variety of technical documents that are used to help ensure safe operation of the plant processes. These documents (as presented in the \"Process Safety Management Site Plan\" and the \"Accidental Release Prevention Plan\") address:\n\n         physical properties of hazardous substances handled at the plant\n\n         operating parameters of the equipment used at the plant\n\n         design basis and configuration of the equipment at the plant.\n\nOxyChem ensures that this process safety information is available to all employees, the LEPC, the local fire department, the Pottstown hospital, and the Lower Pottsgrove Police Department.\n\nMaterial safety data sheets (MSDSs) document the physical properties of the hazardous materials handled at the plant, including regulated substances in covered processes. The information available for each hazardous substance typically includes:\n\n         Toxicity information and permissible exposure limits \n\n         Physical data (e.g., boiling point, melting point, flash point) \n\n         Reactivity and corrosively data \n\n         Thermal and chemical stability data \n\n         Hazards of mixing substances in the process\n\nMSDSs for hazardous substances handled in the process are throughout the facility so that the employees have ready reference to this information. In addition, key MSDSs are provided to the LEPC and the fire department for use in helping formulate emergency response plans.\n\nThe engineering design documents include the operating parameters and the design basis and configuration of the equipment in the covered process. The available information includes:\n\n         Operating parameters\n\n         Block flow or simplified process flow diagrams\n\n         Process chemistry\n\n         Maximum intended inventories\n\n         Safe upper and lower limits for parameters such as temperature, pressu"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 7142,
      "SummaryText": "re, or flow\n\n         Consequences of deviations from established operating limits\n\n         Design basis and configuration of equipment\n\n         Piping and instrumentation diagrams, including materials of construction\n\n         Electrical classification\n\n         Safety systems\n\n         Applicable design codes and standards\n\n         Design basis for relief and ventilation systems\n\n\nWhen important information was not available from the design documents, it was developed through special projects or, in the case of operating parameters, during process hazard analyses of the process. Many of the operating parameters are included in the operating procedures to help with the safe operation of the process. These documents are used to (1) train employees, (2) perform process hazards analyses, and (3) help maintain the equipment.\n\n\nB) Process Hazard Analysis\n\nThe Pottstown Plant performs and periodically updates process hazard analyses (PHAs) of the covered process to help identify process hazards and generate recommendations that might improve the safe operation of the process. A team composed of personnel with engineering and process operating experience and a leader with process hazard analysis experience is assembled to analyze the hazards of the process. The plant primarily uses the HAZOP and \"what-if checklist\" techniques to perform this analysis. The PHA team prepares a written report describing the results of the analysis, including a list of recommendations. Responsibility to resolve the recommendations is assigned to unit personnel and, as appropriate, changes to enhance the safety of the process are implemented.\n\n\nC) Operating Procedures\n\nPottstown Plant engineers, operators, and supervisors work together to develop and maintain operating procedures to define how tasks related to process operations should be safely performed. The operating procedures (1) are used to train employees and (2) serve as reference guides for appropriate actions to take during"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 7142,
      "SummaryText": " both normal operations and process upsets. Operating procedures include:\n\n         Steps for safely conducting activities \n\n         Applicable process safety information, such as safe operating limits and consequences of process \n           deviations\n\n         Safety and health considerations, such as chemical hazards, personal protective equipment \n          requirements and actions to take if exposure to a hazardous substance occurs\n\nPlant personnel develop and maintain operating procedures that cover all phases of operations, including initial startup, normal operations, normal shutdown, emergency shutdown, startup following a turnaround or emergency shutdown, and temporary operations.\n\n\nD) Training\n\nThe Pottstown Plant trains its workers to safely and effectively perform their assigned tasks. The training program includes both initial and refresher training that covers (1) a general overview of the process, (2) the properties and hazards of the substances in the process, and (3) a detailed review of the process operating procedures and safe work practices. Oral reviews and written tests are used to verify that an employee understands the training material before the employee can resume work in the process. The training program is annually evaluated for its effectiveness and training frequency. Recommendations from the operators are reviewed and changes to the training program are implemented as appropriate.\n\n\nE) Mechanical Integrity\n\nThe Pottstown Plant maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public or the environment. The mechanical integrity program includes (1) an inspection and testing program to help identify equipment deterioration and damage before the equipment fails and (2) a quality assurance program to help ensure that new and replacement equipment meets the design standards required for service in the plant's processes. The mechanical integrity program includes:"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 7142,
      "SummaryText": "\n\n         Specifications for inspection and testing of process equipment \n\n         Specifications for replacement parts and equipment \n\n         Procedures for inspecting, testing, and maintaining process equipment \n\n         Procedures for safe work practices such as Lock, Tag and Try; Hot Work; Confined Space Entry;\n          and Line Breaking\n\n         Training of maintenance personnel \n\n         Documentation of maintenance activities\n\n\nF) Management of Change\n\nThe Pottstown Plant management of change program evaluates and approves all proposed changes to chemicals, equipment and procedures for a covered process to help ensure that the change does not negatively affect safe operations. Process changes that are determined to be a replacement in kind (e.g., replacing a valve with an identical valve) are allowed without completing a full management of change program. All other changes must be confirmed through the full management of change program to ensure that inadvertent consequences of process changes are prevented, safety consequences of changes are addressed, affected process safety information and procedures are updated, and affected employees are notified of the changes.\n\n\nG) Pre-startup Review\n\nThe Pottstown Plant performs a safety review of a new or modified process before the process is placed into service to help ensure that the process has been prepared to operate safely. This review confirms that:\n\n         Construction and equipment are in accordance with design specifications\n\n         Adequate safety, operating, maintenance and emergency procedures are in place\n\n         Employee training has been completed  \n\n         For a covered process that management of change requirements have been completed.\n\nA pre-startup review checklist is completed to document the review and to ensure that appropriate issues have been addressed.\n\n\nH) Compliance Audit\n\nThe Pottstown Plant audits the covered process to be certain that the prevention program is"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 7142,
      "SummaryText": " effectively addressing the safety issues of operating the plant. An audit team will be assemble with personnel knowledgeable in the RMP rule and in the covered process. The team will consist of facility personnel and individuals from the plant's parent companies: Occidental Chemical Corporation and Occidental Petroleum Corporation. The audit team will evaluate whether the prevention program satisfies the requirements of the RMP rule and whether the prevention program is sufficient to help ensure safe operation of the process. The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n\n\nI) Incident Investigation\n\nThe Pottstown Plant investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar incidents can be prevented in the future. The plant trains employees to identify and report any incident requiring investigation. An investigation team is assembled, and the investigation is initiated within 48 hours of the incident. The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n\n\nJ) Employee Participation\n\nThe Pottstown Plant developed a written employee participation program for the covered process to help ensure that the safety concerns of the plant's workers are addressed. The plant encourages active participation of personnel in the prevention program activities at the plant. Employees are consulted on, and informed about, all aspects of the RMP rule prevention program, including PHAs and operating procedures.\n\n\nK) Hot Work Permits\n\nThe Pottstown Plant established a hot work permit program to control spark or flame- producing activities that could result in fires or explosions in covered processes at the plant. The plant reviewed OSHA's fire prevention and protection requirements in 29 CFR 1910.252(a) and created a Hot Work"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 7142,
      "SummaryText": " Permit Form to comply with these requirements. Personnel who are to perform hot work are required to fill out the Hot Work Permit Form. The Shift Supervisor reviews the completed form before work can begin. Training in the use of the Hot Work Permit Form is included in the plant's safe work practices orientation.\n\n\nL) Contractors\n\nThe Pottstown Plant established a program to help ensure that contractor activities at the plant are performed in a safe manner. The program reviews the safety record of all contractors to help ensure that the plant only hires contractors who can safely perform the desired job tasks. The plant explains to the contractors the hazards of the process on which they will work, the plant's safe work practices, and the plant's emergency response procedures. In addition, the plant periodically reviews contractors' training documents and work performance to help ensure that safe practices are followed.\n\n\n5) The five-year accident history (' 68.155e):\n \nThe facility did not have any accidental releases in the last five years that meet USEPA's criteria of on-site or off-site deaths, injuries, or property damage, environmental damage, or evacuations.\n\n\n6) The emergency response program (' 68.155f):\n \nThe OxyChem Pottstown Plant emergency response plan has been developed to meet the emergency planning, response and notification requirements of the following regulations:\n\n         OSHA 29 CFR 1910.38 (a) - Employee Emergency Action Plans\n\n         OSHA 29 CFR 1910.119 (n) - Process Safety Management Of Highly Hazardous Chemicals\n\n         OSHA 29 CFR 1910.120 (p) and (q) - Hazardous Waste Operations and Emergency Response\n          (HAZWOPER)\n\n         OSHA 29 CFR 1910, Subpart L - Fire Protection\n\n         PADEP Title 25, Part 1, Subpart C, Article III, Chapter 127 - Release Reporting\n\n         EPA 40 CFR Part 302.6 - Notification Requirements\n\n         EPA 40 CFR Part 355.30 - Facility Coordinator and Emergency Response Plan\n\n         EPA 40 "
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 7142,
      "SummaryText": "CFR Part 355.40 - Emergency Planning and Release Notifications\n\n         EPA 40 CFR Part 112 - Spill Prevention, Control and Countermeasures Plan\n\n         EPA 40 CFR Part 68 - Risk Management Programs for Chemical Accidental Release Prevention\n\n         EPCRA section 302 - List of Extremely Hazardous Substances\n \nThe emergency response strategy for the Pottstown Plant is to prevent and/or control emergency situations via the use of engineering, design, and fixed fire protection systems. Fixed fire protection systems are designed to National Fire Protection Association (NFPA) guidelines. The plant has an Emergency Response Team on each shift, available 24 hours per day, to respond and initiate response actions to contain, control and if possible mitigate the release. The team has access to on site emergency equipment (i.e., HAZMAT Response trailer) to handle emergency situations.\n \nQuarterly drills are conducted to assess and evaluate the emergency response effort at the Pottstown Plant. If assistance were required during an emergency response, the Fire Department would be notified and requested to provide additional resources as necessary.\n\nThe Pottstown Plant uses an EIS modeling system to assess release impacts, if any, and to aid in the determination of response activity. The Pottstown Plant has developed a Special Situations Plan that is a program designed for responding to emergencies that may have impacts beyond the immediate plant and is a supplement to the Emergency Response Plan. The Special Situations Plan also links the local response to the OxyChem Corporate Emergency Response Center located in Dallas, TX for assistance as needed.\n \nThe Pottstown Plant is an active participant in the community planning process with the Montgomery County Local Emergency Planning Committee. A copy of the plant's Emergency Response Plan has been forwarded to the Office of Emergency Preparedness as per the requirements of 40 CFR 355.\n \nThe Pottstown Plant has an active C"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 7142,
      "SummaryText": "ommunity Advisory Panel. The Pottstown Plant is an active participant in and is committed to the Chemical Manufacturers Association's Responsible Care. initiative conducting annual assessments of the Plant's compliance effort. \n\n\n7) Planned changes to improve safety (' 68.155g):\n\nThe Pottstown Plant constantly strives to improve the safety of the processes at the facility through the auditing process, the safety suggestion process, the union management joint safety committee, and the incident investigation process.\n\n\n8) Certification (' 68.185):\n\nTo the best of the undersigned's knowledge, information, and belief formed after reasonable inquiry, the information submitted is true, accurate, and complete.\n\n\n_**___________________________          _David T. Dorko__________\n   Signature                                                       Print Name\n\n\n_Plant Manager_________________          _June 15, 1999___________\n   Title                                                                Date\n\n\n**The original signature is included in the attached cover letter."
    }
  ]
}