{
  "FacilityID": 7193,
  "FacilityName": "Pottstown WWTP",
  "FacilityStr1": "1269 Industrial Highway",
  "FacilityStr2": null,
  "FacilityCity": "Pottstown",
  "FacilityState": "PA",
  "FacilityZipCode": "19464",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42091",
  "LEPC": "Montgomery County LEPC",
  "FacilityLatDecDegs": "40.235833",
  "FacilityLongDecDegs": "-75.625",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Pottstown Borough",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Borough of Pottstown Sewer Auth.",
  "OperatorStr1": "241 King Street",
  "OperatorStr2": "City Hall",
  "OperatorCity": "Pottstown",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19464",
  "OperatorZipCodeExt": null,
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000091125",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-05-07 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.23583,
  "FRS_Long": -75.62536,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8662,
      "AltID": "Wastewater Chorination",
      "FacilityID": 7193,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 9520,
          "ProcessID": 8662,
          "ChemicalID": 62,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8870,
          "ProcessID": 8662,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 4419,
              "Process_NAICS_ID": 8870,
              "SafetyReviewDate": "1999-06-07 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": "Federal SARA Title III, PA Act 165",
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-07 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-07 00:00:00",
              "TrainingReviewDate": "1999-06-07 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Chlorine drill, simulating a leak with the Fire Department, Rescue Squad and hospital all participating",
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-07 00:00:00",
              "EquipmentInspectionDate": "1999-05-03 00:00:00",
              "EquipmentTested": "Chloralert alarm system; flex connectors   (inspected on a weekly basis)",
              "ComplianceAuditDate": "1999-06-10 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "1. Designation of specially trained personnel to handle chlorine process control and maintenance.  2.  Chlorine training on a regular basis for all staff on safety and use of Chlorine Kit B.",
              "_chemicals": [
                {
                  "PrimaryKey": 4568,
                  "PreventionProgram2ID": 4419,
                  "ProcessChemicalID": 9520
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7193,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Montgomery County Emergency Prep",
    "CoordinatingAgencyPhone": "6106316505",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "SARA Title III"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7193,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe Pottstown Borough Authority (PBA) WWTP located in Pottstown, Montgomery County, is owned by the Pottstown Municipal Authority (PMA) and operated by the PBA located at Borough Hall, 241 King Street, Pottstown, Pennsylvania.  The plant discharges treated effluent into the Schuylkill River.\n\nThe Pottstown WWTP was upgraded in 1991 and is capable of treating 15.6 million gallons per day to the level required by the Pennsylvania Department of Environmental Protection (PADEP) and the Environmental Protection Agency (EPA).\n\nThe primary purpose of a WWTP is to protect public waterways from environmental harm and to promote the recreational, commercial, and/or industrial use of these waterways.  The WWTP helps to achieve and maintain water quality goals by achieving a high degree of treatment of all incoming wastewater, including industrial, prior to discharge to the Schuylkill River.\n\na.  The Pottstown WWTP's accidental release prevention program is designed to ensure that the facility operates in compliance with the RMP Rule and with industry standards of performance, such as the guidance documents written by the Chlorine Institute.  The prevention program is based on the following key elements:\n\nHigh level of training of the operators\nPreventive maintenance program\nUse of state-of-the-art process and safety equipment\nUse of accurate and effective standard operating procedures, written with the participation of the operators\nPerformance of a hazard review of equipment and procedures\nImplementation of an auditing and inspection program\n\nb.  The disinfection facility for the Pottstown WWTP is located on-site.  All wastewater is disinfected by using chlorine to kill any pathogenic organisms before discharging the water.  A maximum of 20 one-ton containers (40,000 pounds) of chlorine may be stored onsite at any time, with two chlorine containers in use at any given time.  Containers that are connected in the process are located in a brick building design"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7193,
      "SummaryText": "ed specifically and solely for the safe movement, storage and use of these regulated chemicals.\n\nc.  The offsite consequence analysis includes consideration of two chlorine release scenarios, identified as \"worst case release\" and \"alternative scenario\".  The first scenario is defined by EPA, which states that \"the owner or operator shall assume that the maximum quantity in the largest vessel is released as a gas over 10 minutes,\" due to an unspecified failure.  EPA also requires the assumption of worst-case atmospheric dispersion modeling conditions in order to be conservative and ensure public safety.  The alternative scenario is defined as \"more likely to occur than the worst-case release scenario\".\n\nThe worst-case scenario for an accidental release of chlorine is the catastrophic failure of a one-ton container.  The toxic endpoint selected by EPA for chlorine is 3 parts per million (ppm), which is defined by the American Industrial Hygiene Association (AIHA) as the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action\".  This is the Emergency Response Planning Guideline Level 2 (ERPG-2).  The residential population within a circle with a radius corresponding to the toxic endpoint distance has to be defined \"to estimate the population potentially affected\".\n\nWhen atmospheric dispersion modeling for the worst case scenario was performed using the EPA assumptions, a distance to toxic endpoint of 1.3 miles and an estimated residential population potentially affected of 14,000 was obtained.  The building housing the containers was not considered as a passive mitigation system to reduce the potential risk for the worst-case scenario since some containers are stored outside the building.\n\nThe alternate-case release scenario is identified as a "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7193,
      "SummaryText": "major leak caused by a bad valve, a poor connection, or a piping failure.  This scenario was selected as \"a more likely to occur than the worst-case release scenario\" based on the past history of chlorine releases at this facility and at other WWTPs that are similarly designed.\n\nWhen atmospheric dispersion modeling for the alternate scenario was performed, a distance to toxic endpoint of 0.2 miles and an estimated residential population potentially affected of 30 was obtained.  In addition to being enclosed in a building (passive mitigation) when the containers are in use, active mitigation measures in place to prevent and minimize releases include ambient chlorine monitors and a water curtain, which would significantly reduce the amount of chlorine released in the case of a leak.\n\nEPA's innovative \"Community Right-to-Know\" software tool Landview III, along with database extracts of 1990 Census information and other sources were used to analyze the estimated residential population for the worst-case scenario.  An aerial photograph was used to confirm the estimated residential population in the alternate case scenario.\n\nd.  Preventive maintenance is regularly scheduled and performed.  Trained, experienced personnel clean, service and replace pipes, valves, chlorinators, and other equipment, as needed.  Pigtails are replaced on a yearly basis.\n\nChemical-specific prevention steps include the availability of self-contained breathing apparatus (SCBA), awareness of the hazardous and toxic properties of chlorine, and the presence of a chlorine detector.\n\ne.  There have been no accidental releases of chlorine in the past five years.\n\nf.  The Pottstown WWTP is not required to maintain a site-specific emergency response program, as defined by OSHA and EPA.  However, it does have an Emergency Plan which has been coordinated with the LEPC, which gives specific details regarding emergency contacts, potentially affected areas, evacuation routes, and other information regarding th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7193,
      "SummaryText": "e WWTP.  The WWTP would contact the local fire department, Apex and the Montgomery County Local Emergency Planning Committee (LEPC) in the event of an accidental release, since it does not train its employees to handle such an emergency.\n\ng.  Based on the hazard evaluation, the compliance audit, and other actions taken to prepare this RMP, a few areas were identified for improvement and changes were made to improve safety at the facility.  This included the following:\n\nWriting a standard operating procedure for connecting and disconnecting containers;\nA more formal documentation system for employee training;\nRevising the preventive maintenance procedures;\nDeveloping an Emergency Action Plan."
    }
  ]
}