{
  "FacilityID": 7237,
  "FacilityName": "Great Western Chemical Company - Bakersfield",
  "FacilityStr1": "3451 Unicorn Road, Suite 200",
  "FacilityStr2": null,
  "FacilityCity": "Bakersfield",
  "FacilityState": "CA",
  "FacilityZipCode": "93308",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": null,
  "FacilityLatDecDegs": "35.437222",
  "FacilityLongDecDegs": "-119.073889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 151322229,
  "ParentCompanyName": "Great Western Chemical Company",
  "Company2Name": null,
  "CompanyDUNS": 154023451,
  "Company2DUNS": 0,
  "OperatorName": "Great Western Chemical Company",
  "OperatorStr1": "808 SW 15th Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Portland",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97205",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robbie Bishop",
  "RMPTitle": "Area Operations Manager",
  "FTE": 5,
  "OtherEPAFacilityID": "CAD982468209",
  "EPAFacilityID": "100000091152",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-03-27 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2000-07-31 00:00:00",
  "DeRegistrationEffectiveDate": "2000-07-28 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.43774,
  "FRS_Long": -119.07282,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8728,
      "AltID": "Chemical Storage",
      "FacilityID": 7237,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8936,
          "ProcessID": 8728,
          "NAICSCode": "42269",
          "_desc": {
            "NAICS_CODE": "42269",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9594,
          "ProcessID": 8728,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509594,
          "ProcessID": 8728,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7237,
      "SummaryText": "CAA 112 (RMP and CalARP) Executive Summary\n\nGreat Western Chemical Company - Bakersfield, California\n\nGreat Western Chemical Company (GWCC) is a multinational wholesale distributor of chemical products.  As of the date of this submission, the Company operates twenty-eight distribution warehouses in the United States; only a few of these facilities are subject to Risk Management Program Planning.  This summary describes GWCC's Risk Management Program for its Bakersfield, California, facility.\n\nI. Statement of Senior Management Commitment to Safety\n\nGWCC's President and Chief Executive Officer drafted a formal \"Statement of Corporate Policy on Safety and Environmental Protection.\"  This statement has been provided to all employees and the Company's public and private emergency responders as evidence of the Company's commitment to safety.  The following excerpt is taken directly from the Corporate Statement:\n\nThe personal safety and health of each member of GWCC staff is of paramount importance.  As a company, our very existence depends on service to our customers and support from our neighbors.  GWCC's reputation for safety in handling chemical products will do much to determine the company's future growth.  Our goals include employee safety and prevention of all hazardous material releases to the environment.  We will maintain a safety and environmental program which embodies the proper attitudes toward safety and environmental protection on the part of everyone.  This program requires the total cooperation on the part of every employee in all safety, health and environmental matters. \n\nGWCC has specifically authorized designated facility emergency coordinators to \"commit any resources necessary to control an incident.  This includes mobilization of other emergency response organizations as well as the purchase of necessary supplies and equipment.\"\n\nII.  General Facility Description\n\nGWCC - Bakersfield is located in an industrial area along the Porterville Highway, j"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7237,
      "SummaryText": "ust outside the Bakersfield City Limits.   The area closely surrounding the facility is primarily industrial, and not very densely populated.   The surrounding geography of the area is flat.  No areas designated as environmentally sensitive on local USGS topographic maps and other map sources are within several miles of the facility.\n\nMeadows Field airport is approximately one mile to the east from the facility.  The nearest residential area is approximately 0.6 miles to the south, across Highway 99.  However, more densely populated suburban areas lie approximately 1.7 miles to the southeast of the facility.  The nearest schools to the facility are at least 2 miles from the facility, on the outer and are located primarily to the southeast and southwest.  \n\nA. Description of Primary Activities at Facility\n\nGWCC - Bakersfield a warehousing and distribution facility only.  No packaging or manufacturing of chemical products occurs at this facility.  Chemical products are received, stored and delivered to customers in closed containers. \n\nB.  Description of Facility Processes\n\nGWCC Bakersfield engages in the following activities:\n\n-- Delivery by truck of chemical products in UN-approved containers\n-- Internal movement of chemical products from the receiving area by forklift or pallet jack to and from the designated storage area\n-- Delivery of chemical products to customers\n\nC.  Description of Products/Quantities Handled at Facility\n\nGWCC Bakersfield stores one CAA Section 112 RMP program chemicals in amounts that exceed threshold quantities: chlorine gas.  The largest container of chlorine gas that might be stored at the facility is a one-ton container.   The facility also stored multiple 150-pound cylinders.  One-ton containers are frequently not on site since they are only ordered when a customer specifically orders them and are typically shipped off-site within one to three days of arrival.  Up to eight tonners may be delivered and stored at the facility at any one ti"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7237,
      "SummaryText": "me.\n\nIII.  Worst Case Release Scenarios/Alternative Release Scenarios\n\nThis section summarizes the worst-case release scenarios and the alternative release scenarios presented in the facility's RMP plan. \n\nA.  Worst Case Release Scenarios\n\nThe worst-case scenario for GW - Bakersfield is a release of a one-ton container of chlorine gas.  A release of this magnitude could impact receptors within a three-mile radius (as determined by RMP*Comp).  The Company believes that this release scenario is extremely unlikely given the inherent integrity of containers used for chlorine.  Chlorine ton containers are manufactured to meet stringent U.S. Department of Transportation standards.  These container standards are specifically designed to minimize (if not eliminate) the possibility of accidental release during the rigors of transportation in commerce.  Manufacturing specifications include the use of >1-inch thick steel for the body of the container.  Container weight exceeds 1,500 pounds when empty.  These containers can only be moved at the facility in single units (i.e., one at a time).  This factor, by itself, makes the possibility of a release (during onsite movement) of a quantity greater than one container extremely remote.  Container valves are protected within a recessed compartment to prevent accidental damage during handling/transportation.  \n\nGW - Bakersfield stores chlorine containers outdoors in an area designated by the local Fire Department.  The storage area is not located in an area subject to traffic. \n\nB.  Alternative Release Scenarios\n\nThe alternative release scenario considered at GWCC - Bakersfield is as follows:\n\nA cylinder of chlorine, during loading or unloading, falls and shears off the valve on the top of the cylinder.  This creates a 3/16 inch diameter hole in which the entire 150 pounds of chlorine inside the cylinder are released.  \n\nWe believe this is the most likely release, although several precautions are taken to prevent this from occurring"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7237,
      "SummaryText": ".  For instance, all cylinders are always stored and moved with a valve protection cap on the cylinder.  \n\nA release of this magnitude would occur within 2 minutes and could impact receptors within 0.4 miles of the release site.  No residences are located within this radius, and impact on the local area would be limited to the businesses in the immediate vicinity of the storage area. \n\nIV.  Accidental Release Prevention Planning at the Facility\n\nA.  Rules and Regulations that Apply to this Facility\n\nSeveral hundred federal, state and local environmental and safety rules and regulations apply to this facility; it is not possible to summarize all of the regulatory requirements in this document.  The primary legislation affecting chlorine is OSHA's Process Safety Management rule.  A chlorine PSM program has been implemented at the facility.   The uniform fire and building codes also apply to this facility and are enforced by the local authorities.  The local Fire Department performs regular safety inspections of the facility.\n\nThe Company has a formal safety training program designed to meet training requirements promulgated by OSHA, DOT and EPA.  Hazard communication training (OSHA) is the primary method the Company uses to educate employees on the risks associated with these two chemicals.  Emergency response training is performed in accordance with OSHA's HAZWOPER regulations (29 CFR Part 1910.120).\n\nB.  Internal (Company) Release Prevention Program Requirements\n\nGW is a member of the National Association of Chemical Distributors (NACD).  Membership requires companies to prepare policies and procedures that promote the safe use and handling of chemical products by member companies and also by customers who purchase the chemical products.  GW has more than 100 policies/procedures that address topics including the storage, handling, and transportation of compressed gases and incident planning for chlorine and hydrofluoric acid. \n\nGW facilities are regularly audited fo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7237,
      "SummaryText": "r compliance with all internal and external requirements by GW environmental staff.  \n\nV.  Five-Year Accident History\n\nThere have been no known accidents or releases involving chlorine at GWCC Bakersfield within the last five years.\n\nVI.  Emergency Response Program\n\nThe facility has an emergency response plan that outlines proper response, notification and reporting procedures.  The plan is reviewed and updated as often as necessary (e.g., to reflect changes in personnel, emergency response contractors, etc.).  The facility has contracted with two emergency response contractors to provide assistance with any incidents that cannot be handled by the facility or the fire department.  The facility has two on-site emergency coordinators who are trained to manage all incidents that require implementation of the plan.   \n\nGW also maintains a corporate emergency spill response telephone number (1-800-GWSPILL).  This number is staffed 24-hours per day; the on-call technical support employee will be paged immediately to provide assistance during an incident.  The on-call staff acts as backup to the on-site emergency coordinators.\n\nVII.  Planned Improvements to Safety Program\n\nGWCC is committed to accident prevention and, accordingly, maintains an excellent reputation in the chemical distribution industry.  The primary planned improvement to GW's safety program is an update of the training materials (e.g., videos and handouts) to meet revised regulatory requirements."
    }
  ]
}