{
  "FacilityID": 7245,
  "FacilityName": "Great Western Chemical Company - Idaho Falls",
  "FacilityStr1": "5200 N 15th East",
  "FacilityStr2": null,
  "FacilityCity": "Idaho Falls",
  "FacilityState": "ID",
  "FacilityZipCode": "83401",
  "Facility4DigitZipExt": "5666",
  "FacilityCountyFIPS": "16019",
  "LEPC": "Bonneville County LEPC",
  "FacilityLatDecDegs": "43.542833",
  "FacilityLongDecDegs": "-112.00325",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 93113637,
  "ParentCompanyName": "Great Western Chemical Company",
  "Company2Name": null,
  "CompanyDUNS": 154023451,
  "Company2DUNS": 0,
  "OperatorName": "Great Western Chemical Company",
  "OperatorStr1": "808 SW 15th Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Portland",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97205",
  "OperatorZipCodeExt": "1907",
  "RMPContact": "Troy Taylor",
  "RMPTitle": "Manager, Branch Services",
  "FTE": 7,
  "OtherEPAFacilityID": "IDD980639843",
  "EPAFacilityID": "100000091848",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-09-28 00:00:00",
  "DeRegistrationEffectiveDate": "2006-09-01 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 43.54124,
  "FRS_Long": -112.00377,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8738,
      "AltID": "Chlorine Storage",
      "FacilityID": 7245,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8946,
          "ProcessID": 8738,
          "NAICSCode": "42269",
          "_desc": {
            "NAICS_CODE": "42269",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9604,
          "ProcessID": 8738,
          "ChemicalID": 62,
          "Quantity": 63000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509604,
          "ProcessID": 8738,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 8739,
      "AltID": "Sulfur Dioxide Storage",
      "FacilityID": 7245,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8947,
          "ProcessID": 8739,
          "NAICSCode": "42269",
          "_desc": {
            "NAICS_CODE": "42269",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9605,
          "ProcessID": 8739,
          "ChemicalID": 49,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509605,
          "ProcessID": 8739,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7245,
      "SummaryText": "\nCAA 112(r) Executive Summary\n\nGreat Western Chemical Company - Idaho Falls, Idaho\n\nGreat Western Chemical Company (GWCC) is a multinational wholesale distributor of chemical products.  As of the date of this submission, the Company operates twenty-eight distribution warehouses in the United States; only a few of these facilities are subject to Risk Management Program Planning.  This summary describes GWCC's Risk Management Program for its Idaho Falls, Idaho, facility.\n\nI. Statement of Senior Management Commitment to Safety\n\nGWCC's President and Chief Executive Officer drafted a formal \"Statement of Corporate Policy on Safety and Environmental Protection.\"  This statement has been provided to all employees and the Company's public and private emergency responders as evidence of the Company's commitment to safety.  The following excerpt is taken directly from the Corporate Statement:\n\nThe personal safety and health of each member of GWCC staff is of paramount importance.  As a company, our very existence depends on service to our customers and support from our neighbors.  GWCC's reputation for safety in handling chemical products will do much to determine the company's future growth.  Our goals include employee safety and prevention of all hazardous material releases to the environment.  We will maintain a safety and environmental program which embodies the proper attitudes toward safety and environmental protection on the part of everyone.  This program requires the total cooperation on the part of every employee in all safety, health and environmental matters. \n\nGWCC has specifically authorized designated facility emergency coordinators to \"commit any resources necessary to control an incident.  This includes mobilization of other emergency response organizations as well as the purchase of necessary supplies and equipment.\"\n\nII.  General Facility Description\n\nGWCC - Idaho Falls is located in an agricultural northeast of the Idaho Falls city limits.  The site is bou"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7245,
      "SummaryText": "nded to the North by the Highway 20 and to the south by the Union Pacific Railroad.  Surrounding uses are agricultural.  The closest residence is 0.1 mile away.  There are no at-risk populations (e.g., schools, nursing homes, day-care centers, hospitals, prisons, etc.) located within 0.5 miles of the facility.  The closest environmentally sensitive area is the Snake River nearly 3.0 mile away. \n\nA. Description of Primary Activities at Facility\n\nGWCC - Idaho Falls is a warehousing and distribution facility only.  Minimal packaging (e.g. transferring a material from a large container to a small container) occurs, however all RMP regulated chemical products are received, stored and delivered to customers in closed containers. \n\nB.  Description of Facility Processes\n\nGW- Idaho Falls engages in the following activities:\n\n-- Delivery by truck of chemical products in bulk and nonbulk UN-approved containers\n-- Internal movement of chemical products from the receiving area by forklift [or pallet jack] to and from the designated storage area\n-- Delivery of chemical products to customers\n--Downpacking of non-RMP regulated chemicals\n\nC.  Description of Products/Quantities Handled at Facility\n\nGW - Idaho Falls may store two CAA 112 RMP program chemicals in amounts that exceed threshold quantities:  Chlorine gas and Sulfur Dioxide Gas.  The largest container of chlorine gas that might be stored at the facility is a one-ton cylinder.  The largest container of sulfur dioxide gas that might be stored at GW- Idaho Falls is a one-ton container.  \n\nIII.  Worst Case Release Scenarios/Alternative Release Scenarios\n\nThis section summaizes the worst-case release scenarios and the alternative release scenarios presented in the facility's RMP plan. \n\nA.  Worst Case Release Scenarios\n\nThe worse-case scenario for GW - Idaho Falls is a release of a one-ton container of sulfur dioxide gas.  A release of this magnitude would impact receptors within a 3.1 mile radius (as determined by RMP*Comp). "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7245,
      "SummaryText": " The Company believes that this release scenario is extremely unlikely given the inherent integrity of containers used for chlorine.  Sulfur Dioxide ton containers are manufactured to meet stringent U.S. Department of Transportation standards.  These container standards are specifically designed to minimize (if not eliminate) the possibility of accidental release during the rigors of transportation in commerce.  Manufacturing specifications include the use of >1-inch thick steel for the body of the container.  Cylinder weight exceeds 1,500 pounds when empty.  These containers can only be moved at the facility in single units (i.e., one at a time).  This factor, by itself, eliminates the possibility of a release (during onsite movement) of a quantity greater than one container.  Container valves are protected within a recessed compartment to prevent accidental damage during handling/transportation.  \n\nGW - Idaho Falls stores sulfur dioxide containers outdoors.  The storage area is not located in an area subject to traffic.\n\nB.  Alternative Release Scenarios\n\nAlternative release scenarios at GW- Idaho Falls include (1) the accidental release of 300 pounds of chorine from a one-ton container and (2) the accidental release of 300 pounds of sulfur dioxide from a one-ton container.  \n\nRelease of Chlorine: Because of the inherent integrity of the container itself, only the valve and fusible plug present feasible release scenarios.  As explained above, the valve is recessed inside the cylinder and damage could only occur if an object enters the recessed area with sufficient force to damage the valve.  The fusible plug is designed to melt at approximately 157 degrees F.  If the fusible plug melts as a result of fire, it is expected that the chlorine would be entirely consumed by the fire.  The facility has the appropriate chlorine kits for containing releases from chlorine containers.  The quantity released in dependent upon the timeliness of applying the chlorine kits as ac"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7245,
      "SummaryText": "tive mitigation.  This scenario assumes that the active mitigation will occur within an hour.  These kits are designed to seal leaks at the valve or fusible plug.  The radius of the area affected by the alternative release scenario is approximately 0.1 miles.  Therefore, only the street immediately in front of the facility and the neighboring residence across the street could be affected by a release under the alternative scenario.\n\nRelease of Sulfur Dioxide: Because of the inherent integrity of the container itself, only the valve and fusible plug present feasible release scenarios.  As explained above, the valve is recessed inside the cylinder and damage could only occur if an object enters the recessed area with sufficient force to damage the valve.  The fusible plug is designed to melt at approximately 157 degrees F.  Because the cylinders are stored outside, away from any combustible materials, this is not a high risk.  This scenario assumes that a Act of God damages a valve inside its recessed compartment.  The facility has the appropriate containment kits for containing releases from sulfur dioxide containers.  The quantity released in dependent upon the timeliness of applying the kits as active mitigation.  This scenario assumes that the active mitigation will occur within an hour.  These kits are designed to seal leaks at the valve or fusible plug.  The radius of the area affected by the alternative release scenario is approximately 0.1 miles.  Therefore, only the street immediately in front of the facility and the neighboring residence across the street could be affected by a release under the alternative scenario.\n\nIV.  Accidental Release Prevention Planning at the Facility\n\n\nA.  Rules and Regulations that Apply to this Facility\n\nToo many federal, state and local environmental and safety rules and regulations apply to this facility to detail in this summary.  The primary legislation affecting both chlorine and sulfur dioxide is OSHA's Process Safety Manag"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7245,
      "SummaryText": "ement rule.  A PSM program for each chemical has been implemented at the facility.   The uniform fire and building codes also apply to this facility and are enforced by the Idaho Falls Fire Department. \n\nThe Company has a formal safety training program designed to meet training requirements promulgated by OSHA, DOT and EPA.  Hazard communication training (OSHA) is the primary method the Company uses to educate employees on the risks associated with these two chemicals.  Emergency response training is performed in accordance with OSHA's HAZWOPER regulations (29 CFR Part 1910.120).\n\nB.  Internal (Company) Release Prevention Program Requirements\n\nGW is a member of the National Association of Chemical Distributors (NACD).  It is actively engaged in the process of becoming certified under the NACD's \"Product Stewardship/Responsible Distribution\" Program.  This program requires member companies to prepare policies and procedures that promote the safe use and handling of chemical products by member companies and also by customers who purchase the chemical products.  GW has more than 100 policies/procedures that address topics including the storage, handling, and transportation of compressed gases and incident planning for chlorine and hydrofluoric acid (among other GW-designated \"chemicals of concern\"). \n\nGW facilities are audited regularly for compliance with all internal and external requirements by GW environmental staff.  \n\nV.  Five-Year Accident History\n\nThere have never been any accidents or accidental releases involving either of these chemicals at GW - Idaho Falls.\n\nVI.  Emergency Response Program\n\nGW - Idaho Falls has an emergency response plan that is exercised annually, often with the participation of the Idaho Falls Fire Department.  The plan is reviewed and updated as often as necessary (e.g., to reflect changes in personnel, emergency response contractors, etc.).  The facility has contracted with two emergency response contractors to provide assistance with a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 7245,
      "SummaryText": "ny incidents that cannot be handled by the facility or the fire department.  GW - Idaho Falls has two on-site emergency coordinators who are trained to manage all incidents that require implementation of the plan.   \n\nGW also maintains a corporate emergency spill response phone number (1-800-GWSPILL).  This number is staffed 24-hours per day; the on-call technical support employee will be paged immediately to provide assistance during an incident.  The on-call staff acts as backup to the on-site emergency coordinators.\n\nVII.  Planned Improvements to Safety Program\n\nGWCC is committed to accident prevention and, accordingly, maintains an excellent reputation in the chemical distribution industry.  The primary planned improvement to GW's safety program is an update of the training materials (e.g., videos and handouts) to meet revised regulatory requirements.\n"
    }
  ]
}