{
  "FacilityID": 7249,
  "FacilityName": "Missouri River Intake & Presedimentation Facility",
  "FacilityStr1": "4340 N. 60th Street",
  "FacilityStr2": null,
  "FacilityCity": "Kansas City",
  "FacilityState": "KS",
  "FacilityZipCode": "66104",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20209",
  "LEPC": "Unified Govt. of Wyandotte Co.",
  "FacilityLatDecDegs": "39.166667",
  "FacilityLongDecDegs": "-94.720833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": "kbreon@wd1.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Water District No. 1 of Johnson County",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Water District No. 1 of Johnson Co.",
  "OperatorStr1": "7601 Holliday Drive",
  "OperatorStr2": null,
  "OperatorCity": "Kansas City",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66106",
  "OperatorZipCodeExt": null,
  "RMPContact": "Keri Breon",
  "RMPTitle": "Process Management Coordinator",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000092008",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-07-17 00:00:00",
  "DeRegistrationEffectiveDate": "2009-07-10 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.16497,
  "FRS_Long": -94.71777,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8747,
      "AltID": "Water Treatment",
      "FacilityID": 7249,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8955,
          "ProcessID": 8747,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9623,
          "ProcessID": 8747,
          "ChemicalID": 62,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509623,
          "ProcessID": 8747,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7249,
      "SummaryText": "Introduction\nWater District No. 1 of Johnson County operates a water treatment plant which draws water from both the Missouri and Kansas Rivers.  The Hansen Water Treatment Plant consists of Facility No. 1, which is a 55 million gallon per day, lime-softening plant; and Facility No. 2, which is a 110 million gallon per day, lime-softening plant.  Facility No.2 contains two separate chemical process areas.  In addition to the plant, there are two intake and presedimentation facilities, one at the Missouri River and one at the Kansas River.  These facilities will be covered in three separate Risk Management Plans.  One plan will cover the facilities at the Hansen Water Treatment Plant, and there will be a plan for each of the intake facilities. \n\nThis Risk Management Plan (RMP) covers the Section 112r regulated substances maintained at the Missouri River Presedimentation and Intake Facility, which will be referred to herein as the Facility.\n\nFacility Description\nThe Facility maintains only one regulated substance on site: chlorine.  The maximum chlorine storage is 36,000 pounds, which exceeds the RMP threshold quantity of 2,500 pounds.  The storage and management of chlorine is addressed in this RMP.  \n\nThe Facility is located at 4340 North 60th Street, Kansas City, Kansas, which is in an urban area. \n\nThe Worst Case Release Scenario\nThe worst case release scenario for the Facility was calculated as the release of the largest container of chlorine in accordance with the definition provided in the Environmental Protection Agency guidance for RMP development.  Passive control systems can be considered for the worst-case release, such as the containment provided by a building.  The conditions of the scenario, such as release time and weather status are those provided in the EPA Off-Site Consequence Analysis Guidance. The area of potential impact was determined using RMP*Comp, modeling software developed by the EPA.\n\nThe results of the Off-Site Consequence Analysis indica"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7249,
      "SummaryText": "ted that the chlorine would travel approximately 0.9 miles under the specified weather conditions before dispersing in the atmosphere to the specified end point concentration.  Within that radius of the Facility, an estimated 400 persons could potentially be affected.  Maps of the area and a list of the types of receptors in the potential impact area are provided in the Off-Site Impact Analysis Section.  The list of potential receptors includes:\n\n7 one hospital \n7 one major industrial area\n\nThis type of rapid release would only occur if the chlorine cylinder valve was broken off, or the cylinder was breached.  The likelihood of such an incident occurring is minimal.  \n\nAlternative Release Scenario\nThe alternative release scenario is, by definition, a more likely release scenario than the worst case.  Engineered controls, such as the leak detection system and alarm, and scrubbers installed at the site are considered in the analysis.  \n\nThe type of system failure selected for the alternative release was the loss of chlorine due to a break in the flexible tubing leading from the cylinder to the vacuum regulator.  The chlorine would leak from a 3/8\" opening.  The leak would continue until the chlorine detection alarm sounded and the valve on the cylinder could be closed.  Scrubbers would remove 99.999% of the chlorine from the air before it leaked outside the building.  Because chlorine would have leaked into the chlorine room, response would be made by HazMat Response according to their procedures for a toxic chemical release.  The time for the response was estimated at 60 minutes.  Once on site, the HazMat team would enter the room in protective clothing and close the valve on the leaking cylinder.\n\nThe results of the Off-Site Consequence Analysis using RMP*Comp, indicated that the chlorine would travel approximately 0.1 mile under the specified weather conditions in order to disperse in the atmosphere to the specified end point concentration.  Within that radius of t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7249,
      "SummaryText": "he Facility, it is estimated that five people will potentially be affected.  Maps of the area and a list of the types of receptors in the potential impact area are provided in the Off-Site Impact Analysis Section.\n\nProcess Hazard Assessment\nA process hazard assessment was performed on the chlorine system beginning with the unloading of the container and ending with the chlorine in solution.  A checklist and a modified \"What if\" analysis were used.  In the checklist analysis, general questions regarding the storage and use area, as well as protocols associated with the management of the chlorine system, were answered.  A copy of that checklist is included in this plan.  Following the checklist, each valve, line, and piece of equipment was assessed from the cylinder to point of chemical injection using a system flow diagram.  The valves and other points in the system where the chemical could be released are numbered on the flow diagram. The assessment is formatted in accordance with those numbers.  Compliance with code requirements, potential failures, maintenance and inspection concerns, and standard operating procedures were reviewed for each point in the system.  Comments are summarized in the Process Hazard Assessment section.\n\nPrevention System\nThe Facility has an operation, maintenance and inspection system designed to review each element of the chlorination system routinely.  There are Operation and Maintenance manuals for each major piece of equipment, and personnel receive significant training before being allowed to work on the system.\n\nAs each cylinder is changed, the valves and flexible whip connection of the chlorine system are tested for leaks.  There are standard operating procedures (SOPs) for startup, shutdown, normal operation, and emergency operation.  The SOPs are written and posted in the appropriate areas.  Personnel are trained routinely on safety concerns and general operation procedures as well as emergency procedures.  The system is equipped "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7249,
      "SummaryText": "with chlorine detectors and alarms that indicate leaks.\n\nEmergency Response Plan\nAny response requiring entry in a dangerous atmosphere requiring Level A personal protection or use of a chlorine repair kit is to be managed by HazMat Response, Inc., an emergency response company located in the Kansas City area.  A complete copy of the Emergency Response Plan (Emergency Action Plan) is included.   \n\nAccident History\nThe Facility has had no chlorine releases in the past five years.."
    }
  ]
}