{
  "FacilityID": 7259,
  "FacilityName": "Creative Foods, LLC",
  "FacilityStr1": "710 Pearl",
  "FacilityStr2": null,
  "FacilityCity": "Osceola",
  "FacilityState": "AR",
  "FacilityZipCode": "72370",
  "Facility4DigitZipExt": "0368",
  "FacilityCountyFIPS": "05093",
  "LEPC": "Mississippi County LEPC",
  "FacilityLatDecDegs": "35.710833",
  "FacilityLongDecDegs": "-89.964167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A5",
  "LatLongDescription": "PP",
  "FacilityURL": null,
  "FacilityEmailAddress": "HRR62447@AOL.COM",
  "FacilityDUNS": 618702203,
  "ParentCompanyName": "Osceola Foods, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 618702203,
  "Company2DUNS": null,
  "OperatorName": "Mart Massey",
  "OperatorStr1": "PO Box 368",
  "OperatorStr2": null,
  "OperatorCity": "Osceola",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72370",
  "OperatorZipCodeExt": "0368",
  "FTE": 155,
  "OtherEPAFacilityID": "72370SCLFD710NO",
  "EPAFacilityID": "100000095602",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-18 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-07 00:00:00",
  "ErrorReportDate": "1999-07-07 00:00:00",
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.709554,
  "FRS_Long": -89.96404,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8759,
      "AltID": "Refrigeration",
      "FacilityID": 7259,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 9640,
          "ProcessID": 8759,
          "ChemicalID": 56,
          "Quantity": 28338.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8967,
          "ProcessID": 8759,
          "NAICSCode": "31199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3876,
              "Process_NAICS_ID": 8967,
              "SafetyReviewDate": "1999-06-02 00:00:00",
              "PHA_Date": "1999-06-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-08-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-08-31 00:00:00",
              "TrainingReviewDate": "1999-06-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-02 00:00:00",
              "EquipmentInspectionDate": "1999-05-18 00:00:00",
              "EquipmentTested": "pressure vessels",
              "ChangeMgmtDate": "1996-01-01 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-01 00:00:00",
              "PreStartupReviewDate": "1999-08-01 00:00:00",
              "ComplianceAuditDate": "1999-06-01 00:00:00",
              "AuditCompletionDate": "1999-08-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-16 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-16 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-16 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4430,
                  "PreventionProgram3ID": 3876,
                  "ProcessChemicalID": 9640
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7259,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-02 00:00:00",
    "ERTrainingDate": "1999-08-31 00:00:00",
    "CoordinatingAgencyName": "Mississippi County LEPC",
    "CoordinatingAgencyPhone": "8705631309",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 7259,
      "SummaryText": "y schools, 1 middle school, 1 junior high, and 1 high school. \n\tMedical Care\n\tMedical care support is provided by the Baptist Memorial Hospital having 82 private rooms, an Intensive Care Unit and Coronary Care; County Health Department, and a 96 bed nursing home. \n\tOperation Description\n\tCreative Foods, LLC formally known as Osceola Foods until 1995, has primarily produced private label margarine spreads from 1948 through 1989.  Currently, Creative Foods maintains a viable market share in margarine spread, however they have expanded into value-added products such as pizza sauces, cheese sauces, shortening sticks, dry spices, and food release products.  In 1996 a new warehouse was purchased and currently Creative Foods is in an expansion mode.  These expansions include the addition of a 1,400 square foot cooler storage area, installation of a spiral freezer for a new product line, and process area.  It is anticipated that upon completion of the expansion projects (August 1999), that there will be eight more cooling units and a receiver added to the refrigeration system.  The ammonia inventory may increase by 2,000 pounds.  Further enhancement of the ammonia system will include replacing two Frick compressors with two Vilter 4516 compressors.\n\tThe air cooling process involves the distribution of liquid ammonia through piping (coils) across which air is blown with fans to cool the air.  \n\tTechnology of the Process\n\tRefrigeration is the control of heat.  According to American Heritage Dictionary heat is defined as:\nThe energy associated with the motion of atoms or molecules in\nsolids, which can be transmitted through solid and fluid media\nby conduction, through fluid media by convection and through empty\nspace by radiation.\n\tHeat is energy.  The amount of energy or heat available is determined by the amount of motion or excitement of the atoms or molecules.  The more excited the molecules, the more energy or heat available.\n\tThis energy or heat can be moved or transfe"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 7259,
      "SummaryText": "rred.  This transfer occurs when there is a difference of temperature.  Heat flows from a source of greater energy (higher temperature) to a source of lower energy (lower temperature).  The greater the temperature difference, the more rapid the heat flow.\n\tThere are three types of heat transfer mechanisms:\nConduction\nConvection\nRadiation\n\tThe use of liquid ammonia as a refrigerant is the transferring of heat by conduction and convection.  In conduction heat is transferred by the molecules in a medium coming in contact with each other.  The warm molecules collide with colder molecules giving them some of the energy (heat).  The flow will occur if there is a difference of temperature from one side of the medium to the other.  Metals are very good at transferring heat by conduction.\n\tBy blowing air or moving a liquid such as water or glycol over a material such as metal that has been cooled, heat is transferred by convection.  The heat load in a freezer is moved via convection to the coils where conduction takes place in transferring the heat to the refrigerant.  The refrigeration process does not produce cold.  It simply moves the heat from an area where it is not wanted to a place it can be discharged.\n\tThe refrigeration systems at Creative Foods are accomplished by two methods using Anhydrous Ammonia.  These include:\nAir Cooling\nWater Chilling\n\n\tLiquid ammonia has the ability to absorb very large amounts of heat as it vaporizes.  This ability is the basis for mechanical refrigeration systems.  These mechanical systems utilize both pressure and temperature in the refrigeration cycle.  There are five major components in a mechanical refrigeration system.  These include, 1) Receiver, 2) Metering device/expansion valves, 3) Evaporator, 4) Compressor, and 5) Condenser.\n\tThe Receiver collects the condensed vapors and stores the excess refrigerant charge that is not circulating through the system.  The receiver is located between the condenser and the expansion valve.  It"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 7259,
      "SummaryText": "is also used to store refrigerant when it is necessary to service the system.\n\tThe liquid ammonia is routed to a metering device (expansion valves).  This device regulates the amount of refrigerant going into the evaporator.\n\tAs the ammonia flows through the device, there is a pressure drop.  The amount of pressure drop determines the temperature of the refrigerant going to the evaporator.  The refrigerant leaves the metering device in both a liquid and a vapor phase.\n\tThe two phase refrigerant then enters the evaporator.  The evaporator removes heat from the area or substance being cooled.  The ammonia absorbs heat and vaporizes as it travels through the evaporator.  The ammonia then leaves the evaporator and travels to the compressor.\n\tThe compressor takes the vapor through the suction line and increases the pressure such that when the heat is removed in the condenser, the vapors change form and become liquid.  Work is required to compress these vapors.  This work is converted into energy and stored in the compressed vapors.  This increase in energy results in an increase in temperature.\n\tThe compressed vapors then go to a condenser.  The condenser removes a lot of the heat contained in the compressed vapors.  When enough heat is removed, the vapor changes form and becomes liquid.  This condenser liquid then flows to the receiver.\n\tCreative Foods, receives Anhydrous Ammonia by wheeled vehicle.  The receiver has a maximum of 24,727.5 pounds, which is filled to 80% capacity.  The Anhydrous Ammonia is in a liquid form at receipt.  Contract personnel complete the connection to the tank.  Creative Foods maintenance personnel are at the site during filling.\n\tWorst-case release scenario and alternative release scenario\n\tAs a part of the Creative Foods proactive program concerning the hazards of ammonia to its workers and the surrounding public, its staff has conducted a thorough hazard assessment.\n\tFor the hazard assessment and the RMP, populations potentially affected a"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 7259,
      "SummaryText": "Accidental release prevention and emergency response policies at Creative Foods, LLC\n\tThe policy of Creative Foods is to develop those programs necessary to protect the health of its employees against on-the-job hazards, which may cause sickness or injury now or in the future.  Also, as the operator of a facility at which substances may be used that in uncontrolled situations could cause harm to the public and damage to the environment, we will strive for environmental excellence with a commitment to continual improvement, pollution prevention, and compliance with legislative requirements.  The Risk Management Program (RMP) is one of these programs.\n\tEach employee in areas where the RMP is applicable will be knowledgeable of the related policies and procedures and the supervisors or a designated person is required to ensure that they understand them.  Employees and supervisors are required to comply with our policies and are subject to corrective action in those cases determined to indicate willful violation.\n\tA written plan of action regarding the implementation of employee participation in the program has been developed as a part of our Release Prevention Program as specified by 29 CFR 1910.119.  A compilation of safety information to enable Creative Foods and the employees involved in the ammonia operations to operate safely has been accumulated.  This process safety information includes information pertaining to the toxicological and physical hazards of the chemical listed.  This plan of action includes information pertaining to the technology of the processes, and information pertaining to any equipment used in the processes.\n\tA complete hazard analysis and study of the ammonia system's mechanical integrity has been completed on the ammonia receipt, storage, and utilization operations have been completed.  This analysis was completed by safety and health staff, engineering and maintenance personnel, and certain operational personnel.  This analyses involved a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7259,
      "SummaryText": "review of each operation of the processes to address steps for each operating phase, operating limits, safety and health considerations, and safety systems and their functions.  The assessment also included information concerning the emergency action plans related to the process; development and implementation of safe work practices regarding the control of entrance and exit of personnel in the process areas; pre-startup safety; mechanical integrity of equipment; inspection and testing, correction of deficiencies in equipment, planned or unexpected changes to the process, equipment, and procedures to the processes.\n\tA system was developed and is maintained to promptly address the team's findings and recommendations.  The hazard analyses will be updated as needed and at least every five (5) years.\n\tCreative Foods has developed and implemented written operating procedures to provide clear instructions for safely conducting activities involved in the processes at each operation by our employees, consistent with the process safety information and to address steps for each handling phase, limitations, safety and health considerations, and safety systems and their functions.  Other written documentation of standard operating procedures as a part of this program is included in the following documents:\nJob Safety Analyses\nMechanical Integrity Study of Process Equipment\nPreventive Maintenance Program\nWritten Emergency Response Plan\nEmployee Emergency Action and Evacuation Plan\n\tEach employee involved in operations within the processes where the ammonia is received, processed, or used at the facility has been trained in an overview of the processes and in the operating procedures as outlined by OSHA regulations.  Refresher training is required every three years, and more often if necessary.  Training includes:\n\ta.  Emphasis on the specific safety and health hazards;\n\tb.  Emergency operations in the case of a release including shutdown; and\n\tc.  Safe work practices applicable"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7259,
      "SummaryText": "to the employee's job tasks.\n\tDesignated personnel have specific responsibilities related to the use of contractors who perform maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to areas where the Ammonia is received, stored, or processed in the facility.  These responsibilities include specific requirements in selection of contractors regarding the contractor's safety performance and programs; the provision of information concerning the emergency action plans related to the process; development and implementation of safe work practices regarding the control of entrance and exit of contract employers and contract employees in the process areas; periodic evaluation of the contractor related to safety management at the process; maintenance of certain records related to contractor employee injury and illness; development of written procedures for any new processes; and provision of training to employees.  \n\tContractors performing work on or adjacent to equipment or processes in which Ammonia is present must have clearance from the Maintenance Supervisor prior to beginning operations.  Each contractor will also complete the Creative Foods Divisional Visitor and Contractor Safety Rules form prior to entry into the facility.\n\tIn those cases where contractors will perform work directly to or on the process equipment in which the Ammonia is present, the Safety Coordinator and Maintenance Supervisor will provide an orientation section to them prior to beginning operations.  This orientation will include an introduction to the Creative Foods Process Safety Management Program, information concerning the toxicological and physical hazards of Ammonia, and the emergency response plan in the case of an incident involving a release.  Upon completion, the contractor will be issued a permit by the Maintenance Supervisor to begin work.\nThe Creative Foods and the Ammonia Process\n\tCreative Foods provides employment for 155 workers in Osceola, Arkansas"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7259,
      "SummaryText": ".  This facility is margarine spread and sauces plant operated by Mart Massey, PO Box 368, Osceola, Arkansas 72370.  (telephone - (870) 563-2601).\nSite Description:\n\tThe facility is located in Osceola, Arkansas at 710 Pearl Street, Osceola, Arkansas 72370.  Its Dun and Bradstreet number is 61870-2203.  \n\tGeography and Weather:\n\tOsceola is located in Northeast Arkansas on the banks of the Mississippi River three miles from Interstate 55.  The town extends from the banks of the river to central Mississippi County to an elevation of 238 feet.  Osceola city limits encompasses 4.5 square miles of the county's 905 square miles. \n\tThe weather in Osceola includes warm summers and mild winters.  The average annual rainfall is 39 inches.  The mean daily maximum temperature is 70 degrees F, while the minimum temperature is 49 degrees F.\n\n\n\n\n\tTransportation:\n\tAirports:  Osceola Municipal Airport is a public-use general aviation airport not served by commercial aircraft.  The airport is located within a 15 minute drive from any location in Osceola.  \n\tRailroads:  Burlington Northern Santa Fe Railroad provides four freight lines that service Osceola daily.  There is no passenger service.\n\tInterstates:  Osceola is three miles east of Interstate 55.  Other roadways that service Osceola include US 61 and State roads 140, 325, 119, and 239.\n\tPopulation and Labor Force\n\tThe population of the city of Osceola is 9,165 while Mississippi County has a population of 57,525.  Nearby communities include Wilson, Keiser, Victoria, Luxora, Sans Souci, Nodena, and Burdette.  \nThe labor force for Mississippi County exceeds 25,000.\n\tGovernment and Law Enforcement\n\tThe City of Osceola is operated under a nonpartisan Mayor/Council form, with the Mayor and Councils members elected at-large by a popular vote.  The Police Department is located within the city, where as the Sheriff's Department for Mississippi County is located 6 miles north of Osceola.\n\tSchools\n\tThe population is serviced by 3 elementar"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 7259,
      "SummaryText": "re defined as those within a circle that has as its center the point of release and its radius the distance to the toxic or flammable endpoint.  Owners or operators may use Census data to define this population.  The presence of schools, hospitals, other institutions, public arenas, recreational areas, and large commercial and industrial developments that can be identified on street maps within this circle must be noted.  The presence of environmental receptors within this circle must also be listed.  The EPA has defined environmental receptors as natural areas such as national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preserves, refuges, or areas; and Federal wilderness areas, that can be exposed to an accidental release.\n\tThe worst case scenario for Anhydrous Ammonia was decided as the complete rapid loss of 19782 pounds of Anhydrous Ammonia during a one-minute time frame. The following information was determined using the Automated Resource for Chemical Hazard Incident Evaluation (ARCHIE) model, based on the stability class F, 4.5 mph wind speed, and a level of 200 ppm for Anhydrous Ammonia.  This resulted in a release rate of 19782 lbs/min, and an end point of 9.32 miles from the spill point at 90 degrees F.  \n\tThe alternate case scenario for Anhydrous Ammonia was decided as the loss of Anhydrous Ammonia resulting from a release through a 1-inch line break.  The following information was determined using the Automated Resource for Chemical Hazard Incident Evaluation (ARCHIE) model, based on the stability class F, 4.5 wind speed, and a level of 200ppm for Anhydrous Ammonia.  This resulted in a release rate of 2 lbs/min, for a duration of 15 minutes, and an end point of .09 miles or 472 feet from the spill point.  \nGeneral accidental release prevention program and chemical-specific prevention steps\n\tPrevention of a release is a core component of the Creative Foods Risk Management Program.  This program is designed to ensure"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 7259,
      "SummaryText": "proper work practices and an on-going mechanical integrity program.  This program also ensures compliance with 29 CFR 1910.38, 1910.120, 1910.1200, 40 CFR, Part 68, Part 112, and Part 260.\n\tCreative Foods has developed and implemented written operating procedures to provide clear instructions for safely conducting activities involved in the processes at each operation by our employees, consistent with the process safety information and to address steps for each handling phase, limitations, safety and health considerations, and safety systems and their functions.  Other written documentation of standard operating procedures as a part of this program is included in the following documents:\nMechanical Integrity Study of Process Equipment\nPreventive Maintenance Program\nWritten Emergency Response Plan\nEmployee Emergency Action and Evacuation Plan\n\tTraining\n\tEach employee involved in operations within the process where Ammonia is received, processed, or used at the facility has been trained in an overview of the process and in the operating procedures as outlined by 29 CFR 1910.119.  Refresher training is provided no less than every three years and more often if necessary. \n\tMechanical Integrity\n\tAlso, each maintenance person who has responsibilities to perform maintenance on the process components receives training on an as needed basis, but no less than every three years.\n\t\n Emergency Response\n\tA team of individuals will be trained and equipped as a HAZMAT team.  The team will be equipped with Self-Contained Breathing Apparatuses, Level A suits, and monitoring equipment to respond in an offensive manner.\n\tA record of the training, should contain the identity of the employee, the date of training, and the means, used to verify that the employee understood the training is completed and maintained. During the summer of 1999 training will be completed.\n\tContractors.\n\tDesignated personnel have specific responsibilities related to the use of contractors who perform maintenan"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 7259,
      "SummaryText": "ce or repair, turnaround, major renovation, or specialty work on or adjacent to areas where the Ammonia is received, stored, or processed in the facility.  These responsibilities include specific requirements in selection of contractors regarding the contractor's safety performance and programs; the provision of information concerning the emergency action plans related to the process; development and implementation of safe work practices regarding the control of entrance and exit of contract employers and contract employees in the process areas; periodic evaluation of the contractor related to safety management at the process; maintenance of certain records related to contractor employee injury and illness; development of written procedures for any new processes; and provision of training to employees.  \nFive-year accident history\nNo incidences of ammonia release have occurred at the facility that resulted in deaths or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\nEmergency response program\n\tDue to the receipt, usage, and storage of Ammonia in large quantities, Creative Foods takes a proactive approach to the protection of its employees, the public, and the environment.  In consideration of the hazardous effects that Ammonia may have on human health and the environment the following outlines the facilities prevention and emergency response plans:\n\tWritten Emergency Response Plan\n\tOffensively Trained & Equipped Emergency Action Team in accordance with 29 CFR 1910.120\n\tDevelopment of a Written Implementation Plan of Action\n\tConduction of Hazard Analysis on routine and periodic basis\n\tDevelopment of and documentation of safe work practices\n\tInitial and periodic training of employees\n\tConduction of pre-startup safety reviews\n\tConduction of Compliance Audits\n\tConduction of incident investigations\n\tContractor Program Safety Program\n\tHot Work Permit Program\n\tProcess Safety"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 7259,
      "SummaryText": "Management & Chemical Accidental Release Prevention Committee\n\tMechanical Integrity & Preventive Maintenance Program\n\tDetermination and planning for Worst-Case and Alternative Case Release Scenarios\n\tContinual evaluation for methods to improve facility safety - Safety Committee\n\tMeetings with the Local Emergency Planning Committee and Fir Department\n\nPlanned changes to improve safety\n\tIn an attempt to ensure a continual improvement in the facility worker protection and release prevention programs, training concerning this safety and environmental program and others is conducted for eight hours each month.  This training requires the attendance by all personnel whose job may have any relationship to the ammonia operations."
    }
  ]
}