{
  "FacilityID": 7262,
  "FacilityName": "Baker & Baker",
  "FacilityStr1": "1301 Estes Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Elk Grove Village",
  "FacilityState": "IL",
  "FacilityZipCode": "60007",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "42.005278",
  "FacilityLongDecDegs": "-87.9675",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "CSM nv",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "CSM NV",
  "OperatorStr1": "PO Box 349",
  "OperatorStr2": "100 AH",
  "OperatorCity": "Amsterdam",
  "OperatorStateFIPS": null,
  "OperatorZipCode": null,
  "OperatorZipCodeExt": null,
  "RMPContact": "Jerry Scheffers",
  "RMPTitle": "Vice President of Operations",
  "FTE": 150,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000093908",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "031440AET",
  "SafetyInspectionDate": "1998-09-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": "Amsterdam",
  "ForeignZipCode": null,
  "ForeignCountry": "NL",
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-03-20 00:00:00",
  "DeRegistrationEffectiveDate": "2007-12-01 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.00592,
  "FRS_Long": -87.96779,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8762,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 7262,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8970,
          "ProcessID": 8762,
          "NAICSCode": "31181",
          "_desc": {
            "NAICS_CODE": "31181",
            "NAICS_DESCRIPTION": "Bread and Bakery Product Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9643,
          "ProcessID": 8762,
          "ChemicalID": 56,
          "Quantity": 12400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509643,
          "ProcessID": 8762,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7262,
      "SummaryText": "\nEXECUTIVE SUMMARY\n\nBaker & Baker manufacturers of frozen bakery products and bakery ingredients products at our plant in Elk Grove Village.  We have a strong commitment to operate our facility in a safe and responsible manner.\n\nAmmonia is used at our facility as the cooling medium in our refrigeration systems.  Similar to the function Freon plays in a home or car air conditioning system, ammonia is used to cool water and glycol that in turn cools our product in heat exchangers.  Ammonia is also used in coolers and freezers to keep product at proper temperatures.  The ammonia is contained in a closed loop system; it is designed to remain inside the piping and vessels in our facility.  We believe that ammonia provides the safest and most efficient cooling choice for our operation.\n\n\nA. Describe the Accident Release Prevention and Emergency Policies\n\nBaker & Baker takes many precautions to prevent or minimize accidental releases of ammonia from the refrigeration system.  These precautions include safety controls (alarms and automatic shutdown devices) which are designed to identify and prevent potentially unsafe conditions like pressure increases that could cause a system failure.  We also have a preventive maintenance program designed to maintain the on-going integrity of the systems, a training program designed to ensure that the systems are operated by qualified personnel, and to respond quickly to system upsets.\n\nThe Project Engineer is responsible for the management of these ammonia safety programs.\n\n\nB. Stationary Source and Regulated Substances Handled\n\nThe facility operates a refrigeration system with an ammonia inventory of approximately 12,400 pounds.  Ammonia is the only substance covered by the Accidental Release Prevention Regulations handled at the Elk Grove Village plant.\n\n\nC. Summary of Worst-Case and Alternative Release Scenarios\n\nEPA requires us to define the worst case release scenario from the Elk Grove Village plant as the release of all the ammon"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7262,
      "SummaryText": "ia from the largest vessel on site.  At our Elk Grove Village plant, this would be 12,400 pounds of ammonia over a 10-minute period due to the failure of the high-pressure receiver.  The 12,400 pounds represents the maximum amount of ammonia that would be contained in the receiver at any time.  EPA also requires us to assume that the weather conditions are such that there is almost no wind and no mixing in the atmosphere.\n\nThe alternative release scenario at the Elk Grove Village plant would involve the release of 5,400 pounds of ammonia over a 10-minute period due to the rupture of a =\" high-pressure liquid line.  The duration of the release was estimated for the alternative release scenario by estimating the amount of time required to stop the leak.  Again, EPA required us to estimate the impacts of this release under low wind and stable weather conditions.  \n\nBoth of these releases are unlikely for many reasons.  Our equipment and system were designed using industry standards for ammonia refrigeration.  We have taken precautions to protect our equipment from obvious threats, like vehicular traffic.  We have a preventive maintenance program to maintain the on-going integrity of the refrigeration equipment.  Training programs are in place to ensure that qualified personnel operate the systems, and our emergency response procedures allow us to respond quickly in the event of an accident.  And lastly, the weather conditions used in estimating the extent of the releases are uncommon.\n\n\nD. Description of the Accidental Release Prevention Program\n\nThe facility has an accident release prevention program that complies with Occupational Safety and Health Act's Process Safety Management Standard and EPA's Risk Management Program Regulation.  The prevention program consists of the following elements:\n\n- Employee Participation Program\n- Process Safety Information\n- Process Hazard Analysis\n- Operating Procedures\n- Training Program\n- Contractor Safety Program\n- Pre-Startup Safe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7262,
      "SummaryText": "ty Review Procedures\n- Mechanical Integrity Program\n- Hot Work Permit Procedures\n- Management of Change Procedures\n- Incident Investigation Procedures\n- Compliance Audit Procedures\n\n\nE. Five-Year Accident History\n\nThere have been no ammonia-related accidents at the Elk Grove Village plant in the past five years.\n\n\n\n\nF. Description of the Emergency Response Program\n\nAn emergency response program has been implemented at the Elk Grove Village plant.  This program contains procedures describing how the facility will respond to ammonia spills and other emergencies, including evacuation procedures.\n\nThe plant response team utilizes employees  who are trained to enter and stop an accidental ammonia release.\n\nG. Planned Changes to Improve Safety\n\nBaker & Baker is committed to operating our ammonia refrigeration system in a safe and responsible manner.  We are continually evaluating our equipment and procedures to meet this objective.  Planned improvements include the addition of safety valves."
    }
  ]
}