{
  "FacilityID": 7274,
  "FacilityName": "Bayou Cassotte water treatment plant",
  "FacilityStr1": "3608 Scovel Ave",
  "FacilityStr2": "PO Drawer 908",
  "FacilityCity": "Pascagoula",
  "FacilityState": "MS",
  "FacilityZipCode": "39581",
  "Facility4DigitZipExt": "0908",
  "FacilityCountyFIPS": "28059",
  "LEPC": "Jackson County LEPC",
  "FacilityLatDecDegs": "30.361611",
  "FacilityLongDecDegs": "-88.525333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "jhutch@cityofpascagoula.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Pascagoula",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Pascagoula",
  "OperatorStr1": "3608 Scovel Ave",
  "OperatorStr2": "PO Drawer 908",
  "OperatorCity": "Pascagoula",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39581",
  "OperatorZipCodeExt": "0908",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000094989",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-01 00:00:00",
  "SafetyInspectionBy": "MS State Dept of Health Water Supply Division",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": "1999-07-06 00:00:00",
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": "1999-12-08 00:00:00",
  "DeRegistrationEffectiveDate": "1999-12-01 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 30.362028,
  "FRS_Long": -88.525222,
  "FRS_Description": null,
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8775,
      "AltID": "potable water chlorinatio",
      "FacilityID": 7274,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 9657,
          "ProcessID": 8775,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8989,
          "ProcessID": 8775,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 4461,
              "Process_NAICS_ID": 8989,
              "SafetyReviewDate": "1999-06-15 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "MS DOH Water supply Division",
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-15 00:00:00",
              "ChangeCompletionDate": "2000-02-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "Yes",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-15 00:00:00",
              "TrainingReviewDate": "1998-09-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-15 00:00:00",
              "EquipmentInspectionDate": "1999-06-15 00:00:00",
              "EquipmentTested": "Air Packs, Chlorinators",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-04-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4610,
                  "PreventionProgram2ID": 4461,
                  "ProcessChemicalID": 9657
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7274,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-01 00:00:00",
    "ERTrainingDate": "1960-01-01 00:00:00",
    "CoordinatingAgencyName": "City of Pascagoula Police Departmen",
    "CoordinatingAgencyPhone": "2287622211",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "MS Department of Health, Water Supply Division"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 7274,
      "SummaryText": "d how suitable equipment and an experienced operator can be obtained promptly.\n\nIf liquid chlorine or chlorine water has contacted skin or clothing, shower immediately, removing clothing and wash-ing skin with large amounts of soap and water. NEVER ATTEMPT TO NEUTRALIZE THE CHLORINE WITH CHEMICALS. Do not apply salves or ointments for 24 hours unless directed by a physician.\n\nIf the eyes have been exposed to strong concentrations of chlorine gas, or to liquid chlorine, flush immediately with running water for at least 15 minutes, holding the eyelids apart. CALL A PHYSICIAN, PREFERABLE AN EYE SPE-CIALIST, AT ONCE. If a physician is not immediately available, continue eye irrigation for a second 15-minute period. NEVER ATTEMPT TO NEUTRALIZE THE CHLOR-INE WITH CHEMICALS. Do not apply oils, oily ointments or any other medications unless ordered by a physician.\n\nAssist medical personnel as needed. \n RMP Pascagoula\n\nOperating Procedures\nMOVING\n\nUse care in handling all chlorine con-tainers. Avoid all situations which will cause them to drop or be struck with force by any object.\n\nUse a properly balanced hand truck with clamp or chain to move full chlorine cylinders. Use an elevator, or a crane or hoist equipped with a cradle or carrier, to lift them. Cylinders being trucked should be upright and securely fastened in place. NEVER USE A CHAIN, ROPE SLINGOR MAGNETIC DEVICETO LIFT CHLORINE CYLINDERS. NEVER LIFT THEM BY MEANS OF THE VALVE PROTECTION HOOD.\n\nUse a suitable lifting beam in combination with a hoist or crane of at least two tons capacity to lift chlorine ton containers. Con-tainers being trucked should be chocked or clamped on saddles.\n\nNEVER MOVE CHLORINE CONTAINERS WITHOUT VALVE OUTLET CAP(S) AND PROTECTION HOOD IN PLACE.\n\nSTORING:\n\nStore all chlorine containers, full or empty, in a clean, well-ventilated, fire-resistant area, away from all heat sources, and segregated from other compressed gas containers. Keep area free of trash to avoid fire hazard. Avoid subsu"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7274,
      "SummaryText": "rface storage areas. Store full containers so that access, daily inspection, removal, etc. can be readily accomplished with a minimum of handling. Store full and empty containers separately. Store chlorine cylinders in an upright position. Store chlorine ton containers on their sides, slightly above floor or grade level, on steel or concrete supports. Avoid stacking them.\n\nNEVER STORE CHLORINE CONTAINERS NEAR TURPENTINE, ETHER, ANHYDROUS AMMONIA, FINELY DIVIDED METALS, HYDROCAR-BONS OR OTHER FLAMMABLE MATERIALS. \n\nNEVER STORE CHLORINE CONTAINERS NEAR ELEVATORS, GANG-WAYS OR VENTILATING SYSTEMS.\n\nNEVER STORE CHLORINE CONTAINERS WITHOUT VALVE OUTLET CAP(S) AND PROTECTION HOOD IN PLACE.\n\nUSING:\n\nUse chlorine containers in the order received. Use a flexible connection between the container and the chlorine piping system, preferably 500 psig cop-per tubing with a standard yoke and adapter at the container end.\nUse a new 2-4% antimony lead or a graphitized asbestos gasket when making connections. Make sure connections are tight. Test for leaks. (See LEAKS). Use only a 3/8 square box wrench not over 6 long, turning stem only one tull turn counter-clockwise for opening (clockwise for closing) the chlorine con-tainer valve. NEVER FORCE THE VALVE STEM. Hit wrench handle with the heel of the hand to loosen a stuck valve stem. NEVER USE A HAMMER OR OTHER IMPLEMENTS FOR THIS PURPOSE.\n\nConnection of containers discharging liquid to a manifold is not recommended. NEVER CONNECT TO A GAS MANIFOLD A NEW CONTAINER THAT IS NOT AT THE SAME TEMPERATURE AS OTHER CONTAINERS CONNECTED TO THE SYSTEM.\n\nWeigh containers on a platform scale when unloading.\n\nNEVER HEAT CHLORINE CONTAINERS OR VALVES, OR PLACE THEM IN A HOT WATER BATH TO INCREASE DISCHARGE RATES. Be sure no water or other liquid is sucked back into chlorine containers when nearly empty or due to pressure gradients. NEVER LEAVE CONTAINER VALVES OPEN WHEN CHLORINE IS NOT BEING USED.\n\nUse only valves, gages, regulators, fittings, p"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 7274,
      "SummaryText": "iping, etc., recom-mended for chlorine service.\n\nAfter disconnecting chlorine lines, test valve for leaks, apply valve outlet cap and protection hood. Plug or cap the open end of the chlorine line immediately to keep out moisture.\n\nNotify the chlorine supplier promptly of damaged containers. NEVER TAMPER WITH FUSIBLE PLUGS"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 7274,
      "SummaryText": "Risk Management Plan\nFor\nCity of Pascagoula\n RMP Pascagoula\n\nTable of Contents\n\nExecutive Summary\tSection 1\nRMP Data Elements\tSection 2\nEmergency Response\tSection 3\nOperating Procedures\tSection 4\n RMP Pascagoula\nRisk Management Plan Executive Summary\n\nThe goal of the City of Pascagoula is to provide the citizens of Pascagoula clean safe water in the safest and most efficient manner possible. The safety of our citizens and employees is a primary goal of the City. To obtain this goal, the City takes several steps to ensure that the employees conduct themselves in a safe manner and that sites in the are maintained safely.\n\nThe City of Pascagoula uses chlorine gas as its primary water disinfection. There are six sites in Pascagoula where chlorine is injected. Two of these sites uses ton cylinders and fall within the EPA guidelines for submitting a risk management plan. These sites are the Communy well site located at 1103 Communy Ave. and the Bayou Cassotte well site located at 3608 Scovel Ave. in Pascagoula. Each well site is visited twice daily to ensure they are in proper working order. Each site has two cylinders on line and one full cylinder on site to change out empty cylinders.\n\nThe City of Pascagoula provides trained personnel to inspect each site. Training is provided through the Mississippi Department of Health, Mississippi Water and Pollution and Control Operators' Association, and the Mississippi Rural Water Association. Also, a hand on training is provided by City of Pascagoula staff. \n\nEmergency situations are handled on a case by case basis. However, a set procedure is outlined for employees to follow. These procedures are as follows:\n\nThe police department maintains emergency phone numbers. The police department is the central dispatch station for all emergencies in the City. An on call employee is reported to the police department each evening along with their home phone numbers and pager numbers. The on call employee carries a cell phone to be able to"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7274,
      "SummaryText": "contact other personnel as needed.\n\nIn the event of a chlorine leak, air packs are provided to approach the cylinder to control or fix the leak. The fire department is called out in the event a major leak and the LEPC is notified. The public will be notified to shelter-in-place (i.e. shut off all fresh air intakes, close windows and stay inside.) The fire department would then place a temporary repair kit on the cylinder. The chlorine supplier will be notified to pick up the defective or damaged cylinder.\n\nThe City uses vacuum chlorine injectors that deactivate during power outages. The city prepares for hurricanes by ensuring full water towers and clear zones around the chlorine station. As the City prepares for the next century, reverse osmosis plants will come on line around the first of the year 2000. When these plants come on line the chlorine demand will significantly drop allowing the City to eliminate this hazard. The City participates in the Community Right to Know, SARA Title III Tier 2. This is provided to the Mississippi Emergency Management Agency, The Jackson County Civil Defense, and the City's police and fire departments.\n\nRMP Pascagoula\n\nEmergency Responses\n\nThis plan to respond to chlorine leaks is to be placed at the site where chlorine gas is stored or in use and on the vehicles that service these sites. Also, a copy shall be given to each employee that works with chlorine and a copy shall be kept in the files of the water superintendent. \n\nThe following numbers are to notified in the event of an emergency:\n\nFire and police \t\t911\nChlorine provider\tIndustrial Chemicals\t1-800-476-2042\nNearest Cl provider\tWater & Waste Specialties\t1-800-569-3354\n\nMinor Leaks:\n\nChlorine gas is colorless in small concentrations. However, it will form a white cloud when exposed to ammonia vapor. A small hissing sound may be detectable on a leak. Also, a sharp, pungent odor is detectable.\n\nIf a leak is suspected DO NOT ENTER the area without a properly fitting air pack"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7274,
      "SummaryText": ". NEVER INVESTIGATE OR ATTEMPT TO CONTROL CHLORINE LEAKS WITHOUT USING SUITABLE RES-PIRATORY PROTECTIVE EQUIPMENT.\n Use ammonia vapor provided to detect leak. If leak occurs in the piping or chlorine equipment shut off the supply at the container. Ventilate the area before removing air pack. Then repair equipment.\n\nIf the leak is on the container, determine the nature of the leak and contact the fire department and the chlorine supplier. If the container can be repaired or if the leak can be stopped, make the repairs as required and label the container for pick up. Apply the leak kit if necessary to stop the leak.\n\nMajor Leaks:\n\nIn higher concentrations, chlorine will form a grennish-yellow cloud. A small hissing sound may be detectable on a leak. Also, a sharp, pungent odor is detectable on the fringes of the cloud.\n\nIf the container is leaking liquid, rotate the container so that the leak is on the top. Call the fire department and begin to notify the surrounding public. Contact the Water Superintendent and the nearest chlorine provider. Contact the Civil Defense Director. Eliminate traffic into the affected area. Instruct the general public to close all windows, shut off air conditioners, and block all fresh air intakes until further notice. Monitor the situation and assist responders as needed.\n\nRMP Pascagoula\n\nFirst Aid:\n\nPrompt treatment of any person exposed to chlorine is essential. OBTIAN MEDICAL ASSISTANCE AT ONCE. Move anyone overcome by or seriously exposed tp chlorine AT ONCE to an uncontaminated area.\n\nIf breathing has not ceased, place victim in a comfortable, quiet position and keep him warm. REST IS ESSENTIAL. CALL AMBULANCE.\n\nIf breathing has apparently ceased, start artificial respi-ration immediately, using acceptable methods such as mouth-to-mouth resuscitation. HAVE SOMEONE CALL AMBULANCE.\n\nIf approved inhalation equipment is available, oxygen should be administered, but only by a person authorized for such duty. If not available, know where an"
    }
  ]
}