{
  "FacilityID": 7284,
  "FacilityName": "The Dannon Company, Inc.",
  "FacilityStr1": "1300 Petersmith",
  "FacilityStr2": null,
  "FacilityCity": "Fort Worth",
  "FacilityState": "TX",
  "FacilityZipCode": "76104",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48439",
  "LEPC": "Fort Worth Fire Department",
  "FacilityLatDecDegs": "34.072222",
  "FacilityLongDecDegs": "-97.337778",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "The Dannon Company, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 57454019,
  "Company2DUNS": 0,
  "OperatorName": "The Dannon Company, Inc.",
  "OperatorStr1": "120 White Plains Road",
  "OperatorStr2": null,
  "OperatorCity": "Tarrytown",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "10591",
  "OperatorZipCodeExt": "5536",
  "RMPContact": "Michael Edgemon",
  "RMPTitle": "Regulatory Manager",
  "FTE": 350,
  "OtherEPAFacilityID": "TXD987797665",
  "EPAFacilityID": "100000095559",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-04-08 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-06-15 00:00:00",
  "DeRegistrationEffectiveDate": "2012-06-08 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.74003,
  "FRS_Long": -97.339,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8785,
      "AltID": null,
      "FacilityID": 7284,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 9001,
          "ProcessID": 8785,
          "NAICSCode": "31151",
          "_desc": {
            "NAICS_CODE": "31151",
            "NAICS_DESCRIPTION": "Dairy Product (except Frozen) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9667,
          "ProcessID": 8785,
          "ChemicalID": 56,
          "Quantity": 35000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509667,
          "ProcessID": 8785,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7284,
      "SummaryText": "\n                         THE DANNON COMPANY, INC.\n                          RISK MANAGEMENT PROGRAM\n                                                     EXECUTIVE SUMMARY\n\n1.  General accidental release and prevention policy of The Dannon Company.\n\nIn this yogurt processing facility we utilize anhydrous ammonia as a refrigerant.  Anhydrous\nammonia is considered hazardous by the Environmental Protection Agency. The same properties\nthat make ammonia a valuable refrigerant also makes it necessary to observe certain safety\nprecautions during it's use to prevent exposure to our workers, the surrounding community and\nthe environment.  \nIt is our policy at The Dannon Company to implement the requirements of the Risk Management\nProgram by managing and operating this facility in full compliance with all applicable federal and\nstate regulations that we are governed by. The objective is to minimize the risk of an accidental\nrelease of hazardous materials. Safety depends directly on our proper handling of ammonia. Our\nplant personnel have been trained on the equipment operating procedures and the various safety\ndevices that are incorporated in our facility to prevent the possibility of accidental releases.\n\n2.  Stationary source and regulated substance handled.\n\nThe Dannon Company, Inc., 1300 Petersmith Street, Fort Worth, Texas, operates a refrigeration\nsystem utilizing anhydrous ammonia as the primary refrigerant. Mechanical refrigeration is a\nthermodynamic process where the refrigerant, ammonia, is used as a heat exchanging fluid to\nmaintain a desired temperature in an enclosed environment. The refrigeration cycle consists of\nevaporation, compression, condensation and expansion. Evaporation and condensation are\ndesigned to alter the quantity of energy associated with the refrigerant. Compression and\nexpansion are designed to change the availability of the associated energy. The refrigeration cycle\nis a closed loop process. The ammonia cycle utilizes fluid temperature, press"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7284,
      "SummaryText": "ure and latent heat of\nvaporization for cooling. The refrigeration system uses this phenomenon to remove heat from a\ndesired space, and then to discard that heat through condensation, to an area where it is of no\nconsequence.\n\nThe Dannon Company facility uses ammonia refrigeration to maintain processing, storage room\nand product tank temperatures required for the processing and storage of our product. There are\napproximately 350 employees at this facility, including hourly and salary personnel, that\nmanufacture and prepare shipment of refrigerated dairy products via truck approximately 24\nhours a day, seven days a week.\n  \nThe refrigeration system contains 65,000 pounds of aggregate ammonia. The potential hazards\nthat could lead to an accidental release of the ammonia include, but are not limited to, equipment\nfailure, damage to piping, damage to equipment, human error, etc.\n \n\n\n\nAlthough ammonia is a colorless, tasteless liquid, it's dominant characteristic is it's pungent,\ndistinct odor.  Persons exposed to ammonia will not voluntarily stay in areas of even small\nconcentrations, although these levels would not normally result in any health risks. Risks from\naccidental exposure to ammonia in a vapor state are irritations to the eyes, nose and throat. The\nextent of irritation depends on the exposure amount and length of time exposed.  \nAmmonia is classified non-flammable by the Department of Transportation.  Ammonia will burn,\nbut only in a very narrow concentration level when accompanied with a constant ignition source.\n\n3. Worst case  and alternate case release scenarios including administrative and\nengineering controls to limit/ prevent accidental release.\n\nWorst case scenario depicts continuous source leak from the High Pressure Receiver (HPR)\nlocated inside the screw machine room.  This vessels normal operating level is 16,000 pounds of\nliquid ammonia,  approximately 35% of it's total capacity. Although the high pressure receiver is\ncapable of holding 45,000 po"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7284,
      "SummaryText": "unds, this exceeds engineering controls which limit the liquid level to\na maximum of 80% at any time.  Considering the \"catastrophic\" possibility does exist for this\nvessel to release it's entire contents, engineering controls incorporated into the system would\nnormally prevent such a release.\n\n     Worst case release scenario criteria for The Dannon Company facility:\n\n     Ammonia Quantity:                  16,000 pounds\n     Rate of Release:                   1600 lbs / min. (10 min. release)\n     LOC (Level of Concern):            200 ppm  (EPA ERPG-2)  \n     Physical State:                    Gas \n           Type of Area:                     Urban\n     Wind Speed:                        1.5 m/sec\n     Distance to Endpoint                    2.2 miles\n\nAlternate release scenario is represented by the release of ammonia vapor from a safety relief\nvalve (SRV) due to an overpressurization condition on the pump recirculator vessel located\nwithin the screw machine room. The indicated relief valve would be performing exactly as it is\ndesigned to do during an overpressurization condition. Valve would open to relieve the over-\npressure and vent into the atmosphere via the roof vent pipe.\n\n     Alternate case release scenario criteria for The Dannon Company facility:\n\n     Ammonia Quantity:                  230 pounds\n     Rate of Release:                         21 pounds/min. (20 min. release)\n     Wind Speed:                        3.0 m/sec.\n     Distance to Endpoint:                   .1 miles\n     \n\n\n\n     The following administrative and engineering controls are in place at The Dannon\nCompany. These controls are designed to eliminate, or reduce the possibilities of an\naccidental release from the refrigeration system.\n\n     *  Electronic ammonia detection installed in compressor rooms, coolers, processing areas\nand receiving. Alarm system activates a local audible alarm to alert plant personnel of the\npotential ammonia leak in the monitored areas. \n     *  High liqu"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7284,
      "SummaryText": "id level switches are configured to accumulators and recirculators. High level\nswitches will shut down associated compressor operation during a high level condition.\n     * All compressors are configured with critical safety controls (high pressure, low pressure,\nhigh oil temp cut-outs, etc.) to shut down the respective compressor in the event of an abnormal\noperating condition.\n     *  Safety Relief Valves are configured to all pressure vessels, condensers and compressor\noil separators to eliminate over pressurization conditions in those associated pieces of equipment.\n     *  Periodic Maintenance Program is contracted through a reputable refrigeration company\nto ensure the refrigeration system and it's components are kept in optimum mechanical and\noperating status. Weekly inspections are conducted by the refrigeration contractor. Daily rounds\nare made by plant personnel to verify proper equipment operation.\n     *  Security personnel on premises 24 hours a day, seven days a week to monitor facility\naccess as well as make rounds to detect malfunctions within the refrigeration equipment.\n\n4.  Five-year accident history.\n\nThe Dannon Company facility at Fort Worth has had zero accidental releases to report. \n\n5.   Emergency Action Program\n\nThe purpose of The Dannon Company Emergency Action Plan is to:\n\n     1.   Minimize exposure to our employees and the surrounding community in the event of a\n     hazardous material release or spill.\n\n     2.  Assure the safe emergency evacuation of the plant in the instance that it is required.\n\n     3.  Provide for prompt medical attention to any employees who become seriously injured\n     or ill at work.\n\n     4.  Facility management has developed an Emergency Response Plan to ensure a fast and   \n           efficient response in the event of an accidental release of hazardous materials. \n\nOur Emergency Action Plan currently meets requirements as set forth in OSHA 29 CFR 1910.38,\nEmployee Emergency and Fire Prevention Plans.  \n "
    }
  ]
}