{
  "FacilityID": 7488,
  "FacilityName": "City of  Waterbury Water Treatment Plant",
  "FacilityStr1": "1525 Branch Road",
  "FacilityStr2": null,
  "FacilityCity": "Thomaston",
  "FacilityState": "CT",
  "FacilityZipCode": "06787",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "09005",
  "LEPC": null,
  "FacilityLatDecDegs": "41.668611",
  "FacilityLongDecDegs": "-73.141111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": "EHEITKAMP@aol.com",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Leonard Assard (Operator)",
  "OperatorStr1": "1525 Branch Road",
  "OperatorStr2": null,
  "OperatorCity": "Thomaston",
  "OperatorStateFIPS": "CT",
  "OperatorZipCode": "06787",
  "OperatorZipCodeExt": null,
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000092311",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-06 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2003-06-30 00:00:00",
  "DeRegistrationEffectiveDate": "2003-06-30 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.6698,
  "FRS_Long": -73.13601,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9028,
      "AltID": null,
      "FacilityID": 7488,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 9976,
          "ProcessID": 9028,
          "ChemicalID": 62,
          "Quantity": 36000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 9248,
          "ProcessID": 9028,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 4033,
              "Process_NAICS_ID": 9248,
              "SafetyReviewDate": "1999-06-17 00:00:00",
              "PHA_Date": "1999-09-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-17 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1988-01-01 00:00:00",
              "TrainingReviewDate": "1988-01-01 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1988-01-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-08 00:00:00",
              "EquipmentTested": "Chlorinators, vacuum regulators, pressure reducing valves, isolation valves",
              "ChangeMgmtDate": "1988-01-01 00:00:00",
              "ChangeMgmtReviewDate": "1988-01-01 00:00:00",
              "PreStartupReviewDate": "1988-01-01 00:00:00",
              "ComplianceAuditDate": "1999-06-08 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1988-01-01 00:00:00",
              "HotWorkPermitReviewDate": "1988-01-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4626,
                  "PreventionProgram3ID": 4033,
                  "ProcessChemicalID": 9976
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7488,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Thomaston Fire Department",
    "CoordinatingAgencyPhone": "8602834344",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 7488,
      "SummaryText": "alarm and ventilation system in place and operational in those indoor areas of the WTP where gaseous chlorine could likely be present.   \n\nThe RMP summarizes existing documentation used by HEITKAMP, Inc. for the WTP and supplements the procedures described in other City of Waterbury documents such as general administrative guidelines and safety and health manuals.  The RMP addresses HEITKAMP, Inc.'s management procedures, hazard assessment, prevention program, and emergency response program that are consistent with EPA's Chemical Accident Prevention rule.  Each major element of the Chemical Accident Prevention rule is addressed in the RMP in detail. HEITKAMP, Inc.'s Plant Manager is the primary person for the operator responsible for implementing the provisions of the Chemical Accident Prevention rule for the WTP. \n\nHEITKAMP, Inc. conducted an analysis of chlorine release potential at the WTP.  This analysis presents results of the worst-case release scenario as required by 40 CFR 68.25 and an alternative-case release scenario as required by 40 CFR 68.28, and public receptors are potentially affected by each scenario.  However, over the last five years, no release meeting the provisions of 40 CFR 68.42(a) has occurred at the WTP.\n\nThe prevention program of the RMP includes process safety information, a process hazard analysis, operating procedures, training, maintenance procedures, and provisions for employee participation, pre-startup review, incident investigations, and internal compliance audits.  HEITKAMP, Inc. does not employ outside contractors to work on the chlorination system and does not consider hot work permits applicable to the chlorination system.\n\nHEITKAMP, Inc. assembled a variety of safety information related to chlorine and the equipment used to store and transfer it within the WTP.  Chlorine is an acute toxin that can cause respiratory distress at relatively low concentrations, and can even cause death at higher concentrations.  The chlorine-hand"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7488,
      "SummaryText": "ling equipment at the WTP was designed to safely contain chlorine, but in the event of an accidental chlorine release, a chlorine detection and alarm system will alert personnel at the WTP to the need for an emergency response. \n\nHEITKAMP, Inc. conducted a process hazard analysis of the chlorine process.  The process hazard analysis team consisted of HEITKAMP, Inc. personnel knowledgeable in process operation and maintenance and knowledgeable in the process hazard analysis process.  The process hazard analysis team used a what-if / checklist technique, and recommendations were compiled and are being implemented.\n\nHEITKAMP, Inc. is developing standard operating procedures (SOPs) that provide system descriptions, specifications, and operating steps for the chlorine system.  The SOPs will address start-up, shutdown, inspections, temporary operation, emergency procedures, and troubleshooting.  SOPs to provide for mechanical integrity of the chlorine process equipment rely on manufacturers' recommended approaches. The RM Program will contain the details of this approach.\n\nHEITKAMP, Inc. is implementing a training program with guidelines for conducting regular, structured plant training for employees.  Training record forms document the required training.  The training records for all personnel associated with the covered process appear in the training file kept at the WTP.\n\nHEITKAMP, Inc. is developing an approach for providing employee participation and pre-startup review for the chlorine process at the WTP. The RM Program will contain the details of this approach. \n\nHEITKAMP, Inc. is developing an approach to investigate and document actual releases of chlorine as well as near-miss release incidents.  The RM Program will contain the details of this approach.\n\nHEITKAMP, Inc. is developing an approach to perform audits of the compliance of its on-going RM Program consistent with the requirements of the Chemical Accident Prevention rule. HEITKAMP, Inc. personnel will"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7488,
      "SummaryText": "conduct such audits at least every three years. The RM Program will contain the details of this approach. \n\nAn emergency response program procedure documents the measures HEITKAMP, Inc. will take to respond to an accidental release of chlorine.  For all but minor releases of chlorine, HEITKAMP, Inc. intends to rely on the Thomaston, Connecticut Fire Department for response to an accidental release of chlorine, including providing incident command, local area evacuation and shelter-in-place notifications, and coordination with other appropriate agencies. HEITKAMP, Inc. personnel are responsible for initial notification to the Fire Department of a release and for facility evacuation and accounting for WTP employees in the event of a major chlorine release."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 7488,
      "SummaryText": "The City of Waterbury, Connecticut owns and operates a Water Treatment Plant (WTP) which is physically located in Watertown, Connecticut.  At the time of preparation of this RMP, the WTP is operated for the City under a contract to HEITKAMP, Inc. HEITKAMP, Inc. is developing a Risk Management (RM) Program for the control of catastrophic releases of extremely hazardous substances at the WTP.  The RM Program builds on the commitment of HEITKAMP, Inc. and the City to the protection of its neighbors and its employees and the control of the potential for such a release.\n\nThe U. S. Environmental Protection Agency (EPA) issued the Chemical Accident Prevention rule (40 CFR 68) in June 1996.  This rule requires any facility with a process that involves more than a threshold quantity (TQ) of some 140 hazardous compounds to prepare a risk management plan (RMP). HEITKAMP, Inc., through its consultant Camp Dresser & McKee Inc. (CDM), prepared this RMP which applies to the use of chlorine, which has a TQ of 2500 pounds, and is used for disinfection of drinking water at the WTP, because HEITKAMP, Inc. intends to have up to 36,000 pounds of chlorine on site.  Because the chlorine system at the WTP is an existing system, HEITKAMP, Inc. is submitting the RMP to EPA by June 21, 1999.\n\nHEITKAMP, Inc. uses chlorine stored in 2000-pound pressurized steel cylinders for disinfection of drinking water. At any given time, up to six such cylinders may be tied into the process, with an additional six cylinders in storage available to go on line.  Chlorine is delivered to the WTP on an as-needed basis.  Although the chlorine exists as a liquid under pressure inside the cylinders, it is passed into the disinfection process as a gas through a series of pipes and valves at near ambient temperature and pressure, until it is injected into the liquid process stream and goes into solution to be applied at various points within the WTP.  The WTP has an active chlorine leak-detection system linked to an"
    }
  ]
}