{
  "FacilityID": 7596,
  "FacilityName": "Burbank Water Reclamation Plant",
  "FacilityStr1": "164 West Magnolia Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Burbank",
  "FacilityState": "CA",
  "FacilityZipCode": "91502",
  "Facility4DigitZipExt": "1772",
  "FacilityCountyFIPS": "06037",
  "LEPC": null,
  "FacilityLatDecDegs": "34.177194",
  "FacilityLongDecDegs": "-118.313139",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": "jmellin@uwservices.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Burbank",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Burbank Public Works Depart",
  "OperatorStr1": "P.O. Box 6459",
  "OperatorStr2": "275 E. Olive Avenue",
  "OperatorCity": "Burbank",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91750",
  "OperatorZipCodeExt": "6459",
  "RMPContact": "Bruce Feng",
  "RMPTitle": "Public Works Director",
  "FTE": 19,
  "OtherEPAFacilityID": "CA005531",
  "EPAFacilityID": "100000095167",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-08-03 00:00:00",
  "SafetyInspectionBy": "Burbank Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2000-01-24 00:00:00",
  "DeRegistrationEffectiveDate": "2000-01-03 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.17857,
  "FRS_Long": -118.31612,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9157,
      "AltID": "Dechlorination",
      "FacilityID": 7596,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 9378,
          "ProcessID": 9157,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 10120,
          "ProcessID": 9157,
          "ChemicalID": 49,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 510120,
          "ProcessID": 9157,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7596,
      "SummaryText": "Sulfur dioxide is the most commonly used substance for dechlorinating wastewater after chlorination to provide safe water discharges to the environment.  City of Burbank Public Works Department (CBPWD) Burbank Water Reclamation Plant (BWRP) also stores and uses sulfur dioxide as part of the wastewater treatment process.  Storing and handling large quantities of sulfur dioxide can create hazardous situations. BWRP takes safety obligations in storing and using sulfur dioxide as seriously as it takes in providing the environment safe disinfected water.  The BWRP has an excellent safety record in storing and handling sulfur dioxide.  BWRP's sulfur dioxide handling process is subject to the U.S. Environmental Protection Agency (EPA) Risk Management Program and Plan and also to the California Accidental Release Prevention (CalARP) Program.  These Programs require a summary in the Risk Management Plan (RMP) of policies and procedures followed to safely operate the facility, including a description of the possible consequences in case of an accident and the actions which will be taken by the facility in an event of an emergency.  The following information is specifically required in the RMP Executive Summary: \n\n7 Accidental release prevention and emergency response policies.\n7 General facility and regulated substances information.\n7 Offsite consequence analysis results.\n7 Summary of the accidental release prevention program and chemical-specific prevention steps.\n7 Five-year accident history summary.\n7 Emergency response program summary.\n7 Planned changes to improve safety.\nThe above information for the BWRP Dechlorination System is provided below.\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe BWRP accidental release prevention policy involves a unified approach that integrates proven technology, trains staff in operation and maintenance practices, and uses tested and proven management system practices.  All applicable procedures of the State of Califo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7596,
      "SummaryText": "rnia and EPA's Prevention Program are adhered to, including key elements such as training, systems management, and emergency action procedures.  \n\nThe BWRP emergency response policy involves the preparation of Emergency Response Plan for handling hazardous materials which are tailored to the facility and to emergency response services available in the community, and is in compliance with the EPA and CalARP Program Emergency Response Program Requirements.  BWRP has prepared a emergency response plan for hazardous materials, including sulfur dioxide, to facilitate coordination and emergency planning with offsite response officials and facilities in the event of an emergency.  The emergency response plan has been coordinated with local response agencies (Burbank City Fire Department).\n\nGeneral Facility and Regulated Substance Information\n\nBWRP dechlorination facility is located at the Burbank Steam Power Plant located at 164 West Magnolia Boulevard in Burbank, California.  The facility is surrounded by Burbank-Western Flood Control Channel and other power plant facilities.  The plant was built in 1966 to treat wastewater.  BWRP was originally designed to process 6 million gallons of wastewater a day (6 mgd).  BWRP capacity was increased to 9 mgd in 1976.\n\nThe BWRP has one RMP covered process.  The RMP covered process is the dechlorination process, which introduces sulfur dioxide into the cooling tower blowdown and unused excess effluent to remove residual chlorine.  The dechlorination station consists of sulfur dioxide unloading and supply facilities, a maximum of six ton-containers (two connected, two on standby, and two spares), weighing systems, two sulfonators, and their associated process piping.  Sulfur dioxide is delivered to the plant by truck in ton containers.  Sulfur dioxide gas is withdrawn from the ton container through a vacuum regulating valve, which is installed directly on the container angle valve.  Sulfur dioxide gas is pulled under vacuum from the v"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7596,
      "SummaryText": "acuum regulating valve through pigtails and the sulfur dioxide header lines to one of the two sulfonators provided at the dechlorination station.  In case of rupture of the pigtail connecting the container to the header lines, air would be drawn in rather than sulfur dioxide being released.  The vacuum regulator would shut down the sulfur dioxide supply at the container angle valve, operating as a shut-off valve.  From the sulfonator, sulfur dioxide gas is pulled by vacuum to an injection vault, where it is dissolved into mixing water to form a concentrated solution.  This solution is then piped into the distribution water through a diffuser.  The dechlorination operation is run continuously, 24 hours per day.\nA sulfur dioxide leak detector has been installed inside the sulfur dioxide building, which alarms locally as well as at the BWRP.\n\nAccess to the dechlorination station is through the gates to the Public Service Department off Lake Street.  A guard is on duty during off-hours.  In addition, the sulfur dioxide ton containers are stored inside a room which remains locked except when operators visit the facility.\n\nOffsite Consequence Analysis Results\n\nThe offsite consequence analysis includes consideration of two release scenarios, identified as \"worst-case release scenario\" and \"alternative release scenario\". The first scenario is defined by EPA, which states that \"the owner or operator shall assume that the ... maximum quantity in the largest vessel ... is released as a gas over 10-minutes,\" due to an unspecified failure. The alternative scenario is defined as \"more likely to occur than the worst-case release scenario\".\n\nRMP and CalARP regulations for Program 3 processes require the performance of a consequence analysis for one worst-case release scenario that is estimated to create the greatest distance in any direction to a toxic endpoint resulting from an accidental release of regulated toxic substances from covered processes.  Only passive or administrative"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7596,
      "SummaryText": " controls are allowed for this scenario to reduce offsite impacts.  The release of one-ton (2,000 pounds) of sulfur dioxide over 10-minutes represents the worst-case release quantity for the single covered process at the BWRP. The release rate will thus be 200 lb./min.\n\nThe released liquid sulfur dioxide is assumed to form a denser-than-air cloud consisting of sulfur dioxide vapor and liquid droplets (aerosols) and then disperse in the atmosphere.  The distance to the toxic endpoint was estimated using the EPA's RMP*Comp software (version 1.06).  The toxic endpoint selected by EPA and CalARP rules for sulfur dioxide is 3 ppm, which is the Emergency Response Planning Guideline Level 2 (ERPG-2).  The toxic endpoint was conservatively set by EPA to ensure public notification and that local emergency response planning takes into account the greatest possible impacted area surrounding the release point.  In practice, this type of a total failure of a one-ton container would be unlikely.  EPA-mandated meteorological conditions, namely atmospheric Stability class F, wind speed of 1.5 meter per second, highest daily maximum temperature (77 deg F), and average relative humidity (50%) were used for the worst-case scenario analysis.  The results of the air dispersion analysis indicated that the worst-case release has offsite impacts.  \n\nRMP and CalARP rules require that a scenario, which results in offsite toxic endpoint distance and is more likely to occur than the worst-case scenario should be selected as the alternative release scenario, unless no such scenario exists.  Unlike the worst-case scenario, the alternative release scenario may consider \"active\" mitigation such as automatic shutoff valves, excess flow valves, and containment with scrubbers.  Active mitigation is defined as requiring mechanical, electrical, or human input.\n\nSince sulfur dioxide is the only regulated toxic substance used at the facility, one alternative scenario was selected for the offsite conseque"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7596,
      "SummaryText": "nce analysis.  \n\nThe scenario selected for the BWRP dechlorination system involves the release of sulfur dioxide gas from a crack in the pigtail downstream of the vacuum regulator unit.  Sulfur dioxide gas is withdrawn from the ton container through a vacuum regulating valve, which is installed directly on the container angle valve.  Sulfur dioxide gas is pulled under vacuum from the vacuum regulating valve through plastic tubing and the sulfur dioxide header lines.  In case of a crack in the pigtail connecting the container to the header lines, air would be drawn in rather than sulfur dioxide being released.  The vacuum regulator would shut down the sulfur dioxide supply at the container angle valve, operating as a shut-off valve.  Thus, any crack in the pigtail will result in a negligible release of sulfur dioxide.  Furthermore, the dechlorination system is enclosed in a building that would further reduce the release rate of sulfur dioxide to the atmosphere.\nThus, any impact from the sulfur dioxide release would be confined to the dechlorination building and has no offsite impacts.\n\nIt may be noted that the occurrence of this scenario is highly unlikely because the pigtails are carefully inspected during each connection/disconnection operation, and during operator rounds.\nFinally, no sulfur dioxide release that could have caused safety or health hazard (no deaths, injuries, property or environmental damage, evacuations, or sheltering in place) occurred at the BWRP during the last five years. \n\nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nBWRP has prepared a Federal and State Process Safety Management Program.  BWRP accidental release prevention program is based on the following key elements:\n\n7 A management system\n7 Detailed process safety information that is readily available to staff, emergency responders, and contractors.\n7 A preventive maintenance program.\n7 Performance of process hazard analysis of equipment and"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 7596,
      "SummaryText": " procedures with operation and maintenance staff participation and review.\n7 Use of industry recommended process and safety equipment.\n7 Use of effective operating procedures.\n7 Training of the operators and maintenance staff.\n7 Implementation of an incident investigation, inspection, and auditing program using qualified staff.\n\nChemical-specific prevention steps include availability of self-contained breathing apparatus (SCBA), worn by the operators during connection/disconnection of sulfur dioxide supply, awareness of the hazardous and toxic properties of sulfur dioxide, and presence of sulfur dioxide detectors and alarms.\n\nProcess and Chemical Safety Information\n\nChemical data have been assembled to include health hazard, and chemical exposure limitations, as well as detailed physical properties of sulfur dioxide.  This information includes sulfur dioxide background information and MSDS sheets.\n\nProcess Hazard Analysis \n\nIn 1993, detailed process hazard analysis (PHA) was conducted for the dechlorination system equipment and procedures.  A number of equipment and procedural changes were recommended as part of the PHA conducted in 1993.  These recommendations have been implemented.  In 1999, the PHA for the dechlorination system was further reviewed and will be updated again within a five-year period or whenever there is major change in the process.  Only one additional recommendation was made based on this PHA review, which has already been implemented.\n\nA seismic walkthrough was recently completed based on the 1998 LEPC guidance document.  No new recommendations have been made based on this seismic walkthrough.\n\nOperating Procedures\n\nBWRP maintains written operating procedures that provide clear instructions for the sulfur dioxide process. The operating procedures include start-up, normal operation, and shutdown procedures.  Operating procedures will be developed and put in place prior to any new process equipment coming on line or changes made in the handling o"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 7596,
      "SummaryText": "f sulfur dioxide equipment, and reconfiguration of the facilities.\n\nTraining \n\nBWRP employees presently involved in operating or maintaining the sulfur dioxide process are trained in an overview of the process and applicable operating and maintenance procedures.  BWRP ensures that each employee newly assigned to the sulfur dioxide process, is trained and tested to be competent in the operating procedures listed pertaining to their duties.  Each employee (presently involved in operating the sulfur dioxide process) has been trained to receive the required knowledge, skills, and abilities to safely carry out the duties and responsibilities, including emergency response.\n\nRefresher training is provided annually to each employee operating the sulfur dioxide process to ensure that the employee understands and adheres to the current operating procedures.  In addition, the BWRP ensures that operators are trained in any updated or new procedures prior to startup of a process after a major change as indicated in their Management of Change procedures.\n\nContractors\n\nBWRP has procedures in place that ensures that the contractors are properly informed of the hazards, access limitations to the process area, and emergency response procedures, and prepared to safely complete the work.  The contractors are informed, prior to the initiation of the work at the site, of the applicable provisions of the emergency response plan.\n\nPre-Startup Safety Review and Mechanical Integrity Program\n\nBWRP ensures that a pre-startup safety review is completed for any new covered-by-the-rules process, or for significant modifications to an existing covered process that requires a change in the process safety information.  BWRP maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  BWRP mechanical integrity program includes the following:\n\n7 Written procedures for maintaining mechanical integrity through in"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 7596,
      "SummaryText": "spection and testing of process equipment, based on instructions of equipment vendors, industry codes, and prior operating experience.\n7 Implementation of the written procedures by performing inspections and tests on process equipment at specified intervals.\n7 Training of maintenance personnel in preventive maintenance program procedures; safe work practices such as lockout/tagout, line or equipment opening, and avoidance and correction of unsafe conditions; and safe use and application of special equipment and/or unique tools.\n\nHot Work Permits and Management of Change \n\nBWRP requires employees and contractors to employ safe work practices when performing \"hot work\" in, on, or around the covered process.  BWRP uses a permitting program to ensure hot work is conducted safely on or near a process involving sulfur dioxide.\n\nBWRP provides a system to maintain and implement any management of change or modifications to equipment, procedures, chemicals, and processing conditions. This system allows BWRP staff to identify and review safety hazards or provide additional safety, process, or chemical information to existing data before the proposed change would either compromise system safety or need training to be completed.\n\nInternal Compliance Audits\n\nInternal compliance audits will be conducted every 3 years to verify compliance with the programs and procedures contained in the RMP.  The BWRP will assemble an audit team that will include personnel knowledgeable in the Risk Management Program rule and in the process.  This team will evaluate whether the prevention program satisfies the requirements of the Risk Management Program rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit will be documented, recommendations resolved, and appropriate enhancements to the prevention program will be implemented.\n\nIncident Investigation\n\nBWRP investigates all incidents that could reasonably have resulted in a cata"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 7596,
      "SummaryText": "strophic release (serious injury to personnel, the public, or the environment) so that similar accidents can be prevented.  An investigation team is assembled and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.  Information found during the investigation is reviewed by affected staff and added or used to revise operating and maintenance procedures.\n\nFive-year Accident History Summary\n\nNo sulfur dioxide releases that could have caused safety or health hazard (deaths, injuries, property or environmental damage, evacuations, or sheltering in place) occurred at the BWRP during the last five years.\n\nEmergency Response Program Summary\n\nBWRP is a first responder, plant employees respond to sulfur dioxide accidental release. Depending on the severity of the accidental release, external resources such as the City of Burbank Fire Department will be called to aid in handling sulfur dioxide release. As part of the emergency response program, the BWRP has developed and implemented an Emergency Response Plan for the purpose of protecting public health and the environment.\n\nThe Emergency Response Plan has been coordinated with local response agencies (City of Burbank Fire Department).  The main elements of the emergency response plan are: (1) initial discovery equipment and procedure, (2) response to an emergency, including procedures for immediate action and internal notifications, (3) procedures for external notifications, and (4) termination and follow-up actions.\n\nPlanned Changes to Improve Safety\n\nBased on the 1999 PHA, one change to further improve sulfur dioxide safety was identified.  Based on the PHA it was recommended to update the P&ID for the sulfur dioxide system, which has been implemented.\nBWRP is proposing to discontinue using sulfur dioxide, instead sodium metabisulfite will be used.  This change is expected to be ma"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 7596,
      "SummaryText": "de in about six months."
    }
  ]
}