{
  "FacilityID": 7695,
  "FacilityName": "City of Wheeling Water Pollution Control Facility",
  "FacilityStr1": "2516 Main St.",
  "FacilityStr2": null,
  "FacilityCity": "Wheeling",
  "FacilityState": "WV",
  "FacilityZipCode": "26003",
  "Facility4DigitZipExt": "0613",
  "FacilityCountyFIPS": "54069",
  "LEPC": "Office of Emergency Services",
  "FacilityLatDecDegs": "40.056611",
  "FacilityLongDecDegs": "-80.7265",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "fit4ak@aol.com",
  "FacilityDUNS": 125641837,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Wheeling",
  "OperatorStr1": "1500 Chapline St.",
  "OperatorStr2": null,
  "OperatorCity": "Wheeling",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "26003",
  "OperatorZipCodeExt": null,
  "FTE": 44,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000096692",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-24 00:00:00",
  "SafetyInspectionBy": "Olin Chemical",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.055556,
  "FRS_Long": -80.726944,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9263,
      "AltID": null,
      "FacilityID": 7695,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 10234,
          "ProcessID": 9263,
          "ChemicalID": 62,
          "Quantity": 220000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 9484,
          "ProcessID": 9263,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 4686,
              "Process_NAICS_ID": 9484,
              "SafetyReviewDate": "1999-06-01 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "WV Sewage Treatment and Collection System Design Standards",
              "FR_Comments": null,
              "HazardReviewDate": "1999-05-10 00:00:00",
              "ChangeCompletionDate": "1999-06-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Replacement of pressure gages, installation of wheel chocks, installation of new windsock",
              "OpProceduresReviewDate": "1999-06-04 00:00:00",
              "TrainingReviewDate": "1999-03-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-24 00:00:00",
              "EquipmentInspectionDate": "1999-04-12 00:00:00",
              "EquipmentTested": "Chlorine Leak Detector Unit",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4844,
                  "PreventionProgram2ID": 4686,
                  "ProcessChemicalID": 10234
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7695,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Office of Emergency Services",
    "CoordinatingAgencyPhone": "3042343756",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 7695,
      "SummaryText": "ces to Chemtrec during release events.\nThe WPCF has been actively examining disinfection alternatives for the treatment plant.  An evaluation of the examined alternatives will indicate what changes are to be implemented.  If current disinfection practices are to be continued the WPCF will, most likely, eliminate storage of chlorine in rail cars and convert to storage in one ton cylinders.  This will greatly reduce the maximum intended inventory of the regulated substance.  Any changes in disinfection technique or amount stored will result in an update of this RMP."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 7695,
      "SummaryText": "Wheeling Water Pollution Control Facility\nRisk Management Plan\n\nExecutive Summary\n\n\tRegulations contained in 40 CFR 68 require facilities which store hazardous chemicals in excess of a certain threshold amounts to develop and submit to the USEPA a Risk Management Plan (RMP).  The regulated chemicals and the threshold amounts are listed in the regulations and a variety of guidance documents.  The Water Pollution Control Facility (WPCF) of the City of Wheeling qualified for inclusion in the RMP due to the presence of chlorine stored on-site.\n\tThe threshold amount for chlorine is 2,500 lbs.  Those facilities with 2,500 lbs. or more are subject to RMP regulations. The maximum amount of chlorine present at the facility is 110 tons (there are two 55 - ton rail cars on-site).  The presence of methane gas at the treatment plant was investigated for possible inclusion in this Risk Management Plan.  RMP regulations stipulate a threshold of 10,000 lbs. of methane.  Calculations indicate the maximum amount of methane capable of being stored at the treatment plant is 1,500 lbs. \n\tRMP regulations require the owner to determine which program level that the facility falls under.  There are three levels.  Program 1 is for facilities where a worst case release would not have an effect on any off-site public or environmental receptors.  The WPCF did not qualify for this program level.  Program levels 2 and 3 are for facilities where a worst case release would have an effect on any off-site public or environmental receptors.  Program 3 facilities are those that have either a specific SIC Code (a list of the codes that indicate a Program 3 industry are included in 40 CFR 68) or are subject to OSHA Process Safety Management Regulations.  The WPCF was not included by SIC codes and is not subject to OSHA regulations and therefore qualified as a Program 2 facility.\n\tA worst case release scenario was conducted as required by the RMP.  The scenario dictates that the largest single vessel or c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7695,
      "SummaryText": "ontainer be released to the atmosphere over a 10 minute period.  Air dispersion modeling was conducted using Areal Locations of Hazardous Atmospheres (ALOHA) to determine the distance to the toxic endpoint.  The model indicated that the distance to the toxic endpoint was 3.9 miles.  The effected population was estimated to be 45,000 people.  Public receptors were identified as schools, colleges, residences, hospitals, a prison/correctional facility, recreation areas, major commercial areas, office buildings, industrial areas, stadium, the Wheeling Downs Dog Track, churches, a convent, a monastery and shopping areas.  There were no environmental receptors identified by the model.  \n\tThe regulations also require that the facility model an air release of a more likely release scenario.  After inspection of the treatment plant, a scenario which consisted of a shearing of the pipe which transports the chlorine from the rail car to the chlorine building was selected as more likely.  Specifically, a transfer line failure - (1\" hole, 35' from source, pipe shear at chlorine building wall) from RMP Guidance for Waste Water Treatment Plants, WEF 10/27/98 pg. 4-25 was used. Air dispersion modeling was conducted using Areal Locations of Hazardous Atmospheres (ALOHA) to determine the distance to the toxic endpoint for this scenario. The model indicated that the distance to the toxic endpoint was 0.73 miles.  The effected population was estimated to be 3,100 people.  Public receptors were identified as schools, residences, hospitals, a prison/correctional facility, recreation areas, major commercial areas, office buildings, industrial areas, churches, shopping areas, Wheeling Downs Dog Track and a stadium. There were no environmental receptors identified by the model.\nThe WPCF has an active release prevention program in place.  Elements of the prevention program include automatic leak sensors with local and remote alarms as well as automatic alerting of 911.  WPCF employees are tr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7695,
      "SummaryText": "ained annually in the properties and safe handling of chlorine.  Employees are also trained in the use of safety equipment including SCBAs and leak repair kits.  \nRMP required prevention program elements also include a management system to be developed.  Safety information such as, Material Safety Data Sheets for chlorine, maximum intended inventory of regulated substances, safe upper and lower temperatures, pressures, flows and compositions of equipment used to store and handle the regulated substance, equipment specifications and codes and standards used to design, build and operate the process was compiled.  The above will be updated if a major change occurs that makes the information inaccurate.\nThe facility will conduct a hazards review of the regulated process at least every five years or whenever a major change to the system occurs.  Use of a checklist and 'what if' questionnaire facilitate the completion of the hazard review.\nOperating and maintenance manuals are available for personnel to use for reference purposes.  These manuals detail the proper and safe procedures for handling the regulated chemical as well as maintenance procedures and frequencies.  The operators log amounts of chemical used and operating adjustments made to the process.  Maintenance personnel log maintenance procedures performed on the process equipment.\nAll current employees have received training in the properties of the regulated chemical and the safe and proper operation of equipment used to store and handle the substance.  New employees are trained as above before they are permitted to operate or maintain the chlorine system.  Annual training updates are conducted.  All training activities are recorded on training logs.\nAt least every three years, the facility conducts a compliance audit to ensure that the facility is adhering to all the elements of the RMP.  A compliance audit checklist is used to conduct the compliance audit.\nWhenever an incident which resulted in, or could rea"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7695,
      "SummaryText": "sonably have resulted in a catastrophic release occurs the owner conducts an incident investigation. The owner promptly addresses and resolves the investigation findings and recommendations.  Resolutions and corrective actions are documented.  The findings of the investigation are reviewed with all affected personnel whose job tasks are affected by the findings.  Investigation summaries will be retained for five years. \n\tThe facility has had no accidents which have resulted in on-site deaths, injuries or significant property damage or known offsite deaths, injuries, property damage, environmental damage, evacuations or sheltering in place in the last five years.\n\tThe WPCF is included in the community's Emergency Response Plan.  The Water Pollution Control Facility does respond to incidental releases of chlorine that can be controlled at the time of release by employees in the immediate release area.  This does not constitute a response under OSHA's HAZWOPER Standard (29 CFR 1910.120) which was adopted by EPA for use in the Risk Management Plan Regulations.  \nFor releases where concentrations of the regulated chemical in the work area exceed relevant work place standards, such as OSHA Permissible Exposure Limit (1 ppm, Short Term Exposure Limit) or where the leak is clearly progressing so that a hazard is imminent, the release can no longer be considered incidental and emergency responders will be alerted. \nThe community's Emergency Response Plan has evacuation, shelter in place and vehicular traffic detour contingencies in place if a release of toxic material occurs.  The  Emergency Response Plan also has procedures in place to notify the city Fire Department as well as Chemtrec (1-800-424-9300) in the event of a chlorine release.  The program is activated by 911 when they receive notice of a chlorine leak.  Chemtrec is designated as first responders for chlorine releases.  The Fire Department and Water Pollution Control Facility employees will provide support servi"
    }
  ]
}