{
  "FacilityID": 7859,
  "FacilityName": "SUPERVALU, INC.",
  "FacilityStr1": "1120 HARVEY LANE",
  "FacilityStr2": null,
  "FacilityCity": "SUFFIELD",
  "FacilityState": "CT",
  "FacilityZipCode": "06078",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "09003",
  "LEPC": "Suffield LEPC",
  "FacilityLatDecDegs": "41.85",
  "FacilityLongDecDegs": "-72.991389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A3",
  "LatLongDescription": "SW",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "SUPERVALU, INC.",
  "Company2Name": null,
  "CompanyDUNS": 410617000,
  "Company2DUNS": 0,
  "OperatorName": "SUPERVALU, INC.",
  "OperatorStr1": "11840 VALLEY VIEW ROAD",
  "OperatorStr2": null,
  "OperatorCity": "EDEN PRAIRIE",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55344",
  "OperatorZipCodeExt": null,
  "FTE": 400,
  "OtherEPAFacilityID": "CTD 065531410",
  "EPAFacilityID": "100000102694",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.94571,
  "FRS_Long": -72.62425,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9449,
      "AltID": "ANHYDROUS AMMONIA",
      "FacilityID": 7859,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 10430,
          "ProcessID": 9449,
          "ChemicalID": 56,
          "Quantity": 13000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 9675,
          "ProcessID": 9449,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 4209,
              "Process_NAICS_ID": 9675,
              "SafetyReviewDate": "1999-03-06 00:00:00",
              "PHA_Date": "1999-03-06 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-01-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 1,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-01-01 00:00:00",
              "TrainingReviewDate": "1999-01-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "GARDEN STATE COMM. COLLEGE. OPERATOR 1",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": "GRADES ISSUED",
              "MaintenanceReviewDate": "1999-06-03 00:00:00",
              "EquipmentInspectionDate": "1999-06-16 00:00:00",
              "EquipmentTested": "FRICK COMPRESSORS",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-06 00:00:00",
              "PreStartupReviewDate": "1999-06-06 00:00:00",
              "ComplianceAuditDate": "1999-06-09 00:00:00",
              "AuditCompletionDate": "1999-06-09 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-09 00:00:00",
              "HotWorkPermitReviewDate": "1998-10-15 00:00:00",
              "ContractorSafetyReviewDate": "1999-01-02 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-02 00:00:00",
              "CBI_Flag": 0,
              "Description": "REFRIGERATED WAREHOUSE STORAGE FACILITY",
              "_chemicals": [
                {
                  "PrimaryKey": 4829,
                  "PreventionProgram3ID": 4209,
                  "ProcessChemicalID": 10430
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7859,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-03 00:00:00",
    "ERTrainingDate": "1998-11-15 00:00:00",
    "CoordinatingAgencyName": "SUFFIELD FIRE DEPARTMENT",
    "CoordinatingAgencyPhone": "8606683888",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7859,
      "SummaryText": "\nEXECUTIVE SUMMARY FOR SUPERVALU, INC.  SUFFIELD, CT\n\n  SUPERVALU has begun its facility risk management program by defining the process.  The process at the perishable facility is one of refrigeration.  To define would be to say that the anhydrous ammonia is used as a refrigerant to absorb heat from an insulated vault area and maintain temperatures of -10 f, 28 f, and 34 f.  The process of absorbing takes place through evaporators that are suspended from the ceiling of the vaults.     The anhydrous ammonia is pumped into these evaporator air handlers with the use of sealed pumps at the rate of 4 to 1 ratio.  This means that 4 times the amount of refrigeration is pumped in to the evaporator that can be boiled off during the refrigeration cycle.  The refrigeration is then recycled to the pump packages.  The screw compressors maintain the pressures required to maintain the desired temperature, by sucking a vapor off the top of the pump packages.  This vapor is then compressed into a high-pressure gas and piped to an evaporative condenser on the roof of the facility.  The high-pressure gas is then condensed by removing heat from the refrigerant pipes by passing water and air over them, thus condensing the high-pressure gas into high-pressure liquid.   This liquid then drains into a high pressure liquid receiver.  The level of refrigerant in the pump packages is maintain by a float switch allowing liquid refrigerant into the low stage and high stage pump packages, each having its' own float switch.  This liquid is supplied by liquid in the high pressure receiver.  There, the process being performed is one of boiling (therefore absorbing heat) and condensing (therefore rejecting heat into the atmosphere) within a closed loop system. \n \n\nThe facility's approach to chemical safety is taken from the Supervalu Ammonia Hazard Control System (SAHCS).   Within SAHCS are the following policies:\n\nEMPLOYEE PARTICIPATION\n\n  We have on-going process safety meetings.  Employees, mana"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7859,
      "SummaryText": "gement, insurance co., fire dept,  LEPC and contractors have been in attendance in these meetings when required and is all documented.  Employees have been involved in every aspect of the PSM program.  There have not been any additions to the process since installation of the original equipment.\n\nPROCESS SAFETY INFORMATION\n\nThe contractor information that was compiled during construction is complete.  Although we, through the process hazard analysis have approached all aspects of the information to confirm these facts.  Since the process involved is one of  refrigeration , the majority of the information needed is compiled on the M.S.D.S.  Toxicity permissible exposure limits, physical data, reactivity data, corrosive data, thermal and chemical stability data, and hazardous of inadvertent mixing of different materials all are contained on the M.S.D.S. and are on file.  It is also covered by our hazardous communication program posted in the warehouse.  \n\nINFORMATION ON TECHNOLOGY OF THE PROCESS\n\nBlock flow diagrams have been made on a one-line diagram for simplicity.  They include the zone valve locations for quick reaction by untrained eyes.  The as built mechanical drawings and electrical diagrams are readily available in the maintenance office, and in the Emergency Response box located at the Guard Shack entering the facility.   They are updated to show changes that have occurred.\n\nMAXIMUM INTENDED INVENTORY\n\nThe Suffield facility has 13,000 lbs. of anhydrous ammonia.  Since our process is one of refrigeration all of our equipment is and has been purchased and sized for the pressure and temperature relationships of NH3.  Each and every aspect of the process has been examined by hazard analysis.  \n\n\n\n\n\nEVALUATION OF THE CONSEQUENCES OF DEVIATIONS\n\nSupervalu feels that since all of the equipment involved has been chosen with respect to NH3 that there are no deviations,  therefore no consequence.\n\nMATERIAL OF CONSTRUCTION\n\n                  Documentation on site.\n\nPI"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7859,
      "SummaryText": "PING AND INSTRUMENTS DIAGRAMS\n                  \n                  Documentation on site\n\nELECTRICAL CLASSIFICATION\n\n                 This area is a class II location in a division 2 area.\n\nRELIEF SYSTEM\n\n                  Relief system is designed to relieve the entire system.\n\nVENTILATION SYSTEM\n\n                  Ventilation system meets the code.  Documentation on site.\n\nDESIGN CODE AND STANDARDS EMPLOYED\n\n                   Mechanical codes have been met.\n\nSAFETY SYSTEMS\n\nAmmonia detection, temperature alarms, relief system, maintenance programs, and remote pump down and shut down buttons, remote ventilation buttons, and auto ventilation detection system.\n\nPROCESS HAZARD ANALYSIS\n\nThe \"what-if \" method of process hazard analysis has been used and is documented.  \n\nOPERATING PROCEDURES\n\nOperating procedures have been written on start-up and shut down of ammonia plant,  sprinkler operation, fire pump operation,  hot work permit, confined space  and lock out tag out.\n\nTRAINING\n\nAll employees involved in the actual operation and maintenance have been trained in all safe work practice policies.  Ammonia safety, confined space, bloodborne pathogen, electrical safety, hazard communication, fire extinguishers, 24 hour tech,  incident command and Operator 1 course at Garden City Community College, Kansas.\n\n\n\n\n\nCONTRACTORS\n\nTraining of contractors is an on-going process.  Documentation is on site.  Contractors in all aspects of safe work practice policies.  PSM is introduced to each contractor before he begins working at the facility.\n\nPRE-STARTUP SAFETY REVIEW\n\nThe risk management must attend any and all meetings that might concern modifying the process including other construction within the facility.\n\nMECHANICAL INTEGRITY\n\nTo date there has been no modification to the process.  There is however, on-going inspection of all equipment and integrity of the equipment is an on-going task of inspections.\n\nHOT-WORK PERMITS\n\nStandard procedures have been established and the is"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7859,
      "SummaryText": "suance of hot work permits.\n\nMANAGEMENT OF CHANGE\n\nM.O.C. is on file\n\nINCIDENT INVESTIGATION\n\nThe Suffield facility has an on-going incident investigation program.\n\nEMERGENCY PLANNING AND RESPONSE\n\nAn extensive plan has been created and distributed to all subject personnel and the fire dept. and LEPC.\n\nFACILITY PROFILE:\n\n                Supervalu, Inc. Suffield CT Division is a warehousing and distribution facility built in 1959 and expanded in 1968, 1976, 1978, 1984 and 1992 for the storage and distribution of perishable food products and dry grocery.  The operation consists of two shifts receiving, storing and shipping of approx. 350,000 cases per week of frozen food, meat, poultry and dairy/deli and grocery products.\n                 The main building is constructed of steel masonry and cooler panels and is alarmed and sprinkler equipped.   It is approximately 700,000-sq. ft. sitting on 66 acres about 2.2 miles north of  I-91 on the west side of the Connecticut River. The garage is connected to the facility and is used for the sole purpose of servicing our own fleet.  There are no basements in either of these facilities.\n\nThe main building is refrigerated using NH3 or Anhydrous Ammonia, direct expansion R502, R408A, RHP80, R22. The main machine room is located on the north side of the perishable section of the building. \nThere are fire hydrants around the facility.\n\nWORSE CASE SCENERIO\n\n                Total release: 13,000.  Although highly unlikely because the refrigerant is contained in three vessels: low stage pump package, high stage pump package and high-pressure receiver.  Other than an explosion of the total facility, each vessel would contain approximately 4000 lbs. with the remaining refrigerant in piping, evaporators and condensers.  If a rupture occurred and the vessel pressure dropped to 0 PSIG or atmospheric pressure, the ammonia temperature would quickly change to the temperature pressure relationship of - 26F.  Most of the refrigerant would then l"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7859,
      "SummaryText": "ay in the vessel and not cause the total charge to release all at once.  This would allow for emergency measures, mitigation and response to be taken to capture the refrigerant.\n                 If there was an explosion, caused by possibly an airplane crash or terrorist causing the total release of the refrigerant there would be an offsite impact that we have estimated to be 1.5 miles using the EPA's RMP Ammonia Refrigeration Guidelines.\n\nFormulas used: 13000 lbs/10 mins=1300 lbs. (RPM guidelines permits 60 min) Refer to RMP Guidance for Ammonia Refrigeration (40 CFR Part 68).  Chapter 4  page 4-11 Exhibit 4-4 Distances to Toxic Endpoint for Anhydrous Ammonia Liquefied Under Pressure F Stability, Wind Speed 1.5 meters per Second.\n \n   If during this explosion which caused the rupture and release of the total charge, the sprinkler system would also rupture mitigating a large concentration of the release. This would cause an environmental impact that is far less of an impact than the human aspect of a release.\n\nALTERNATIVE RELEASE:\nPipe Rupture: Because of the use of fork trucks in the facility the possibility exists of the hitting and rupturing a pipe or evaporator which could cause the release of approximately 4000 lbs. of Ammonia. There are devises on each of the vessels (low level floats) which will shut down the ammonia pumps, which would cause and immediate pressure drop. The immediate impact would be within the facility. Shortly after this facility impact an offsite impact could occur which we estimate as being 0.1 miles.\n\nFORMULAS USED:\n4000 lbs/60mins = 67 lbs./min. Refer to RMP Guidance for Ammonia Refrigeration (40 CFR Part 68).  Chapter 4  page 4-15 Exhibit 4-5 Distances to Toxic Endpoint for Anhydrous Ammonia  D Stability, Wind Speed 3.0 meters per Second.\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS.\n\n              Supervalu follows the OSHA PSM Rule and internal policy of Supervalu Ammonia Hazard Control System"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 7859,
      "SummaryText": "s (SAHCS).   The manufacturers maintenance schedules are followed, compressor log sheets filled out daily, refrigeration emergency pump down remote switches have been installed, evaporator and condenser cleaning, pipe guard inspections, pipe hanger inspections, temperature logs, PI&D labeling of all valves, central relief valve piping and sprinkler inspections.  Annual training is given to all maintenance personnel in ammonia safety, electrical safety, confined space, bloodborne pathogens, fire extinguisher, HAZCOM, fall protection,  forklift training, sprinkler training, respiratory, battery safety, tool safety, hotworks permit, lockout tagout. \n\nFIVE-YEAR ACCIDENT HISTORY.\n          None.\n\nEMERGENCY RESPONSE PROGRAM.\n                 Supervalu conducts continuous planning to minimize the danger to life, health and property from emergencies or disasters.  We cooperate with the state, local and public bodies and agencies charged with Emergency Response.  We take necessary and prudent steps to assure continuity of operations and restoration of production activities as quickly as possible following an emergency or disaster.\n                  We have developed an Emergency Response Program, which includes all the criteria for implementation and assigned responsibilities.  These elements include:\n                   Policy, Scope and Priorities\n                   Planning for Emergency Response\n                   Definitions\n                   Emergency Classification Levels\n                   Notification Procedures\n                    Initial Mobilization\n                    Emergency Response Team\n                    Communications\n                    Emergency Response Council List\n                    Emergency Response Center and Command Post\n                    Evacuation Procedures\n                    Emergency Outside Help- Local and State\n                    Hospitals\n                    Locations of Emergency Shutoffs\n                    Emergency Equipment Ava"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 7859,
      "SummaryText": "ilable\n                    First Aid & CPR first response\n                    Emergency Response Manual for Cranston Fire Department\n                    Employee Emergency Plan and Fire Prevention Plan\n                    Active member of the LEPC \n\n\nPLANNED CHANGES TO INCLUDE SAFETY\n                    Training will be an on-going focus in any aspect of our process.   PHA is constantly in progress \".        "
    }
  ]
}