{
  "FacilityID": 7883,
  "FacilityName": "El Segundo Generating Station",
  "FacilityStr1": "301 Vista Del Mar",
  "FacilityStr2": null,
  "FacilityCity": "El Segundo",
  "FacilityState": "CA",
  "FacilityZipCode": "90245",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": null,
  "FacilityLatDecDegs": "34.823139",
  "FacilityLongDecDegs": "-117.645611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A4",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 197234768,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "El Segundo Power LLC",
  "OperatorStr1": "301 Vista Del Mar",
  "OperatorStr2": null,
  "OperatorCity": "El Segundo",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90245",
  "OperatorZipCodeExt": null,
  "FTE": 60,
  "OtherEPAFacilityID": "CAR000036848",
  "EPAFacilityID": "100000102667",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "018763",
  "SafetyInspectionDate": "1999-01-06 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.91649,
  "FRS_Long": -118.42763,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9477,
      "AltID": null,
      "FacilityID": 7883,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 10459,
          "ProcessID": 9477,
          "ChemicalID": 57,
          "Quantity": 44836.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 9703,
          "ProcessID": 9477,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 4805,
              "Process_NAICS_ID": 9703,
              "SafetyReviewDate": "1999-06-21 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-01-06 00:00:00",
              "ChangeCompletionDate": "2000-03-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-26 00:00:00",
              "TrainingReviewDate": "1999-06-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-26 00:00:00",
              "EquipmentInspectionDate": "1999-05-10 00:00:00",
              "EquipmentTested": "Ammonia Vapor Sensors",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4964,
                  "PreventionProgram2ID": 4805,
                  "ProcessChemicalID": 10459
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7883,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-12 00:00:00",
    "ERTrainingDate": "1999-06-10 00:00:00",
    "CoordinatingAgencyName": "City of El Segundo Fire Department",
    "CoordinatingAgencyPhone": "3106072242",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7883,
      "SummaryText": "1.0\tEXECUTIVE SUMMARY\n\nThe following provides a brief summary of the key components of the Risk Management Program for the aqueous ammonia storage and handling system at El Segundo Generating Station.\n\n\n1.1\tIntroduction\n\nPursuant to the requirements contained in Chapter 6.95, Article 2 of the California Health & Safety Code x 25531 through 25543.3, and the Clean Air Act 112r and Title 40 of the Code of Federal Regulations Part 68, this Risk Management Plan (RMP) is submitted on behalf of the El Segundo  Generating Station.  This program is implemented in California as the California Accidental Release Prevention (CalARP) Program\n\nThe scope of this RMP is based on discussions with the Administering Agency (AA), the city of El Segundo Fire Department, to ensure that all issues are resolved and to incorporate state requirements.  With input from the AA, the ammonia storage and handling facility was identified as the only process that triggers the RMP/CalARP requirements.  This process was determined to be covered by Program 2 requirements.  The process hazard review technique was then presented to and approved by the AA and the level of detail for this RMP submission agreed upon.\n\n\n1.2\tGeneral Description of the Stationary Source and Regulated Substance\n\n\tEl Segundo Generating Station, located in El Segundo, California, is an electric generating station consisting of four units, two rated at 175 MW, and two rated at 335 MW.  These units are capable of combusting either fuel oil or natural gas.  Unit 4, rated at 335 MW, is equipped with pollution control equipment using Selective Catalytic Reduction (SCR) technology for controling nitrogen oxides (NOx) emissions.  The SCR system in use at the El Segundo Generating Station employs ammonia injection to reduce NOx emissions approximately 80% from uncontrolled levels.  Aqueous ammonia is also used in the station water treatment system where it is used for pH control.  Aqueous ammonia is classified as a toxic chemical subjec"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7883,
      "SummaryText": "t to the requirements of the California Accidental Release Prevention (CalARP) Program.  The aqueous ammonia used is a 29.5% solution of ammonia in water, ammonium hydroxide (CAS Number 7664-41-7).\n\nThe ammonia storage and handling system at El Segundo Generating Station is comprised of a single underground storage tank, pumps, and piping which terminate at the vaporizer where the aqueous ammonia is atomized.  The underground storage tank is double-walled, 20000 gal in volume, and is equipped with pressure relief valves, leak detectors, temperature, pressure, and reference level indicators.  The piping consists of 2 inch I.D. piping to the vaporizer; a 1 inch I.D. ammonia line to the station water treatment system and an additional 1 inch I.D. line to the demineralizer system formerly used for the regeneration of anion and cation exchange resins.  The line to the demineralizer system is now capped.\n\n\tAll other regulated substances onsite including hydrazine and propane are in quantities below thresholds.\n\n1.3\tOffsite Consequence Analysis Results\n\nThe Offsite Consequence Analysis prepared in support of this RMP utilized the methodologies recommended by EPA and employed the RMP*Comp, ver. 1.06 modeling system.  The following release scenarios were hypothesized:\n\nRelease Scenario I - Worst-Case \n\nThe entire contents of all piping carrying aqueous ammonia between the pump and vaporizer are released through a failed pipe.  Under worst-case meteorological conditions, 1.5 m/s wind speed and a stable (Pasquill F) atmospheric stability class, the ammonia cloud could travel 0.1 miles before dispersing sufficiently to no longer pose a health hazard to the public.\n\nRelease Scenario II - Alternative \n\nThe entire contents of the delivery truck's hose carrying aqueous ammonia between the truck shut-off valve and the tank hook-up is released by a failed delivery hose.  Active mitigation consists of the station's fill procedure which utilizes both the truck operator and the plant op"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7883,
      "SummaryText": "erator.  The plant operator verifies the truck operator is following the fill procedure and authorizes the driver to begin the fill when the delivery hose is properly connected.  In case of a hose rupture the fill delivery truck's operator closes the truck's shut-off valve and dilutes the ammonia spill with water. Response action will be consistent with the emergency procedures in the station's spill plan.  Under average meteorological conditions, 3.0 m/s wind speed and a neutral (Pasquill D) atmospheric stability class, the ammonia cloud could travel <0.1 miles before dispersing sufficiently to no longer pose a health hazard to the public.\n\n\n\n\nRelease Scenario III - Alternative \n\nA pump flange or connector fails resulting in the leak of approximately 50 gallons of aqueous ammonia outside.  Active mitigation consists of control room operator intervention to manually shutoff of the affected pump.  A pump low pressure alarm and low flow alarm will annunciate in the control room.  Upon receiving either alarm the system will be shut down. The pump will be isolated pending repair and dilution of the spill with water.  Response action will be consistent with the emergency procedures in the station's spill plan. Under average meteorological conditions, the ammonia cloud could travel <0.1 miles before dispersing sufficiently to no longer pose a health hazard to the public.\n\n\n1.4\tSummary of the Five-Year Accident History\n\nThere have been no accidental releases from the aqueous ammonia storage and  handling system at El Segundo Generating Station in the past five years that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  (Statute:  40 CFR 68.42)\n\n\n1.5\tSummary of Prevention Program 2\n\n\tEl Segundo Generating Station is covered by an accidental release prevention program which includes the following:\n\n7 Periodic hazard reviews and updates.\n7"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7883,
      "SummaryText": "Periodic audits of the system and its operation.\n7 Emergency Response Plan that is coordinated with local emergency response agencies.\n \n The aqueous ammonia storage and handling system prevention program includes the following steps:\n \n7 Comprehensive Station Orders covering all components of the aqueous ammonia storage and handling system including,\n7 operation\n7 maintenance\n7 inspection\n7 training\n \n \n 1.6\tSummary of the Emergency Response Program\n \n The El Segundo Generating Station has recently revised its emergency response plan.  The core elements of the plan include:\n \n7 specific actions to be taken in response to an accidental release of ammonia\n7 procedures to notify local and public agencies including the El Segundo Fire Department, the Office of Emergency Services and the National Response Center as necessary\n7 a list of resources for emergency health care\n7 information regarding the training of employees on responses to releases \n7 a list of other federal and state requirements the facility is subject\n\n1.7\tPlanned Changes to Improve Safety\n\n\tThe HAZOP Analysis of the aqueous ammonia storage and handling system at El Segundo Generating Station conducted as part of this Risk Management Program resulted in recommendations to improve the system's safety.  The recommendations are in the  evaluation process and will be implemented as necessary.\n\n\n1.8\tSource of Meteorological Data\n\n\tUnited States of  America Department of Commerce 1997 Local Climatological Data Annual  Summary with Comparative Data Los Angeles California International Airport"
    }
  ]
}