{
  "FacilityID": 7900,
  "FacilityName": "City of Oldsmar WWF",
  "FacilityStr1": "351 Lafayette Blvd.",
  "FacilityStr2": "-----------------------",
  "FacilityCity": "Oldsmar",
  "FacilityState": "FL",
  "FacilityZipCode": "34677",
  "Facility4DigitZipExt": "3754",
  "FacilityCountyFIPS": "12103",
  "LEPC": "District 8 LEPC",
  "FacilityLatDecDegs": "28.02925",
  "FacilityLongDecDegs": "-82.654111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "N.A.",
  "FacilityEmailAddress": "pnailos@ci.oldsmar.fl.us",
  "FacilityDUNS": 72542137,
  "ParentCompanyName": "City of Oldsmar",
  "Company2Name": "N.A.",
  "CompanyDUNS": 72542137,
  "Company2DUNS": 0,
  "OperatorName": "City of Oldsmar",
  "OperatorStr1": "351 Lafayette Blvd.",
  "OperatorStr2": "----------------------------",
  "OperatorCity": "Oldsmar",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "34677",
  "OperatorZipCodeExt": "3754",
  "RMPContact": "Patrick Nailos",
  "RMPTitle": "Wastewater Facilities Supervisor",
  "FTE": 22,
  "OtherEPAFacilityID": "N.A.",
  "EPAFacilityID": "100000103229",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-03-09 00:00:00",
  "DeRegistrationEffectiveDate": "2005-01-01 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 28.03183,
  "FRS_Long": -82.65481,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9494,
      "AltID": "CHLORINE",
      "FacilityID": 7900,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 9721,
          "ProcessID": 9494,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 10476,
          "ProcessID": 9494,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 510476,
          "ProcessID": 9494,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 9495,
      "AltID": "Sulfur dioxide",
      "FacilityID": 7900,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 9722,
          "ProcessID": 9495,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 10477,
          "ProcessID": 9495,
          "ChemicalID": 49,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 510477,
          "ProcessID": 9495,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7900,
      "SummaryText": "Environmental Protection Agency\nRISK MANAGEMENT PLAN\n\nSubmitted by\n\nThe City of Oldsmar\nPinellas County, Florida\n\nPrepared by\n\nAnthony \"Tony\" Mannello\nEnvironmental Inspector\nThe City of Oldsmar\n351 Lafayette Boulevard\nOldsmar, Florida 34677\nAnd\nO'Brien & Gere\nEngineers, Inc\n\n\n          June 21, 1999\n\nCERTIFICATION STATEMENT\n\n\n\nTo the best of the undersigned's knowledge, information, and belief formed after reasonable inquiry, the information submitted is true, accurate, and complete.\n\n\n\n\n__________________________            Patrick Nailos\nSignature                        Print Name\n\n\n\nWastewater Facilities Supervisor            6/21/99\nTitle                        Date\n\n\nEXECUTIVE SUMMARY ELEMENTS\n\n\nAccidental Release Prevention & Emergency Response Policies\n\n    Accidental Release Prevention:\n\nAll areas of release prevention for The City of Oldsmar Wastewater Facility are contained in the City's Process Safety Management Program (PSM). This is a comprehensive plan that encompasses all aspects of the City of Oldsmar's WWF methods and procedures of receiving, handling, processing and worst as well as alternative accidental release scenarios of hazardous chemicals on site. \n\n\n    Emergency response Policies:\n\nThe City of Oldsmar Wastewater Facility's response to emergencies is controlled by 4 main elements/policies: \n\nX Risk Management Plan\nX Process Safety Management\nX Chlorine Emergency Response Action Plan\nX Sulfur Dioxide Emergency Response Action Plan\n\n\n\nThe management of the City of Oldsmar's Wastewater Facility has had a safety program in effect since 1991. Since inception, the program has undergone extensive change. The evolution process has taken this program from the early planning, research and development stages to a well defined, structured and to this date, safe & successful program. This is evidenced by a track record with respect to \"employee time lost\" and \"vehicle time lost, accident\" awards received from the National Safety Council. This years' requirement for the RMP, PSM, and other accompanying plans pro"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7900,
      "SummaryText": "vide an opportunity to update, revise and in some cases create the necessary plans needed to assure the ultimate in safety for both employees and surrounding residents. \n\n\nRegulated Substances Handled\n\nX Chlorine (Cl2)up to 6000 lbs.\nX Sulfur Dioxide (SO2).up to 6000 lbs.\n\n\n\nThe City of Oldsmar's Wastewater Facility is located at 351 Lafayette Boulevard has a primary function to receive, treat, and dispose of sanitary sewage. The treated effluent is discharged to Mobbley Bay or sold as reclaimed water to residents of the City. \n\nChlorine is used in the wastewater treatment process to remove harmful bacteria in the water, as required by FDEP/EPA regulations, prior to discharge into Mobbley Bay or into the reclaimed distribution system.\n\nSulfur Dioxide is used in the wastewater treatment process for the dechlorination of Plant effluent, prior to discharge into Mobbley Bay. This effluent dechlorination process is required in order to avoid a negative impact to the flora and fauna in the surrounding surface waters.\n\nBoth of these processes occur in the same building, identified to as the \"Chlorine Building\". This building is located at the southernmost side of the Wastewater Facility.\n\n \n\n\nWorst-Case Release Scenario and the Alternative Release Scenario(s)\nThe following data provided by O'Brien & Gere Engineers, Inc. \n\n\nWorst-Case Release Scenario Calculations\nChlorine and Sulfur Dioxide Systems\nCity of Oldsmar \n4/28/99\nChlorine\nTotal quantity in cylinder = 2,000 lb.\nRelease Rate = (2,000 lb./10 min)*0.55 (enclosed space factor) = 110 lb/min\n\nFrom Table 11 (RMP Guidance Manual):\n\n100 lb/min, distance to toxic endpoint = 0.9 mi.\n150 lb/min, distance to toxic endpoint = 1.2 mi.\n\nInterpolating between them:\n\n100 lb/min    0.9 mi.\n110 lb/min    d\n150 lb/min    1.2 mi.\n\n1) 100-110/100-150 = 0.9-d/0.9-1.2 \n2) -10/-50 = 0.9-d/-0.3\n3) 3 = -45+50d\n4) 48=50d\n5) d=48/50\n\nd = 0.96 miles (for urban terrain)\n\n\nSulfur Dioxide\nTotal quantity in cylinder = 2,000 lb.\nRe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7900,
      "SummaryText": "lease Rate = 110 lb/min\n \nFrom Table 12 (RMP Guidance Manual):\n\n100 lb/min, distance to toxic endpoint = 0.9 mi.\n150 lb/min, distance to toxic endpoint = 1.1 mi.\n\nd = 0.94 miles (urban terrain)\n \n\nRMP* Comp\nResults of Consequence Analysis\n\nChemical: Chlorine\nCAS #: 7782-50-5\nCategory: Toxic Gas\nScenario: Alternative\nRelease Duration: 10 minutes\nStorage Parameters: Hole or puncture area: 0.049 square inches\nTank Pressure: 92.5 psi\nTank Temp: 770 F\n\nRelease Rate: 4.19 pounds per min\nMitigation Measures: Release in enclosed space, in direct contact with outside air\n\nTopography: Urban surroundings (many obstacles in the immediate area)\nToxic Endpoint: 0.0087 mg/L; basis: ERPG-2\nEstimated Distance to Toxic Endpoint: <0.1 miles (<0.16 kilometers); report as 0.1 mile\n\n--------Assumptions About This Scenario---------\nWind Speed: 3 meters/second (6.7 miles/hour)\nStability Class: D\nAir Temperature: 77 degrees F (25 degrees C)\n------------------------------------------------\n\n\nRMP* Comp\nResults of Consequence Analysis\n\nChemical: Sulfur dioxide (anhydrous)\nCAS #: 7446-09-5\nCategory: Toxic Gas\nScenario: Alternative\nRelease Duration: 10 minutes\nStorage Parameters: Hole or puncture area: 0.049 square inches\nTank Pressure: 92.5 psi\nTank Temp: 770 F\n\nRelease Rate: 3.90 pounds per min\nMitigation Measures: Release in enclosed space, in direct contact with outside air\n\nTopography: Urban surroundings (many obstacles in the immediate area)\nToxic Endpoint: 0.0078 mg/L; basis: ERPG-2\nEstimated Distance to Toxic Endpoint: <0.1 miles (<0.16 kilometers); report as 0.1 mile\n\n--------Assumptions About This Scenario---------\nWind Speed: 3 meters/second (6.7 miles/hour)\nStability Class: D\nAir Temperature: 77 degrees F (25 degrees C)\n------------------------------------------------\n\n Figure 1.    Chlorine Release Scenarios:\n\nFigure 2.    Sulfur Dioxide Release Scenarios:\n\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention\n    \nRefer to Elements 1-13 of The City of Oldsmar's Pr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7900,
      "SummaryText": "ocess Safety Management Guide (PSM).\n\n\n\nFive-Year Accident History\n\nThere is no data regarding the Five-Year Accident History. In the past five years there have been no accidents to report.\n\n\n\nEmergency Response Program\n\nRefer to: PSM (Chlorine ERP and Sulfur Dioxide ERP)\n\n\n\nPlanned Changes to Improve Safety\n\nGreater communication between safety officials and employees is and will continue to be the key to greater safety. Through monthly safety meetings, which focus on all aspects of safety, all employees are continually reminded of potential disaster and how to avoid it. \n\nAs new \"state of the art\" products are developed, they will be considered, and if appropriate, purchased by the respective divisions. \n\nAny new programs such as the RMP will in fact be our biggest \"Planned changes\" to our Safety Program. Whereas our Safety Program is gradually evolving into an efficient and highly functional program, minor refining is all that is currently planned for the upcoming years. The current system proves to be functioning quite well and will continue to change with the times, as well as keep up with the ever-changing industry standards.\n \nJune 3, 1999                O'Brien & Gere Engineers, Inc. (O'Brien & Gere) Letter\n\nTony Mannello\nEnvironmental Inspector\nCity of Oldsmar\n351 Lafayette Blvd.\nOldsmar, FL 34677-3754\n\n    Re:    Offsite Consequence Analysis\n\n    File:    24081.001\n\nDear Mr. Mannello,\n\nO'Brien & Gere Engineers, Inc. (O'Brien & Gere) is pleased to submit this letter report summarizing results of the specific components of the Risk Management Plan (RMP) developed for the City of Oldsmar Wastewater Facility WWF) located in Oldsmar, Pinellas County, Florida.  This letter report has been prepared in accordance with our proposal of March 29, 1999 and our on-site investigation of April 29, 1999.\n\nThe tasks performed for this study included: \n\n7 Task 1 - Developing Draft What-If scenarios for both Chlorine and Sulfur Dioxide processes\n7 Task 2 - Chlorine and Sulfur Dioxide - Wor"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7900,
      "SummaryText": "st-case release scenario modeling using RMP* Comp model\n7 Task 3 -  Chlorine and Sulfur Dioxide - Alternate-case release scenario modeling using RMP* Comp model\n7 Task 4 - Identifying the public and environmental receptors impacted by the worst-case and alternate-case releases of Chlorine and Sulfur Dioxide\n\n\nTask 1 - Developing What-If scenarios for both Chlorine and Sulfur Dioxide processes\n\nDraft What-If scenarios for the Chlorine and Sulfur Dioxide processes were developed for the facility to meet the requirements of the RMP (See Attachment 1 & 2).  It is our understanding that City of Oldsmar WWF will be conducting a Process Hazard Analysis Team meeting and will update the What-If Scenarios for both systems.  The final What-If Scenarios will be inserted into the individual RMP sections. \n Task 2 - Chlorine and Sulfur Dioxide - Worst-case release scenario modeling\n\nIn accordance with 40 CFR 68 Subpart B - Hazard Assessment, facilities which are defined as Program 3 are required to evaluate one worst-case release scenario analysis in the RMP for each regulated substance at the facility.  The RMP rule defines the worst-case release as \"the release of the largest quantity of a regulated substance from a vessel or a process line failure that results in the greatest distance to an endpoint\". The worst-case release quantity is the greatest amount held in a single vessel, taking into account any administrative controls that limit the maximum quantity.   \n\nEPA established \"endpoints\" for release modeling analysis, which would result in no adverse impact to public health.  For toxins, the endpoint is the chemical concentration in the air to which a person can be exposed to up to an hour without serious health effects.  EPA's endpoint concentration for Chlorine and Sulfur Dioxide is 3 ppm.  Air dispersion modeling using Environmental Protection Agency (EPA) approved RMP* Comp was performed to calculate the impacts of; one (1) ton (2,000 lbs) cylinder of chlorine and anoth"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 7900,
      "SummaryText": "er calculation for; one (1) ton (2,000 lbs) cylinder of Sulfur Dioxide released to the atmosphere.  The distance to the toxic endpoint for the Chlorine worst-case scenario is 0.96 miles.  The distance to the toxic endpoint for the Sulfur Dioxide worst-case scenario is 0.94 miles.\n\nIn accordance with 40 Code of Federal Regulation (CFR) 68.30, the off-site impacts resulting from a worst-case release scenario are evaluated by estimating the population within a circle with its center at the point of release and a radius equal to the distance to the endpoint.  Therefore, under the worst-case release scenario, a circular area with a calculated radius of 0.96 miles (mi.) from the Chlorine system and 0.94 mi. from the Sulfur Dioxide system around the facility could be potentially affected  (See Figure 1).\n\nThe WWF lies within City of Oldsmar in Pinellas county, Florida.  According to the latest information attainable from the U.S. Census Bureau, City of Oldsmar has a population density of 933.8 population/square mile (U.S. Census Bureau 1990).  Based on this information, it is estimated that up to 2702 people are within the circular area under the worst-case release scenario from the Chlorine system and 2590 people from the worst-case release scenario from the Sulfur Dioxide system.\n\n\nTask 3 -  Chlorine and Sulfur Dioxide - Alternate-case release scenario modeling\n\nIn accordance with 40 CFR 68.28, the facility is required to identify and analyze at least one alternative-case release scenario (ACS) for inclusion in the RMP for each regulated substance.  The alternative release scenario can be venting of one of the covered process systems due to a component failure (i.e., container, piping) that results in concentrations above the toxic endpoint beyond the property line.  The Process Hazard Analysis (PHA) (40 CFR 68.67), which is part of the prevention program, states that an alternative release scenario must reach an endpoint off-site, unless no such alternative release scen"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 7900,
      "SummaryText": "ario exists. Criteria for selection of the ACS included: \n\n7    more likely release scenario that results in an off-site impact\n7    may account for passive and active mitigation, and administrative controls\n7    release at actual release height\n7    may account for more representative meteorological conditions of D stability and 3.14 m/s wind speed\n \nIn evaluating the ACS, the OCA team considered several options, and selected several potential ACSs based on:\n\n7    actual operating history and toxic substance release history\n7    guidance provided by EPA in OCA guidance and in the Model Plan for Ammonia Refrigeration\n7    scenarios identified in previous PHA studies (i.e., Occupational Safety and Health Administration     (OSHA)'s Process Safety Management (PSM) What-if Scenarios)\n\nThe alternate-case release scenario identified for both substances for RMP OCA requirements is a disconnection of the feed manifold at the tanks.  \n\nAir dispersion modeling RMP* Comp was performed to calculate the impacts of  Chlorine and Sulfur Dioxide from a 0.049 square inch area opening over a 10 minute period released to the atmosphere.  The distance to the toxic endpoint of 3 ppm for the Chlorine worst-case scenario is 0.10 mi.  The distance to the toxic endpoint of 3 ppm for the Sulfur Dioxide worst-case scenario is 0.10 mi..\n\nIn accordance with 40 Code of Federal Regulation (CFR) 68.30, the off-site impacts resulting from a worst-case release scenario are evaluated by estimating the population within a circle with its center at the point of release and a radius equal to the distance to the endpoint.  Therefore, under the worst-case release scenario, a circular area with a calculated radius of 0.10 mi. from the Chlorine system and 0.10 mi. from the Sulfur Dioxide system around the facility could be potentially affected  (See Figure 2).\n\nThe WWF facility lies within City of Oldsmar in Pinellas county, Florida.  According to the latest information attainable from the U.S. Census Bureau, City of Oldsmar has "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 7900,
      "SummaryText": "a population density of 933.8  population/square mile (U.S. Census Bureau 1990).  Based on this information, it is estimated that up to 29 people are within the circular area under the alternative-case release scenario from the Chlorine system and from the Sulfur Dioxide system.\n\n\nTask 4 - Identifying the public and environmental receptors\n\nThe regulation requires the identification of public receptors within the circle defined by the worst-case release scenarios.  Public receptors include \"off-site residences, institutions (e.g. schools and hospitals), industrial, commercial, and office buildings, parks, or recreational areas inhabited or occupied by the public at any time without restriction by the stationary source where members of the public could be exposed to toxic concentrations, radiant heat, or overpressure, as a result of an accidental release.\"  Off-site means areas beyond the facility property boundaries and \"areas within the property boundary to which the public has routine and unrestricted access during or outside business hours.\"  City of Oldsmar choose to list the following public receptors based on a number of different factors including the number of people at the industry and proximity to the city.\n\n\nPublic Receptors impacted from the worst-case and alternative-case release scenarios include \n(See Figures 1 & 2): \n\n\nIndustrial Parks: \n- Cypress Lake Industrial Park\n- Tower Lake Center\n\nGovernment buildings:\n- City Hall\n- Chamber of Commerce\n- Oldsmar Art Center\n\n    \nSchools:\n- Oldsmar Elementary School\n- Oldsmar Christian School\n\n Parks:\n- R.E. Oldsmar Park/Friendship Park\n- Oldsmar Recreation Center\n- Baseball Field\n- Oldsmar Christian School Park\n\n\n\nPlease see the attached figures for detailed locations of the receptors impacted by these releases.  Environmental receptors are limited to natural areas such as national parks, monuments, wilderness areas, forests, state parks, officially designated wildlife sanctuaries, preserves, refuges.  There are"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 7900,
      "SummaryText": " no environmental receptors included within the worst-case and alternate-case release scenario areas. \n\nWe are pleased to have the opportunity to submit our results to City of Oldsmar and look forward to working with City of Oldsmar upon completion of the Process Safety Management (PSM) and the RMP.  If you have any questions or need additional information, please do not hesitate to contact me at (813) 623-5225.\n\nVery truly yours,\n\nO'BRIEN & GERE ENGINEERS, INC.\n\n\n\n\nChaitali R. Dave\nStaff Engineer\n\n\ncc:    Paul R. Seavy, O'Brien & Gere Engineers, Inc.\n\n\n"
    }
  ]
}