{
  "FacilityID": 7995,
  "FacilityName": "Oak Lodge Sanitary District",
  "FacilityStr1": "13750 SE Renton Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Milwaukie",
  "FacilityState": "OR",
  "FacilityZipCode": "97222",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41005",
  "LEPC": null,
  "FacilityLatDecDegs": "45.423333",
  "FacilityLongDecDegs": "-122.651389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "P1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "N/A",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Oak Lodge Sanitary District",
  "OperatorStr1": "14611 SE River Road",
  "OperatorStr2": null,
  "OperatorCity": "Milwaukie",
  "OperatorStateFIPS": null,
  "OperatorZipCode": null,
  "OperatorZipCodeExt": null,
  "FTE": 14,
  "OtherEPAFacilityID": "OR 002614-0",
  "EPAFacilityID": "100000101016",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-20 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": "Oregon",
  "ForeignZipCode": "97267",
  "ForeignCountry": "US",
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-07-17 00:00:00",
  "DeRegistrationEffectiveDate": "2012-09-08 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 45.423633,
  "FRS_Long": -122.652298,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9615,
      "AltID": "Chlorine",
      "FacilityID": 7995,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 10602,
          "ProcessID": 9615,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 9843,
          "ProcessID": 9615,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 4296,
              "Process_NAICS_ID": 9843,
              "SafetyReviewDate": "1999-05-01 00:00:00",
              "PHA_Date": "1999-05-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-06-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-05 00:00:00",
              "TrainingReviewDate": "1999-05-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-05 00:00:00",
              "EquipmentInspectionDate": "1999-05-05 00:00:00",
              "EquipmentTested": "Delivery piping, chlorinator",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-05-05 00:00:00",
              "PreStartupReviewDate": "1999-05-05 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-05 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-05 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-05-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4921,
                  "PreventionProgram3ID": 4296,
                  "ProcessChemicalID": 10602
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7995,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-01 00:00:00",
    "ERTrainingDate": "1999-06-15 00:00:00",
    "CoordinatingAgencyName": "Clackamas Fire District",
    "CoordinatingAgencyPhone": "5037226600",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 7995,
      "SummaryText": "l be a strip extending from the treatment facility to the Willamette River and north and south along the river. The affected population would be approximately 50 people.  \n\nThe alternative release scenario involves a break in the flexible connection between the one ton container and the chlorine distribution header. The scenario modeled assumed a chlorine release of 9.7 pounds per minute over a (60) minute period. Meteorological conditions for this site were derived from the Oregon State Climatologist's office. Conditions used were Stability F, wind speed 5.7 m/s, average air temperature 56 degrees and average humidity 73%. \n\nThe model indicated a distance to toxic endpoint of 0.1 miles. EPA RMP regulations require the an estimate of residential population affected within a circle with its center at the point of release and a radius determined by the distance to the toxic endpoint. Based on 1990 census data it is estimated that approximately 150 people may be affected. In fact, a much smaller area and population will be involved. The alternative release scenario assumed a ground level release. The treatment facility site is at the base of a hillside with an increase in elevation from the chlorine storage area to the east property line of the treatment site of approximately thirty (30) feet. The elevation continues to increase off site to an elevation of approximately one hundred and fifty (150) feet. Chlorine, being two and one half times heavier than air is not expected ot move up slope. The west perimeter of the treatment facility borders a park with the elevation decreasing from approximately thirty nine (39) feet at the chlorine storage area to approximately ten (10) feet at the Willamette River. The west shore of the river rises sharply to an elevation of approximately one hundred and fifty (150) feet. Therefore, it is anticipated that the actual affected area will be a strip extending from the treatment facility to the Willamette River and north and south alon"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 7995,
      "SummaryText": "Executive Summary - Oak Lodge Sanitary District Risk Managment Plan (RMP)\n\na. The Oak Lodge Sanitary District accidental release prevention program is in compliance with the  emergency response program requirements contained in 40 CFR Part 68.  \n\nb. The Oak Lodge Sanitary District wastewater treatment facility, located at 13750 SE Renton Avenue, Milwaukie, Oregon, came on line in 1962 to address pollution problems from failing septic systems. The facility has a design flow of four million gallons per day. Chlorine is used for effluent disinfection prior to discharge to the Willamette River at milepost 20.1. The amount of chlorine on site is two (2) one-ton containers. The operation of the chlorination system has only one (1) one ton container opened at a time. The second container is connected to the chlorine header manifold but the container valve is not open. The facility is manned eight hours per day. \n\nc. The off site consequence analysis requires that a worst case release and alternative release scenario be evaluated. A worst case release is defined by EPA as \"the release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to an endpoint\". This scenario assumes that the total quantity in the largest vessel is released as a gas over a ten minute period due to an unspecified failure. The alternative scenario is defined as \"more likely to occur than the worst case release\". \n\nOff site consequence analysis requires air dispersion modeling be used to determine the distance the released chlorine will travel before its concentration decreases to the toxic endpoint, selected by EPA as 0.0087 mg/l. The toxic endpoint is defined as \"the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms, which could impair an individuals ability to take p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7995,
      "SummaryText": "rotective action\". A corresponding circle with its center at the point of the release and a radius corresponding to the toxic endpoint is then used to determine the residential population affected. \n\nThe worst case scenario at the Oak Lodge facility involves the failure of one (1) one ton container. The offsite consequence analysis for this scenario was modeled using RMPCOMP developed by EPA. The program using conditions predefined by EPA calculated the result of the release of the entire tank contents (2,000 pounds) over a ten (10) minute period at a wind speed of 1.5 meters per second and an \"F\" atmospheric stability class. \n\nThe model indicated a distance to toxic endpoint of 0.9 miles. EPA RMP regulations require an estimate of residential population affected within a circle with its center at the point of release and a radius determined by the distance to the toxic endpoint. Based on 1990 census data it is estimated that approximately 8,500 people may be affected. In fact, a much smaller area and population will be involved. EPA RMP regulations require that a worst case release be analyzed assuming a ground level release. The treatment facility site is at the base of a hillside with an increase in elevation from the chlorine storage area to the east property line of the treatment site of approximately thirty (30) feet. The elevation continues to increase off site to an elevation of approximately one hundred and fifty (150) feet. Chlorine, being two and one half times heavier than air is not expected to move up slope. The west perimeter of the treatment facility borders a park with the elevation decreasing from approximatley thirty nine (39) feet at the chlorine storage area to ten (10) feet at the Willamette River. The west shore of the river rises sharply to an elevation of approximately one hundred and fifty (150) feet and eventually two hundred (200) feet at the eastern edge of the affected area. Therefore, it is anticipated that the actual affected area wil"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7995,
      "SummaryText": "g the river. The affected population would be approximately 20 people.   \n\nd. The accidental release prevention program is based on operator training, effective operating procedures, preventive maintenance program, daily equipment inspections and performance of a hazard review of equipment and procedures.\n\nChemical specific prevention steps include availability of self contained breathing apparatus, worn by staff during connection/disconnection of chlorine supply and opening of chlorination equipment and awareness of the hazardous and toxic properties of chlorine.\n\ne. No accidental releases of chlorine have occurred at this facility in the past five years. \n\nf. There is a facility emergency response plan that is in compliance with the program requirements contained in 40 CFR Part 68. \n\ng. Oak Lodge Sanitary District recognizes its responsibility under Section 112( r ) of the Clean Air Act and 40 CFR Part 68 to provide a well operated and maintained facility and carry out activities designed to prevent and mitigate accidental chemical releases. Oak Lodge Sanitary District is continually evaluating possible changes to improve safety. Based on these evaluations the following changes have been implemented or are planned. The chlorine inventory has been reduced, new chlorination equipment will be installed, a chlorine detection and alarm system is being specified, improved security of the chlorine storage area has been completed and a dike was installed to slow the release of chlorine gas. An additional mitigation measure being specified is the conversion of the chlorinators to a vacuum system. The vacuum regulator valves mounted on the gas supply valve from the one ton container, will replace the pressurized chlorine gas piping with vacuum piping. In the event of a supply line failure the amount of chlorine released will be greatly reduced."
    }
  ]
}