{
  "FacilityID": 8049,
  "FacilityName": "Henderson Terminal",
  "FacilityStr1": "Hwy. 136 West & Geneva Road",
  "FacilityStr2": "P.O. Box 1629",
  "FacilityCity": "Henderson",
  "FacilityState": "KY",
  "FacilityZipCode": "42419",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21101",
  "LEPC": "Henderson County LEPC",
  "FacilityLatDecDegs": "37.815",
  "FacilityLongDecDegs": "-87.648056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "WR",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 807195722,
  "ParentCompanyName": "IMC-Agrico",
  "Company2Name": "IMC Global",
  "CompanyDUNS": 807195722,
  "Company2DUNS": 807195722,
  "OperatorName": "IMC-Agrico Henderson Terminal",
  "OperatorStr1": "Hwy. 136 West & Geneva Road",
  "OperatorStr2": "P.O. Box 1629",
  "OperatorCity": "Henderson",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "42419",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000101436",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "NH3 Terminal in Henderson, KY",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.78794,
  "FRS_Long": -87.50789,
  "FRS_Description": "OTHER",
  "FRS_Method": "ZIP CODE-CENTROID",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9673,
      "AltID": "Liquid Ammonia Storage",
      "FacilityID": 8049,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 10663,
          "ProcessID": 9673,
          "ChemicalID": 56,
          "Quantity": 90000000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 9901,
          "ProcessID": 9673,
          "NAICSCode": "42291",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 4328,
              "Process_NAICS_ID": 9901,
              "SafetyReviewDate": "1998-07-21 00:00:00",
              "PHA_Date": "1998-07-21 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-11-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "none",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Compressors to refrigerate ammonia & prevent overpressurization.",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Operator continuous monitoring",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "PM programs established, procedures updated, excess flow valves installed",
              "OpProceduresReviewDate": "1999-04-15 00:00:00",
              "TrainingReviewDate": "1999-04-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-21 00:00:00",
              "EquipmentInspectionDate": "1998-07-21 00:00:00",
              "EquipmentTested": "All ammonia piping",
              "ChangeMgmtDate": "1999-05-27 00:00:00",
              "ChangeMgmtReviewDate": "1999-01-16 00:00:00",
              "PreStartupReviewDate": "1999-05-27 00:00:00",
              "ComplianceAuditDate": "1998-05-01 00:00:00",
              "AuditCompletionDate": "1999-02-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-28 00:00:00",
              "HotWorkPermitReviewDate": "1999-02-04 00:00:00",
              "ContractorSafetyReviewDate": "1999-01-16 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-15 00:00:00",
              "CBI_Flag": 0,
              "Description": "Anhydrous ammonia unloaded from barges, stored as refrigerated liquid at atmospheric pressure, and loaded in tank trucks.  This is the covered process subject to 29CFR1910.119, PSM standard.  The prevention program is essentially the PSM program with appropriate additions required by RMP.  Written maintenance procedures for this facility are primarily daily maintenance checklists.",
              "_chemicals": [
                {
                  "PrimaryKey": 4955,
                  "PreventionProgram3ID": 4328,
                  "ProcessChemicalID": 10663
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8049,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-02-04 00:00:00",
    "ERTrainingDate": "1998-10-09 00:00:00",
    "CoordinatingAgencyName": "Henderson Fire Department",
    "CoordinatingAgencyPhone": "2708311277",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8049,
      "SummaryText": "EXECUTIVE SUMMARY - IMC-Agrico, Henderson Terminal\n\n\n\n1.    Accident Release Prevention and Emergency Response Policies\n\nThe IMC-Agrico, Henderson Terminal has a long standing commitment to worker and public safety.   This commitment is demonstrated by resources invested in accident prevention, such as personnel training, emergency equipment, participation in emergency drills, and meetings with local emergency response organizations. \n\nThis commitment is also consistent with the corporation's environmental, health and safety policy which provides that:\n\n1)  All facilities will be designed, operated, and managed to protect the health and safety of the employees and the public; \n2)  All employees will be educated on the applicable environmental, health and safety standards, and procedures; \n3)  Sufficient human and financial resources will be allocated to sustain these goals; \n4)  Audits will be conducted regularly to verify compliance with this policy.\n \nThese corporate policies also emphasize the importance of complying with OSHA's Process Safety Management standard, so that all employees and the surrounding community will be adequately protected from potential fire, explosion and /or toxic release hazards associated with catastrophic releases.\n\nIt is IMC-Agrico's policy to implement reasonable controls to prevent foreseeable releases of regulated and hazardous substances.  If an accidental release does occur, IMC-Agrico trained personnel will respond to control and contain the release.  IMC-Agrico has a comprehensive program for complying with safety and environmental regulations for all regulated and other hazardous substances handled.\n\n\n2.    Stationary Source(s) and Regulated Substance(s) Handled\n\nThe IMC-Agrico, Henderson Terminal is engaged in the storage and transport of liquefied anhydrous ammonia.  Anhydrous ammonia is unloaded from river barges at the dock and transferred via an aboveground pipeline to two interconnected aboveground refrigerated storage vessels."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8049,
      "SummaryText": "  The liquid ammonia, stored in each vessel at approximately -27 degrees F, is subsequently transferred via piping through heat exchangers to an unloading station where cargo tank trucks are filled.  The anhydrous ammonia from this facility is typically used as a crop nutrient by various end users.  Anhydrous ammonia is the only regulated toxic substance present at the Henderson Terminal that exceeds the threshold planning quantity of 10,000 pounds.\n\n\n3.    Worst-Case Release Scenario(s) and Alternative Release Scenario(s)\n\nThe worst case release scenario at the Henderson Terminal is the loss of the entire contents of one of the refrigerated  anhydrous ammonia storage vessels over a period of ten minutes into a holding pond surrounding the vessels.  The capacity of the holding pond is 110% of the largest anhydrous ammonia storage vessel at the Henderson Terminal.  The holding pond has been built up with earthen sides to maintain this capacity.  Calculations based on EPA's Offsite Consequence Analysis guidance document were used to predict the distance to the toxic endpoint of 0.14 mg/L.  These calculation showed that the distance to the toxic endpoint has off-site impacts.  However, this worst case release scenario is unlikely to occur based on the design of the storage vessel.\n\nA number of alternative release scenarios were evaluated at the Henderson Terminal.  Some of these scenarios did not result in offsite impacts.  The alternative release scenario resulting in the farthest distance to the toxic endpoint involved a leak of refrigerated ammonia from a pump discharge pipe with a hole diameter of two inches.  Again, calculations based EPA's Offsite Consequence Analysis guidance document were used to predict the distance to the 0.14 mg/L toxic endpoint.  Using the standard alternative case parameters in the RMP rule, the distance to the toxic endpoint was determined to have offsite impacts.  As no credit was taken for active mitigation measures and local weather condi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8049,
      "SummaryText": "tions, this alternative case scenario is conservative.\n\n\n4.    General Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nAnhydrous ammonia is regulated as a highly hazardous chemical under OSHA's Process Safety Management (PSM) standard.  Based on the quantity of anhydrous ammonia present at Henderson Terminal, the Henderson Terminal is subject to OSHA's PSM requirements, and therefore, the Henderson Terminal satisfies the eligibility requirements for a Program 3 Prevention Program under EPA's RMP.  The Henderson Terminal has fully implemented OSHA's PSM standard requirements and is using this program as its RMP Prevention Program. A brief summary of the facility's PSM program is as follows:\n\nThe Henderson Terminal encourages all employees to participate in all facets of process safety and accident prevention.  The Henderson Terminal has an employee participation plan that documents the many ways employees are involved in accident prevention and process safety.  \n\nThe Henderson Terminal keeps a wide variety of technical documents that are used to safely operate of the anhydrous ammonia process.   These documents address the chemical properties and associated hazards, limits for key parameters of process operations.   Specific plant personnel have an assignment to keep this information up-to-date. \n\nThe Henderson Terminal had conducted  a comprehensive Process Hazards Analysis (PHA) to ensure that hazards associated with the anhydrous ammonia process are identified and controlled. The Henderson Terminal periodically revalidates its PHA to incorporate regulatory changes, new developments (such as lower toxicity standards and technology improvements), and offsite consequences.  The revalidation occurs at least every five years and the findings and resolutions are kept for the life of the process.  This revalidation process has been recently completed.  \n\nThe Henderson Terminal has established practices and procedures to maintain pressure vessel"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8049,
      "SummaryText": "s, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition.  The basic aspects of this program include: (1) Conducting training; (2) Developing written procedures; (3) Performing inspections and tests in accordance with recognized standards; and (4) Correcting identified deficiencies and applying quality assurance measures.\n\nThe Henderson Terminal also has procedures in place to ensure continuation of the entire PSM program, including: writing and periodically updating operating procedures; training operators and maintenance personnel; management of change programs; contractor safety programs; plus developing an audit schedule that meets OSHA PSM requirements.\n\nMoreover, the Henderson Terminal has active mitigation measures in-place to prevent and/or minimize accidental releases.  These measures include: vessel construction standards, a vessel flare, safety relief valves, and continuous leak monitoring.\n\n\n5.    Five -Year Accident History\n\nThe five-year accident history includes a review of all accidental releases of regulated substances held above threshold quantities in covered processes that resulted in on-site deaths, injuries, or significant property damage, or known off-site deaths, injuries, evacuations, sheltering-in-place, property damage, or environmental damage.   Since June 21, 1994, the Henderson Terminal has had no accidental releases which meet the above criteria.\n\n\n6.    Emergency Response Program\n\nThe Henderson Terminal has a written emergency response plan.  It involves the use of trained emergency responders employed at Henderson, a coordinated effort with local emergency response officials and the use of emergency response equipment.  A copy of the emergency response plan has been provided to the Henderson Fire Department.\n\n\n7.    Planned Changes to Improve Safety\n\nThe Henderson Terminal is working to timely resolve all action items generated as a result of internal audits and "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8049,
      "SummaryText": "process hazard analysis.  The Henderson Terminal is also planning to perform nondestructive testing on a scheduled basis on the anhydrous ammonia storage vessels to verify mechanical soundness from potential cracks and other sources of corrosion."
    }
  ]
}