{
  "FacilityID": 8120,
  "FacilityName": "SHELBY WASTEWATER  TREATMENT PLANT",
  "FacilityStr1": "1940 SOUTH LAFAYETTE STREET",
  "FacilityStr2": null,
  "FacilityCity": "SHELBY",
  "FacilityState": "NC",
  "FacilityZipCode": "28150",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37045",
  "LEPC": "Cleveland County LEPC",
  "FacilityLatDecDegs": "32.242639",
  "FacilityLongDecDegs": "81.570917",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "OT",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "brwwtp@vnet.net",
  "FacilityDUNS": 79063468,
  "ParentCompanyName": "CITY OF SHELBY",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "JOHN RHOM",
  "OperatorStr1": "P.O.BOX 207",
  "OperatorStr2": null,
  "OperatorCity": "SHELBY",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28151",
  "OperatorZipCodeExt": "0207",
  "RMPContact": "Jacob Whisnant",
  "RMPTitle": "Assistant Fire Chief",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000100927",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-12 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.24111,
  "FRS_Long": -81.57222,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9778,
      "AltID": "CHLORINE GAS",
      "FacilityID": 8120,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 10009,
          "ProcessID": 9778,
          "NAICSCode": "56221",
          "_desc": {
            "NAICS_CODE": "56221",
            "NAICS_DESCRIPTION": "Waste Treatment and Disposal"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 10799,
          "ProcessID": 9778,
          "ChemicalID": 62,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 510799,
          "ProcessID": 9778,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8120,
      "SummaryText": "EXECUTIVE SUMMARY\n\nTHE ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT YOUR FACILITY:\nThe City of Shelby Wastewater treatment plant complies with OSHA Regulation 29 CFR 1910.119 for the use of hazardous chemicals.  The facility is inspected yearly by what we consider two valuable indentities. These are the NC Department of Environmental Health,Water Quality Section and NC League of Municipalities. We  feel that working closely with these agencies has provided us with the necessary information to continuously adhere to all applicable federal and state regulations pertaining to chlorine Cl2.  Our training involves local emergency agencies and it is a written policy of PSM of this facility to notify the Shelby Fire Department of any release in order for them to respond and investigate.\n\nFACILITY DESCRIPTION AND REGULATED SUBSTANCES HANDLED:\nThe Shelby Wastewater Treatment Plant is a tertiary treatment facility which treats both municipal and industrial wastewater flows. The plant is designed to treat an average monthly flow of 6.0 MGD and a peak daily flow of 10.5 MGD.  This facility incorporates the lastest technology in the disposal of municipal and industrial waste through composting.\n\nWORST-CASE RELEASE SCENARIO:\nOur worst-case scenario is based on a liquid spill and vaporization of a one ton cylinder filled with 2,000 pounds of chlorine resulting in the total release of the entire cylinder product over a ten-minute period at a approximately 1.5m/sec wind speed. According to the EPA's OCA Guidance Reference tables, the distance to the end point is 3.01 miles of rural terrian. This release has the potential to spread in an area containing 2 schools, and several residential neighborhoods. The projected population of the effected area is approximately 3,000 people. However, because of the topographical lay of the land and the written procedures that comply with OSHA PSM standards and their enforcement along with training on such procedures and scenari"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8120,
      "SummaryText": "os, a release of this magnitude is highly unlikely. Also items in place such as leak detectors for detection of product less than 1 part per million and a vacuum system that stops the flow of gas immediately and automatically if there is a breach in the chlorine feed lines are benefits to employees and citizens safety.Employee's attitude toward safety and the understanding of the effects of such a release plays a major role in the prevention of such an event.\n\nALTERNATIVE RELEASE SCENARIO:\nThe alternative scenario is based on a pipe leak with the release of 17 pounds of chlorine over a 60 minute period with a wind speed of approximately 1.5 m/sec. According to EPA's OCA Guidance Reference tables, the distance to the end point is projected to be 1.00 miles. This has the potential to spread in an area containing  area residents effecting approximately 800 in population. Due to enforced written procedures and policies and checklists that comply with OSHA PSM standard and state and federal guidelines a scenario to this effect is extremely unlikely. Detection systems and automatic shutdown devices in vital areas are other supports for this scenario being improbable.\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM CHEMICAL-SPECIFIC PREVENTION STEPS:\nThis wastewater facility complies with OSHA 1910.119 regulation for accident prevention rules and other state and federal regulations that are applicable for the safety of its employees and citizens. For critical operations, which involve chlorine Cl2, personnel working in pairs and checklists for such operations along with back up systems create a more competent prevention program. All accidents that occur at the facility,whether they are chemical related or not, are investigated to prevent the same mistake from occuring  and to display a committment to safety. Written procedures and polices are only as effective as the training that is provided to execute such programs along with employees attitude toward safety and the r"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8120,
      "SummaryText": "espect for the product.\n\nFIVE-YEAR ACCIDENT HISTORY:\nThis facility has not had an accident involving chlorine Cl2 during the past 5 years that has caused injuries, deaths, property or environmental damage. There have been no on-site or off-site evacuations due to any accidents.\n\nTHE EMERGENCY RESPONSE PROGRAM:\nAs  a part of the enforced written and training procedures at the facility, the Shelby Police and Fire Departments are to be notified of any emergency involving the wastewater treatment plant chlorinating  process or any other emergency involving other chemicals on site. The Cleveland County Hazardous Materials team is also a part of the response protocol. Involvement with the Local Emergency Planning Committee and training with local agencies to understand roles and responsiblities are all items this facility has incorporated into its program.\n\nPLANNED CHANGES TO IMPROVE SAFETY:\nSince it started operating in 1965 the City of Shelby Wastewater Treatmnet Plant has had several renovations to the facility to upgrade the safety of its operation. Recent renovations in 1993 redesigned the entire campus bringing about a state of the art  sludge management / dewatering composting facility.This facility has a good working and training relationship with the Shelby police and Fire departments along with the Local Emergency Planning Committee. With technology constantly changing the City of Shelby will progressively continue to budget ways to  improve the safety and operations of its facility along with ways to reduce inventory of regulated substances."
    }
  ]
}