{
  "FacilityID": 8168,
  "FacilityName": "CITY OF OXNARD WASTEWATER TREATMENT PLANT",
  "FacilityStr1": "6001 S. PERKINS ROAD",
  "FacilityStr2": null,
  "FacilityCity": "OXNARD",
  "FacilityState": "CA",
  "FacilityZipCode": "93033",
  "Facility4DigitZipExt": "9047",
  "FacilityCountyFIPS": "06111",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.142778",
  "FacilityLongDecDegs": "-119.185278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "www.oxnardwastewater.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "CITY OF OXNARD, CALIFORNIA",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "CITY OF OXNARD WWTP",
  "OperatorStr1": "6001 S. PERKINS ROAD",
  "OperatorStr2": null,
  "OperatorCity": "OXNARD",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93033",
  "OperatorZipCodeExt": "9047",
  "RMPContact": "MARK NORRIS",
  "RMPTitle": "WATER ENVIRONMENT SUPERINTENDENT",
  "FTE": 70,
  "OtherEPAFacilityID": "CAC002129056",
  "EPAFacilityID": "100000104371",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-17 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2006-08-03 00:00:00",
  "DeRegistrationEffectiveDate": "2006-06-27 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.14167,
  "FRS_Long": -119.18472,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9834,
      "AltID": "CHLORINE",
      "FacilityID": 8168,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 10069,
          "ProcessID": 9834,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 10860,
          "ProcessID": 9834,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 510860,
          "ProcessID": 9834,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 9835,
      "AltID": "SULFUR DIOXIDE",
      "FacilityID": 8168,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 10070,
          "ProcessID": 9835,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 10861,
          "ProcessID": 9835,
          "ChemicalID": 49,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 510861,
          "ProcessID": 9835,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8168,
      "SummaryText": "EXECUTIVE SUMMARY\n\nPolicy:\nThe City of Oxnard Wastewater Treatment has and continues to design facilities, operate and maintain equipment and commit the personnel and resources to meet or exceed industry standards and regulatory requirements.  The City developed and implemented the Process Safety Management / Risk Management Prevention Program to provide a systematic approach to employee involvement, safety awareness and program assessment.\n\nPlant Description:\nThe City of Oxnard Wastewater Treatment Plant (WWTP) is located at 6001 S. Perkins Road, Oxnard, California.   The facility provides secondary treatment for wastewater from the Cities of Oxnard, Port Hueneme and other unincorporated areas.  The WWTP is managed, operated and maintained by approximately 70 staff.\n\nThe WWTP utilizes two acutely hazardous materials (chlorine and sulfur dioxide) within the treatment process. The facility has a planned maximum inventory capacity to store 24,000 pounds (12 one-ton containers) of chlorine and 12,000 pounds (6 one-ton containers) of sulfur dioxide.  The current inventory is 12,000 pounds of chlorine and 8,000 pounds of sulfur dioxide.\n\nProgram Compliance:\nThe Risk Management Prevention and Process Safety Management Programs have been developed and implemented.  The Risk Management Prevention is fulfillment of 40 CFR PART 68.  The Process Safety Management Program is in fulfillment of the Occupational Health and Safety Administration's (OSHA) 1910.119, as well as Cal/OSHA's California Code of Regulations, Title 8, Section 5189, Process Safety Management of Acutely Hazardous Materials. \n\nOffsite Consequence Analysis:\nIn accordance with 40 CFR PART 68, Subpart D, \"worst-case\" release scenarios and alternative scenarios are required to be completed to determine the distance to endpoint (e.g., under worst-case weather, the substance could travel X distance before dispersing enough to no longer pose a hazard to the public).  \n\nWorst-case Scenarios:\nThe worst-case scenario fo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8168,
      "SummaryText": "r both chlorine and sulfur dioxide assumed a one-ton (2000 pound) cylinder releasing the entire contents over an 18 minute period.   The distance of impact (greater than 3 ppm) extended 0.9 miles (4,800 feet) from the storage facility. \n\nAlternative Scenarios (Passive):\nAlternative scenarios, using only the passive treatment of the building, were developed to assess the impacts of release events that have the possibility of occurring at the treatment plant.  The chlorine and sulfur dioxide endpoint distances were reduced to <0.20 miles for chlorine and <0.10 miles for sulfur dioxide.\n\nAlternative Scenarios (Active and Passive):\nAlternative scenarios, assuming worst-case release parameters and using active and passive treatment, were developed to assess the impacts of release events that have the possibility of occurring at the treatment plant. Active treatments include process leak detection and monitoring, chlorine/sulfur dioxide chemical scrubber, and pressure relief valves. The combination of the passive (e.g. building) and the active treatments reduce the endpoints to less than 100 feet which is well within the facility's property. \n\nSafety Elements:\nThe City has maintained a comprehensive program since 1975 and has implemented additional health and safety programs as regulations and prevention programs were introduced.  The City received the \"Large Plant of the Year -1997\" for the State of California by the California Water Environment Association (CWEA). The award recognizes facilities with excellent operation/maintenance performance, proactive health and safety programs and the commitment and resources to implement such programs.\n\nThe facility has a full-time Safety Officer and a Safety Committee that is comprised of supervisory, administrative, operational and maintenance personnel. The Committee has \"spear-headed\" several risk reduction projects over the past several years including:\n7 Emergency Response Program\n7 Installation of Wind Socks to assist Emerge"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8168,
      "SummaryText": "ncy Responders\n7 Installation of remote pneumatic chemical shut-off valves\n7 De-commissioning of the Chlorine and Sulfur Dioxide Bulk Tanks\n7 Investigation of the potential to use liquid sodium hypochlorite and sodium bisulfite in lieu of gaseous acutely hazardous materials.  Although the improvement is not a regulatory requirement, the city realizes the reduction in the associated risk with using non-acutely hazardous materials.\n\nSafety elements can be defined as either administrative or engineering controls.  Administrative elements include: 1) procedural requirements, 2) training, 3) operator certification, and 4) City's policy and commitment of resources.  Engineering elements include physical modifications or facilities to 1) detect, 2) contain, 3) treat, 4) warn, or 5) eliminate a potential incident.\n\nAccident History:\n\nThe City has maintained a clean record of accidental releases of acutely hazardous materials and reports no incidents.  The City does maintain comprehensive Incident Investigation and Emergency Response Programs in the event of an occurrence.  Ongoing Emergency Response training provides the personnel and resources familiarity with procedures and potential incident scenarios.  Joint training exercises have been conducted with the City Fire Department and additional exercises are planned.\n\nCompliance Audit:\n\nA compliance audit was conducted in accordance with RMP/PSM requirements by an outside consultant in 1998. The audit was to evaluate the adequacy of the PSM and RMP programs and provide recommendations of improvements.  The major recommendation to improve the overall safety of the facility was to review the site security issue.  The Safety Committee is reviewing the situation and a plan of action is pending.\n\nRisk Reduction Initiatives:\n\nConsistent with the City historical pro-active \"track record\", several risk reduction programs are in progress. First, authorization has been granted by the City of Oxnard Council to change from \"gaseous chl"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8168,
      "SummaryText": "orine/sulfur dioxide\" to \"liquid bleach/sodium bisulfite\" as the \"primary\" treatment chemicals.  By converting to sodium hypochlorite and sodium bisulfite, the potential risk of a gaseous release will be significantly reduced. In addition, upgrades to the containment, monitoring and treatment facilities (active treatment) will provide additional reliability and subsequent risk reduction.  A reduced amount of \"stand-by\" chlorine and sulfur dioxide will be maintained in the event of liquid chemical shipment curtailment. Second, the existing chlorine /sulfur dioxide systems will converted to \"vacuum\" systems thus reducing the potential."
    }
  ]
}