{
  "FacilityID": 8229,
  "FacilityName": "UAP MIDSOUTH",
  "FacilityStr1": "HIGHWAY 14 BY-PASS",
  "FacilityStr2": null,
  "FacilityCity": "ROLLING FORK",
  "FacilityState": "MS",
  "FacilityZipCode": "39159",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28125",
  "LEPC": "Sharkey County LEPC",
  "FacilityLatDecDegs": "32.906333",
  "FacilityLongDecDegs": "-90.899972",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A4",
  "LatLongDescription": "LF",
  "FacilityURL": "www.conagra.com/envmnt.html",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "TRI-STATE DELTA CHEMICAL, INC.",
  "Company2Name": "CONAGRA INC.",
  "CompanyDUNS": 751379150,
  "Company2DUNS": 7258908,
  "OperatorName": "MR. JIMMY WALKER",
  "OperatorStr1": "HIGHWAY 14 BY-PASS",
  "OperatorStr2": null,
  "OperatorCity": "ROLLING FORK",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39159",
  "OperatorZipCodeExt": null,
  "FTE": 21,
  "OtherEPAFacilityID": "067141-MS-001",
  "EPAFacilityID": "100000103853",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1991-02-12 00:00:00",
  "SafetyInspectionBy": "Tennessee Vally Authority",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "UAP MIDSOUTH",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-01-16 00:00:00",
  "DeRegistrationEffectiveDate": "2008-12-31 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.901389,
  "FRS_Long": -90.895556,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9915,
      "AltID": "5191",
      "FacilityID": 8229,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 10950,
          "ProcessID": 9915,
          "ChemicalID": 56,
          "Quantity": 56078.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10150,
          "ProcessID": 9915,
          "NAICSCode": "453998",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 4958,
              "Process_NAICS_ID": 10150,
              "SafetyReviewDate": "1999-08-13 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "Yes",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "ASSHAA K61",
              "FR_Comments": "This facility complies with all Federal, State and Local rules and regulations.",
              "HazardReviewDate": "1998-08-13 00:00:00",
              "ChangeCompletionDate": "1999-08-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Struck by Vehicle",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "PRV Manifold, Locking devices, Quick-Shut off Valve",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Quick Shut off valve",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": "Daily Visual",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-08-13 00:00:00",
              "TrainingReviewDate": "1999-03-15 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "How to conduct a safety inspection",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Video",
              "MaintenanceReviewDate": "1998-08-13 00:00:00",
              "EquipmentInspectionDate": "1998-08-13 00:00:00",
              "EquipmentTested": "Check Internal Excess Flow Control Valve, Main Shutoff Manual Valve,  Pressure Relief Valves, transfer lines,hoses,all other control valves",
              "ComplianceAuditDate": "1998-08-13 00:00:00",
              "AuditCompletionDate": "1998-08-13 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1998-08-13 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 5121,
                  "PreventionProgram2ID": 4958,
                  "ProcessChemicalID": 10950
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8229,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-03-15 00:00:00",
    "ERTrainingDate": "1999-07-15 00:00:00",
    "CoordinatingAgencyName": "LEPC, FIRE DEPARTMEN, SHERIFF DEPAR",
    "CoordinatingAgencyPhone": "6018732814",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 8229,
      "SummaryText": "y; we do not anticipate a total and catastrophic realease.    We are committed  to protect the general public from the risks associated with th anhydrous ammonia industry and to assure the public and our employee's that safety is foremost at UAP MIDSOUTH, in Rolling Fork, Mississippi        \n\n2. PRIMARY ACTIVITY:\n    -UAP MIDSOUTH is an agriculture business.  We supply agriculture products to the local farmers, who use these valuable products to produce food and fiber, from the land, for the benefit of families in the United States and beyond. \n   -We mix fertilizer  to provide balanced and valuable nutrients to the crops grown in this region. Along with the fertilizer products, we also sell a variety of crop protection chemicals and seed.\n   _We minimize the storage of anhydrous ammonia in two ways: (1) We store a limited amount of anhydrous ammonia product; our maximum capacity for ammonia storage is 56,078 pounds, or approximately two truck transport loads at any one time.   (2) Our peak season for storage is March through June and September each year; the rest of the year the tank capacity is held near empty.  We feel having limited inventory is an important management tool and incorporate this techneque in our overall mitigation plan.   Our employees, the environment and the  communtiy is at less risk to exposure,  when our inventory balance is reduced. \n   -In addition to having well maintained equipment and trained employees, our business has an emergency respond plan.  Our emergency respond plan, has been distributed to  the Local Planning Committee, the local Fire Department and the Local Law Enforcement Agency.  We are prepared to respond quickly and effiencently to mitigate any uncontrolled release of anhydrous ammonia. Our plan includes a procedure for informing he public and local entities abut accidental releases;(2)  Procedures to be used on site to respond to an accidential release; and (3) A description of the employee training used to educate emplo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8229,
      "SummaryText": "yees regarding emergency situations.  Our company will continue to work side by side with each agency, so they can assist our company in alerting the community of any release inside the established end point zone perimeter.  The very sparse population and remote rural setting works nicely into our mitigation plan.  It has been determined that approximately 129 receptors have some limited exposure in the worst case scenario of .77 miles, and 70 of those receptors also reside within 0.33 mile impact zone. The total population inside the .77 mile zone is limited to an estimated 400 total people.  Total population of Rolling Fork, MS is 2,444 of which estimated 2044 live outside the .77 mile zone\n\n3. WORST CASE RELEASE SCENERIO AND THE ALTERNATIVE RELEASE SCENARIO\n         The worst case scenario release would be when each tank is filled to the allowable 56% filling density for anhydrous ammonia. The filling density is related to the weight of water; therefore the  combined capacity of the two 6000 gallon tanks is  56,078 pounds.  The maximum offsite concentrations are associated with a dense gas plume which slumps to the ground and travels downwind.   In this worst case, though higly unlikely, a plant upset could allow the entire 56,078 pounds of product to exit both tanks and enter the atmosphere and impact the ground in 10 minutes. Utilizing conservative information from look up tables as a source to determine the impact distance, we assume that all released liquid ammonia will become a gas or entrained in the gas.  Some portion of the ammonia will rain out as a liquid or spill on the ground, which reduces the vapor mass.  In this scenario, we assume the entire contents is a vapor. Using acceptable scientifically developed look up tables,  anhydrous ammonia will likely disperse and travel a porportional distance related to total quantity when released and when the quanity is known.  The look up tables, which are used and readily accepted by our industry, determined t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8229,
      "SummaryText": "hat the vapor mass would be diluted to a safe 200 parts per million in air within 0.77 miles, or 4,481.4 feet from the point of release.  This data is also associated with EPA direction of  using data where the windspeed is 3 mph and D stability atmosphere.  Again the population is the same within these areas as stated in number two (2) above i.e. 129 population receptors in 0.77 miles and 70 population receptors in 0.33 mile zone\n\n4.      THE ALTERNATIVE WORST CASE SENERIO is based not only on our five year history, without having any deaths, injuries, or  property damage at the facility,  but a lifetime history of 21 years for this facility.    We are proud of our 21 year accident or incident free record and expect this trend to continue.  Inspite of having a perfect record, there remains a risk that a pipe may break or the transfer hose may split when pumping off the delivery transport into the storage tank.  Again refering to data from look up charts, prepared by experts, it has been determined that certain sized hose or pipes used to transfer ammonia will release anhydrous ammonia product at a given rate during a plant upset.  Our installed pipe used to fill our storage tanks is one and a half-inch (1-1/2) I.D.  In this Alternative Worst Case senerio, if this transfer pipe is broken or ruptured, the release of 7,127 pounds of anhydrous ammonia could occur in 2 minutes.  We believe our emergency response plan will have the release controlled in less time than two minutes.    Given the size of release from the source it is expect to impact a portion of 0.33 mile radius, depending on wind direction, before the dilution of ammonia vapor in air is reduced to 200 parts-per-million [ppm] concentration.  That is 1920.6 feet, in any direction from the release point, when the wind is blowing at 3mph and D stability weather condtions.  Inside this .33 mile zone, 70 population receptors are identified and there are no environmental receptors in this zone.\n\nGeneral Acciden"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 8229,
      "SummaryText": "UAP MIDSOUTH Contact Mr. Jimmy Walker 601-873-2658\nHwy. 14 By-Pass\nRolling Fork, MS 39159\n\nRisk Management plan: EXECUTIVE SUMMARY\n\n1. UAP MIDSOUTH FACILITY POLICY:\n\n           This facility has been a community icon for 20 plus years under one mangement, with an impeccable safety rating.  Our business was consolidated May 29, 1999 with a major world known company United Agri Products.    While Anhydrous Ammonia is recogonized to have dangerous characteristics,  we are experts in managing this product.  Our community may be subject to some exposure under a total catastrophic release.  For over 20 years we have proven Anhydrous Ammonia can be stored and transfered safely.  The community has not been subjected to any exposure as a result of a release of ammonia vapor.  Our equipment is well maintained and equipped with all standard safety devices the ammonia industry requires.  While we do not anticipate a release, we have an  emergency action plan filed with the Local Emergency Planning Committee, the Local Fire Department and the Local Sheriff Department. We maintain an open dialoque with the  LEPC and fire department and encourage them to  to attend a training seminar at our business, so they are familiar with our process.     We at UAP MIDSOUTH have trained facility employee's who know how to safely handle and store anhydrous ammonia product.  Our company also has administrative Environmental and Regulatory  employees, knowledgeable about anhydrous ammonia storage facilities and will assist with any emergency information from remote areas of the United States if required.  Our employees along with the community LEPC, local law enforcement, local fire department and state regulatory agencies are in a position to reduce the threat of anhydrous ammonia from reaching the community or residential neighbors.   We have several features designed into the facility to mitigate the potential of a release and to minimize the impact of a uncontrolled release into the communit"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8229,
      "SummaryText": "tal Release prevention program for employees and mechanicall-specific prevention steps are installed in our process.   UAP MIDSOUTH will continue to keep all necessary appurtenances and storage tanks in compliance with the provision of Safety Requirements for the Storage and Handling of Anydrous Ammonia, found in the K - 61 Standards, published by The American National Standards Institute, Inc.  In addition, our  business will continue to follow standards of U.S.Occupational Safety and Health Administration (OSHA), 29 CFR 1910.111, Storage and handling of anhydrous ammonia.  Our employee training program will continue to train for worst case scenerio, so we are prepared to react correctly and completely and so our response and alert plan will be effective.  Our emerengency action plan on file with the local LEPC agency will enhance the ability of the LEPC to develop an appropriate emergency community action plan.  Our business will encourage annual visits from the LEPC, local Law Enforcement, concerned citizens and the Fire Department to visit our facility.  In combination with the agencies, we will continue to build a dialogue and working partnership with the public, our workers and various levels of government to make our system better.  We offer any training assistance to those needing additional information on how to respond to an emergency at our site.   \n\nOur business will continue to improve on the safe handling of anyhydrous ammonia at our facility, utilizing both administrative control and mechanical control.  Periodic evaluations are performed to assess the maintenance of well designed passive mitigation safety features designed by engineers and set by standards, and incorporated into the equipment used to store and handle this product.  We will continue to assess the value of making future investments in our facility to improve on site safety for our employees and the community.  At this time, we do not see the need for additional or specific safety re"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 8229,
      "SummaryText": "commendatons that would make the process better at this time."
    }
  ]
}