{
  "FacilityID": 8302,
  "FacilityName": "McKenna Falls Intake Facility",
  "FacilityStr1": "5000 Road - Bremerton Watershed",
  "FacilityStr2": null,
  "FacilityCity": "Bremerton",
  "FacilityState": "WA",
  "FacilityZipCode": "98312",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53035",
  "LEPC": null,
  "FacilityLatDecDegs": "47.527222",
  "FacilityLongDecDegs": "-122.786111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Bremerton Municipal Utilities",
  "Company2Name": null,
  "CompanyDUNS": 556846970,
  "Company2DUNS": 0,
  "OperatorName": "City of Bremerton",
  "OperatorStr1": "3027 Olympus Drive",
  "OperatorStr2": null,
  "OperatorCity": "Bremerton",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98310",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000104022",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-05-17 00:00:00",
  "DeRegistrationEffectiveDate": "2012-05-15 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 47.52722,
  "FRS_Long": -122.78611,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9999,
      "AltID": "Chlorine Process",
      "FacilityID": 8302,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 11037,
          "ProcessID": 9999,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10235,
          "ProcessID": 9999,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 4504,
              "Process_NAICS_ID": 10235,
              "SafetyReviewDate": "1999-06-10 00:00:00",
              "PHA_Date": "1999-06-03 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-06-04 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-10 00:00:00",
              "TrainingReviewDate": "1999-06-10 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-18 00:00:00",
              "EquipmentInspectionDate": "1999-03-18 00:00:00",
              "EquipmentTested": "Chlorine leak detectors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-18 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-18 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-18 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-18 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "McKenna Falls Intake Facility (McKenna Falls) provides drinking water for the City of Bremerton, Washington and is operated by the City's Public Works and Utilities Department.  The water is diverted from the Union River and chlorine is used to disinfect the water prior to entering it to the City of Bremerton water distribution system.\n\nChlorine ton-cylinders are delivered to the McKenna Falls facility approximately once a month.  The facility maintains four ton-cylinders on site at all times, with two of the cylinders connected to the process at any time.  Although two cyliders are connected to the process at all times, only one is used to feed chlorine to the process, with the other used as a spare.  The cylinders are stored on cradles inside of a building at all times.  The chlorine process at  McKenna Falls  pulls chlorine vapor from the cylinders under vacuum.  The chlorine is fed to a chlorinator  where it is mixed with  water by a chlorinator.  The flow rate of the chlorine vapor is controlled by the flow rate of water into the suppy system.  The facility has two chlorinators on site; however, only one is on-line at a time.  The ton-cylinders are interlocked to automatically change over to the spare cylinder when the pressure in the on-line cylinder decreases to a designated level.  The chlorine storage room and each chlorinator room is equipped with a chlorine leak detector.  These detectors are connected tot he City's SCADA system for alarms.",
              "_chemicals": [
                {
                  "PrimaryKey": 5169,
                  "PreventionProgram3ID": 4504,
                  "ProcessChemicalID": 11037
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8302,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "City Fire Dept./PSNS HazMat Respons",
    "CoordinatingAgencyPhone": "3604785381",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8302,
      "SummaryText": "A.     Description of Stationary Source and Regulated Substances Handled\n\nMcKenna Falls Intake Facility (McKenna Falls) provides drinking water for the City of Bremerton, Washington and is operated by the City's Public Works and Utilities Department.  The water is diverted from the Union River and chlorine is used to disinfect the water prior to entering the City of Bremerton water distribution system.\n\nChlorine ton-cylinders are delivered to the McKenna Falls facility approximately once a month.  The facility maintains four ton-cylinders on site at all times, with two of the cylinders connected to the process at any time.  Although two cylinders are connected to the process at all times, only one is used to feed chlorine to the process, with the other used as a spare.  The cylinders are stored on cradles inside of a building at all times.  The chlorine process at McKenna Falls pulls chlorine vapor from the cylinders under vacuum.  The chlorine is fed to a chlorinator where it is mixed with water by a chlorinator.  The flow rate of the chlorine vapor is controlled by the flow rate of water into the supply system.  The facility has two chlorinators on site; however, only one is on-line at a time.  The ton-cylinders are interlocked to automatically change over to the spare cylinder when the pressure in the on-line cylinder decreases to a designated level.  The chlorine storage room and each chlorinator room is equipped with a chlorine leak detector.  These detectors are connected to the City's supervisory control and data acquisition system (SCADA) system for alarms.\n\nAs a result of the process at McKenna Falls, chlorine is stored at the facility in quantities (approximately 8,000 pounds) that exceed the threshold quantity specified by EPA regulations.  McKenna Falls has one covered process that requires compliance with Program 3 of the EPA Risk Management Program (RMP) regulation.\n\nB.     Accidental Release Prevention & Emergency Response Policies of McKenna Falls\n\nT"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8302,
      "SummaryText": "he City of Bremerton Public Works and Utilities Department is committed to protecting facility personnel, the public and the environment from any workplace and accidental release hazards as documented in the Department of Public Works and Utilities Safety Manual.\n\nSafety, environmental protection and risk management programs are implemented and coordinated with community emergency responders for emergency planning and response efforts.\n\nC.     Release Scenario Discussion\n\nIn accordance with the requirements of the EPA RMP regulations McKenna Falls performed the following offsite consequence analyses:\n\n- One worst-case release scenario for chlorine.\n- One alternate release scenario for chlorine.\n \n The following are brief descriptions of the release scenarios that are being submitted by McKenna Falls in the Risk Management Plan (RMPlan).   McKenna Falls elected to use EPA's RMP*CompTM computer program to calculate estimated release rates and to determine the distances to the appropriate toxic endpoints.  The American Water Works Association Research Foundation (AWWARF) Compliance Guidance and Model Risk Management Program for Water Treatment was also used to assist in the selection of an alternate release scenario release rate.\n \n \n Worst-Case Release Scenario\n \n The worst-case release scenario for the McKenna Falls facility was calculated assuming that the entire contents of a one-ton chlorine cylinder are released instantaneously, resulting in a ten minute release of 2,000 pounds of gaseous chlorine.  The release was assumed to occur inside of the chorine building.  Urban topography was selected for this scenario as the chlorine building is surrounded by a wooded area which would have a similar buffering effect as buildings.  Using EPA's RMP*CompTM, the distance to the toxic endpoint for this scenario was calculated to be 0.90 miles.  There are no environmental receptors located within the 0.90 mile radius; however, there are residences within this radius.\n \n Alter"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8302,
      "SummaryText": "native Release Scenario\n \n The alternative release scenario for the McKenna Falls facility was calculated assuming a 5/16-inch hole in the vapor valve on the one-ton cylinder.  Table 5-5 in the AWWARF guidance document indicates that a 5/16 inch diameter hole in the valve body of a one-ton cylinder would result in a release rate of 10.5 lb/min of chlorine vapor.  The release was assumed to occur inside of the chorine building.  Urban topography was selected for this scenario as the chlorine building is surrounded by a wooded area.  When this release rate is input into RMP*CompTM, the distance to the toxic endpoint for this scenario is calculated to be 0.10 miles.  There are no public or environmental receptors located within the 0.10 mile radius.\n \n D.     Five-year Accident History\n \n Under the EPA RMP regulations, an accidental release is defined as a release of a regulated substance that \"resulted in deaths, injuries or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\"  Within the past five years, McKenna Falls has had no releases that meet these requirements.\n \n \n E.     Prevention Program Elements\n \n Management System - McKenna Falls has a management program that assigns overall responsibility for the development and implementation of the Risk Management Program (RMProgram) to a qualified individual or position of responsibility.  It clearly delineates accountability and responsibilities for any elements where responsibilities are delegated.\n \n \n Process Safety Information - Process safety information is maintained for use by employees operating the covered process, including the following information:\n -  MSDS for chlorine that contains toxicity information, permissible exposure limits, physical data, reactivity data, thermal and chemical stability data and synergistic effects from mixing process flows.\n- Block flow diagrams for the covered process. \n- Process c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8302,
      "SummaryText": "hemistry and maximum intended inventory data for the covered process.\n-  Safe operating limits and evaluation of consequences of deviations from these limits for the covered process.\n- Covered process equipment information consisting of materials of construction; piping and instrumentation diagrams (P&IDs); electrical classification; relief system design and design basis; ventilation system design; design codes and standards employed; and safety systems (interlocks, detection or suppression systems).\n \n Process Hazard Analysis (PHA) - A PHA was been performed for the Program 3 covered process at McKenna Falls in accordance with 40 CFR Part 68.67.  The PHA was performed using the What-If method.  The PHA identified the hazards associated with chlorine and the covered process; causes of potential accidental release scenarios; safeguards used to prevent accidental releases; and methods used to detect, monitor or control accidental releases.  Any issues identified during the PHA were documented and resolved in a timely manner.  The PHA will be revalidated and updated once every five years following completion of the initial PHA.\n \n Operating Procedures - Operating procedures have been developed for the chlorine process. \n \n Training - New employees working with a covered process will receive initial training in accordance with 40 Part CFR 68.71.  The training will include an overview of the process and emphasizes process operating procedures, safe work practices, health and safety hazards, and emergency operations including shutdown.  Those employees already involved in operating or maintaining a covered process prior to 21 June 1999 have certified in writing as having \"the required knowledge, skills, and abilities to safely carry out the duties and responsibilities as specified in the operating procedures.\"\n \n Refresher training will be provided at a minimum of once every three years to all employees involved in working with a covered process.  Documentation will be ma"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8302,
      "SummaryText": "intained for each employee to ensure that he or she received and understood the required training.\n \n Mechanical Integrity -  Employees involved in the maintenance of the covered process will receive additional training, which includes an overview of the process, its hazards, and applicable procedures to ensure that the employee can perform the job in a safe manner.  Maintenance, inspection and testing procedures and frequencies are consistent with applicable manufacturer's recommendations and follow accepted engineering practices.  \n \n Management of Change (MOC) - A written MOC procedure has been developed to manage changes in process chemicals, technology, equipment and operating procedures for the covered process in accordance with 40 CFR Part 68.75.  The MOC procedure does not apply to \"replacements in kind\" which are defined as replacements that satisfy the original design specifications (e.g., replace a pressure reducing valve with a new identical valve supplied by the original equipment manufacturer).\n \n Pre-Startup Safety Review (PSSR) - A PSSR will be performed in accordance with 40 CFR Part 68.77 for new covered processes and for modified covered processes when the modification is significant enough to require a change in the process safety information.  \n \n Compliance Safety Audits - RMProgram compliance will be confirmed through safety audits that are performed at least once every three years in accordance with 40 CFR Part 68.79.  The audits will be completed by at least one person knowledgeable in the process.  A report of the findings will be generated following the audit, and all deficiencies and/or recommendations will be promptly addressed and the resolution is documented.  The two most recent safety audit reports will be maintained at the Water Resources Division Office.\n \n Incident Investigation - Specific incident investigation, reporting, and documentation procedures have been developed in accordance with 40 CFR Part 68.81 in response to any inc"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 8302,
      "SummaryText": "ident involving a covered process that did or could have reasonably resulted in a catastrophic release of a regulated substance.  Under EPA RMP, a catastrophic release is defined as a major uncontrolled emission, fire, or explosion involving one or more regulated substances that presents imminent and substantial endangerment of public health and the environment.  \n \n The incident investigation procedure will be initiated as soon as possible and no later than 48 hours following any incident.  A team will be established to perform the incident investigation and always includes at least one person knowledgeable in the process, a contract employee if the incident involves work by a contractor, and other persons with appropriate qualifications to investigate an accident.\n \n Following the investigation, a written report will be prepared summarizing the following information at a minimum: date of the incident; date the investigation began; description of the incident and any contributing factors; and any recommendations resulting from the investigation.  When completed, all affected personnel including contract employees review the report.  Incident investigation reports will be maintained at the Water Resources Division Office for a minimum of five years.\n \n Employee Participation - A written employee participation plan has been developed that provides employees with access to PHA and all other information developed under the RMP regulation in accordance with 40 CFR Part 68.83.  The employee participation plan describes employee participation in conducting PHA and in implementing all other RMP elements.\n \n Hot Work Permit - An authorization and permit program for hot-work operations has been developed for hot-work conducted on or near a covered process in accordance with 40 CFR Part 68.85.  The permit is used to document that fire prevention and protection standards in 29 CFR Part 1910.252(a) have been implemented prior to beginning the hot-work operations.  Also, the per"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 8302,
      "SummaryText": "mit lists the date(s) authorized for the hot-work and identifies the equipment to be worked on or near.\n \n Contractors - A contractor safety program has been developed which is in accordance with 40 CFR Part 68.87.  The program covers all contractors performing maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to a covered process. The safety performance of each contractor will be evaluated prior to selection.   Each contractor employee will be informed of the known potential toxic release hazards related to work on a covered process as well as the relevant provisions of the emergency response program.  Procedures are in place to control the entrance, presence, and exit of contract employees in covered process areas.  Periodically, the performance of the contract owner or operator will be evaluated while working in or adjacent to a covered process.\n \n F.  Emergency Response Program\n \n McKenna Falls employees will respond only to incidental releases of chlorine where the release can be absorbed, neutralized, or otherwise controlled at the time of release by employees in the immediate release area, or by maintenance personnel.  For non-incidental releases McKenna Falls will rely on outside responders.  Therefore, McKenna Falls has coordinated response actions with the City of Bremerton Fire Department and the PSNS HazMat Response Team and ensured that appropriate mechanisms are in place to notify emergency responders when there is a need for response.\n \n \n G.     Planned Changes to Improve Safety\n \n In an effort to improve safety and to reduce the risk of accidental releases, changes to the RMProgram and the facility have been implemented or are currently planned.  These improvements were identified either as risk reduction measures during the PHA for the chlorine process or as a result of an improved RMProgram and the dedication to an inherently safer process.  The following changes are presently planned to improve process safety a"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 8302,
      "SummaryText": "t McKenna Falls:\n7 Consolidate process safety information for the chlorine process;\n7 Consolidate operating procedures for the chlorine process;\n7 Implement contractor safety program and perform safety screening of contractors\n7 Install electronic maintenance system to print out work orders when it is time to perform mechanical integrity procedures on a piece of equipment and document the results"
    }
  ]
}