{
  "FacilityID": 8427,
  "FacilityName": "Williams Gas Processing -- Ignacio Plant",
  "FacilityStr1": "3746 County Road 307",
  "FacilityStr2": "NA",
  "FacilityCity": "Durango",
  "FacilityState": "CO",
  "FacilityZipCode": "81301",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08067",
  "LEPC": "Region IX LEPC",
  "FacilityLatDecDegs": "37.145",
  "FacilityLongDecDegs": "107.784722",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "P1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 879847010,
  "ParentCompanyName": "The Williams Companies",
  "Company2Name": "NA",
  "CompanyDUNS": 7908163,
  "Company2DUNS": 0,
  "OperatorName": "Williams Gas Processing",
  "OperatorStr1": "3746 County Road 307",
  "OperatorStr2": "NA",
  "OperatorCity": "Durango",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "81301",
  "OperatorZipCodeExt": null,
  "FTE": 45,
  "OtherEPAFacilityID": "COd000776526",
  "EPAFacilityID": "100000102453",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "95oplpo32",
  "SafetyInspectionDate": "1998-09-10 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.13492,
  "FRS_Long": -107.77108,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10132,
      "AltID": "Product Storage",
      "FacilityID": 8427,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 11190,
          "ProcessID": 10132,
          "ChemicalID": 118,
          "Quantity": 123959889.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10369,
          "ProcessID": 10132,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 4579,
              "Process_NAICS_ID": 10369,
              "SafetyReviewDate": "1999-04-09 00:00:00",
              "PHA_Date": "1999-04-09 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 1,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 1,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Fire System Monitors",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Surveillance Camera",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Management of Change Doc.",
              "OpProceduresReviewDate": "1999-06-01 00:00:00",
              "TrainingReviewDate": "1999-06-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Monthly Employee Meeting",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-01 00:00:00",
              "EquipmentInspectionDate": "1999-02-24 00:00:00",
              "EquipmentTested": "Demethanizer Tower",
              "ChangeMgmtDate": "1999-05-01 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-01 00:00:00",
              "PreStartupReviewDate": "1999-03-01 00:00:00",
              "ComplianceAuditDate": "1998-06-15 00:00:00",
              "AuditCompletionDate": "1999-09-09 00:00:00",
              "IncidentInvestigationDate": "1999-06-14 00:00:00",
              "InvestigationChangeDate": "1999-08-01 00:00:00",
              "ParticipationPlansReviewDate": "1999-04-14 00:00:00",
              "HotWorkPermitReviewDate": "1998-10-15 00:00:00",
              "ContractorSafetyReviewDate": "1998-12-18 00:00:00",
              "ContractorSafetyEvalDate": "1998-11-17 00:00:00",
              "CBI_Flag": 0,
              "Description": "Product Storage (Tank Farm)",
              "_chemicals": [
                {
                  "PrimaryKey": 5259,
                  "PreventionProgram3ID": 4579,
                  "ProcessChemicalID": 11190
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8427,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-02-09 00:00:00",
    "ERTrainingDate": "1999-05-20 00:00:00",
    "CoordinatingAgencyName": "Animas Fire Department",
    "CoordinatingAgencyPhone": "9702471155",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8427,
      "SummaryText": "\n                    EXECUTIVE SUMMARY\n        IGNACIO PLANT RISK MANAGEMENT PLAN\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\nThe  employees  at  the Ignacio Gas Conditioning  Plant  are strongly  committed  to EMPLOYEE, PUBLIC  and  ENVIRONMENTAL SAFETY. The commitment is demonstrated by conforming to  our Process  Safety  Management Program  and  various  resources invested in accident prevention. \"MOCK\" emergency drills are conducted monthly and specific training of our personnel  is required  in  order to eliminate the occurrence of  possible hazards. These goals are achieved with every project design, installation,  operation and maintenance of  our  processes. Our  policy  is  to  implement the appropriate  controls  to prevent any possible release of our regulated substances  to surrounding public domains, existing waterways and/or animal habitats.  The  Emergency Operating Procedure  (EOP)  manual utilized   at  the  Ignacio  facility  includes   designated procedures mandated by the Williams management group.  These specific   procedures  are  for  notification  of  agencies, evacuation  of  public  receptors and  response  of  trained personnel to control and contain the release.\nTHE STATIONARY SOURCE AND REGULATED SUBSTANCES\nThe  Ignacio Gas Conditioning Plant is located  in  a  rural area  of  La Plata County, Colorado, on Section 36, Township 34  north, Range 9 west NMPM, 10 miles southeast of Durango, Colorado,  1  =  miles west of the La Plata  County  airport along  County  Road  307. We have three regulated  substances present  at  our  facility;  they include  methane,  ethane, and  butane  all of  which are  extracted  from the inlet natural gas  stream.   Listed below are the maximum inventory quantities:\n    Methane    - 194,000 lbs.\n    Ethane    - 487,000 lbs.\n    Butane    - 2,441,000 lbs..\n WORST CASE RELEASE SCENARIO AND ALTERNATIVE RELEASE SCENARIO\nThe  Worst  Case Scenario (WCS) for the Ignacio Plant  is  a vapor  cloud explosion involving a product storage  tank  of B"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8427,
      "SummaryText": "utane  to be overfilled. In the scenario, 123,959,889  lbs. of  Butane  would  be  released resulting  in  an  explosion calculated to cause a 1-psi pressure increase at an endpoint distance  of 0.86 miles. The offsite impact of this scenario involves  approximately 50 public receptors  and  two  other industrial  facilities;  no  environmental  receptors   were identified.    The  EPA's Offsite Consequence Analysis (OCA)  guidance  reference\ntables/equations were used to model this scenario.\nClearly, this hypothetical situation is highly unlikely. Given the safe work procedures employed at the Ignacio plant the normal  operating level of this product storage tank is  66% with  administrative controls calibrated to alarm at 88%.  A passive  mitigation  is currently utilized  in  our  product storage  area to eliminate any pooling of flammable  liquids and   a    fire  water  system  with  monitors,   which   are\ntested/certified annually to ensure reliability.\nThe  Alternative  Release Scenario (ARS) involves  the  same storage  tank at normal operating conditions. This  scenario depicts a gasket failure on the piping attached to the  tank\nand  releasing approximately 2,538 lbs. in a  period  of  45 minutes.  With Butane being a heavy gas the downwind  hazard would result in a vapor cloud fire 78 feet in diameter, with no public, industrial or environmental receptors identified. This  fire would trigger the ultra violet detection  in  the area of the tank farm and immediately alarm the control room and Emergency Shutdown (ESD)  the  facility.  The ARCHIE  software  utilized  by WILLIAMS in this modeling is recognized to be sufficient  by the EPA.\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\nThe  Ignacio  Gas Conditioning Plant is a facility  that  is covered by Process Safety Management (PSM) regulations (OSHA 1910).  The  essential provision of PSM  is  Process  Hazard Analysis (PHA)- a careful review of what could go wrong  and wh"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8427,
      "SummaryText": "at  safeguards must be implemented to prevent releases  of hazardous  chemicals. Through a series of PHAs, all  the covered processes have been reviewed to ensure accuracy.  The PHAs are revalidated in accordance with OSHA regulations every four years. The  PSM program of the plant requires a systematic approach in evaluating the entire process. The approach addresses the process  design,  process  technology,  process  changes operational and maintenance activities and procedures,  non-routine  activities  and procedures, emergency  preparedness plans  and procedures, training programs, and other elements that   affect  the  process  are  all  considered    in    the\nevaluation. To assist the location in the implementation  of the  PSM program the plant has assigned a person to the sole responsibility  of  PSM  coordinator,  and  this  person  is responsible directly to management.\nEMERGENCY RESPONSE PROGRAM INFORMATION\nThe  Ignacio  Plant  maintains a written emergency  response program  to safeguard plant personnel, the public safety as  well as  the environment. The program consists of procedures  for responding to a regulated substance release,  including the  possibility of a fire and/or explosion associated with an accidental release of a flammable substance. The procedures  address all  aspects  of  emergency response,  including  evacuation plans,  accounting  for personnel after an  evacuation,  and notification  of local emergency response agencies  and  the public  if  a  release  occurs.  Employees  receive  monthly training  in these procedures to perform emergency  response duties.  The  program is updated annually  due  to  possible modifications  made  to  the gas plant.  These  changes  are administered through the Management of Change (MOC)  process and our Salt Lake office.\nThe overall emergency response program for the Ignacio Plant is  coordinated with the Local Emergency Planning  Committee (LEPC).   This  coordination  includes  attending    periodic\n"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8427,
      "SummaryText": "meetings  of  the LEPC committee, composed of local  emergency response  officials  and  industry  representatives.    The\nfacility has 24-hour communications capability with La Plata County's LEPC, along with offering the local fire department and  other  emergency response organizations the opportunity to  participate in periodic \"MOCK\" emergency drills. Ignacio Plants EOP manual is also updated annually and delivered  to our   emergency  response  officials  and  various  industry representatives.\nFIVE-YEAR ACCIDENT HISTORY\nWe have not had a single release of a regulated substance at\nthe  Ignacio  facility  within the  last  five  years.  This accomplishment  is  attributed  to  the  stringent   release prevention policy mandated by the Williams management  group and executed by each employee.\nPLANNED CHANGES TO IMPROVE SAFETY\nCritical emergency equipment such as the existing fire pump will be reviewed to assure long-term operability and reliability. Replacement, due to obsolescence or spare part unavailability, will be performed where warranted."
    }
  ]
}