{
  "FacilityID": 8467,
  "FacilityName": "DOT Foods Inc., (Mt. Sterling)",
  "FacilityStr1": "Highway 99 South",
  "FacilityStr2": null,
  "FacilityCity": "Mount Sterling",
  "FacilityState": "IL",
  "FacilityZipCode": "62353",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17009",
  "LEPC": "Brown County Emergency and Dis",
  "FacilityLatDecDegs": "39.976972",
  "FacilityLongDecDegs": "-90.759028",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.dotfoods.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 607955903,
  "ParentCompanyName": "DOT Foods Inc.",
  "Company2Name": null,
  "CompanyDUNS": 25671256,
  "Company2DUNS": null,
  "OperatorName": "DOT Foods, Inc.",
  "OperatorStr1": "Highway 99 South",
  "OperatorStr2": null,
  "OperatorCity": "Mount Sterling",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62353",
  "OperatorZipCodeExt": null,
  "FTE": 100,
  "OtherEPAFacilityID": "ILD984822833",
  "EPAFacilityID": "100000090279",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.977764,
  "FRS_Long": -90.756245,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10217,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 8467,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 11297,
          "ProcessID": 10217,
          "ChemicalID": 56,
          "Quantity": 28500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10454,
          "ProcessID": 10217,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 4645,
              "Process_NAICS_ID": 10454,
              "SafetyReviewDate": "1998-03-18 00:00:00",
              "PHA_Date": "1998-03-04 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "line breaks",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "operating and maintenance procedures",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "liquid level columns, pressure indicators, compressor control screens",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "procedural modifications",
              "OpProceduresReviewDate": "1998-04-20 00:00:00",
              "TrainingReviewDate": "1999-04-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "videotape on hazards on ammonia",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-04-20 00:00:00",
              "EquipmentInspectionDate": "1998-04-20 00:00:00",
              "EquipmentTested": "Compressors C1 & C4 tested and calibrated",
              "ChangeMgmtDate": "1999-06-01 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-04-27 00:00:00",
              "HotWorkPermitReviewDate": "1999-02-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-02-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 5346,
                  "PreventionProgram3ID": 4645,
                  "ProcessChemicalID": 11297
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8467,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-04-23 00:00:00",
    "ERTrainingDate": "1998-11-28 00:00:00",
    "CoordinatingAgencyName": "Brown County Emergency and Disaster",
    "CoordinatingAgencyPhone": "2177732113",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 8467,
      "SummaryText": "echanical Code which specifically outlines requirements for the safe operation of ammonia refrigeration systems.  These safety features include a water diffusion tank, ammonia sensors in the new and existing engine room as well as sensors in selected cold storage areas, and automatic shut down systems.    In addition, the majority of the ammonia is maintained inside the engine room or on the engine room roof (condensers).  Ammonia sensors are located throughout the facility as follows:\nNew Engine Room (1), Existing Engine Room (1), Penthouses (4), Dock Area (10), Relief Header (1), Freezer Area (12), and Cooler Area(1).\nIn the event a sensor detects ammonia, the detection system will alarm as follows:\nWarning: 50 ppm; Autodialer activates alarm light at control panel and office.\nAlarm: 250 ppm; Exhaust fans start.\nShutdown: 5,000 ppm; Compressor shutdown and King Valve closed.\n\nIn addition to the Uniform Mechanical Code, the facility will operate in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines.  In particular, the IIAR Bulletin 110, Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems.\n\n\nHAZARD ASSESSMENT SUMMARY\n\nWorst Case Release Result Summary\nScenario Description: Release of the maximum quantity of ammonia that can be stored in the high pressure receiver - 16,000 pounds - in 10 minutes.  No passive mitigation measures were used.  The most pessimistic meteorological conditions were used: 1.5 m/s and F stability.  The SLAB dispersion model was used to determine the distance to the toxic endpoint of 200 ppm.  This release reaches offsite and may affect public receptors.  No environmental receptors were affected by this potential release.\n\nAlternative Release Result Summary\nScenario Description: A 0.25 inch diameter leak of high pressure liquid ammonia for one hour.  The quantity of ammonia released in one hour at this rate is 6000 pounds.  The meteorological conditions used were 3 m/s and D stability.  T"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 8467,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe new DOT Foods facility has an emergency response plan in effect.  The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n1.)To save lives.\n2.)To minimize and avoid injuries.\n3.)To protect the environment.\n4.)To minimize property damage.\n\nDOT Foods maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe DOT Foods ammonia refrigeration system has been in operation since 1991.  Changes/modifications have taken place since the completion of the facility.  The ammonia refrigeration process was designed and constructed in accordance with all applicable federal, state, and local regulations.  The facility is located at Highway 99 South, Mount Sterling, Illinois 62353. \n\nThe ammonia refrigeration system uses 28,500 pounds of ammonia for dock operations, warehouse cold storage, and freezer storage.  The majority of the system is located in the new and existing machine room including vessels and compressors.  The condensers are mounted on the machine room roof, the water tank is located in the existing machine room, and all of the evaporators are located in their respective cold storage rooms/areas.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe DOT Foods facility was designed and constructed in accordance with the Uniform M"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8467,
      "SummaryText": "he SLAB dispersion model was used to determine the distance to the toxic endpoint of 200 ppm.  This release reaches offsite and may affect public receptors.  No environmental receptors were affected by this potential release.\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nThis facility has been in operation since 1991 and changes/modifications have taken place since the completion.  There is no accident history at this facility from June 1994 through June 1999.\n\n\nEMERGENCY RESPONSE PROGRAM\n\nDOT Foods maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes due to the renovation of the facility.  \nIn the event that an ammonia leak is discovered, the person nearest to the leak will alert any personnel in the immediate area who are unaware of the danger, and the DOT Foods Freezer Maintenance Operator (if he/she is present).  He/she will then use a portable radio to inform the Incident Commander (Facility Manager) and the other managers and contractors of the situation.\nThe DOT Foods on-duty engineer (Refrigeration Engineer if present) will determine what procedures and personnel are necessary to remedy the problem.  The following agencies will be notified:\n\n1. Mt. Sterling Fire Department, Police Departments, and Illinois Highway Patrol; or call the Mt. Sterling Fire Department directly at 217-773-2341.\n\n2.  If an ammonia release exceeds 100 pounds (Federal Reportable Quantity CERCLA), call the National Response Center 1-800-424-8802 and the Illinois Emergency Agency at 800-782-7860.  The Brown County Emerge"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8467,
      "SummaryText": "ncy and Disaster can be contacted at 217-773-2886.\n\n3.  If additional help is required for an ammonia spill or leak, the facility can call Chemtrec - Manufacturing Chemists Association 1-800-424-9300.\n\n4.  If an employee ingests ammonia, the Poison Control Center can be reached 24 hours per day at 800-342-9293.\n\n5.  If an ammonia release spills into the sewer system, storm drain or any type of water way, contact the Brown County Emergency and Disaster at  217-773-2113.\n\n6.  If an ammonia release is significant enough to potentially cause odor complaints from neighboring facilities, contact the Brown County Health Dept. at 217-773-2714 or the Springfield EPA at 217-782-3637.\n\n7.   If there is an accident that involves a fatality or if three or more people are hospitalized for injuries, call the local Peoria OSHA Office at 309-671-7033.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazard Analysis provided the mitigation measures outlined below to improve safety at the DOT Foods facility located at Highway 99 South, Mount Sterling, Illinois.\n\nR01  Institute an emergency response plan with specific responsibilities defined.  Also include when an evacuation should be initiated as well as who is responsible for activating the evacuation. Consider using the fire alarm for ammonia evacuation notification; ensure that someone notifies fire department that the fire alarm is due to an ammonia release.\n\nR02  Coordinate with local fire department regarding whether they will assist DOT Foods with entering the engine room to shut down a release (since DOT Foods only one SCBA).  Also evaluate whether the SCBA is in compliance with current standards and/or the SCBA is being inspected according to manufacturer's recommendations.\n\nR03  Conduct annual evacuation drills.\n\nR04  Keep records of the evacuation drill outlining results, recommendations, and mitigations.\n\nR05  Include in mechanical integrity program that the relief valves will be replaced/recertified every five years or w"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8467,
      "SummaryText": "hen a release occurs.\n\nR06  Ensure that there is procedure for properly changing substations.\n\nR07  Ensure that the procedure for changing the filters is included in the Operating Procedures section of the PSM document and that the maintenance schedule in the Mechanical Integrity section of the PSM document includes the change-out frequency for these filters.\n\nR08  Ensure emergency response plan includes when to use escape masks and when an operator is allowed to re-enter a room to shut down or fix a leak.\n\nR09  Implement a contractor safety program.\n\nR10  Consider the necessity of a wind sock and where it should be located.  \n\nR11  Investigate the feasibility of a backup power source (i.e. batteries, UPS, etc.).\n\nR12  Include in emergency response program what to do in the event of a low pressure liquid spill on the machine room floor (i.e. using an absorbent material for cleanup).\n\nR13  Include a test of the high level alarm and switches in mechanical integrity program.\n\nR14  Ensure that operating procedures include an oil drain procedure.\n\nR15  Ensure that there are operating procedures for this abnormal operation documented in the operating procedures section of the PSM document.\n\nR16  Consider the feasibility of installing a solenoid valve on the high pressure receiver line that would shut down in the dock evaporators if the ammonia sensor is activated.\n\nR17  Review evacuation procedures with respect to employee notification and accountability.\n\nR18  Ensure that evacuation routes and/or exit locations are posted in several areas in the building.\n\nR19  Consider implementing a procedure so that the operator notifies someone prior to going on the roof if a leak is suspected.  Include the buddy system and portable eyewash stations in this procedure.\n\nR20  Evaluate the fall protection regulation with respect to the procedures that the operator must follow regarding escape from a toxic release versus fall protection that may hinder escape.\n\nR21  Ensure that there is"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 8467,
      "SummaryText": "a procedure to properly locked out condenser prior to entering for cleaning.\n\nR22  Install a disconnect at the condenser so the operator can be sure that the power to the condenser is off.\n\nR23  Check against the manufacturer's recommendations regarding the frequency of the ammonia sensor calibration requirements.\n\nR24  Consider adding a third shutoff switch (glass enclosed and located in battery room) that is accessible by a designated individual that is not an operator (i.e. on the weekends).  This person will need to be designated and trained as to when to use the shut off etc.\n\nR25  Consider adding ammonia placarding to the machine room door.\n\nR26  Consider adding DO NOT ENTER and/or AUTHORIZED PERSONNEL ONLY signs to the control room door in accordance with OSHA sign and tag requirements (1910.145).  \n\nR27  Examine the exit signs in the machine room to ensure compliance with OSHA's 1910.37(q), Means of Egress and Exit Signs.  Consider the need for a step outside the machine room door that exits to the outside.\n\nR28  Consider labeling the important valves in the ammonia system (i.e. any valves referred to in the operator procedures).\n\nR29  Install a new sign in the machine room that indicates the total amount of ammonia in the system.\n\nR30  Tag the valves and lines inside the emergency relief box.\n\nR31  Consider including a summary of the emergency response plan that shows telephone numbers of emergency response personnel.\n\nR32  Label the emergency relief box with warning label such as EMERGENCY USE ONLY.  In addition, ensure that the box is locked either with a break-away lock or keys distributed such that someone is always on site with a key.\n\nR33  Consider installing guardrails around the condenser catwalks.\n\nR34  Consider installing additional grading around the duct work from the freezer/cooler to the penthouse.\n\nR35  Implement and review operating procedures, including delivery, startup, shutdown, and emergency operations.\n\nR36  Develop and implement an em"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 8467,
      "SummaryText": "ergency response program and use the Emergency Response Action Plan Checklist as a guideline.\n\nR37  Check OSHA hearing protection requirements (1910.95).\n\nR38  Consider installing steps/bridges over the roof pipelines.\n\nR39  Review the air intake location at the Dry Warehouse to determine if shelter-in-place or evacuation is the best procedure in the event of an ammonia release at the freezer warehouse."
    }
  ]
}