{
  "FacilityID": 8497,
  "FacilityName": "MCSD Wastewater Management Facility",
  "FacilityStr1": "795 Hiller Road",
  "FacilityStr2": null,
  "FacilityCity": "McKinleyville",
  "FacilityState": "CA",
  "FacilityZipCode": "95519",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06023",
  "LEPC": "Coastal Region",
  "FacilityLatDecDegs": "40.943611",
  "FacilityLongDecDegs": "-124.122222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "mcsd@humboldt1.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "McKinleyville Community Services District",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "McKinleyville CSD",
  "OperatorStr1": "P.O. Box 2037",
  "OperatorStr2": null,
  "OperatorCity": "McKinleyville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95519",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": "N/A",
  "EPAFacilityID": "100000107458",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-02-09 00:00:00",
  "SafetyInspectionBy": "County EHD",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.94171,
  "FRS_Long": -124.120329,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10284,
      "AltID": "Wastewater Chlorination",
      "FacilityID": 8497,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 11399,
          "ProcessID": 10284,
          "ChemicalID": 62,
          "Quantity": 4200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10522,
          "ProcessID": 10284,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 4690,
              "Process_NAICS_ID": 10522,
              "SafetyReviewDate": "1999-06-10 00:00:00",
              "PHA_Date": "1997-06-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-06-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "haz-mat response personnel",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "hand-held chlorine detectors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "increased haz-mat response capability; installation of seismic safety engineering controls",
              "OpProceduresReviewDate": "1999-06-10 00:00:00",
              "TrainingReviewDate": "1999-02-07 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "site-specific haz-mat drills",
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-10 00:00:00",
              "EquipmentInspectionDate": "1999-05-25 00:00:00",
              "EquipmentTested": "ALL",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-10 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1998-02-09 00:00:00",
              "AuditCompletionDate": "1998-02-09 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-10 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-10 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-06-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 5423,
                  "PreventionProgram3ID": 4690,
                  "ProcessChemicalID": 11399
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8497,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-10 00:00:00",
    "ERTrainingDate": "1998-12-15 00:00:00",
    "CoordinatingAgencyName": "Humboldt County Environmental HD",
    "CoordinatingAgencyPhone": "7074456215",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "California Health and Safety Code Chapter 6.95",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8497,
      "SummaryText": "From: Final Regulations\nGovernor's Office of Emergency Services\n\nThe owner or operator shall provide in the RMP an executive summary that includes a brief description of the following elements:\n\n(a) The accidental release prevention and emergency response policies at the stationary source;\n(b) The stationary source and regulated substances handled;\n(c) The worst-case release scenario(s) and the alternate release scenarios(s), including administrative controls and mitigation measure to limit the distances for each reported scenario;\n(d) The general accidental release prevention program and chemical-specific prevention steps;\n(e) The five-year accident history;\n(f) The emergency response program, and;\n(g) Planned changes to improve safety.\n\n\nDRAFT - RMP EXECUTIVE SUMMARY\n\nIntroduction\nThe McKinleyville Community Services District utilizes chlorine to provide disinfection of treated wastewater at their Waste Water Management Facility located off of Hiller Road in McKinleyville.  In addition, the District has the ability, although it has never been utilized, to provide additional chlorination of the District's potable water supply.  The District's potable water chlorination equipment is located at the North Bank Road Pump Station, where the District's turnout is received from the wholesaler, the Humboldt Bay Municipal Water District.\n\nIn conjunction with these facilities and functions, the District stores liquid chlorine and maintains piping and plumbing to facilitate the injection of chlorine to affect disinfection of pathogenic organisms.  Liquid chlorine is stored in one-ton containers at the Waste Water Management Facility, and in 150-lb. cylinders at the North Bank Road Pump Station.  In order to facilitate ordering and delivery of the one-ton cylinders, the District occasionally stores liquid chlorine in excess of 2,500 lbs.\n\nChlorine is listed by state and federal agencies as a regulated substance.  The federal Accidental Release Prevention program requires stat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8497,
      "SummaryText": "ionary sources with more than the threshold quantity of a regulated substance to be evaluated to determine the potential for and impacts of accidental releases from the covered process.  Under conditions specified by the state and federal agencies, the owner or operator of a stationary source which stores more than the threshold quantity is required to develop and submit a risk management plan (RMP).  The federal threshold quantity for chlorine is 2,500 lbs., which therefore requires the District to develop and submit a RMP to the federal Environmental Protection Agency (EPA) by June 21, 1999.  In addition, the District will be subject to the provisions of the California Accidental Release Prevention (CalARP) program.  The CalARP program includes the federal Accidental Release Prevention Program with certain additions specific to the state pursuant to the state Health and Safety Code.  The purpose of the state and federal accidental release programs is to prevent the accidental release of regulated substances.\n\nAccidental Release Prevention\n\nThe McKinleyville Community Services District recognizes the potential impact of handling chlorine in conjunction with their water and waste water treatment processes.  The District has implemented several safety programs to prevent accidental releases.  These plans have been updated, expanded, and integrated in conjunction with the Risk Management Plan program.\n\nProcess Management Safety Plan\nThe California Division of Occupational Safety (Cal/OSHA) requires that owners/operators of facilities upon which any listed acutely hazardous material is stored/used in excess of specified quantities must develop a process safety management plan.  The goal of the regulation is to reduce the risk of occupationally related injuries of illnesses related to the accidental release of an acutely hazardous material.  The District's Process Safety Management Plan was originally developed in ______.  This document identifies the physical and toxic"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8497,
      "SummaryText": "ological hazards of chlorine and sulfur dioxide, and analyzes the hazards inherent in the District's processes regarding these substances.  The process hazard analysis utilized a composite of several different methodologies, including what-if, failure mode effects analysis, and primary hazard assessment.  The objectives of the analysis were to identify possible hazard scenarios, identify what causes(s) could lead to each scenario, characterize the probable consequence of each cause, and suggest corresponding mitigation options.\n\nOnce the possible hazard scenarios were characterized, a qualitative estimation of the frequency with which causative factors might occur and a categorization of the consequences based upon degree of severity upon employee health and safety was developed.  Finally a risk ranking was derived from a matrix composed of axes representing frequency and consequence.\n\nThe District's Process Safety Management Plan forms the backbone of the Risk Management Plan.  Additional elements required by the Risk Management Plan Program were added, most notably the analysis and evaluation of potential off-site consequences.  The Process Safety Management Plan was re-evaluated with respect to new and additional information gathered during the Risk Management Plan process, and revised to reflect this new information.\n\nHazardous Material Handling Training\nAll District field personnel have completed the 40-hr HAZWOPER course for Hazardous Waste Operations and Emergency Response training.  In addition, District field crew members are completing the annual requirement of 8 hours of refresher training and participating in field training exercises under contract agreement with the Northern California Safety Consortium.\n\nEmergency Response Policies\nThe District's Emergency Response Policies are clearly outlines in the District's Process Safety Management Plan.  The critical component of this Plan (Exhibit C - Emergency Action Plan/Spill Response Procedures) is included"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8497,
      "SummaryText": "in its entirety in the Risk Management as _______________\n\nPotential Off-Site Consequences\n\nWorst-Case Release Scenario\nThe worst-case scenario is dictated by EPA as being the release of the entire contents of the largest on-site container (one ton) in 10 minutes.  Although extremely unlikely to ever occur, air dispersion modeling of the worst case scenario has determined that effectively, the entire community of McKinleyville would be included within the defined endpoints of 3 ppm concentration of chlorine.  The estimated population impacted by this release scenario is approximately _________ people, and includes: _____________\n\nThe consulting firm of Scientech, Inc. of Idaho Falls, Idaho were retained to prepare computer modeling and mapping of the endpoints for the District's Risk Management Plan.  The endpoints that are required to be mapped for the Risk Management Plan are defined as \"the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to 1 hour without experiencing or developing irreversible or other serious health effects or symptoms that could impair an individual's ability to take protective action\".  This concentration is defined as 3 parts per million (ppm).\n\nThe physical limits which define the endpoints (3 ppm concentration) of each release scenario were determined based upon computer modeling of several factors.  These factors include the amount and rate of material assumed to be released (the release scenario), and also weather conditions; typically represented by wind direction, velocity and atmospheric stability.  The air dispersion modeling computer program utilized by the District's consultant examines historic weather data for the McKinleyville airport and uses the conditions which would produce the worst dispersion of the chlorine to calculate the concentration of chlorine based upon the selected release scenario.  It then plots contour lines of equal concentrations, and from this pl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8497,
      "SummaryText": "ot, we can identify the location of the endpoint (3 ppm) concentration.\n\nIt is important to recognize that the plotted endpoints are not consistent with our intuitive concept of air dispersion \"plumes\" or clouds.  A plume represents the dispersion of material given one particular set of atmospheric conditions (primarily wind direction and speed).  The air dispersion model utilized in the Risk Management Plan plots the endpoints for dispersion by wind in all directions, based upon the worst historic atmospheric conditions for each direction.  It is informative to review the historic wind and atmospheric data upon which the Risk Management Plan is based.  Examining the worst atmospheric conditions (F Stability) upon which the air dispersion modeling is based, the historic information shows that a total of 86% of the time during the F Stability conditions, the plume would move away from the Waste Water Management Facility between the quadrants of NNW and SW.  There are no residential receptors within these quadrants.  Likewise, the historical information can be reviewed for wind direction and frequency for ALL wind speeds, directions and atmospheric conditions.  This information shows that for the historic information, over 48% of the time the plume would move away from any residential receptors.\n\nAlternate-Release Scenario\nThe Alternate Release Scenario is intended to represent a more credible, but still highly unlikely accidental release scenario.  The Risk Management Plan Program allows greater latitude in selecting an alternate release scenario that reasonably represents the actual details of the facility.  Staff and consultants have reviewed the Process Safety Management Plan and considered actual materials handling procedures at the Waste Water Management Facility.  Based upon this review, the most credible alternate release scenario is thought to be a discharge from the connection port on the one-ton cylinder.  This accidental release is most likely to occur dur"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 8497,
      "SummaryText": "ing the handling of the cylinder during delivery and connection/disconnection, and we have therefore assumed that District personnel are present when the incident occurs.\n\nActual hand-on exercises where District employees practice their hazardous materials training demonstrate that it is reasonable to assume a repair kit can be applied to this accidental release within 60-90 minutes.  A 90-minute discharge through the cylinder's connection port (a 5/16\" diameter hole) therefore defines the selected alternate release scenario.  This scenario results in a total of ________ lbs of chlorine being released within the 90-minute duration.\n\nThe 3 ppm endpoints for this release scenario have been plotted and mapped, and it is estimated that the estimated population affected by this release scenario is approximately _________ people, and includes: _____________\n\nAdministrative Controls and Mitigations\nIn conjunction with the Disinfection Alternatives Report prepared by Oscar Larson and Associates, the District considered adopting administrative controls to limit the inventory of chlorine and sulfur dioxide to avoid requirements for filing the Federal RMP.  District staff believes these controls offer little or no real potential to reduce the risk or potential off-site consequences of an accidental release.  Other administrative controls have already been implemented that minimize the on-site quantities of hazardous materials within reasonable parameters of materials delivery schedules and assurance that the District remains able to provide needed disinfection functions at their critical facilities.\n\nThe District has elected to implement several mitigations of risk and the potential off-site consequences of an accidental release.  As noted below, the District has committed to implementing over $40,000 in safety upgrades at their Waste Water Management Facility.  In addition, the District continues to invest in training, preparation, organization, and coordination with other re"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 8497,
      "SummaryText": "sponding agencies.  The training of staff to respect the inherent risk in handling hazardous material is likely the best investment to reduce the risk of accidental release, as the human factor is often a large contributing factor in accidents.  Likewise, the preparation, training, and organization necessary to provide efficient and effective response in the event of an accidental release assures the potential off-site consequences are minimized.\n\nAccidental Release - Accident History\n\nThe District has utilized chlorine since the Waste Water Management Facility was constructed in 1983.  In over 15 years of handling chlorine, the District has never experienced an accidental release.  The District remains committed to maintaining this excellent accident history, and never experiencing an accidental release in the future.  In recognition of this commitment, the District continues regular training of field personnel in the safe handling, and proper emergency response in the event of an accidental release.  Safety meetings are conducted on a regular basis, and topics discussed and staff members attending are documented in District files.  Various safety plans including the District's Hazardous Material Business Plan, the Process Safety Management Plan, and the District's Emergency Operations Plan are regularly reviewed and updated.  The District has contracted with the Northern California Safety Consortium to conduct training sessions and functional exercises in the implementation of these various plans.\n\nEmergency Response Program\n\nThe District has developed several documents which provide guidance for emergency response to emergencies, including accidental release of hazardous materials.  These documents are being reviewed, updated, and integrated to be internally consistent, and appropriately and consistently referenced in all of the District's safety/emergency response documents.  Emergency response to the accidental release of hazardous materials is included in the"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 8497,
      "SummaryText": "District's Process Safety Management Plan, Appendix C, entitled Emergency Action Plan/Spill Response Procedures.  This Appendix is included in the Risk Management Plan in its entirety as ______________.\n\nPlanned Changes to Improve Safety\n\nThe District retained the engineering consulting firm of Oscar Larson and Associates to prepare a Disinfection Alternatives Study.  The purpose of the Oscar Larson and Associates study was to examine the existing practices and procedures as well as alternate disinfection methodologies to evaluate revisions to the District's current practices and procedures that might reduce the risk of accidental release and/or potential off-site consequences in the event of an accidental release.  Four alternatives, in addition to the existing conditions, were identified and evaluated in the final report.  Cost estimates were prepared for both capital costs and maintenance costs of each alternative.\n\nThe final report prepared by Oscar Larson and Associates recommended the District continue the current practices utilizing liquid chlorine and sulfur dioxide, or adopt administrative controls to limit the inventory of chlorine and sulfur dioxide to avoid requirements for filing the Federal RMP.  District staff feels the administrative controls to limit the inventory of chlorine and sulfur dioxide below the federal regulatory threshold limits to avoid the requirement to file the Federal RMP, offers little or no real potential to reduce the risk or potential off-site consequences of an accidental release.\n\nThe final report also recommended installation of a number of safety upgrades to further improve the safety of the existing facilities, and/or improve the District's ability to respond in the event of an accidental release.  In that these improvements offer real potential for reduction of risk, and/or improved response in the event of an accidental release, District staff supports these improvements, and recommended to the District Board that these im"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 8497,
      "SummaryText": "provements be implemented.\n\nThe MCSD Board approved upgrades to the District's Waste Water Management Facility, and directed staff to include funding for these improvements in the District's FY 1999-2000 budget.  The estimated cost of these improvements is approximately $44,000, and includes the following system improvements:\n\n7 Emergency Exhaust Fan Ducts\n7 Additional Leak Detectors\n7 Piping Revisions\n7 Alarm System Modifications\n7 Electronic Ton Container Scales\n7 Wind Monitor and Telemetry\n\nThese improvements are planned to be implemented during the FY 1999-2000 in order to further improve the safety and reduce the potential consequences of an accidental release of hazardous materials."
    }
  ]
}