{
  "FacilityID": 8539,
  "FacilityName": "Chevron USA Production Co. - RWSU NGL Plant",
  "FacilityStr1": "100 Chevron Road",
  "FacilityStr2": null,
  "FacilityCity": "Rangely",
  "FacilityState": "CO",
  "FacilityZipCode": "81648",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08103",
  "LEPC": "Rio Blanco County LEPC",
  "FacilityLatDecDegs": "40.100861",
  "FacilityLongDecDegs": "-108.872167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 803743616,
  "ParentCompanyName": "Chevron Corporation",
  "Company2Name": null,
  "CompanyDUNS": 1382555,
  "Company2DUNS": 0,
  "OperatorName": "Chevron USA Production Company",
  "OperatorStr1": "100 Chevron Road",
  "OperatorStr2": null,
  "OperatorCity": "Rangely",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "81648",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000106976",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.10708,
  "FRS_Long": -108.86687,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10349,
      "AltID": "NGL Extraction",
      "FacilityID": 8539,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 11512,
          "ProcessID": 10349,
          "ChemicalID": 155,
          "Quantity": 370000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 773,
              "ProcessChemicalID": 11512,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 774,
              "ProcessChemicalID": 11512,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 775,
              "ProcessChemicalID": 11512,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 776,
              "ProcessChemicalID": 11512,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 777,
              "ProcessChemicalID": 11512,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10587,
          "ProcessID": 10349,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 10350,
      "AltID": "Propane Refrigerant",
      "FacilityID": 8539,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 11513,
          "ProcessID": 10350,
          "ChemicalID": 98,
          "Quantity": 48000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10588,
          "ProcessID": 10350,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8539,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-10-01 00:00:00",
    "ERTrainingDate": "1998-12-01 00:00:00",
    "CoordinatingAgencyName": "Rio Blanco Sheriff",
    "CoordinatingAgencyPhone": "9708785023",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8539,
      "SummaryText": " DESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n \n As majority owner, Chevron USA Production Company operates the Rangely Weber Sand Unit (RWSU) Natural Gas Liquids (NGL) Plant for itself and the unit partners. The NGL plant, located in the Rangely Weber Sand Unit field, is approximately three miles west of the town of Rangely.  The plant was designed to process 155 mmscfd of naturally occurring hydrocarbon gas.  Chevron has five (5) employees assigned to the NGL Plant.  \n\nThe primary activities of the NGL Plant involving RMP regulated substances are recovering a natural gas liquid (NGL) product by chilling a gas stream containing liquefiable hydrocarbons.   A distillation process is used to purify the hydrocarbons that condense as a result of chilling the gas stream.  The NGL product contains propane, butane, isobutane, pentane, isopentane and heavier hydrocarbon liquids.\n \nThe chilling effect required to recover NGL is provided by a refrigeration system.  The refrigeration system re-circulates a refrigerant to remove heat from the gas stream being processed.  The refrigerant used in the chilling process is 98% propane and 2% ethane.  The NGL extraction process and the propane refrigeration process are Program Level 1.\n \n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nIt is the policy of Chevron USA Production Company to conduct its business in a socially responsible and ethical manner that protects safety, health and the environment.  The RWSU Emergency Preparedness and Response Policy involves assessing the hazards and risks of an unplanned incident; developing a plan for managing those hazards and risks; communicating relevant information to employees, contractors and appropriate agencies; and conducting emergency exercises.   \n \n\nOFFSITE CONSEQUENCE ANALYSIS RESULTS\n\nMaximum quantity of regulated substances that could be stored in the NGL process is 370,000 pounds of flammable mixture.  There are two identical NGL storage vessels; the maxim"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8539,
      "SummaryText": "um quantity that could be stored in each vessel is 190,000 pounds of flammable mixture composed of propane, butane, isobutane, isopentane and pentane.  The maximum quantity of liquid propane that can be stored in the refrigeration process is 48,000 pounds.  There are two identical propane surge tanks: the maximum quantity that could be stored in each tank is 24,000 pounds.\n\nWorst-case scenario (WCS) for the NGL extraction process would be a catastrophic failure of one of the NGL storage vessels resulting in a release of the entire volume in a vapor cloud explosion.  WCS for the propane refrigeration process would be a catastrophic failure of one of the surge tanks resulting in a release of the entire volume in a vapor cloud explosion.  Although Chevron has numerous controls to prevent such releases and to manage their consequences, no credit for administrative controls or passive mitigation measures was taken into account in evaluating these scenarios.\n\nWhile the calculated maximum distance to endpoint (1 psi overpressure) for the WCS of the NGL extraction process is beyond the plant boundaries, there are no public receptors within that radius.  Similarly, while the calculated maximum distance to endpoint for the WCS of the propane refrigeration process is beyond the plant boundaries, there are no public receptors within that radius.  The potential affected area of the propane refrigeration worst-case release scenario is completely bounded in the potential affected area of the NGL extraction process WCS.\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n \nChevron encourages employees to participate in all facets of process safety management and accident prevention.  Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a process hazard analysis (PHA) team.  Employees have access to all information created as part of the RWSU accident prevention program element. \n\nThe RWSU NGL p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8539,
      "SummaryText": "lant keeps a variety of technical documents that are used to help maintain safe operation of the processes.  These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories and equipment design basis/configuration information.  Chemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs).\n\nFor the NGL extraction process and the propane refrigeration process, Chevron has documented safety-related limits for specific process parameters (e.g. temperature, pressure, level, flow,) in the plant instrumentation system's \"point detail\" directory.  Chevron ensures that the processes are maintained within these limits using process controls and monitoring instruments, highly trained personnel and protective instrument systems (e.g. automated shutdown systems).\n\nThe RWSU NGL plant has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled.  Within this program, each process is systematically examined to identify hazards and that adequate controls are in place to manage these hazards.\n\nThe RWSU NGL plant maintains written procedures that address various modes of process operations such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, and (5) normal shutdown.  To complement the written procedures for process operations, Chevron has implemented a comprehensive training program for all employees involved in operating the NGL plant. \n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe RWSU NGL plant has an excellent record of accident prevention.  There have been no releases from the RMP covered processes in the last five years.\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nChevron maintains a written emergency response program, including the RWSU NGL plant, which is in place to protect worker and public safety as well as "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8539,
      "SummaryText": "the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures follow the standard Incident Command System to address all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and postincident cleanup and decontamination requirements.\n\nIn addition, the plant has procedures that address maintenance, inspection, and testing of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is reviewed annually and updated when necessary based on modifications made to the NGL plant processes or other RWSU operations.  The emergency response program changes are administered through the MOC process, which includes informing and/or training affected personnel in the changes.\n\nThe overall emergency response program for the RWSU NGL plant is coordinated with the Rio Blanco County Local Emergency Planning Committee (LEPC).  The RWSU NGL plant has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g. Rangely fire department, Sheriff's Department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  The RWSU NGL plant conducts periodic emergency drills and Chevron provides refresher training to local emergency responders regarding the hazards of regulated substances in the NGL plant."
    }
  ]
}