{
  "FacilityID": 8559,
  "FacilityName": "AlliedSignal Medical Products Facility",
  "FacilityStr1": "4790 Olympic Drive",
  "FacilityStr2": null,
  "FacilityCity": "Kingman",
  "FacilityState": "AZ",
  "FacilityZipCode": "86401",
  "Facility4DigitZipExt": "6771",
  "FacilityCountyFIPS": "04015",
  "LEPC": "Mohave County LEPC",
  "FacilityLatDecDegs": "35.267694",
  "FacilityLongDecDegs": "-113.942556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.alliedsignal.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 39136262,
  "ParentCompanyName": "AlliedSignal",
  "Company2Name": null,
  "CompanyDUNS": 139691877,
  "Company2DUNS": null,
  "OperatorName": "AlliedSignal Inc",
  "OperatorStr1": "101 Columbia Road",
  "OperatorStr2": null,
  "OperatorCity": "Morristown",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07962",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": "86401LLDSG47900",
  "EPAFacilityID": "100000106592",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-28 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-01-28 00:00:00",
  "DeRegistrationEffectiveDate": "2013-12-12 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.267694,
  "FRS_Long": -113.942556,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10371,
      "AltID": "EtO Storage & Unloading",
      "FacilityID": 8559,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 11536,
          "ProcessID": 10371,
          "ChemicalID": 9,
          "Quantity": 100000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10610,
          "ProcessID": 10371,
          "NAICSCode": "32512",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 4743,
              "Process_NAICS_ID": 10610,
              "SafetyReviewDate": "1999-04-16 00:00:00",
              "PHA_Date": "1998-02-17 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-11-16 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-18 00:00:00",
              "TrainingReviewDate": "1999-06-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-18 00:00:00",
              "EquipmentInspectionDate": "1999-06-18 00:00:00",
              "EquipmentTested": "Ethylene Oxide Transfer Hose",
              "ChangeMgmtDate": "1999-06-18 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-18 00:00:00",
              "PreStartupReviewDate": "1998-10-05 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1997-12-17 00:00:00",
              "InvestigationChangeDate": "1997-12-18 00:00:00",
              "ParticipationPlansReviewDate": "1999-06-18 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-18 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-18 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 5516,
                  "PreventionProgram3ID": 4743,
                  "ProcessChemicalID": 11536
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8559,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-02-11 00:00:00",
    "ERTrainingDate": "1998-10-09 00:00:00",
    "CoordinatingAgencyName": "Mohave County LEPC",
    "CoordinatingAgencyPhone": "5207539141",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 8559,
      "SummaryText": "the process.\n\n-\tInformation on the equipment in the process\n\nProcess Hazard Analysis:\n\nA Process Hazards Analysis has been completed for all processes that use \nregulated chemicals.  These analyses are used to review areas involved in the use, \nstorage, manufacturing, handling, or onsite movement of regulated chemicals.  \nThe Hazards and Operability Method (HAZOP) is to be used to perform PHA\u0012s at \nthe AlliedSignal Kingman facility.\n\nStandard Operation Procedures \u0016 (SOP):\n\nWritten operating procedures have been developed that provide clear instructions \nfor safely conducting activities involved in the processes that use regulated \nchemicals.  Each of these SOPs includes steps to complete the operating phases, \noperating limits, and safety and health considerations.\n\nAll RMP operation procedures are reviewed modified as necessary, and reissued \nannually.\n\nTraining:\n\nAll employees, including maintenance and contract employees involved with the \ncovered process, are trained on the specific safety and health hazards of the \nprocess.  They are also trained on emergency operations including shutdown, and \nother safe work practices that apply to the employee\u0012s job task.\n\nMechanical Integrity:\n\nThe Mechanical Integrity Program at the Kingman facility is structured to assure \nthat equipment involved in the use, storage, manufacturing, handling, or onsite \nmovement of regulated chemicals is designed, fabricated, installed, and \nmaintained to minimize the risk of releases of these chemicals.\n\nManagement of Change\n\nThe Management of Change process at the Kingman facility is the process by \nwhich any permanent or temporary modifications to process chemicals, \ntechnology, equipment, or facilities are managed.  The process is used to sustain \nor enhance the level of process safety within the Kingman facility.\n\nThe Management of Change procedure applies to all AlliedSignal employees and \ncontractors at the Kingman facility that are involved in operating and/or \nmaintaining any of"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8559,
      "SummaryText": "se would crack and that an opening 1/16 of \nand inch wide and extending for < of the circumference of the hose would occur.\n\nMitigation of this type of release would automatically occur through a system of \ninterlocks and alarms.  An EO detection pickup point is located in close proximity to \nthe EO transfer pump.  When that sensor detects an EO concentration above 15 ppm, \nan alarm will sound alerting on-site personnel.  A system of interlocks will also be \nactivated.  The interlocks will shut down the EO transfer pump reducing the pressure \nat the leak site.  The interlocks will also close the outlet valves on the EO railcar, \nminimizing the amount of EO that could potentially escape through the leak.  Plant \npersonnel responding to the alarm in appropriate personnel protective equipment will \nfurther isolate the leak through a system of manually operated valves.  EO monitoring \npoints located at the plant fence line will detect any potential off site impact and \nprompt notification of community emergency response personnel.  The anticipated \nplume from this release will not impact any private residences.  However, it could \nimpact the exercise yard of a local prison.  The buildings in the prison are outside the \nanticipated impact zone.\n\n\n5.\tGeneral accidental release prevention program and chemical specific accident \nprevention program\n\nThe Kingman facility has a comprehensive general accidental release prevention \nprogram.  The program is comprised of 12 elements.  The activities at the Kingman \nfacility in each of these elements are described briefly below.\n\nProcess Safety Information:\n\nThe Process Safety Information section of the program is designed to help those \ninvolved in operating the process to identify and understand the hazards posed by \nthose processes involving regulated chemicals.\n\nProcess Safety Information will include information on: \n\t\n-\tThe hazards of the regulated chemicals used or produced by the process.\n\n-\tInformation on the technology of"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 8559,
      "SummaryText": "AlliedSignal Kingman Plant\nKingman, AZ.\n\n\nEPA Risk Management Program\nExecutive Summary\n\n\n\n1.\tIntroduction:\n\nThe Kingman facility is a manufacturing plant located in Kingman Arizona.  It is part \nof the Specialty Chemicals Business Unit of AlliedSignal Inc.  Headquartered in \nMorris Township, New Jersey, AlliedSignal is an advanced technology and \nmanufacturing company serving customers worldwide with aerospace and automotive \nproducts, chemicals, fibers, plastics and advanced materials.  With 1998 sales of \napproximately $15 billion, the company ranks among the top 100 of the Fortune 500.  \nAlliedSignal has approximately 70,500 employees at 300 facilities in 40 countries.  \nAlliedSignal operates twelve major businesses: Aerospace Equipment Systems, \nAerospace Engines, Electronic and Avionics Systems, Aerospace Marketing Sales \nand Services, Federal Manufacturing and Technologies, Polymers, Specialty \nChemicals, Electronic Materials, Consumer Products Group, Turbocharging Systems, \nTruck Brake Systems and Friction Materials.  More information about AlliedSignal \nmay be found at its Web Page: www.AlliedSignal.com\n\nIt is the world wide policy of AlliedSignal to design, manufacture and distribute its \nproducts and to handle and dispose of materials throughout their life cycle in a \nmanner that protects the environment and safeguards employees, customers and the \npublic from unacceptable risk.  AlliedSignal\u0012s complete Health, Safety and \nEnvironment Policy may be found at the AlliedSignal Web Page.\n\nThis facility participates in the Responsible Care program of the Chemical \nManufacturers Association.  The Community Awareness and Emergency Response \nCode of Responsible Care brings chemical plants and local communities together \nthrough communications and cooperative emergency planning.  The Process Safety \nCode of Responsible Care is designed to prevent fires, explosions and accidental \nchemical releases.  The code requires safety audits, inspection and maintenance \npr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8559,
      "SummaryText": "ograms, and safety training for employees and contract workers.  Facilities are \nencouraged to listen to the concerns of the community and to consider these concerns \nwhen designing and implementing process safety systems.\n\n\n2.\tPlant Description\n\nThe Kingman Facility is located in the Kingman Airport Industrial Park at 4790 \nOlympic Drive, Kingman, Arizona.  The facility currently has 10 employees.  \n\nAt the Kingman facility chlorotetrafluoroethane (Refrigerant-124) is mixed with \nethylene oxide and chlorotetrafluoroethane (Refrigerant 124) and \nchlorodifluoromethane (Refrigerant 22) are mixed with EO to make Oxyfume 2000 \nand Oxyfume 2002 respectively.  Oxyfume 2000 is used primarily by medical device \nmanufacturers to sterilize medical devices such as sutures and lens implants for the \neye prior to shipment to hospitals and doctor\u0012s offices.  Oxyfume 2002 is used \nprimarily by hospitals to sterilize reusable heat sensitive devices such as various types \nof scopes used for arthoscopic surgery prior to reuse.\n\nThe Kingman facility supports the local community by paying over $ 80,000 per year \nin taxes.  The Plant Manager of the Kingman facility is a member of the Local \nEmergency Planning Committee (LEPC) and is active in helping to prepare the \ncommunity to handle a potential emergency situation.\n\nThe only chemical in the Kingman facility that requires the facility to participate in \nEPA\u0012s Risk Management Program is EO.  At the Kingman facility, EO is stored in \nthe same rail car in which it is shipped.  The car is surrounded by a water deluge \nsystem for fire protection and to suppress vapors in the unlikely event a leak should \noccur.  The EO car is only connected to the EO distribution piping when a transfer is \nbeing made to a blend tank.  At all other times the car is disconnected and sealed.  \nTransfers occur on an average of once per week and take about 4 hours.\n\n\n3.\tAccidental release and emergency response policies\n\nThe Kingman facility strictly adheres to"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8559,
      "SummaryText": "all AlliedSignal corporate policies \nconcerning Health Safety and Environmental Issues.  It is the policy of the Kingman \nfacility to: \u0013Protect people, property, and the environment by conducting programs \nfor safety, loss prevention, product safety and integrity, occupational health and \nenvironmental excellence, and by formally reviewing and continually improving the \neffectiveness of the health, safety and environmental processes.\u0014\n\nThe Kingman facility has a written facility specific Plant Emergency Response and \nSpill Plan.  It is the objective of the Plan to \u0013provide sufficient information to \nformulate an initial response to a fire, explosion, or any unplanned release of \nhazardous material to the air, soil, or surface water at the facility.\u0014\n\nThe Kingman Facility has a management employee who is dedicated to managing all \nHealth, Safety, Environmental and Emergency response issues.  This individual is \nresponsible for ensuring compliance with all regulatory requirements and overseeing \nthe facility\u0012s response to any unforeseen incident.  It is the Plant Manager\u0012s \nresponsibility to ensure that all policies and procedures are comprehensive, complete \nand followed.\n\nLocal emergency responders are familiar with the Kingman facility.  The facility has \nconducted tours for the firefighters from the local fire district and has held joint \nemergency response drills with those individuals.  The facility has also provided \nfinancial support to the local fire district by purchasing equipment used for \nemergency response and donating it to the fire district.\n\nThe Kingman Regional Medical Center has been given information on all of the \nchemicals at the Kingman facility.  Treatment protocols for exposed patients have \nalso been provided.\n\n\n4.\tWorst case and alternative release scenarios and administrative and mitigation \ncontrols in place to limit the impact of a release\n\nEPA\u0012s RMP regulations required the Kingman facility to model the dispersion and \noff-site impacts"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8559,
      "SummaryText": "of EO which would be released to the atmosphere in the event of a \nhypothetical worst case release scenario occurring at the Kingman facility.  The \nKingman facility\u0012s worst case scenario is the hypothetical failure of an EO railcar \ncontaining a maximum of 75,000 pounds of EO.  As required by EPA\u0012s regulations, \nthe worst case scenario air dispersion modeling assumed that the resulting spill from \nthe railcar could not be controlled by the facility\u0012s EO spill mitigation system \n(described more fully below) and furthermore, that the entire 75,000 pounds of spilled \nEO would vaporize in 10 minutes.  Under these unlikely assumptions, the toxic cloud \nformed by the vaporized EO would reach offsite endpoints and public receptors under \ncertain meteorological conditions assumed in the air dispersion modeling required by \nEPA.\n\nFor a number of reasons, it is extremely unlikely that this event would ever occur.  \nShould the entire liquid EO contents of the railcar be released through failure of the \nrailcar while located at the Kingman facility, the EO would fall into the collection pan \nbelow the railcar and drain to a collection sump.  Upon release of the EO, a sensor \nabove the EO railcar would alarm notifying plant personnel and turn on a water \ndeluge system.  The water deluge would serve to suppress the evaporation and \ndispersion of the EO.  Thus, although a portion of the 75,000 pounds would evaporate \nimmediately, most evaporation would occur and be dispersed more slowly over an \nextended period of time without the same off-site consequences predicted by the \nworst case scenario modeling.\n\nEPA\u0012s regulations also require the modeled dispersion and off-site impacts of EO \nwhich would be released to the atmosphere in the event of a more credible alternate \nscenario occurring at the Kingman facility.  The alternate scenario for the Kingman \nfacility involves a leak in a stainless steel braided hose on the discharge of the EO \ntransfer pump.  It was assumed that the ho"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 8559,
      "SummaryText": "the equipment covered by the Risk Management Program\n\nPre-Startup Review:\n\nPre-start-up safety reviews are used to help ensure designs and procedures are \ncomplete and thorough prior to bringing on line a new facility or a significantly \nredesigned existing unit.  Reviews will be done on all units covered by the Risk \nManagement Program.\n\nCompliance Audits:\n\nCompliance audits will be performed by Kingman facility personnel or outside \ncorporate auditors as required.\n\n\nIncident Investigation:\n\nProper incident investigation is necessary to continuously improve the safety in \nthe Kingman facility.  By identifying contributing factors that create variations \n(incidents) and defining corrective actions, prevention efforts can be properly \nfocused.\n\nAll incidents that cause or have the potential to cause injury to personnel or \nsignificant damage to equipment, the environment, or the public are investigated.\n\nEmployee Participation:\n\nThe Kingman facility\u0012s management consults with employees on the development \nand implementation of the elements of RMP.  Management also consults with \nplant employees during the conduct of process hazards analysis.  The plant will \nprovide to employee\u0012s access to process hazard analysis and to all other \ninformation required to be developed under this standard.\n\nHot Work Permits:\n\nThe Kingman facility has a comprehensive procedure outlining requirements for \ncompleting any activity involving hot work.  The procedure requires that the \nactivity must be reviewed and the hazards identified.  Those hazards must be \ncommunicated to all personnel whose activities could affect the safety of the \nindividuals performing the hot work or of the process in general.\n\nContractors:\n\nThe Kingman facility has a program to insure that contractors who work in the \nKingman facility do so without compromising their safety or the safety of others \nin the plant.  This program covers all contractors working in or adjacent to a \ncovered process.\n\nSafety performance"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 8559,
      "SummaryText": "shall be considered during the contractor selection process.  \nIn addition, contractors shall maintain, for AlliedSignal\u0012s review, records \ndocumenting that his employees are properly trained in their particular craft \nline(s).  Contractors shall also maintain for AlliedSignal\u0012s review, all records of \nsafety meetings and safety-related incidents requiring disciplinary action.\n\n\nChemical specific accident prevention programs:\n\nThe facilities, equipment, and the chemical covered by the EPA Risk \nManagement Program at the Kingman facility have been reviewed several times \nby multiple teams comprised of people from widely varying backgrounds.  \nRecommendations from these reviews have been studied and implemented where \nappropriate.  Consequently the chemical specific prevention programs at the \nKingman facility are comprehensive and well engineered.  Those safeguards \ninclude the following engineering controls:\n\n1)\tEO is shipped to the facility in two specially designed and constructed \nrailcars.  These cars exceed DOT standards for the transport of EO and are \nonly used to transport EO to the Kingman facility.  In order to minimize the \namount of EO in the facility at one time these cars hold a maximum of 75,000 \npounds.  The facility also restricts the number of cars on site at any time to \none.\n\n2)\tThe only storage of pure EO that occurs at the Kingman facility is in the \nrailcar in which the EO was shipped to the facility.  The same railcar is used \nfor shipping and storage to minimize the risk of contamination of the EO.  The \nEO car is only connected to the facility\u0012s EO distribution system while a \ntransfer to a blend tank is occurring.  At all other times, the car is \ndisconnected and sealed.  By following this procedure, the facility can \nminimize the risk of contamination of the railcar and reduce the potential for \nleaks in the transfer piping.\n\n3)\tThe EO car is positioned under a water deluge system at all times while on the \nfacility.  In the event of a g"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 8559,
      "SummaryText": "rass fire or a fire on the car, the deluge will protect \nthe car from the heat of the fire or extinguish the fire if the fire is on the car.  \nIf the car should begin to leak, the water deluge can be used to suppress the \nescaping vapor.  Should an exothermic reaction occur in the car, the deluge \ncan be used to remove the heat of reaction in the car.  The deluge is activated \nby fire on the car, high EO concentration above the car (see No. 4) or by \nmanual activation.\n\nWater from the rail car deluge system falls into a collection pan.  The \ncollection pan drains underground to a below ground lined collection basin.  \nAdding large amounts of water to any EO release will reduce the vapor \npressure of the EO and suppress the flammability.\n\n4)\tWhen the EO car is positioned under the water deluge system, there is an EO \ndetection point immediately above the dome of the car.  There is also a \ndetection point next to the EO transfer pump.  These detectors are set to \nactivate a local alarm at 15 ppm EO.  The facility\u0012s off site security company \nreceives an alarm at 30 ppm EO so that it can notify plant personnel 24 hours \na day.  The detector on top of the railcar is set to turn on the water deluge at \n.7% EO to suppress escaping vapor and prevent ignition.  Early awareness of \nsmall EO leaks helps the facility take the appropriate action to prevent a \nrelease that would impact off site population.\n\n5)\tThe hose used to transfer liquid EO from the EO railcar to the distribution \nsystem is a double walled hose.  If the inner hose fails, the EO is trapped \ninside the outer hose and does not escape.  The annular space between the \nhoses is checked for pressure every time the car is connected.  The annular \nspace is checked for trace amounts of EO every 6 months.  If a leak in the \ninner hose is detected, the hose is replaced.  This procedure reduces the risk of \na serious failure of the transfer hose resulting in a significant leak.\n\n6)\tThe liquid and vapor outlets of the EO"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 8559,
      "SummaryText": "railcar are connected through \nautomatic valves during transfers to the blend tanks.  The automatic valves \nwill close to isolate the contents of the railcar in the event of any abnormal \ncircumstance.  An abnormal circumstance could be the detection of EO in \nexcess of 15 ppm by the EO detectors described in item No. 4.  It may also be \nthe shut down of EO transfer pump for any reason.  By closing the automatic \nvalves on the EO car during abnormal conditions, the amount of EO that can \npotentially be released if a leak should occur is minimized.\n\n7)\tAll five-blend tanks are equipped with safety relief valves to release excess \npressure in the tank prior to catastrophic failure of the vessel.  In addition each \ntank has remotely operated automatic valves on all bottom outlets from the \ntanks.  The valves can be quickly shut isolating the tank contents from transfer \npiping from a remote location in the event a leak occurs.  Shutting these \nvalves minimizes the amount of material that would leak out if a leak were to \noccur.\n\n8)\tIn conjunction with the EO detection system described in Item 4 above, an \nadditional EO monitoring system covers the Kingman facility.  This system \nalarms when an EO concentration in excess of 1 ppm is detected at any one of \n20 monitoring points.  3 of these monitoring points are located at the property \nfence line and will provide warning should a release in the facility have a \npotential off site impact.  By detecting leaks in our piping systems with the \nabove EO detection equipment when they are small, we can address those \nleaks before they become larger and can have a significant off site impact.\n\n\n6.\tFive-Year Accident History\n\nThe Kingman facility has never had a release of ethylene oxide that had an on site or \noffsite impact.\n\n7.\tEmergency Response Program \n\nThe Kingman facility has a written facility specific Plant Emergency Response and \nSpill Plan.  It is the objective of the Plan to \u0013provide sufficient information to \nformu"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 8559,
      "SummaryText": "late an initial response to a fire, explosion, or any unplanned release of \nhazardous material to the air, soil, or surface water at the facility.\u0014\n\nIn the event of a Plant Emergency all personnel in the facility will gather at the \nassembly point.  After a head count, the nature of the emergency will be determined.  \nIf the emergency can be handled with plant personnel and there is no potential for off \nsite impact, mitigation of the emergency will begin immediately.\n\nIf the emergency includes a fire or has the potential for off site impact, the Hualapai \nValley Fire Department and the Sheriff\u0012s department will be notified to coordinate \nfire fighting and evacuation of the surrounding population respectively.  In addition \nthe Mohave County Local Emergency Planning Committee (LEPC) will be notified \nto assist as necessary.\n\nFirst aid and subsequent treatment of any injured plant personnel or surrounding \npopulation will be handled by Kingman Regional Medical Center.  KRMC has a fact \nbook on the Kingman facility\u0012s Chemicals, including Material Safety Data Sheets and \ntreatment recommendations.\n\nAll plant personnel receive a minimum of 16 hours of emergency response training \neach year.  This training includes classroom training as well as hands on training of \nsimulated emergencies.  The Hualapai Valley Fire Department has sent personnel to \nparticipate in the 16-hour emergency response session held each fall.\n\n\n8.  Planned Changes to Improve Safety\n\nThe Kingman facility has never had an RMP type accident.  However, all incidents \nthat cause or have the potential to cause injury to personnel or significant damage to \nequipment, the environment, or the public are investigated.  From those investigations \nseveral changes have been made to the equipment and procedures at the Kingman \nfacility.\n\nIn addition, a Process Hazards Analysis has been completed for all processes that use \nregulated chemicals.  These analyses are used to review areas involved in the use, \nstora"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 8559,
      "SummaryText": "ge, manufacturing, handling, or onsite movement of regulated chemicals.  The \nanalyses are reviewed and updated on a periodic basis.\n\nRecommendations for changes to improve process safety are gathered from the \nincident investigations and hazard reviews.  All outstanding recommendations have \nbeen carefully reviewed and where appropriate implemented at the Kingman facility.  \nThere are currently no outstanding recommendations to improve safety in the \nKingman facility."
    }
  ]
}