{
  "FacilityID": 8572,
  "FacilityName": "Equistar Chocolate Bayou Polymers Plant",
  "FacilityStr1": "FM 2004, South of Alvin",
  "FacilityStr2": null,
  "FacilityCity": "Alvin",
  "FacilityState": "TX",
  "FacilityZipCode": "77512",
  "Facility4DigitZipExt": "4000",
  "FacilityCountyFIPS": "48039",
  "LEPC": "Brazoria County LEPC",
  "FacilityLatDecDegs": "29.231111",
  "FacilityLongDecDegs": "-95.190556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "PP",
  "FacilityURL": "equistarchem.com",
  "FacilityEmailAddress": "ralph.king@equistarchem.com",
  "FacilityDUNS": 969557263,
  "ParentCompanyName": "Equistar Chemicals, L.P.",
  "Company2Name": null,
  "CompanyDUNS": 969557263,
  "Company2DUNS": 0,
  "OperatorName": "Equistar Chemicals, L.P.",
  "OperatorStr1": "One Houston Center, Suite 1600",
  "OperatorStr2": "1221 McKinney",
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77252",
  "OperatorZipCodeExt": "2583",
  "FTE": 43,
  "OtherEPAFacilityID": "77511QNTMC2MILE",
  "EPAFacilityID": "100000106459",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.26444,
  "FRS_Long": -95.20778,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10388,
      "AltID": "HDPE Production Plant",
      "FacilityID": 8572,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 11555,
          "ProcessID": 10388,
          "ChemicalID": 155,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 778,
              "ProcessChemicalID": 11555,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 779,
              "ProcessChemicalID": 11555,
              "ChemicalID": 95
            }
          ]
        },
        {
          "ProcessChemicalID": 11556,
          "ProcessID": 10388,
          "ChemicalID": 119,
          "Quantity": 380000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 11557,
          "ProcessID": 10388,
          "ChemicalID": 107,
          "Quantity": 1200000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 11558,
          "ProcessID": 10388,
          "ChemicalID": 95,
          "Quantity": 200.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10628,
          "ProcessID": 10388,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 4749,
              "Process_NAICS_ID": 10628,
              "SafetyReviewDate": "1998-10-12 00:00:00",
              "PHA_Date": "1997-11-07 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-02-16 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 0,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-09 00:00:00",
              "TrainingReviewDate": "1999-04-29 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Computer based training",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-03-01 00:00:00",
              "EquipmentInspectionDate": "1999-02-08 00:00:00",
              "EquipmentTested": "Vent Compressor EC201-2",
              "ChangeMgmtDate": "1999-04-23 00:00:00",
              "ChangeMgmtReviewDate": "1996-08-12 00:00:00",
              "PreStartupReviewDate": "1999-04-27 00:00:00",
              "ComplianceAuditDate": "1999-06-01 00:00:00",
              "AuditCompletionDate": "1999-12-31 00:00:00",
              "IncidentInvestigationDate": "1999-04-12 00:00:00",
              "InvestigationChangeDate": "1999-07-31 00:00:00",
              "ParticipationPlansReviewDate": "1999-03-09 00:00:00",
              "HotWorkPermitReviewDate": "1997-05-12 00:00:00",
              "ContractorSafetyReviewDate": "1998-02-02 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-27 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Equistar Chocolate Bayou Polymers Plant fully integrated High-Density Polyethylene Resin production facility.  It consists of only one production unit, which has been determined to be subject to Program Level 3.  All of the appropriate safeguards associated with the type of chemicals being handled are applied uniformly across the plant.  Everything in this prevention program applies to the entire facility.",
              "_chemicals": [
                {
                  "PrimaryKey": 5522,
                  "PreventionProgram3ID": 4749,
                  "ProcessChemicalID": 11555
                },
                {
                  "PrimaryKey": 5523,
                  "PreventionProgram3ID": 4749,
                  "ProcessChemicalID": 11556
                },
                {
                  "PrimaryKey": 5524,
                  "PreventionProgram3ID": 4749,
                  "ProcessChemicalID": 11557
                },
                {
                  "PrimaryKey": 5525,
                  "PreventionProgram3ID": 4749,
                  "ProcessChemicalID": 11558
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8572,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1997-12-30 00:00:00",
    "ERTrainingDate": "1999-02-10 00:00:00",
    "CoordinatingAgencyName": "Brazoria County LEPC",
    "CoordinatingAgencyPhone": "8003924321",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8572,
      "SummaryText": "Risk Management Plan Executive Summary\nEquistar Chemicals, LP\nChocolate Bayou Polymers Plant\n\n1. Purpose\n\nThis document describes the Equistar Chemicals Chocolate Bayou Polymers Plant's philosophy and procedures for managing risk to employee health, public safety and to the environment.  It is intended to be just a summary of the many policies, procedures and actions that are taken to prevent or mitigate the potential release of chemicals listed under EPA 40 CFR 68 Accidental Release Prevention Requirements: Risk Management Programs (RMP) Under the Clean Air Act, Section 112(r)(7).\n\n2. Plant Overview\n\nThe Equistar Chocolate Bayou Polymers Plant is a High-Density Polyethylene Resin production facility.  It manufactures a range of differing molecular weight High-Density Polyethylene (HDPE) Resins used in the manufacturing of plastic products.  The complex consists of two parallel reactor trains operated as a single process.  Ethylene and applicable co-monomers are dissolved in isobutane and polymerized to HDPE by the addition of suitable catalyst.  The reaction is carried out in loop-type reactors operated at elevated pressure and temperature; there, the reaction mixture is circulated at a high velocity.  Feed ethylene, co-monomers, isobutane, hydrogen, catalyst, and co-catalyst are added continuously to the system as the product is withdrawn.  A portion of the reactor slurry is circulated through external hydroclones to concentrate the slurry and therefore reduce the amount of isobutane, which is recycled.  The polymer is continuously removed as a slurry and processed into HDPE pellets.  The ethylene feedstock is transported to the facility by pipeline, other  process chemicals are transported to the facility by tank truck or in shipping containers.\n\n\n3. Accidental Release Prevention and Emergency Response Policies\n\nEquistar is committed to employee, public and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8572,
      "SummaryText": " that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at Equistar.  It is our policy to implement appropriate controls to prevent and mitigate possible releases of regulated substances.  Unforeseeably, if such a release does occur, our trained emergency response personnel are on hand to control and mitigate the effects of the release.  We also coordinate with the Chocolate Bayou Mutual Aid Group which provides additional emergency response resources.\n\n4. The Stationary Source and the Regulated Substances Handled\n\nThe Equistar Chocolate Bayou Polymers Plant encompasses the manufacturing of High-Density Polyethylene (HDPE).  In the process of making HDPE, several regulated substances are used in a flammable mixture, comprising of three (3) regulated flammable substances above the threshold quantity.  The three (3) regulated flammable substances are: 1-Butene, Ethylene and Isobutane.  No regulated toxic substances are used above the threshold quantity at the Equistar Chocolate Bayou Polymers Plant.\n\n5. The Worse-Case Release Scenarios and the Alternative Release Scenarios, including administrative controls and mitigation measures to limit the distances for each scenario\n\nMethodology given in the RMP Offsite Consequence Analysis Guidance by the EPA and the EPA RMP*Comp computer software were employed by Equistar to perform worst and alternative case release scenarios.  The following paragraphs provide details of the chosen scenarios.\n\nA.  Flammable Worse-Case Release Scenario\n\nThe worse-case release scenario submitted for Program 3 flammable substances involves a catastrophic release of an entire Isobutane storage bullet.  The scenario assumes the complete loss of containment of 453,000 lb. of Isobutane which vaporizes, finds an ignition source, with 10 percent of the released quantity participating in a vapor cloud explosion.  Under worse-case weather conditions, the maximum distance exce"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8572,
      "SummaryText": "eds the plant fence line with an endpoint of 1 psi overpressure.\n\n    D.  Flammable Alternative Case Release Scenario\n\nThe alternative release scenario submitted for Program 3 flammable substances involves the shaft seal failure of a reactor elbow pump.  The scenario assumes the release of 76,000 lb. of Isobutane, which vaporizes, finds an ignition source, with 10 percent of the released quantity participating in a vapor cloud explosion.  Under worse-case weather conditions, the maximum distance exceeds the plant fence line with an endpoint of 1 psi overpressure.  \n\nFor the worse-case flammable release scenario and for the alternative flammable release scenario, no credit was taken for active mitigation and emergency response actions that would normally occur to prevent or reduce the possible releases.  Such active mitigation measures that are in-place are: Tandem shaft seals on pumps, vapor detection systems to alert operating personnel of a hydrocarbon release, process controls and interlocks, fire water monitors and deluge systems, and a fully trained emergency response fire brigade.\n\n6. The General Accidental Release Prevention Program and the Chemical Specific Prevention Steps\n\nEquistar has taken the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68.  This facility was designed, constructed, and is maintained in accordance with many national Codes and Standards too numerous to mention in this short summary.  Codes or Standards from the following major organizations are used: ASME, ANSI, API, IEEE, NFPA, ASTM and ISA.  The reactor portion and associated feed/catalyst preparation/purification areas of the HDPE process at the Equistar Chocolate Bayou Polymers Plant are subject to the OSHA PSM standard under 29 CFR 1910.119.  The HDPE pellet finishing, blending and storage areas are not a covered process due to the lack of a threshold quantity of OSHA regulated chemicals.\n\nThe following sections briefly describe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8572,
      "SummaryText": " the elements of the release prevention program in place at Equistar.\n\nProcess Safety Information\nEquistar maintains a record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazards Analysis\nEquistar conducts studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out the analysis is referred to as a Unit Process Hazards Analysis (PHA).  A team of qualified personnel with expertise and knowledge of the process technology and plant operations undertake the studies.  A person knowledgeable of the PHA process being used leads the team.  Any findings related to the PHA are addressed in a timely manner.\n\nOperations Procedures\nFor the purposes of operating our facilities safely, Equistar maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency operations, emergency shutdown, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operating technicians involved with the process.\n\nTraining\nEquistar has a training program in place to ensure that employees that are operating processes are competent in the operating procedures associated with these processes.  New employees receive basic training in process operations followed by on-the-job supervision along with additional training until they are qualified to work independently.  Refresher training is provided at least every three years and more frequently as needed.\n\nMechanical Integrity\nEquistar carries out documented maintenance inspections and testing of process equipment and controls to ensure proper functions.  Process equipment examined by these inspections and checks includes among others; pressure vessels, storage tanks, piping systems, relief valves and flare systems, p"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8572,
      "SummaryText": "umps, compressors and firewater deluge/monitor systems.  Some instruments that are inspected and checked include; emergency shutdown systems, interlocks and alarms, process controls, and vapor detection systems.  Only qualified maintenance personnel who have received previous training in maintenance practices are allowed to carry out maintenance.  Furthermore, these personnel are offered specialized training as needed.  Equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Equistar to manage changes to the process chemicals, technology, equipment and procedures.  Process operating technicians, maintenance personnel or any other employee whose task are affected by a modification in process conditions are promptly made aware, and trained as needed, of the change.\n\nPre-Startup Safety Review\nPre-Startup Safety Reviews related to new processes and to modifications to existing processes are conducted as a regular practice at Equistar.  These reviews are conducted to confirm that the facility's construction, equipment, and the operating/maintenance procedures are suitable for safe startup prior to placing the equipment into service/operation.\n\nCompliance Audits\nEquistar conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out annually and corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigations\nEquistar investigates any incident that has resulted in, or could reasonably have resulted in, an employee injury or a catastrophic release of a hazardous material.  These investigations are undertaken to identify the root cause leading to the incident as well as identify any corrective actions needed to prevent reoccurrence.\n\nEmployee Participation\nEquistar believes that process safety management and accident prevention "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 8572,
      "SummaryText": "is a team effort.  All company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, many of the various elements of the release prevention program require employee participation as the normal procedure for implementation of that element.  All employees have access to all information created as a part of the facilities implementation to the RMP rule, particularly information resulting from the process hazards analysis.\n\nHot Work Permits\nAt Equistar all hot work on covered processes requires an approved Hot Work Permit.  Employees and contractors are trained to recognize when a Hot Work Permit is required and in how to initiate obtaining such a permit.  Operations technicians ensure that the required Hot Work Permit safety precautions are fully implemented prior to signing the permit and allowing work to begin.  Personnel affected by the Hot Work Permit Procedure receive specific procedural training on an annual basis.\n\nContractors\nWhen selecting a contractor, a thorough evaluation of the safety performance of the contractor is carried out to determine if the contractor should even be allowed to submit a proposal.  Additionally, Equistar routinely monitors the safety performance of all our contractors to ensure adequate performance.  Equistar has a strict policy of informing the contractors of known potential hazards related to the contractors work and to the potential process hazards of the area the contractor will be working in.  Contractors are also informed of the procedural actions that they are to take during an emergency response situation.\n\n7. Five Year Accident History\n\nDue to our release prevention policies, there has been no accidental release of substances regulated by the RMP rule, in the last 5 years, that had an onsite or offsite impact as described under EPA 40 CFR Part 68.42(a).  As a matter of course, Equistar reports and investigates all incidents.  \n\n8. Emergency"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 8572,
      "SummaryText": " Response Plan\n\nEquistar has in place a written Emergency Response Plan to deal with accidental releases of hazardous materials.  The plan includes many aspects of emergency response including; fire fighting, adequate first aid and medical treatment, shelter in place, evacuations, notification of Brazoria County Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified, and notification of the public through our Community Alert Network (CAN) system.  Our CAN system is an automatic phone system that calls all neighbor phones with a recorded message that provides key actions to be taken in the event of an emergency.  The plant also has an online computer release modeling system called \"Safer\" which uses current meteorological data and chemical release information to predict the direction, distance and concentration of the release plume.  Additionally, the Equistar Chocolate Bayou Polymers Plant has a program call Special Situations Plan (SSP) which is an emergency assistance program of plant personnel to the surrounding community.  The SSP is activated anytime an emergency could possibly have effects off the plant site.\n\nTo ensure proper functioning, our emergency response plans are periodically drilled and practiced.  Our emergency response equipment is regularly inspected and serviced.  And of course, the plan is reviewed and updated as needed to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n9. Planned Changes to Improve Safety\n\nSeveral developments and findings have resulted from the implementation of various elements of our accidental release prevention program.  The following are just some of the items that were identified during unit PHAs and are being planned for installation.\n7 Installation of additional process alarms\n7 Installation of additional interlocks and shutdown systems\n7 Installation of additional relief protection\n7 Revision of operat"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 8572,
      "SummaryText": "ing procedures to ensure maintaining correct process levels"
    }
  ]
}