{
  "FacilityID": 8600,
  "FacilityName": "Carter-Wallace, Inc. - Dayton Dist. Center",
  "FacilityStr1": "30 Tower Road",
  "FacilityStr2": null,
  "FacilityCity": "Dayton",
  "FacilityState": "NJ",
  "FacilityZipCode": "08810",
  "Facility4DigitZipExt": "1571",
  "FacilityCountyFIPS": "34023",
  "LEPC": "South Brunswick Township OEM",
  "FacilityLatDecDegs": "40.373333",
  "FacilityLongDecDegs": "-74.469361",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A6",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1223445,
  "ParentCompanyName": "Carter-Wallace, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1223445,
  "Company2DUNS": 0,
  "OperatorName": "Carter-Wallace, Inc.",
  "OperatorStr1": "Half Acre Road",
  "OperatorStr2": null,
  "OperatorCity": "Cranbury",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08512",
  "OperatorZipCodeExt": null,
  "RMPContact": "Richard J. Majos",
  "RMPTitle": "Vice President, SHEA",
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000107635",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-04-25 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2002-06-03 00:00:00",
  "DeRegistrationEffectiveDate": "2002-05-15 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.37,
  "FRS_Long": -74.46607,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10422,
      "AltID": "Aerosol Warehouse",
      "FacilityID": 8600,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 10663,
          "ProcessID": 10422,
          "NAICSCode": "49311",
          "_desc": {
            "NAICS_CODE": "49311",
            "NAICS_DESCRIPTION": "General Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 11596,
          "ProcessID": 10422,
          "ChemicalID": 155,
          "Quantity": 532000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 790,
              "ProcessChemicalID": 11596,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 791,
              "ProcessChemicalID": 11596,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 11597,
          "ProcessID": 10422,
          "ChemicalID": 155,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 792,
              "ProcessChemicalID": 11597,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 793,
              "ProcessChemicalID": 11597,
              "ChemicalID": 111,
              "_chemical": {
                "ChemicalID": 111,
                "ChemicalName": "Difluoroethane  [Ethane, 1,1-difluoro-]",
                "CASNumber": "75-37-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 511596,
          "ProcessID": 10422,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 511597,
          "ProcessID": 10422,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8600,
      "SummaryText": "\nBACKGROUND\n\nCarter-Wallace, Inc. is engaged in the manufacture and sale of a diversified line of Consumer  and Health Care products.  Carter-Wallace began its operations at the Dayton Distribution Center in April 1992.  The Dayton Distribution Center consists of administrative offices, warehouse storage and shipping areas.  There are no manufacturing activities at this location.\n\nThe Dayton Distribution Center includes 200,000 square feet of warehouse storage capacity  and is situated in a commercial zone surrounded by several other distribution facilities.  The warehouse operates five days per week, eight hours per day, and employs 50 people.\n\nFACILITY DESCRIPTION\n\nThe operations affected by the risk management plan (RMP) involve the receipt and storage of aerosol product in consumer size containers. Product is moved within the warehouse via forklift trucks.\n\nVarious hydrocarbons are used as propellants in the aerosol product.  The hydrocarbons propellants are defined by both the US Environmental Protection Agency (USEPA) and the New Jersey Department of Environmental Protection (NJDEP) as hazardous materials.  The NJDEP and USEPA enforce regulations designed to minimize the potential for an accidental release associated with handling hazardous materials.  Additionally, the US Occupational Safety and Health Administration (OSHA) enforces accident prevention regulations to protect employees.  The aerosol product propellants are listed as hazardous due to flammability. \n\nACCIDENT HISTORY\n\nThe warehousing and distribution operations have not had any significant releases of regulated materials or accidents during the five year accident review period.  A significant release includes incidents resulting in offsite injuries, environmental impact, or evacuations, or onsite injuries or significant property damage.\n\nHAZARD ASSESSMENT\n\nNJDEP and USEPA accident prevention regulations require companies to analyze what is defined as  worst case and alternative case release scen"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8600,
      "SummaryText": "arios.\n\nThe worst case release scenario is defined as the sudden loss of containment of material in the largest tank, vessel or container.  The worst case scenario assumes the sudden release of aerosol from a case of consumer packaged product.  The alternative release scenario also assumes the release of aerosol from consumer packaged products.  The worst case release scenario assumes that several highly unlikely events occur simultaneously such as:\n\n7 Catastrophic failure of aerosol cans within a case;\n7 Failure of all automated safety and alarm systems;\n7 Failure of our trained and experienced operators to respond appropriately; and\n7 The event occurs during least likely stagnant meteorological conditions.\n\nCarter-Wallace used USEPA developed guidance (Risk Management Program Guidance for Warehouses) to complete the modeling for both scenarios.  The modeling shows that there would be no impact on the surrounding community from either the worst case or alternative case release scenarios.\n\nThese results classify the Dayton Distribution Center as a USEPA defined Program 1 facility which presents a minimal risk to the community.  Other Program levels include Program 2 and Program 3.  Program 3 includes those facilities that may present some risk to the community and / or includes facilities subject to OSHA's Process Safety Management (PSM) program.  The PSM program regulates the use of hazardous materials by identifying and managing the potential release of hazardous materials in order to protect employees.\n\nHowever, the NJDEP RMP does not include Program 1 requirements within its regulations, despite the fact that the worst case release scenario shows no impact to the surrounding community.  Since the Dayton Distribution Center is subject to the OSHA PSM program, the distribution center is classified as a Program 3 facility.\n\nPREVENTION PROGRAMS\n\nCarter-Wallace has developed programs to comply with the required environmental, health and safety standards. \n\nWe take a "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8600,
      "SummaryText": "systematic, proactive approach to preventing accidental releases of hazardous chemicals through process management systems and programs which include: \n\n- Process safety information\n- Pre-startup review\n- Process hazard analysis\n- Compliance audits\n- Operating procedures\n- Accident investigation\n- Training\n- Employee participation\n- Mechanical integrity\n- Hot work permit\n- Management of change\n- Contractor safety\n\nIn addition to our management programs, specially designed systems to control, prevent, detect, and mitigate potential accidental releases are also in place.  These include an early  suppression, fast response sprinkler system installed throughout the warehouse.  Aerosol storage racks are equipped with in-rack sprinkler systems and specially designed automatically controlled forklift trucks are used to move aerosol product among the aisles in the aerosol warehouse.  All of our forklift operators are trained and certified.  Our firewater and sprinkler systems are inspected annually by an outside independent company.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nCarter-Wallace strives for continuous improvement of its safety program.  We train our employees to safely perform their assigned tasks.  We encourage our employees to suggest changes or improvements that will help minimize the potential for unanticipated failure of operating equipment including the forklift trucks.  Our systems and programs are routinely audited, typically by an outside company, to evaluate their effectiveness.\n\nWe have recently reviewed and modified our prevention program elements.  We are presently reviewing  our equipment and procedures recommendations identified during a process hazard analyses performed by an independent expert with the participation of our facility personnel.\n\nEMERGENCY PREPAREDNESS AND RESPONSE\n\nCarter Wallace has an emergency response plan detailing procedures to respond to accidental releases and other emergencies.  Our plan is tested on a regular basis through exerc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8600,
      "SummaryText": "ises and drills.  Our plan has been shared with the  local Office of Emergency Management for South Brunswick Township. \n\nIn the event of an emergency affecting the local community, Carter-Wallace will work closely with local, county and stage agencies to help ensure public safety.  These agencies take the lead in informing the public on appropriate actions in the event of an emergency."
    }
  ]
}