{
  "FacilityID": 8718,
  "FacilityName": "Willoughby Quartz Plant",
  "FacilityStr1": "4901 Campbell Road",
  "FacilityStr2": null,
  "FacilityCity": "Willoughby",
  "FacilityState": "OH",
  "FacilityZipCode": "44094",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39085",
  "LEPC": "Lake County LEPC",
  "FacilityLatDecDegs": "41.625",
  "FacilityLongDecDegs": "-81.445556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 556829349,
  "ParentCompanyName": "GE Quartz Inc.",
  "Company2Name": "General Electric Company",
  "CompanyDUNS": 1367960,
  "Company2DUNS": null,
  "OperatorName": "Willoughby Quartz Plant",
  "OperatorStr1": "4901 Campbell Road",
  "OperatorStr2": null,
  "OperatorCity": "Willoughby",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44094",
  "OperatorZipCodeExt": null,
  "FTE": 290,
  "OtherEPAFacilityID": "44094GNRLLEUCLI",
  "EPAFacilityID": "100000110293",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "0243160086",
  "SafetyInspectionDate": "1997-10-14 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.62392,
  "FRS_Long": -81.44688,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10576,
      "AltID": "HF Storage/Delivery",
      "FacilityID": 8718,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 11776,
          "ProcessID": 10576,
          "ChemicalID": 55,
          "Quantity": 170000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10824,
          "ProcessID": 10576,
          "NAICSCode": "327999",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 5177,
              "Process_NAICS_ID": 10824,
              "SafetyReviewDate": "1999-03-12 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "NFPA Volumes 1 - 10; National Electric Code",
              "FR_Comments": null,
              "HazardReviewDate": "1999-04-22 00:00:00",
              "ChangeCompletionDate": "1999-06-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Tank farm area has a deluge system",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-12 00:00:00",
              "TrainingReviewDate": "1999-03-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-12 00:00:00",
              "EquipmentInspectionDate": "1996-11-01 00:00:00",
              "EquipmentTested": "Installation of new storage tanks",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-04-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 5353,
                  "PreventionProgram2ID": 5177,
                  "ProcessChemicalID": 11776
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8718,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Willoughby Fire Department",
    "CoordinatingAgencyPhone": "4409534343",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8718,
      "SummaryText": "INTRODUCTION\n\nThis Risk Management Plan is part of the continuing commitment of GE Quartz, Inc. (GE Quartz) to minimize the potential impact from our facility on our workers, our community neighbors, and the environment.  It is the stated policy of GE Quartz to safely manage our site operations.  In addition, we have prepared contingency plans to be used in the unlikely event that an accident should occur. \n\nWe believe it is important for all interested parties to have access to information that can help them better understand our business and our facility.  If you have any questions about this document, or any other aspect of our company or our plans, please contact our Community Relations Representative at (216) 266-2185. \n \nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nOur company is committed to operating safe and environmentally sound manufacturing facilities everywhere we do business.  Protection of our neighbors and workers is the highest priority.  This ongoing commitment to worker and public safety is demonstrated through resources invested for safe design, operation, and maintenance of our facilities.  \n\nIn order to provide top quality products for our customers, the GE Quartz Willoughby Plant uses in its manufacturing process a chemical, hydrofluoric acid (HF) that is classified as toxic.  We are committed to complying with governing laws, regulations, and prevailing engineering standards as well as systematic assessments to manage and maintain a safe operation when using this chemical.   Our operating practices and procedures ensure that multiple controls are implemented to prevent an accidental release of this chemical.  However, in the unlikely event that a major release would occur, we immediately notify the appropriate emergency responders, such as the local Emergency Response Team of the Fire Department. \n\nDESCRIPTION OF THE FACILITY AND REGULATED SUBSTANCES\n\nThe GE Quartz facility located at 4901 Campbell Road in Willoughby, Ohio p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8718,
      "SummaryText": "roduces quartz crucibles and tubes for use in commercial applications such as semi-conductor equipment.  Silica sand is used as the primary raw material to produce these products.  The sand must be properly prepared in order to obtain the quality required in the final product.  Aqueous hydrofluoric acid (HF) is used in one of the preparation steps in making these products.  In the Powder Area, HF is used to purify the silica sand raw material.  Silica sand, 70% HF, hydrochloric acid and water are loaded into a mechanical \"tumbler\" where the mixture is mixed and washed for a specified period of time. After the washing process, the washed sand, an acid byproduct and spent acid are removed from the tumbler for final treatment.  The spent acid is neutralized on-site.\n\nIn the Large Diameter Area, tube products are washed and cleaned by immersing the products in a dilute HF solution.  One-gallon bottles of HF are used in this area.  Although this process is not regulated by RMP program GE Quartz still follows good operating practices to maintain safe conditions in this area. \n\nThe HF used on site is received by a delivery tanker truck from which it is transferred to one of two storage tanks that are under roof and surrounded by a containment dike.  Truck off-loading takes place on a depressed ramp that also acts as a containment system.  When needed, HF is pumped from the storage tank through hard pipe to the tumbler area within the plant.  Interlocks and administrative controls require the addition of water to the tumbler before acid can be added.  Therefore, the acid is diluted as it is added to the tumbler. \n\nHAZARD ASSESSMENT RESULTS\n\nAs part of our risk management planning, we have identified the type of event that, should it ever occur, would have the most negative impacts on our workers and our neighbors.  This is known as the Worst-Case Scenario (WCS).   As defined by the United States Environmental Protection Agency (EPA), under this scenario we are required to a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8718,
      "SummaryText": "ssume that the numerous engineering and administrative safety controls we have in place to prevent or mitigate such accidents have all failed at once. \n\nThis worst-case scenario would involve the release of a 70% HF from one of the two storage tanks.  The worst-case scenario assumes a catastrophic failure is an event that result in the instantaneous release of the entire vessel volume.  In this event, this would be up to 100,000 pounds of the 70% HF acid which would be released into the containment dike.  After such a release, the acid is assumed to evaporate with the vapors dispersing in the direction of the prevailing wind.  According to EPA guidelines, exposure to HF at levels above 20 parts per million (20 parts HF in a million parts of air) for approximately one hour can result in serious health effects.  Consequently, the worst-case scenario estimates the distance that this concentration of HF could reach as a result of this quantity of HF being instantaneously released from the storage tank. \n\nA scenario using more realistic assumptions involves the failure of a hose used to transfer the 70% HF acid from the tank truck to the storage tank.  EPA defines this as the Alternative Release Scenario (ARS).  Under this more realistic scenario, the contents of the transfer pipe, and a limited amount of material from the delivery tank truck, would drain into the containment dike of the truck off-loading area forming a pool that would evaporate.  The total amount of HF released in this scenario is 100 pounds from the transfer line and 7100 pounds from the tank truck. \n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM/ CHEMICAL-SPECIFIC PREVENTION STEPS\n\nGE Quartz has a comprehensive program to prevent accidental releases of highly hazardous chemicals at its Willoughby Plant.  This prevention program is an integral part of the safe working practices at GE Quartz.  The prevention program ensures that proper safety information is in place; operating procedures are followed; c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8718,
      "SummaryText": "hemical hazards are identified; employees and contractors are trained; and critical equipment is properly inspected and maintained.  Our prevention program meets all aspects of the accidental release prevention program requirements of the EPA's Risk Management Program.\n\nGE Quartz is engaged in an aggressive and comprehensive effort to identify and address Year 2000 issues.  We are in the process of inventorying our equipment at the site, interviewing suppliers, putting into place corrective actions where necessary, and developing a contingency plan.  We are on track to complete this process prior to the critical roll-over date and believe we have addressed the systems and equipment necessary for safe site operation.\n\nIn addition to assuring that all aspects of our operation are Year 2000 compliant, there are many specific safety features in place at the facility.  Some of the features in place at the Willoughby GE Quartz Plant to prevent a chemical accident include:\n\nSafety procedures that reduce the potential for human error which could lead to a storage tank overfill;\nSecondary containment dikes at the tank truck off-loading area to contain potential spills from the tank truck;\nSecondary containment dikes around the chemical storage tanks to contain a spill;\nOperation of a fume scrubbers at the chemical storage area;  \nExtensive safety information about chemical processes made available to employees;\nWritten operating procedures that identify plant policies on emergency response actions;\nComprehensive employee and contractor training programs to promote consistently safe work-practices;\nMaintenance programs to ensure ongoing equipment reliability - includes equipment testing and inspection;\nCompliance auditing to ensure standards are being followed;\nA safety procedure to review proposed plant modifications before they are implemented for possible hazards; and\nSafety reviews prior to startup of our processes. \n\nFIVE YEAR ACCIDENT HISTORY\n\nThe GE Quartz Plant has a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8718,
      "SummaryText": "record of accident prevention that demonstrates its commitment to public and worker safety.  Even minor incidents are investigated to identify what went wrong and to learn how to prevent future occurrences.  \n\nThe RMP requires that all incidents involving regulated chemicals that resulted in any off-site impact or significant on-site impacts be reported in this document.  GE Quartz has had no releases of HF acid at the Quartz Plant within this 5-year history that resulted in any on-site or off-site impacts as defined by EPA. \n\nPARTICIPATION IN EMERGENCY RESPONSE \n\nThe GE Quartz Plant is included in the community response plan of the Local Emergency Planning Commission.  Plant staff are trained as first responders to a spill and the Plant has agreements with spill contractors for emergency response assistance.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nGE Quartz is committed to continuously improving the overall safety and environmental performance record at the Willoughby Quartz Plant.   Some of the specific planned changes aimed at improving this performance are:  \nContinuing development of best management practices;\nConducting a site-specific drill and training with the fire department and Local Emergency Planning Committee."
    }
  ]
}