{
  "FacilityID": 8721,
  "FacilityName": "Lake County Water Treatment East",
  "FacilityStr1": "1845 Lake Road",
  "FacilityStr2": null,
  "FacilityCity": "Painesville",
  "FacilityState": "OH",
  "FacilityZipCode": "44077",
  "Facility4DigitZipExt": "4665",
  "FacilityCountyFIPS": "39085",
  "LEPC": "Lake Co. Emerg. Mgmnt. Agency",
  "FacilityLatDecDegs": "41.766889",
  "FacilityLongDecDegs": "-81.220417",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "Z2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Lake County Commissioners",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Lake County Department of Utilities",
  "OperatorStr1": "105 Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Painesville",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44077",
  "OperatorZipCodeExt": "0465",
  "RMPContact": "John Spetrino",
  "RMPTitle": "Superintendent",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000110382",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-09-09 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Lake County Water East",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP Pro 98",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.76991,
  "FRS_Long": -81.21459,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10579,
      "AltID": "Liquid Chlorine",
      "FacilityID": 8721,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 10827,
          "ProcessID": 10579,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 11779,
          "ProcessID": 10579,
          "ChemicalID": 62,
          "Quantity": 4052.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 511779,
          "ProcessID": 10579,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8721,
      "SummaryText": "Lake County Water Treatment Facility East\nEPA Risk Management Plan\n\"Executive Summary\"\n\nThe managers and employees of the Lake County Department of Utilities are strongly committed to the safety and health of the people of our communities, employees, and environment.  This commitment is demonstrated at the Lake County Water Treatment Facility East by consistently meeting and exceeding, the many stringent regulatory requirements and standards we face daily for water quality and safety.\nOur facility's primary activity is the treatment and disinfection of potable water.  Our current treatment technique uses chlorine as the main disinfectant.  It is delivered by semi-truck in one ton containers.  Once it arrives onto our property, trained and qualified employees follow simple procedures to safely unload and store the chlorine.  Using proper safety equipment & techniques, the cylinders are unloaded by crane from the truck into a specially designed enclosed storage room where they are stored until they are needed for the treatment process.  The storage and feed room are constructed of fire resistant materials and are designed to help contain the material in the unlikely event of a leak.  All material and equipment in the process are specifically designed and installed for the express purpose of handling the regulated substance.  There are also specially designed sensors in the storage and feed rooms that are connected to various alarms that are conveniently located throughout the facility to alert plant personnel if a leak were to occur.   \nIn order to meet EPA inventory requirements, we have no more than five (5) containers on site at any given time. Two (2) of these containers are kept on scales connected to the chemical feed process at any given time to ensure proper disinfection of the water our customers and their families consume. \nIt is our responsibility and commitment to our communities, employees, families, and environment, to implement appropriate controls to e"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8721,
      "SummaryText": "nsure the prevention of possible releases of any substances or chemicals that may potentially affect life or health. This is covered in our accidental release prevention program, which is part of our Emergency Operating Procedures and the plant's Operating and Maintenance manuals. The program covers areas such as hazard communications, facility and equipment design, equipment installation, operating procedures, chemical hazard awareness, maintenance, and employee training associated with the various processes at our facility. Our employees participation and input have led to the refinement of these procedures.  As a result of the expertise of our employees and the procedures they use, we have had an excellent record with no accidental releases over the last five (5) years.\nOur responsibility to safety is further demonstrated by continually reviewing options which may reduce risks. We are also considering an engineering study for the possible replacement of chlorine with a different chemical for disinfection.  \nIn spite of our record, and all the effort and time that we have invested in improving the process of handling chlorine at our facility, we know the risk of a chlorine leak, although small, is still possible.  Another step we have taken to further ensure the safety of our community and employees is to use the EPA's software program for calculating theoretical release scenarios under our plant's current design conditions.  While it is a highly improbable event to release the complete process inventory in a gaseous form over a ten (10) minute period, this program estimates that a release of this magnitude could spread up to a maximum distance endpoint of 3.0 miles.  \nAnother theoretical alternative release scenario calculation would be a release of approximately 2.1 pounds of chlorine in a gaseous form over thirty (30) minutes due to equipment failure.  An event like this could spread to a maximum distance endpoint of less than 0.1 mile.  \nUnforeseeably, if such"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8721,
      "SummaryText": " a release would occur, we are completely coordinated with Painesville Township Fire Department in conjunction with the Lake County Hazard Intervention Team, which provides highly trained emergency response personnel, to control and mitigate the effects of any such release.\n\nCertification Statement\nTo the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\nName: John J. Spetrino\n\nSignature:\n\nTitle: Superintendent\n\nDate signed:\n\n"
    }
  ]
}