{
  "FacilityID": 8743,
  "FacilityName": "Plum Creek Manufacturing Columbia Falls MDF",
  "FacilityStr1": "500 12th Avenue West",
  "FacilityStr2": null,
  "FacilityCity": "Columbia Falls",
  "FacilityState": "MT",
  "FacilityZipCode": "59912",
  "Facility4DigitZipExt": "1990",
  "FacilityCountyFIPS": "30029",
  "LEPC": "Flathead County LEPC",
  "FacilityLatDecDegs": "48.3775",
  "FacilityLongDecDegs": "-114.204167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.plumcreek.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 627555626,
  "ParentCompanyName": "Plum Creek Timber Company",
  "Company2Name": null,
  "CompanyDUNS": 604382754,
  "Company2DUNS": null,
  "OperatorName": "Plum Creek Manufacturing",
  "OperatorStr1": "P.O. Box 1990",
  "OperatorStr2": null,
  "OperatorCity": "Columbia Falls",
  "OperatorStateFIPS": "MT",
  "OperatorZipCode": "59912",
  "OperatorZipCodeExt": "1990",
  "FTE": 140,
  "OtherEPAFacilityID": "59912PLMCRPOBOX",
  "EPAFacilityID": "100000109642",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "OP-2667-00",
  "SafetyInspectionDate": "1998-09-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 48.37339,
  "FRS_Long": -114.19732,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10616,
      "AltID": null,
      "FacilityID": 8743,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 11823,
          "ProcessID": 10616,
          "ChemicalID": 56,
          "Quantity": 83166.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10867,
          "ProcessID": 10616,
          "NAICSCode": "321219",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 4915,
              "Process_NAICS_ID": 10867,
              "SafetyReviewDate": "1999-06-14 00:00:00",
              "PHA_Date": "1999-05-27 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Stack monitor",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-14 00:00:00",
              "TrainingReviewDate": "1999-06-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-14 00:00:00",
              "EquipmentInspectionDate": "1999-06-08 00:00:00",
              "EquipmentTested": "All major components of ammonia system visually inspected",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-14 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-14 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-14 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-14 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 5725,
                  "PreventionProgram3ID": 4915,
                  "ProcessChemicalID": 11823
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8743,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-14 00:00:00",
    "ERTrainingDate": "1998-07-31 00:00:00",
    "CoordinatingAgencyName": "Flathead County LEPC",
    "CoordinatingAgencyPhone": "4067585561",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 10,
      "FacilityID": 8743,
      "SummaryText": "quire that an Accidental Release Emergency Response Plan be prepared. The plan must be prepared in accordance with the provisions of another overlapping OSHA regulation-Employee Emergency Plans (29 CFR 1910.38(a)). In addition, provisions of the OSHA hazardous waste and emergency response standard, 29 CFR 1910.120 (q) must also be considered. The Emergency Planning and Response Plan described in this section complies with the requirements of 40 CFR 68.90 and 29 CFR 1910.38(a). The facility is a non-responding facility in accordance to definitions for responding and non-responding facilities as defined in the RMP/PSM regulations. \n\nThe Plum Creek Columbia Falls MDF facility emergency action plan provides specific emergency response procedures for accidental releases of ammonia. The emergency response procedures cover a release from the initial discovery through evacuation."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 8743,
      "SummaryText": "Facility Background\n\nThe Plum Creek Columbia Falls, Montana complex consists of a log yard, a sawmill, a plywood mill and a medium density fiberboard (MDF) facility.\n\nIn the MDF process, sawdust and planer shavings are refined into fine cellulose fibers.  These fibers are then mixed with urea formaldehyde resin and dried to the proper moisture content.  The dried fibers are then formed into a mat and pressed into MDF panels.  These panels are sanded, cut to final size, and packaged for shipment.\n\nIn the MDF process ammonia is added to the MDF panels where the ammonia reacts with the free formaldehyde to bind the formaldehyde to prevent future formaldehyde off gassing.  Liquid ammonia is transferred from the ammonia storage tank through a pump to a vaporizer. In the vaporizer the ammonia is converted from a liquid to a gas. From the vaporizer the gaseous ammonia goes through a filter and flow control instrumentation to the vacuum treatment chamber where the ammonia is pulled through the MDF panels and reacts with the formaldehyde. Any unreacted ammonia then goes through a baghouse filter to a vacuum pump, then is discharged to the atmosphere through a vent stack.   \n\nPlum Creek management is committed to a zero injuries/illness approach to safety. All accidents, injuries, and occupational illnesses are considered to be preventable and the causes leading to them are manageable. Assurance of a safe and healthy environment is everyone's responsibility. Plum Creek has comprehensive written safety, health, and environmental programs and procedures. Safety, health, and environmental professionals from the regional office are assigned to the facility.\n\nIntroduction\n\nThe Clean Air Act Amendments of 1990 included provisions that require facilities that use certain substances above a threshold amount to develop a plan to reduce the likelihood of an accidental release of the substances to the atmosphere and reduce the likelihood of serious harm to the public and environment. Th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8743,
      "SummaryText": "e plan must also include mitigation measures to reduce the potential impact on the public in the unlikely event of a release. The requirements of the plan, commonly referred to as a Risk Management Plan (RMP), are detailed and codified in 40 Code of Federal Regulations (CFR) Part 68.\n\nThe Plum Creek AF Line ammonia system is subjected to the RMP requirements because ammonia is stored at the facility in quantities above the regulatory threshold.  There are 3 different RMP compliance programs. Because the facility is subject to the Occupational Safety and Health Act (OSHA) Process Safety Management (PSM) regulations, the facility's ammonia system process is subject to the most stringent of three RMP programs (Program 3).\n\nThe RMP consists of three major parts. The first part is the Hazard Assessment. The Hazard Assessment is done to determine the effects that a release of a regulated substance could have on the public. The hazard assessment includes a worst-case (low probability) and alternate release (more probable) scenario, and a 5-year history of accidental releases of ammonia. The second part is a Prevention Program that consists of 12 elements designed to improve the system safety and decrease the likelihood of a release. The third part is the Emergency Response Program, which develops a plan for dealing with a release in the unlikely event that one would occur. Because the regulations are very similar, the Prevention Program and the Emergency Response Program also serves as the OSHA Process Safety Management (PSM) plan, and this document is therefore  referred to as the RMP/PSM plan.\n\nThe RMP regulations require a submittal to the USEPA. This submittal includes an Executive Summary and is referred to as the RMP Submittal. \n\nHazard Assessment for RMP\n\nA Plum Creek MDF facility AF Line ammonia system Hazard Assessment was performed to determine the effects a release would have on the public. For ammonia, the Hazard Assessment determined the distance a set endpoin"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8743,
      "SummaryText": "t concentration of ammonia gas would travel from the source. In addition, an estimate of the population that could be affected by a release of ammonia was determined and sensitive receptors such as hospitals, schools, and nursing homes were identified. The Hazard Assessment considered two release scenarios-a \"worst case\" (low probability) and an \"alternative\" (more probable) case. \n\nWorst-Case Scenario (Low Probability)\n\nThe worst-case scenario for the Plum Creek MDF AF Line ammonia system was the release of the entire contents of the largest single vessel at the facility containing ammonia. The release of this vessel was assumed to occur in 10 minutes (as required by the RMP regulations). The DEGADIS  model Version 2.1 was used to estimate the distance to the toxic end point for ammonia for this scenario.  Under this scenario, the release had offsite impact on receptors.  \n\nThe regulations require that the development of a worst-case release scenario be based on conservative assumptions. For example, it is required to assume that the entire contents of the largest single container of ammonia will be released over 10 minutes without any active intervention from facility personnel or systems.  This worst-case scenario is unlikely to occur since the physical properties of ammonia are not consistent with the assumptions required by the regulation. \n\nThe largest single vessel at the MDF AF Line ammonia system containing ammonia is designed to prevent releases from the vessel. This vessel has safety relief valves to prevent the vessel from rupturing and from releasing large quantities of its contents in a short period of time. The facility personnel would detect a release of this magnitude during routine process area inspections or because of a loss of ammonia flow, which is indicated on the operator's panel board. These conditions would allow the facility's emergency action plan to be activated.  Local response agencies would be immediately notified of the release, the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8743,
      "SummaryText": "agencies would take actions to mitigate the impact of the release, and members of the public potentially impacted by the release would be notified. \n\nAlternative Scenario (More Probable)\n\nThe RMP rule also requires that at least one alternative (more probable) release scenario be evaluated for ammonia . The alternative scenario reflects a type of release that is more likely to occur compared to the worst-case scenario. Unlike the worst-case scenario, the alternative release scenario may consider \"active\" mitigation such as shut-off valves, and a more realistic release quantity and release rate.  Active mitigation is defined as requiring mechanical, electrical, or human input. Lastly, it assumes local, typical meteorology, which is more realistic than the conservative meteorological conditions that must be assumed for the worst-case scenario.\n\nThe alternative release scenario for ammonia that was chosen at AF Line ammonia system  consisted of a release of ammonia through a hole in the transfer line between the delivery truck and the ammonia storage tank, which resulted in offsite impacts. This scenario was chosen as the alternate release scenario because it is viewed as the most probable even though any release scenario is viewed as remote.  The DEGADIS model was used again to estimate the distance to the toxic end point for ammonia for this scenario.\n\nFive-year Accident History\n\nThere have not been any accidents associated with the AF Line ammonia system for the past five years.\nPrevention Program for RMP/PSM Plans\n\nThe Prevention Program, together with the Emergency Response Program, makes up the RMP/PSM Plan. The Prevention Program consists of 12 elements designed to improve system safety and decrease the likelihood of a release.  These 12 elements are summarized below.\n\nEmployee Participation\n\nPlum Creek supports and encourages employee participation in its safety program.  Employee participation is valuable because it increases the safety awareness of the employ"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8743,
      "SummaryText": "ees and it allows the employee's experience in operating and maintaining the processes to be incorporated into the plan. Employees are involved in the facility's incident investigation of near misses, as well as accident investigations, safety meetings, developing and/or revising operating procedures, and employees participating in the Process Hazard Analysis that is described below.  MDF facility employees and contractors receive RMP/PSM awareness training that instructs them on how the RMP/PSM requirements may impact their jobs. Those employees who operate and maintain the AF Line ammonia system are trained in how to safely maintain and operate these processes.\n\nProcess Safety Information\n\nThe RMP regulations require that information concerning process chemicals, technology, and equipment be compiled as part of a RMP program for the MDF facility AF Line ammonia system. Emergency response planners can use such information to develop training programs and procedures, or as a general resource. The information is supplied to contractors who work in the MDF facility AF Line ammonia system  area as part of the requirements outlined in the Contractors element. \n\nProcess Hazard Analysis\n\nA Process Hazard Analysis (PHA) was conducted systematically to evaluate potential causes and consequences of accidental releases. This information is being used by Plum Creek staff to improve safety and reduce the consequences of accidental releases. Equipment, instrumentation, utilities, human actions, and external factors that might affect the process were the focus of the PHA that was performed for the \n\nMDF facility AF Line ammonia system.\n\nThe MDF facility AF Line ammonia system PHA was conducted in May 1999 by an interdisciplinary team of Plum Creek employees familiar with the process operation and maintenance, and plant management. The PHA was done using a combination of  What-If and Checklist methods. Based on the results of the PHA, the facility will review the ammonia transfer"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 8743,
      "SummaryText": "procedures with the vendor and verify the existence of excess flow valves to assure that safe procedures are being followed.\n\nOperating Procedures\n\nOperating procedures for the MDF facility AF Line ammonia system have been developed as part of the RMP/PSM. Written operating procedures assure continuous, efficient, and safe operation of the facility. The goal of the operating procedures is to provide clear instructions to safely operate the process. Operating procedures are also used to train new employees and to provide refresher training for existing employees.\n\nThe detailed operating procedures include startup, shutdown and emergency operating procedures. The procedures describe how the system should be operated in order to minimize the chances of an accidental release. The procedures also emphasize safety considerations during operation and address hazardous situations that can occur and how to correct them.  \n\nTraining\n\nAn effective RMP/PSM training program can significantly reduce the number and severity of accidental release incidences. Employees involved in operating or maintaining the AF Line ammonia system must receive training that includes applicable operating and maintenance procedures and an overview of the process. Training must emphasize safety and health hazards, and safe work practices.\nPlum Creek MDF facility employees have received initial training on the operations and maintenance of the regulated processes, an overview of each of the RMP/PSM plan elements, and the procedures that must be followed to comply with the requirements of the RMP/PSM plan. In addition to RMP/PSM plan training, Plum Creek MDF facility's  employees have been trained to respond to an accidental release. Refresher process operation training must be provided at least every 3 years. Refresher training for emergency response is conducted annually.\n\nContractors\n\nPlum Creek MDF facility must make contractors aware of the known hazards of the AF Line ammonia system process relate"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 8743,
      "SummaryText": "d to the contractors' work. In addition, the facility must make contractors aware of the applicable elements of its emergency response plan. Plum Creek screens contractors for those who can perform work on or adjacent to the ammonia system process without compromising the safety and health of employees at the facility. \n\nBefore allowing a contractor to work on or adjacent to the ammonia system process, Plum Creek must obtain and evaluate information regarding the contractor's safety performance and programs. When a contract involving work on or adjacent to the ammonia system is to be bid, the bidding procedures must ensure that contractor safety management requirements are met. If a contractor is to work in or adjacent to any covered processes, a safety briefing, to make the contractor aware of the Plum Creek MDF facility's RMP/PSM plan requirements, must be conducted before work begins. Upon arriving at the plant for the first time to perform work, a contractors safety orientation will be conducted for the contractor. \nCurrently no contractors are used to provide maintenance or design changes to the ammonia system.  If contractors are used, however, the contractor training in place will be used. \n\nPre-startup Review\n\nA pre-startup safety review must be conducted for any new covered process or for significant modifications to the existing MDF AF Line ammonia system that necessitate a change in the process safety information. No new or significantly modified process will start up and no acutely hazardous chemicals will be introduced into such a process prior to the pre-startup safety review. The purpose of the pre-startup safety review is to ensure that the facility is ready to operate new and modified regulated processes safely. \n\nTo initiate the pre-startup safety review, all updated elements of the Process Safety Management Plan are assembled for review. This includes all process safety information, process hazard analysis, operating procedures, employee training"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 8743,
      "SummaryText": "and mechanical integrity. A pre-startup safety review team completes a pre-startup checklist. The pre-startup safety review team should complete and sign a Pre-Startup Safety Review Form. This form documents the process, and helps ensure that the review has been properly performed. The Pre-Startup Safety Review Form must be authorized before startup.\n\nMechanical Integrity\n\nAn effective mechanical integrity program is one of the primary lines of defense against a release. The mechanical integrity program also addresses equipment testing and inspection, preventative maintenance schedules, and personnel training. The intent is to ensure that equipment used to process, store, or handle ammonia is maintained and installed to minimize the risk of releases.\n\nMDF facility maintenance employees use a computerized maintenance management system to store equipment information, generate and prioritize work orders, schedule preventative maintenance (PM), provide safety procedures for work orders, and maintain an inventory of parts and materials. The computerized maintenance management system is used to generate work orders for preventative maintenance and routine inspections. In addition to preventative maintenance, the MDF AF Line maintenance employees perform corrective maintenance in the event of equipment malfunction or breakdown.. The employees that carryout maintenance are all trained as part of the RMP/PSM.\n\nHot Works Permits\n\nRMP/PSM regulations require employees and contractors to employ safe work practices when performing \"hot work\" in, on, or around the AF Line ammonia system. To ensure that hot work is done safely, a Hot Work Permit Program (Welding and Cutting Permit Policy and Procedures) has been developed that requires a permit to be issued before hot work is performed. Hot work is defined as the use of oxyacetylene torches, welding equipment, grinders, cutting, brazing, or similar flame- or spark-producing operations.\nThe process of completing the hot work permit"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 8743,
      "SummaryText": "makes it necessary to identify the hazard, recognize what safeguards are appropriate, and then initiate the safeguards necessary to ensure a fire-safe workplace. Following the standards outline in this section aid in complying with the OSHA Hot Works Regulations (1910.252(a)).\n\nManagement of Change\n\nA system for the proper management of changes and modifications to equipment, procedures, chemicals, and processing conditions is required under the RMP/PSM. Modifications to the AF Line ammonia system will be reviewed before they are implemented to determine if the modification would compromise system safety. An effective change management system will help minimize the chance for an accidental release.\nIf a modification covered under RMP/PSM is made, its effects must be addressed, employees must be informed, and the written procedures must be updated. The intent is to require that all modifications to equipment, procedures, and processing conditions other than \"replacement in kind\" be managed by identifying and reviewing them before implementation. Selected personnel from maintenance and plant engineering will evaluate any modifications that are covered under the RMP/PSM. The person requesting a change will complete a Management of Change Form that the Production Superintendent, Plant Engineer and Maintenance Supervisor will review and authorize prior to initiation of a covered change.\n\nIncident Investigation\n\nEach incident that resulted in or could reasonably have resulted in a catastrophic release of ammonia must be investigated. A process to identify the underlying causes of incidents and to implement procedures for preventing similar events has been developed. To investigate an incident, an investigation team will be established. As part of the investigation, an incident report will be prepared and changes recommended as appropriate.\n\nThe investigation team should ask questions such as what equipment failed, which behavior failed, and which material leaked, reacted"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 8743,
      "SummaryText": ", or exploded. As part of the incident review, employee's actions that may have contributed to the incident will also be reviewed. A determination will be made as to whether it is necessary to institute additional training for the employees to prevent the incident from occurring in the future. On the incident investigation report form, the MDF Plant Manager identifies which of the recommended system changes are approved for implementation. The incident investigation report and any changes resulting from the report will be reviewed with all employees who operate and maintain the AF Line ammonia system. \n\nCompliance Audit\n\nThe MDF facility is required to complete a compliance audit for the RMP/PSM program. The primary goals of conducting an internal compliance audit are to gather sufficient data to verify compliance with RMP/PSM requirements and good process safety practices, identify process safety deficiencies and develop corrective actions, and increase safety awareness among plant employees.\nThe compliance audit methodology is modeled after OSHA's guidelines for conducting regulatory PSM compliance audits: Compliance Guidelines and Enforcement Procedures, OSHA Instruction CPL 2-2.45A (September 13, 1994). An internal compliance audit must be conducted at the plant at least once every 3 years for the MDF AF Line ammonia system. A team that includes at least one person knowledgeable in the covered processes and an audit leader (Safety Director) knowledgeable in RMP/PSM requirements and audit techniques will conduct the audits. The Manager, MDF and the audit team will promptly determine an appropriate corrective action for each deficiency identified during the audit and document the corrective actions and the dates by which they must be taken.\n\nEmergency Response Program for RMP/PSM Plans\n\nThe Emergency Response Program details a plan for dealing with a release. OSHA Process Safety Management regulation 29 CFR 1910.119(n) and EPA RMP regulation 40 CFR 68 Subpart E re"
    }
  ]
}