{
  "FacilityID": 8773,
  "FacilityName": "TANIMURA & ANTLE-YUMA, ARIZ. COOLER",
  "FacilityStr1": "6435 EAST GILA RIDGE RD.",
  "FacilityStr2": null,
  "FacilityCity": "YUMA",
  "FacilityState": "AZ",
  "FacilityZipCode": "85364",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04027",
  "LEPC": "Yuma County LEPC",
  "FacilityLatDecDegs": "32.686667",
  "FacilityLongDecDegs": "-114.581833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PF",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 22002509,
  "ParentCompanyName": "TANIMURA & ANTLE, INC.",
  "Company2Name": null,
  "CompanyDUNS": 22002509,
  "Company2DUNS": 0,
  "OperatorName": "TANIMURA & ANTLE, INC.",
  "OperatorStr1": "P.O. BOX 4070",
  "OperatorStr2": null,
  "OperatorCity": "SALINAS",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93902",
  "OperatorZipCodeExt": null,
  "RMPContact": "ALLIE PADGETT",
  "RMPTitle": "FACILITIES MANAGER",
  "FTE": 240,
  "OtherEPAFacilityID": "CESDG",
  "EPAFacilityID": "100000108279",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1993-11-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.67654,
  "FRS_Long": -114.51965,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10665,
      "AltID": null,
      "FacilityID": 8773,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 10918,
          "ProcessID": 10665,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 11878,
          "ProcessID": 10665,
          "ChemicalID": 56,
          "Quantity": 45000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 511878,
          "ProcessID": 10665,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8773,
      "SummaryText": "EXECUTIVE SUMMARY\n\n1. PREVENTION AND RESPONSE\n\nTanimura & Antle operates a shipping and cooling facility in Yuma, Ariz. in addition to other similar facilities.  Risk prevention and emergency response procedures are in place at all T&A facilities and the same management and maintenance personnel are responsible for maintaining the ammonia refrigeration equipment to prevent accidents, and for responding to an emergency.  An Emergency Response Plan is maintained onsite and lists the responsible personnel and the policies for responding to an accident involving the regulated substance.\n\nThere are both portable and fixed refrigeration systems onsite and all have safeties to detect unsafe operating conditions.  Fixed systems support a cold storage and a processing facility.  These systems have ammonia detection systems tied into an alarm system that is monitored 24 hours per day.  The portable systems have no detection since the units are outdoors.  Operators are present to monitor these units when they are running.  There is a list of responders experienced with ammonia refrigeration that would respond and determine specific responses for any incident.  Safeties and detection equipment are tested and maintained by experienced maintenance personnel as spelled out in the SOPs (Stand Operating Procedures) and the maintenance program.\n\n2. STATIONARY SOURCE AND SUBSTANCE DESCRIPTION\n\nAt the Yuma facility, ammonia refrigeration systems are used for processing produce, cold storage, produce precooling and ice generation.  Fixed systems are attached to the cold storage and processing buildings.  The portable refrigeration equipment is trailer mounted and is used for precooling and ice generation.  The cold storage and processing systems are designed as per current applicable building and safety codes.  Portable units vary in age but are well maintained and in good condition.  The total charge for the all the refrigeration systems is approximately 45,000 LBS. \n\n3. RELEASE SCENAR"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8773,
      "SummaryText": "IOS\n\nBoth a worse case and an alternate release scenario were modeled for this RMP utilizing a computer modeling program.  The worse case was an release of the entire ammonia charge of the largest system in 10 minutes with ambient conditions as required by EPA regulations.  The alternate was a release for 25 minutes averaging approximately 100 LBS/minute.  This is a more probable release due to items such as rotating seals, pressure relief valves, leaks in piping, charging system or draining oil.  The modeling software used was \"A Real Locations Of Hazardous Atmospheres\" (ALOHA) from the National Safety Council in cooperation with the EPA.  Both scenarios were considered releases in a rural setting.  Release plumes were plotted on maps which showed the location of populations, schools,  public areas, and acute care facilities if effected by the release.  The mapping software utilized was \"Mapping Application for Response and Planning of Local Operational Tasks\" (MARPLOT) also from the National Security Council.  Effected populations were estimated using \"Land View III\", a computer census modeling program from the Bureau of Census that is able to calculate census data of areas defined on MARPLOT generated maps.\n\nOffsite consequences were analyzed at 200 PPM  level of concern for the two above release scenarios.  Results show the worse case scenario having a potential endpoint of 2.2 miles.  If the area was encircled with the 2.2 mile endpoint distance as the radius, the total area population would be approximately 3,600.  This area contains schools, residences and industrial/commercial businesses.  The alternate scenario has considerably less offsite consequence with an endpoint of 1,293 feet at 200 PPM.  Some residences and nearby businesses would be effected.  Effected population is approximately 24.\n\nThere are various measures in place or recommended as risk reduction in the Process Hazard Analysis (PHA) to limit the endpoint distances of a release.  One is an amm"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8773,
      "SummaryText": "onia monitoring system for early detection.  Preventive maintenance and safety inspections are used to insure equipment and piping is maintained and operating in a safe manner.\n\n4. GENERAL RELEASE PREVENTION PROGRAM\n\nT&A maintains a release prevention program to eliminate or minimize releases.  The program includes regular inspections, monitoring equipment and logging conditions, scheduled maintenance, and operator training.  Releases are documented and analyzed for ways to prevent a similar future release.  A Risk Management Program which includes accident prevention procedures for the ammonia refrigeration system is maintained on-site along with this RMP. \n\nThe ammonia refrigeration system has specific safety procedures to prevent a release.  Operators and mechanics are trained for safe operation and maintenance of the refrigeration system.  They are also trained in emergency response procedures in the event of an ammonia release.  There are emergency shut off switches outside the mechanical room of the main cold storage for shutting down the system.  An alarm and detection system will monitor the facility for unsafe ammonia concentration levels and for operating conditions outside of safety set points.  Monitoring is 24 hours per day. \n\n5. FIVE YEAR ACCIDENT HISTORY\n\nThere have been no accidents at this facility.\n\n6. EMERGENCY RESPONSE PROGRAM\n\nIn event of a release, certain personnel are designated to determine the potential hazard and coordinate response procedures.  The emergency coordinator is responsible for contacting emergency response agencies, schools, daycare centers, and acute care facilities that may be effected by the release.  The coordinator will also be responsible for evacuation of employees if necessary, and for coordination with community emergency responders if off-site evacuations are required.  \n\n7. PLANNED CHANGES TO IMPROVE SAFETY\n\nSpecific recommendations resulting from the PHA are listed in the Risk Management Program kept on file at thi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8773,
      "SummaryText": "s facility.  All refrigeration equipment is well maintained and operated in a safe manner by trained personnel.  Operating, maintenance, training and safety procedures will be formalized with improved written documentation."
    }
  ]
}