{
  "FacilityID": 8987,
  "FacilityName": "North Attleborough Wastewater Treatment Facility",
  "FacilityStr1": "Cedar Road",
  "FacilityStr2": null,
  "FacilityCity": "Attleboro",
  "FacilityState": "MA",
  "FacilityZipCode": "02760",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25005",
  "LEPC": "North Attleboro LEPC",
  "FacilityLatDecDegs": "41.959444",
  "FacilityLongDecDegs": "-71.305278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 53518916,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Town of North Attleborough",
  "OperatorStr1": "Department of Public Works",
  "OperatorStr2": "240 Smith Street",
  "OperatorCity": "North Attleborough",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "02760",
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000111755",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2024-05-29 00:00:00",
  "DeRegistrationEffectiveDate": "2023-12-31 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.96064,
  "FRS_Long": -71.30625,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-STREET CENTERLINE",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10938,
      "AltID": null,
      "FacilityID": 8987,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 12184,
          "ProcessID": 10938,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 11200,
          "ProcessID": 10938,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 5293,
              "Process_NAICS_ID": 11200,
              "SafetyReviewDate": "1999-06-21 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "Yes",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "The  Chlorine Institute",
              "FR_Comments": null,
              "HazardReviewDate": "1999-04-30 00:00:00",
              "ChangeCompletionDate": "1999-09-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-30 00:00:00",
              "TrainingReviewDate": "1999-04-28 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-30 00:00:00",
              "EquipmentInspectionDate": "1999-04-28 00:00:00",
              "EquipmentTested": "Performed preventive maintenance and tested chlorine gas detector, inspected tank connections, flexible piping, valves, and chlorination systems.",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 5473,
                  "PreventionProgram2ID": 5293,
                  "ProcessChemicalID": 12184
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8987,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-21 00:00:00",
    "ERTrainingDate": "1997-09-01 00:00:00",
    "CoordinatingAgencyName": "North Attleborough Fire Department",
    "CoordinatingAgencyPhone": "5086994422",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 8987,
      "SummaryText": "acility's property line.\n\nThe WWTF developed an alternative release of chlorine scenario that focuses on more realistic release scenarios occurring during more common meteorological conditions.  While the WWTF has had no reportable releases, EPA requires modeling of a release which could impact off-site locations. After considering all criteria in the RMP rule and the Hazard Assessment performed on the chlorination process, the WWTF has chosen an alternative release scenario that involves a whip failure in the chlorine room. This scenario represents what staff believe to be the most likely scenario for a significant chlorine release.\n\nD. Accident Release Prevention Program\n\nThe WWTF has developed an accidental release prevention program designed and implemented to reduce the possibility of an accidental catastrophic release.   The program complies with the RMP requirements found at 40 C.F.R. Part 68, Subpart D.  While elements of this plan have been in place for years, the plan as a whole was recently implemented.  Even prior to the implementation of this plan no reportable releases had occurred at the treatment facility.\n\nThe basic elements of the WWTF\u0012s prevention program are described below: \n\n1.0 Safety Information.  The WWTF has compiled written process safety information which helped identify the hazards posed by chlorine, handling of materials, management, storage activities and the chlorination process in general.  The compilation of process safety information provided the foundation for understanding the hazards involved in the chlorination  process and was crucial to the development of a complete and thorough hazard analysis.  The required safety information includes information pertaining to the hazardous chemicals (e.g. chlorine), the technology of the process, and the process equipment.   40 C.F.R. ' 68.48. \n\n2.0 Hazard Review.  The WWTF performed its most recent hazard review on the chlorination system in April 1999.  The hazard analysis provided a tho"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8987,
      "SummaryText": "revention program is coordinated with the WWTF's Process Safety Management (PSM) program.  Under the RMP rules, the WWTF is classified as a Level 2 facility, and must prepare an accident prevention program in compliance with RMP\u0012s Level 2 accident prevention program requirements;\n3. Implementation of an emergency response program.  As recommended in the RMP rule and by numerous federal response entities, the facility has developed an integrated contingency plan designed to meet applicable state and federal emergency response and accident prevention planning requirements. \n\nAdditional information regarding how the WWTF addresses each of these requirements is provided below and in the attached RMP plan.\n\nWhile the RMP program at the WWTF helps ensure that the facility is maintained and operated in a safe and environmentally responsible manner, it is just one component of the WWTF\u0012s comprehensive safety and environmental programs.  Additional components beyond the scope of the RMP include, but are not limited to: regular employee/contractor safety training, periodic table-top safety and emergency response drills, acquisition and maintenance of emergency response and personnel protective equipment, development of safe work practices (confined space, lockout/tagout, hot work), implementation of safe work procedures, new project safety review procedures, preventive maintenance and regular inspections of all tanks and equipment that contain hazardous chemicals, chemical control and purchasing procedures, medical emergency response training, contractor certification, etc. \n\nThe facility and all equipment are designed and operated to minimize the possibility of an accidental release.  At a minimum, the facility and equipment meet government and industry design and construction standards.\n\nB.  RMP Covered Stationary Source and Regulated Substance\n\nThe WWTF owns and operates its wastewater treatment facility in Attleboro, Massachusetts.  The facility treats industrial and sani"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8987,
      "SummaryText": "tary wastewater from the Town of North Attleborough and discharges the treated effluent to the Ten Mile River.  The only chemical present at the facility in sufficient quantities to be regulated by the chemical accident prevention rule is chlorine.  Chlorine is used to disinfect wastewater.\n\nChlorine is stored in 2,000 lb. tanks within the chlorine room, and is injected into the water stream in the adjacent chlorinator room. Both rooms are equipped with chlorine detectors which sound an alarm in the event of an accidental release of chlorine.\n\nThe total maximum amount of chlorine stored on-site is 6,000 lbs. (3 tanks).  The maximum amount of chlorine used at any one time in the chlorination process is 4,000 lbs.\n\nC. Off-site Consequence Analysis\n\nAs required by the RMP rule, the WWTF\u0012s off-site consequence analysis included evaluation of a worst-case accidental release for all toxic chemicals and an alternative release for each covered chemical.\n\nA worst-case release is defined by EPA as a release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to an endpoint defined in ' 68.22.  40 C.F.R. ' 68.3.   EPA requires the worst-case accidental release to be modeled using highly conservative meteorological data designed to result in the maximum possible adverse impact.  For example, EPA requires worst-case models to assume that the entire contents of the largest vessel are released instantaneously on a warm night with slow, steady wind.  According to the Chlorine Institute, no 2,000 lb. chlorine tank has ever released its contents in ten minutes.  The probability of such an event is extremely low.\n\nUsing the EPA mandated criteria described above, the worst-case release at the WWTF (for purposes of RMP) would involve a complete failure of a 2,000 lb. chlorine tank, filled to maximum capacity.  If such a \nrelease occurred, it would result in a vapor cloud that could impact persons outside of the f"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 8987,
      "SummaryText": "Risk Management Plan\nExecutive Summary \nTown of North Attleborough\nWastewater Treatment Facility\nAttleboro, MA\n\n\nI.0  Executive Summary\n\nA. Accidental Release Prevention and Emergency Response Policies \n\nThe Town of North Attleborough Wastewater Treatment Facility (WWTF) is committed to operating its wastewater treatment facility in Attleboro, Massachusetts in an environmentally responsible manner and to providing a safe workplace for its employees and the surrounding community.  As part of this commitment to environmental stewardship and worker safety, the WWTF has developed and implemented environmental and safety programs designed to reduce or eliminate the potential for accidental releases.  The WWTF has also developed and implemented a number of programs designed to ensure that if an accidental release occurs it will be handled in a manner that minimizes adverse impact to personnel, the surrounding community, the environment and the facility. \n\nThe WWTF views accident prevention, personnel protection, and environmental protection as continuous processes.  Consequently, The WWTF continuously strives to improve its accident prevention, environmental protection and emergency response programs. The WWTF\u0012s Risk Management Program complements this overall accident prevention and response program.  The WWTP\u0012s Risk Management Program (RMP) complies with the U.S. Environmental Protection Agency\u0012s (EPA\u0012s) Chemical Accident Prevention rule found at 40 C.F.R. Part 68.  This RMP Plan provides the public with information about the treatment facility's processes, accident prevention programs, and emergency response planning efforts.   The WWTF\u0012s compliance with EPA\u0012s RMP rule includes:\n\n1. Completion of a hazard assessment in compliance with 40 C.F.R. Part 68, Subpart B, including the five-year accidental release history.  The WWTF has never experienced an RMP reportable release or accident.\n2. Implementation of an accident prevention program.  The facility's RMP accident p"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8987,
      "SummaryText": "rough, orderly, systematic approach for identifying, evaluating, and controlling hazards posed by the chlorination process.  The hazard review utilized the what-if/checklist methodology in accordance with 29 C.F.R. ' 1910.119(e) and 40 C.F.R. ' 68.50.  \n\n3.0 Operating Procedures.  The WWTF has developed and implements written operating procedures that provide clear instructions for safely conducting activities involved in the chlorination process.  See 40 C.F.R. ' 68.52.\n\n4.0 Training.  The WWTF provides employees, contractors and visitors with training that focuses  on the special safety and health hazards posed by the facility operations, RMP covered processes, emergency operations, and safe work practices applicable to the employees\u0012 job tasks.  The WWTF confirms that employees and contractors involved in operating a covered process have successfully completed the required training.  See 40 C.F.R. ' 68.54.\n       \n5.0 Maintenance.  The WWTF has developed and implements written procedures to maintain the ongoing integrity of the process equipment listed below.  The WWTF also trains employees to maintain the process equipment.  See 40 C.F.R. 68.56.\n\n6.0 Incident Investigation.  The WWTF investigates each incident which resulted in, or could reasonably have resulted in, a catastrophic release of a highly hazardous chemical.  An incident investigation team is established and consists of at least one person knowledgeable in the process involved, including a contract employee if the incident involved work of the contractor, and other persons with appropriate knowledge and experience to thoroughly investigate and analyze the incident. See 40 C.F.R. ' 68.60.\n\n7.0 Compliance Audits.  The WWTF will evaluate its compliance with the RMP rule at least every three years to verify that the procedures and practices it has developed are adequate and being followed.  A report of the audit findings will be developed.  See 40 C.F.R. ' 68.58. \n\nE. Five Year Accident History\n\nThe WWTF"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 8987,
      "SummaryText": "has never experienced a release that requires reporting under the chemical accident prevention rule.\n\nF. Emergency Response Procedures and Policies\n\nWWTF staff evacuate during all emergency incidents, and emergency assistance is provided by the North Attleborough Fire Department and other emergency responders.  Emergency procedures are described in detail in the facility's integrated contingency plan.  In the event of small fires, all WWTF employees are trained in the use of fire extinguishers.  Personnel have also been trained to notify the WWTF head operator in the event of more extensive accidental releases.  The Head Operator is responsible for assessment of the extent of the release, internal notification of the release and determination of whether or not outside responders are needed. \n\nThe North Attleborough Fire Department operates under mutual aid agreements with surrounding and nearby towns to ensure that additional  emergency response personnel and equipment are available to respond to an emergency release at the facility.  In addition, the WWTF has an agreement with an outside contractor, Jones Chemical, to provide emergency response services, if needed.\n\nThe WWTF has also adopted and implements an Integrated Contingency Plan that meets the regulatory requirements of the following federal and state response planning and prevention laws:  \n\n7 OSHA Emergency Action Plan (29 C.F.R. 1910.38(a))\n7 Massachusetts Employee Right-to-Know Law (M.G.L. Ch. 111(f))\n7 EPA Risk Management Plan Emergency Response Program (40 C.F.R. ' 68.95)\n\nThe ICP includes, among other things:\n\n7 Procedures for notifying the public and the local emergency planning committee\n7 Arrangements for first-aid procedures and emergency medical treatment procedures for exposure to chlorine \n7 Emergency  notification and evacuation procedures\n7 Employee training procedures\n7 Procedures to amend the ICP plan\n \nG. Planned Changes\n\nNo changes are currently planned."
    }
  ]
}