{
  "FacilityID": 9173,
  "FacilityName": "GVK America, Inc.",
  "FacilityStr1": "157, GVK Drive",
  "FacilityStr2": null,
  "FacilityCity": "Biscoe",
  "FacilityState": "NC",
  "FacilityZipCode": "27209",
  "Facility4DigitZipExt": "9669",
  "FacilityCountyFIPS": "37123",
  "LEPC": "Montgomery County LEPC",
  "FacilityLatDecDegs": "35.331",
  "FacilityLongDecDegs": "-79.765806",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "Z4",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 617501721,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "GVK America, Inc.",
  "OperatorStr1": "157, GVK Drive",
  "OperatorStr2": null,
  "OperatorCity": "Biscoe",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27209",
  "OperatorZipCodeExt": "9669",
  "FTE": 69,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000114253",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-09-18 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2007-09-05 00:00:00",
  "DeRegistrationEffectiveDate": "2007-08-28 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.328611,
  "FRS_Long": -79.767778,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 11216,
      "AltID": "Resin Manufacturing",
      "FacilityID": 9173,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 12500,
          "ProcessID": 11216,
          "ChemicalID": 1,
          "Quantity": 35000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 11482,
          "ProcessID": 11216,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 5256,
              "Process_NAICS_ID": 11482,
              "SafetyReviewDate": "1999-05-10 00:00:00",
              "PHA_Date": "1994-02-10 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-03-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1994-02-10 00:00:00",
              "TrainingReviewDate": "1994-02-10 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-10 00:00:00",
              "EquipmentInspectionDate": "1999-05-10 00:00:00",
              "EquipmentTested": "Tanker Unloading Station",
              "ChangeMgmtDate": "1999-05-10 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-10 00:00:00",
              "PreStartupReviewDate": "1999-05-10 00:00:00",
              "ComplianceAuditDate": "1999-05-10 00:00:00",
              "AuditCompletionDate": "1999-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-10 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-10 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-10 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 6112,
                  "PreventionProgram3ID": 5256,
                  "ProcessChemicalID": 12500
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 9173,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1994-02-10 00:00:00",
    "ERTrainingDate": "1994-02-10 00:00:00",
    "CoordinatingAgencyName": "Montgomery County - LEPC",
    "CoordinatingAgencyPhone": "9105764221",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9173,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policy at\nGVK America, Inc.:\n\nThe handling and storage of all chemicals at our facility is contained in the safety manual and operating instructions of each process along with the MSDS data for all materials used. All storage vessels and drums are labeled with the Hazard Classification, toxicity and flammability clearly visible. The training and induction of all new employees into areas where chemicals are stored and handled includes familiarity with the MSDS for the materials they need to handle and training on the use of safety gear and practices. Trained personnel, always closely supervise unloading of tankers containing formaldehyde, which is the only chemical covered under this RMP. The pumps, valves and tanks have built in devices to ensure safe shutdown of the unloading process in case of loss in pressure of the pumps due to any down stream rupture of pipes or leakage from valves. The plant operator only signs off on the shipping documents after the formaldehyde pumping is completed and the tanker is physically disconnected from the plant.\n\nWe have monthly safety meetings with a combination of permanent members from the management team and rotational members from the production and maintenance teams. The committee reviews all safety concerns and carries out an inspection in every meeting. They are also trained by means of specialized videos obtained from our chemical vendors and insurance companies in the safe handling and storage of chemicals, at least once, during the six-month tenure of each committee.\n\nWe have invited the local Biscoe fire department and its chief to tour the facility so that they are familiar with the layout of the plant, location and quantity of chemicals stored. Copies of the MSDS for the chemicals stored and handled at GVK were made available to them. We are in contact with the Montgomery County Emergency Response Committee in Troy and plan to participate in future meetings that"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9173,
      "SummaryText": "relate to their emergency planning activities.\nThe senior management of GVK America, Inc. is fully committed to maintaining the highest possible standards of safety and house keeping and the prevention of accidents in the workplace and do everything necessary to ensure GVK is a responsible employer and concerned member of the local community.\n \n2.\tDescription of facility and manufacturing processes:\n\nGVK America, Inc. is involved in the manufacture and sale of thermally fused melamine panels with a particleboard or medium density fiberboard core. The plant is divided into four main process areas:\t\n\nResin and Additive Plant - The chemical processes where formaldehyde is used in the manufacture of thermoset resins (urea formaldehyde (UF) and melamine formaldehyde (MF)) and additives required for the application of these resins in the manufacture of treated papers.\n\nPaper Treater - The process where special decor papers are impregnated with UF and coated with MF Resin for use in the production of laminated panels.\n\nShortcycle Press - The process in which the treated paper is fused to the board substrate in a hydraulically operated press by application of pressure at an elevated temperature. The resin in the paper flows into the cells of the substrate and cures under the influence of temperature and pressure to form a thermally fused melamine panel.\n\nComponent Plant - Mechanical processes to cut, edge band and machine the melamine panels into components for applications in the manufacture of furniture.\n\nThe only regulated substance is formaldehyde used in the Resin manufacturing process. The formaldehyde is purchased in 37% aqueous solution and stored in two 25kL vertical storage tanks. Normally one tank is in use and the other is filled only after the tank in use reaches a minimum reorder level. The quantity ordered each time is one full tanker load of 47,000 lb. with a frequency of one tanker load every 3 weeks.\n\n\n3.\tRelease Scenarios:\n\nToxic Worst Case Scenario - Thi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9173,
      "SummaryText": "s was calculated using the EPA's RMP*Comp Model assuming one of the two 25kL 37% formaldehyde storage vessels collapses or the outlet pipe ruptures releasing the entire contents of 17,500 lb. of formaldehyde (on a 100% basis) to the environment.\n\nThe model shows an affected area with an end point approx. 6.20 miles centered on our facility with an estimated population of 2000 people in a rural setting. Because of the low population density and wooded areas the actual impact is likely to be lower. Further, since our storage vessels are indoors, the actual exposure of the spill to the atmosphere will be considerably less.\n\nOn the average, the quantity of formaldehyde stored at the site is roughly 50% of the worst case scenario and we have administrative controls to ensure it never exceeds the maximum value used in the model. To further reduce the risk of contamination of the outside environment, we are considering mitigation systems. We already have a sump drain on one side of the storage vessels that can hold about 50% of the total vessel volume and this is closed off from the drain outlet to the effluent system. We are looking at the possibility of installing an automatic or remote actuated sluice gate on the drain outlet from the building to prevent any overflow from the sump drain leaving the building and evaporating into the atmosphere. This will allow us to contain the spill within the building and manage it better.\n\nAlternative Release Scenario - This was also calculated using EPA's RMP*Comp model using the same quantities as the worst case model, but the affected area is reduced to an end-point of 2.10 miles with an estimated population of 500 due to different wind conditions. As described in the worst case model above, the actual impact will be considerably less due to the topography of the site and the presence of a sump drain near the storage vessels.\n\nThe same mitigation measures proposed above will have a considerable impact on managing potential spills c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9173,
      "SummaryText": "onsidered in this model.\n\n\n\n\n\n\n\n\n\n\n\n4. \tGeneral Accidental Release Prevention program at GVK America, Inc.and specific plan for preventing formaldehyde spills:\n\nWe have clearly laid out procedures for the receipt, handling, storage and use of all chemicals in our process and the responsibility for these activities are only delegated to experienced individuals who have been given specific training in the processes. We have a written chemical spill response program that is communicated to every employee along with the MSDS for each chemical. The program is reviewed on a regular basis in the monthly Safety Committee Meeting.\n\nAll material inventories are maintained either automatically by PLCs used in the process or by manual book keeping and physically verified every month to check material balance and ensure there is no loss of chemicals in the system.\n\nThe responsibility for maintenance of all equipment used in the storage and handling of formaldehyde is assigned to the lead operator / supervisor of the resin plant and audited on a regular basis by the Plant Manager and the Safety Committee.\n\nWe have a written document laying down guidelines of the responsibilities and the sequence of actions to be taken in the event of a chemical spill major or minor.\n\nWe are reviewing containment systems for the control of spillage from formaldehyde storage vessels with the aim of installing additional security to prevent escape of formaldehyde outside the facility walls in the worst case scenario.\n\n5. \tThe five-year accident history at GVK America, Inc.:\n\nWe have had NO Accidental releases of formaldehyde in the past five years.\n\n6.\tEmergency Response Program at GVK America, Inc.:\n\nWe have a written Emergency Contingency Plan for the GVK facility that is communicated to each employee and reviewed on a regular basis in the monthly Safety Committee Meeting. This contains the following major elements:\n\n- Chain of command and responsibilities\n- Response Notification Checklist with ex"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 9173,
      "SummaryText": "ternal and internal emergency contacts   \n  And their phone numbers\n- Key Team Member Notification List\n- Fire or Explosion Chain of Events\n- Bomb Threat Chain of Events / Checklist\n- Natural Disaster and Inclement Weather Chain of Events\n- Evacuation Instructions and Diagram\n\n7. Planned Changes to Improve Safety\n\nWe are reviewing methods of mitigation and control of chemical spills with emphasis on containment of 37% formaldehyde within the facility walls in the worst case scenario."
    }
  ]
}