{
  "FacilityID": 919,
  "FacilityName": "Alpenrose Dairy",
  "FacilityStr1": "6149 S.W. Shattuck RD.",
  "FacilityStr2": null,
  "FacilityCity": "Portland",
  "FacilityState": "OR",
  "FacilityZipCode": "97221",
  "Facility4DigitZipExt": "1044",
  "FacilityCountyFIPS": "41051",
  "LEPC": "Office of Emergency Management",
  "FacilityLatDecDegs": "45.48",
  "FacilityLongDecDegs": "122.739722",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "alpenrose@teleport.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Carl Cadonau SR.",
  "OperatorStr1": "6149 S.W. Shattuck RD.",
  "OperatorStr2": null,
  "OperatorCity": "Portland",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97221",
  "OperatorZipCodeExt": "1044",
  "RMPContact": "Eric Trummel",
  "RMPTitle": "Maintenance Supervisor",
  "FTE": 155,
  "OtherEPAFacilityID": "97221LPNRS6149S",
  "EPAFacilityID": "100000010203",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-05 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Ammonia Refrigeration System",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-05-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-05-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-05-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-05-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0.5e",
  "FRS_Lat": 45.47971,
  "FRS_Long": -122.73853,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1013,
      "AltID": "Refrigeration System",
      "FacilityID": 919,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1026,
          "ProcessID": 1013,
          "NAICSCode": "311511",
          "_desc": {
            "NAICS_CODE": "311511",
            "NAICS_DESCRIPTION": "Fluid Milk Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 1027,
          "ProcessID": 1013,
          "NAICSCode": "31152",
          "_desc": {
            "NAICS_CODE": "31152",
            "NAICS_DESCRIPTION": "Ice Cream and Frozen Dessert Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 1028,
          "ProcessID": 1013,
          "NAICSCode": "311513",
          "_desc": {
            "NAICS_CODE": "311513",
            "NAICS_DESCRIPTION": "Cheese Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1101,
          "ProcessID": 1013,
          "ChemicalID": 56,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 501101,
          "ProcessID": 1013,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 919,
      "SummaryText": "ALPENROSE RISK MANAGEMENT PROGRAM\n\nEXECUTIVE SUMMARY\n\nAlpenrose Dairy recognizes the fact that we have a responsibility not only to all our employee's but also to our surrounding community in regards to the safety and welfare of everyone that live and work around us. In keeping with this responsibility we would like to take this opportunity to inform our community of the potential risks posed by the dairy. Alpenrose Dairy has been in business since 1916, and throughout the years there have been numerous technological advances in processing, packaging and storage of milk, ice cream and cultured products. An early advancement was in the 1940's when Alpenrose began using Anhydrous Ammonia in its refrigeration system. Ammonia is commonly used by a large number of industrial facilities because of its ability to be detected by odor at low level concentrations. Ammonia is also naturally reoccurring which means that it is organic and it is not harmful to the ozone level. Ammonia is a toxic gas under ambient conditions. When ammonia is used in a refrigeration system it contains ammonia in a gas and liquid form under pressure. When ammonia is released into the atmosphere it has the potential for harmful effects to workers and to the community. There are several causes that can cause a refrigeration system to release ammonia ranging from a small release to a catastrophic release. Some of the causes include the venting of a relief valve, the rupturing of process piping, valve packing leaks, seal leaks on a pump, or possibly the rupturing of a delivery hose.\n There are two release scenarios that need to be addressed. The first scenario is known as The Worst-Case Release Scenario, the second is The Alternative Release Scenario. In the Worst-Case Scenario the assumption is that we lose all of our 20,000 pound ammonia charge in 10 minutes. This is based on a release rate of 2000 pounds of gas Ammonia per minute and a wind speed of 3.4 miles per hour using the EPA approved software "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 919,
      "SummaryText": "program called RMP*Comp. Since this facility is located in a populated area, the toxic cloud formed by the evaporating ammonia would reach offsite endpoints and public receptors. One of the ways to mitigate a release from the main holding tank (the HPR can hold up to 5000 gallons) is to place it indoors, this will contain the release initially. In the alternative release scenario we have used 5oo pounds as the release quantity. The alternate release scenario uses a realistic situation of a valve leaking on a piece of rooftop equipment. In the RMP*Comp program this release will have an off-site impact of .06 miles from the center of the dairy. In the 50 years since Alpenrose started using Anhydrous Ammonia in its refrigeration process we have never had an on or off-site release that has resulted in a serious injury or caused a loss of life. There are reasons for this; Ammonia systems are designed according to national and local standards. If the system contains more than 10,000 pounds, they are operated using a program called Process Safety Management. Process Safety Management is a comprehensive guideline for which an operator of a refrigeration system must conduct day to day assignments. In other words, it is a detailed plan by which every aspect of work that needs to be conducted has a procedure designed to reduce the chances of a worker getting injured or having a release of ammonia into the atmosphere. Another element of PSM is Preventive Maintenance. Using Preventive Maintenance we inspect different parts of the refrigeration system on a set time schedule. This assists us in determining if equipment needs repair proir to failure. And maintaining a leak free system. Our maintenance department responds to all reports of leaks immediately. And repairs are a priority. We test all new piping installed prior to filling the piping with ammonia and all new equipment is installed by contractors licensed by the state of Oregon. In 1998 we started using new style insulati"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 919,
      "SummaryText": "on on our pipes and vessels to ensure longer life to our system. Our refrigeration contractor routinely inspects our refrigeration system. This is performed to detect and repair any system deficiency that could lead to an unscheduled incident. \nWe the employees at Alpenrose use these procedures everyday to protect ourselves, our coworkers, our families, and the public inside and outside our gates. In the last five years we have had only two significant releases. The first of these releases was under the reportable quantity that requires us to notify local and Federal authorities. The release was stopped within 1 hour. The second release involved a pipe rupturing due to a process upset. The release lasted approximently 1 1/2 hours and never had any off-site impact. Once again neither of them resulted in any injuries within the dairy. There also were no off-site injuries or evacuations. Alpenrose has a team of people trained to handle any releases that may occur. These people have attended classes sponsored by RETA (Refrigeration Engineers and Technicians Association). And received training through Tualatin Valley Fire and Rescue annually on a rotating schedule throughout the year.\n We also have invited members of Portland Fire Department, and had them attend tours of our facility. It is important to Alpenrose Dairy that we maintain a close relationship to the Fire Department. In the past we have conducted ammonia release drills with Portland Fire and their HAZMAT team. We will continue to do this in the future so that we can be better prepared in case of a large off-site release. Windsocks have been mounted on our facility to be used to determine an appropriate emergency response during a significant release. If ever a release were to occur that requires us to notify people of the surrounding community it will be done by emergency responders sounding a three to five minute continuos alarm from their emergency vehicles. The tone may be different but the key will be th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 919,
      "SummaryText": "at the sound lasts for three to five minutes. The preferred method for protecting yourself and your family is to Shelter in Place. Shelter in Place will allow you to stay indoors and not expose you to the airborne chemical. The five key elements to Shelter-In -Place are (1) Move inside and turn on the radio or TV for emergency information. (2) Close all windows and doors. (3) Turn off ventilation systems. (4) In buildings, go into and seal a room if possible. (5) Continue to listen to radio or TV for further instructions. Once again Alpenrose wishes to say that we are very concerned about our neighbors and employee's well being and we will continue to improve our efforts to make Alpenrose a safe dairy."
    }
  ]
}