{
  "FacilityID": 9216,
  "FacilityName": "C. of Fredericksburg Wastewater Treatment Facility",
  "FacilityStr1": "700 Beulah Salisbury Road",
  "FacilityStr2": null,
  "FacilityCity": "Fredericksburg",
  "FacilityState": "VA",
  "FacilityZipCode": "22401",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51630",
  "LEPC": null,
  "FacilityLatDecDegs": "38.288972",
  "FacilityLongDecDegs": "-77.451111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Fredericksburg",
  "OperatorStr1": "P.O. Box 7447",
  "OperatorStr2": null,
  "OperatorCity": "Fredericksburg",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "22404",
  "OperatorZipCodeExt": "7447",
  "RMPContact": "Wilbur E. Brown, Jr.",
  "RMPTitle": "Superintendent",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000114556",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-02-19 00:00:00",
  "DeRegistrationEffectiveDate": "2010-02-15 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.28897,
  "FRS_Long": -77.45111,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 11289,
      "AltID": "Chlorine Disinfection",
      "FacilityID": 9216,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 11558,
          "ProcessID": 11289,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 12609,
          "ProcessID": 11289,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 512609,
          "ProcessID": 11289,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 11290,
      "AltID": "Dechlorination Process",
      "FacilityID": 9216,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 11559,
          "ProcessID": 11290,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 12610,
          "ProcessID": 11290,
          "ChemicalID": 49,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 512610,
          "ProcessID": 11290,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9216,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe City of Fredericksburg Wastewater Treatment Facility is located on Beulah Salisbury Road in Fredericksburg, Virginia.  The facility treats wastewater received from the City of Fredericksburg before discharging it into the Rappahannock River. The City of Fredericksburg Facility uses chlorine for disinfection and sulfur dioxide for dechlorination as part of its treatment process.  The facility receives chlorine and sulfur dioxide in one-ton (2,000-pound) cylinders.  The City of Fredericksburg Facility stores up to a maximum of seven cylinders of chlorine and five cylinders of sulfur dioxide at any given time.\n\nChlorine and sulfur dioxide are toxic substances regulated by the United States Environmental Protection Agency's Risk Management Program Rule [40 CFR Part 68].  The City of Fredericksburg Facility has prepared a Risk Management Plan (RMP) in accordance with the requirements of 40 CFR Part 68.\n\nAccident Prevention\n\nThe City of Fredericksburg Facility has used chlorine and sulfur dioxide in its treatment system for its entire operating history.  During that time, facility personnel have taken considerable care in the storage and handling of these substances.  The facility receives one-ton cylinders of chlorine and sulfur dioxide by truck, lifts them using a motorized crane designed specifically for moving one-ton cylinders, and places them on saddles designed specifically for the storage of these cylinders. Before accepting a cylinder, facility operators check the condition of the cylinder and inspect it for leaks.\n \nSensors are located within the chlorine and sulfur dioxide storage areas.  The chlorine sensor alarms when the chlorine concentration exceeds 1 part per million (ppm).  The sulfur dioxide sensor alarms when the sulfur dioxide concentration exceeds 10 ppm.  The alarms notify the operators of low concentrations of chlorine and sulfur dioxide in the storage areas so that the operators can respond immediately and correct the situat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9216,
      "SummaryText": "ion.  The alarms are tested monthly.\n\nRelease Scenarios\n\nThe USEPA requires that facilities which meet the requirements of 40 CFR Part 68 model two release scenarios for each regulated toxic substance, a worst-case release scenario and an alternative release scenario.  Affected facilities are required to estimate the distance that a chemical plume will travel before its concentration falls below the USEPA-established \"toxic endpoint\" concentration.  Affected facilities are required to estimate the population and identify other environmental receptors that may be impacted under such a release scenario.\n\nThe worst-case release scenario is an unlikely event, used solely for planning purposes, whereby the complete contents of the one-ton cylinder are assumed to be released over a ten-minute period.  The release is directionally independent, therefore, the distance to the toxic endpoint is assumed to comprise the radius of a circle drawn around the facility.  The purpose of this exercise is to prepare the facility and emergency responders for \"worst-case\" conditions.\n\nThe facility contracted an outside consultant with air dispersion modeling expertise to model the releases of both chlorine and sulfur dioxide in accordance with USEPA requirements.  The dense gas dispersion modeling program DEGADIS was used for the worst-case release scenarios using site-specific conditions.\n\nThe USEPA also requires facilities to model an alternative release scenario or \"more-likely\" release scenario which also impacts offsite receptors (if one exists).  Since the facility has not experienced the release of chlorine or sulfur dioxide in its operating history, the selection of appropriate alternative release scenarios was based on knowledge of the City of Fredericksburg Facility and its operations.  The facility used the process hazard analysis (PHA) conducted as part of the OSHA Process Safety Management Plan in 1997 to review a number of scenarios and the measures in place to mitigate a s"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9216,
      "SummaryText": "ubsequent release.  The PHA did not identify any likely scenarios which, when modeled, would reach an offsite receptor.  Therefore, the facility used the unlikely scenario of a failure of the pressure relief device (fusible plug) on the cylinder in order to meet the USEPA requirement that an alternative release result in an offsite impact.  The facility used the USEPA Offsite Consequence Analysis (OCA) Guidance to estimate the distance to the toxic endpoint for the alternative release scenario.\n\nFive-Year Accident History\n\nThrough training, prevention measures, and safe operating practices, the facility has not experienced the release of chlorine or sulfur dioxide which has adversely affected offsite receptors during its entire operating history.\n\nEmergency Response\n\nThe facility operators are trained to respond to a minor release of chlorine or sulfur dioxide within the storage areas.  The operators wearing the proper personal protective equipment are capable of entering the storage areas and repairing or replacing faulty equipment.  In the event of a more significant release, the facility has a mutual aid agreement with the Virginia Department of Emergency Services (VDES), which would provide HAZMAT trained personnel to assist in mitigating the release.\n\nPlanned Changes to Improve Safety\n\nThe City of Fredericksburg Facility continually reviews the existing operating procedures, process safety information, and training program to protect the safety of its employees and the surrounding population."
    }
  ]
}