{
  "FacilityID": 9242,
  "FacilityName": "Larose Gas Processing Plant",
  "FacilityStr1": "1474 Highway 24",
  "FacilityStr2": null,
  "FacilityCity": "Larose",
  "FacilityState": "LA",
  "FacilityZipCode": "70373",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22057",
  "LEPC": "Lafourche Parish LEPC",
  "FacilityLatDecDegs": "29.542861",
  "FacilityLongDecDegs": "-90.397278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Discovery Producer Services LLC",
  "Company2Name": "Texaco Exploration and Production Inc.",
  "CompanyDUNS": 0,
  "Company2DUNS": 131114662,
  "OperatorName": "Bridgeline Gas Distribution LLC",
  "OperatorStr1": "P.O. Box 1699",
  "OperatorStr2": null,
  "OperatorCity": "Larose",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70373",
  "OperatorZipCodeExt": null,
  "FTE": 22,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000113076",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1560-00120-V1",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.54286,
  "FRS_Long": -90.39728,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 11317,
      "AltID": "Larose Gas Processing",
      "FacilityID": 9242,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 12637,
          "ProcessID": 11317,
          "ChemicalID": 155,
          "Quantity": 1200000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1660,
              "ProcessChemicalID": 12637,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1661,
              "ProcessChemicalID": 12637,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1662,
              "ProcessChemicalID": 12637,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1663,
              "ProcessChemicalID": 12637,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1664,
              "ProcessChemicalID": 12637,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1665,
              "ProcessChemicalID": 12637,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1666,
              "ProcessChemicalID": 12637,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 11587,
          "ProcessID": 11317,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 5321,
              "Process_NAICS_ID": 11587,
              "SafetyReviewDate": "1997-12-29 00:00:00",
              "PHA_Date": "1997-12-30 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-01 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Fire Monitors, Fire Hydrants and Portable Fier Extinguishers",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": "Process Alarms and Distributive Control System",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Alarm setpoint changes",
              "OpProceduresReviewDate": "1998-10-01 00:00:00",
              "TrainingReviewDate": "1998-06-18 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-03 00:00:00",
              "EquipmentInspectionDate": "1999-05-21 00:00:00",
              "EquipmentTested": "1500hr Inspection of ZZ112 Flash Gas Compressor",
              "ChangeMgmtDate": "1999-05-24 00:00:00",
              "ChangeMgmtReviewDate": "1999-01-13 00:00:00",
              "PreStartupReviewDate": "1999-02-19 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1999-03-08 00:00:00",
              "InvestigationChangeDate": "1999-03-09 00:00:00",
              "ParticipationPlansReviewDate": "1999-02-04 00:00:00",
              "HotWorkPermitReviewDate": "1996-06-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-03-03 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-22 00:00:00",
              "CBI_Flag": 0,
              "Description": "Natural Gas Cryogenic Processing Unit",
              "_chemicals": [
                {
                  "PrimaryKey": 6208,
                  "PreventionProgram3ID": 5321,
                  "ProcessChemicalID": 12637
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 9242,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Larose Fire District #3",
    "CoordinatingAgencyPhone": "5046328068",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9242,
      "SummaryText": "Risk Management Plan\nLarose Gas Processing Plant\nExecutive Summary\n\nLaDEQ Facility ID No. 27399\n\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES     \n\nThe Larose Gas Processing Plant is committed to worker and public safety.  This commitment is demonstrated by our efforts in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, facility trained personnel will evaluate the situation, take actions within the capabilities of the facility, and/or notify the necessary outside agencies.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES     \n\nThe Larose Gas Processing Plant is located on Louisiana State Highway No. 24 approximately one half mile west of Larose, Louisiana.  The Larose Gas Processing Plant provides condensate removal, conditioning, natural gas drying, and cryogenic processing of natural gas for a natural gas gathering pipeline system.  Methane, condensate and natural gas liquid products are shipped from the facility via pipeline systems.  The Larose Gas Processing Plant is capable of storing both propane and butane to meet the minimum RMP reporting quantities.\n\nOFFSITE CONSEQUENCE ANALYSIS RESULTS\n\nThe worst-case scenario (WCS) for the Larose Gas Processing Plant is a vapor cloud explosion involving the largest inventory of a flammable mixture (Natural Gas Liquid - Raw Make consisting predominately of Ethane, Propane and Butane), contained in a single pressurized process vessel.  The maximum quantity possible contained within this process vessel during an unlikely severe process upset is 180,000 pounds.  Although process and administrative controls are in place to limit this quantity, those controls were not considered in calculating this maximum quantity determination.  The entire inventory of the process vessel is ass"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9242,
      "SummaryText": "umed to release, form a vapor cloud, ignite and explode - creating a Vapor Cloud Explosion (VCE).  Using RMP*CompTM, the maximum distance to the 1-psig overpressure endpoint is 0.4 miles.  Although we have numerous controls to prevent such releases, and to manage their consequences, no credit for passive mitigation measures is taken into account in evaluating this WCS.\n\nThe alternative release scenario (ARS) that is used as a planning case at the Larose Gas Processing Plant is a, 3/4\" outside diameter tubing line rupture within the residue gas cooler causing a residue natural gas release to the cooling water discharge line.  The natural gas release reaches the outfall structure at Bayou Blue through the cooling water discharge line. The release rate is 1,000 pounds per minute and is assumed to last for 15 minutes before valves can be realigned to stop the release.  The released natural gas is ignited causing a vapor cloud fire.  Using RMP*CompTM, the maximum distance to the lower flammability limit endpoint for this scenario is 0.1 mile.  With a radius of 0.1 mile, this ARS would extend outside of the boundary of the Larose Gas Processing Plant.  There are no offsite receptors impacted by this ARS.  This event was selected as being a practical scenario for use in emergency planning and response.\n\n\n GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM \n \n  The following is a summary of the accident prevention program in place at the facility.  The process at the Larose Gas Processing Plant is regulated by both the Environmental Protection Agency's (EPA's) Risk Management Program (RMP) rule and the Occupational Safety and Health Administration's (OSHA's) Process Safety Management (PSM) standard.  Because RMP accident prevention requirements for this process are essentially the same as PSM, this summary addresses each of the OSHA PSM elements, and describes the management system in place to implement the accident prevention program at the Larose Gas Processing Plant.  \n \n Emp"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9242,
      "SummaryText": "loyee Participation\n \n The facility encourages employees to participate process safety management and accident prevention, including process hazard analyses, incident investigations, and the development of operating and maintenance procedures. These personnel also participate in safety meetings, resolving certain safety concerns, and updating and compiling technical documents and chemical information pertaining to the process and critical equipment.  \n \n Employees have access to information created as part of the facility's accident prevention program.  Specific ways that employees may be involved in the accident prevention program are outlined in a written employee participation plan that is maintained at the Larose Gas Processing Plant.  This employee participation plan addresses accident prevention program elements.  \n \n In addition, the Larose Gas Processing Plant has a number of initiatives under way which address process safety and employee safety issues.  These initiatives include forming teams to promote both process and personal safety.  The teams typically have members from various areas of the facility, including operations, maintenance, engineering, and facility management.\n \n Process Safety Information\n \n The Larose Gas Processing Plant keeps a variety of technical documents that are used to help maintain safe operation of the process.  These documents address chemical properties and associated hazards, limits for key process parameters and specific inventories, safety interlocks, suppression systems, vent and relief studies, and equipment design basis/configuration information. \n \n Chemical-specific information, including exposure hazards and emergency response/ exposure treatment considerations, is provided in material safety data sheets (MSDSs). For specific process areas, the facility has documented safety-related limits for specific process parameters (e.g., temperature, level, composition) in the equipment specifications and operating procedures. "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9242,
      "SummaryText": " The Larose Gas Processing Plant maintains the process within these limits by using process controls and monitoring instruments, trained personnel, and protective instrument systems (e.g., automated shutdown systems).\n \n The Larose Gas Processing Plant also maintains technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment.  This information, in combination with procedures and equipment operating history, provides a basis for inspection and maintenance activities, as well as for evaluating proposed process and facility changes so safety features in the process are not compromised.  Additional and/or modified process safety information resulting from process or facility changes are updated through the management of changes process.\n \n Process Hazard Analysis (PHA)\n \n The Larose Gas Processing Plant has a program to identify and control hazards associated with the various processes that are identified and controlled.  Within this program, the process is systematically examined to identify potential hazards and controls in place to manage these hazards, and recommend additional controls, as appropriate.\n \n The facility uses a variety and combination of applicable methodologies to conduct PHAs.  These PHAs address (1) facility siting, (2) human factors, (3) qualitative evaluation of a range of the possible safety and health effects of failure of controls on personnel, (4) and one or more of the following methodologies appropriate to determine and evaluate the hazards of the process (a) What-if; Checklist, (b) Hazard and Operability (HAZOP), (c) Failure Mode and Effects Analysis (FMEA), (d) Fault Tree Analysis, or (e) an appropriate equivalent methodology.  PHAs are conducted using a team of people who have operating and maintenance experience, as well as engineering expertise.  This PHA team identif"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 9242,
      "SummaryText": "ies and evaluates potential hazards of the process as well as accident prevention and mitigation measures, and then makes recommendations for additional prevention and/or mitigation measures. \n \n The PHA team recommendations are forwarded to management for resolution. Implementation of additional prevention and/or mitigation options in response to PHA recommendations is based on a relative priority ranking assigned by the PHA team.  The approved prevention and/or mitigation options in response to PHA team recommendations are tracked until they are completed.  The final resolution of each recommendation is documented and retained.\n \n The Larose Gas Processing Plant revalidates these PHAs at least every 5 years, and will be conducted at this frequency until the process no longer contains hazardous chemicals above the threshold quantities.  The recommendations from these revalidated PHAs are also forwarded to management for resolution, and the final resolution of each revalidated PHA recommendation is documented and retained.\n \n Operating Procedures\n \n The Larose Gas Processing Plant maintains written procedures that address various modes of process operations.  These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  These procedures are periodically reviewed and certified as current and accurate. In addition, the Larose Gas Processing Plant maintains information on how to respond to upper or lower limit exceedances for specific process or equipment parameters.  This information, along with written operating procedures, is available to operators in the process unit and for other personnel to use as necessary to safely perform their job tasks.\n\n  Training\n \n To complement the written procedures for process operations, the Larose Gas Processing Plant has implemented a training program for employees involved in operating the process.  New operational employees receive training on the Larose Gas Pr"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 9242,
      "SummaryText": "ocessing Plant's operating procedures and basic training in process operations, if they are not already familiar with such operations.  A new operator is paired with a senior operator to learn process-specific duties and tasks.  After operators demonstrate adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently. In addition, operators periodically receive refresher training on the operating procedures to maintain their skills and knowledge at an acceptable level.  This refresher training is conducted at least every 3 years, or more frequently upon request.  Training is documented for each operator, including demonstrated skills used to verify that the operator understood the training.  Process maintenance personnel are trained in their perspective duties for maintaining the mechanical integrity of critical process equipment and systems.  Operational and maintenance personnel also receive training on the procedures for conducting hot work permitting; management of change; and other appropriate safe work practices.  \n \n Contractors\n \n The Larose Gas Processing Plant uses contractors to supplement its workforce during periods of increased maintenance or construction activities.  As part of a contractor safety management program, contractor's safety programs and performance are evaluated, contractors are oriented to the potential hazards and applicable emergency procedures, and periodically reviewed for their safety performance while on the job.  A contractor's specific job skills and knowledge are also included during the evaluation process. Other aspects of this contractor safety management program that apply to contractors working on or near process equipment include procedures to enable contractors to: (1) Perform their work in a safe manner;  (2) Be aware of the hazards in their workplace;  (3) Understand what to do in the event of an emergency;  (4) Understand and follow site safety rules; and  (5) Inform facil"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 9242,
      "SummaryText": "ity personnel of any hazards that are found during their work.  This is accomplished by providing contractors with a process overview, information about safety and health hazards, emergency procedure requirements, and applicable safe work practices.  The Larose Gas Processing Plant evaluates contractor safety programs and facility personnel periodically monitor contractor performance with regard to their safety obligations.\n \n Pre-startup Safety Reviews (PSSRs)\n \n The Larose Gas Processing Plant conducts a PSSR for new or modified facilities that require a change in the process safety information.  The purpose of the PSSR is to determine that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides an additional check that construction is in accordance with the design specifications and required safety systems are operationally ready.  A PSSR also verifies that appropriate safety, operational and maintenance procedures are in place, and adequate training has been provided to the appropriate personnel.  A PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.  When new facilities are commissioned, a PHA is included in the PSSR.  \n \n Mechanical Integrity\n \n The Larose Gas Processing Plant has established practices and procedures to maintain critical process equipment in a safe operating condition.  The basic aspects of this program include (1) utilization of maintenance personnel, (2) developing written procedures, (3) performing inspections and tests, and (4) correcting identified deficiencies.  In combination, these activities form a system that maintains the mechanical integrity of the process.  Inspections and tests are performed to help verify equipment functions as intended and that equipment is within acceptable limits.  If a "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 9242,
      "SummaryText": "deficiency is identified that presents an immediate safety concern, Larose Gas Processing Plant personnel will correct the deficiency before placing the equipment back into service. \n \n Safe Work Practices\n \n The Larose Gas Processing Plant has safe work practices in place to help provide worker and process safety.  Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to isolate energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping or equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work), and (5) a permit and procedure to verify that adequate precautions are in place before entry into a confined space.  These procedures (and others), along with training of affected personnel, form a system to help perform operations and maintenance activities safely.\n \n Management of Change\n \n The Larose Gas Processing Plant has a system to manage changes to covered processes.  Changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes are reviewed and authorized before being implemented.  Changes are reviewed to (1) determine that adequate controls are in place to manage new hazards and (2) determine that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, equipment information, and operating procedures are updated.  In addition, operating and maintenance personnel are provided necessary training on the change.\n \n Incident Investigation\n \n The Larose Gas Processing Plant investigates incidents related to a covered process that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  The goal of an investigation is to determine the factors that"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 9242,
      "SummaryText": " may have led to the incident, and develop corrective actions to prevent a recurrence of the incident or a similar incident.  The investigation team documents its recommendations to prevent a recurrence, and forwards these recommendations to facility management for resolution. Corrective actions taken in response to the investigation team's recommendations are tracked until they are complete.  The final resolution of each recommendation is documented, and the investigation results are reviewed with employees (including contractors) who could be affected by the recommendations.  Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHAs and PHA revalidations. \n \n Compliance Audits\n \n To help determine that the accident prevention program is functioning properly, the Larose Gas Processing Plant periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are conducted at least every 3 years.  The audit team develops findings that are forwarded to facility management for resolution.  Corrective actions taken in response to the audit team's findings are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained.  \n \n SPECIFIC PREVENTION STEPS\n \n The process at the Larose Gas Processing Plant has potential hazards that are managed for continued safe operation.  The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\n \n Universal Prevention Activities\n \n The accident prevention program summarized previously is applied to the RMP-covered process at the Larose Gas Processing Plant.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n \n Special"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 9242,
      "SummaryText": "ized Safety Features\n \nThe Larose Gas Processing Plant has safety features to provide a means of containing /controlling a release, detecting a release, and reducing the consequences of (mitigate) a release.  The following types of safety features are used in the RMP-covered process: \n \n Monitoring and detection systems include (1) hydrocarbon gas detectors, (2) operations personnel on site 24 hours per day providing routine surveillance, (3) audible and visual warning alarms, and (4) Distributed Control System (DCS) providing real-time monitoring and control.\n \n Process controls include (1) relief devices to avoid overpressure of process equipment, (2) flare system to capture and incinerate episodic releases, (3) valves to permit process control or isolation (manual or automated), (4) interlocks and automated shutdown systems for specific process parameters (e.g., high temperature, pressure, level, etc.), and (5) redundant equipment and instrumentation (e.g., uninterruptible power supply for DCS).\n \n Active and passive mitigation systems include (1) fire suppression and extinguishing systems, (2) emergency procedures to react to emergencies, (3) curbing or diking for spill prevention and control, and (4) communications link with local emergency planning committee (LEPC).\n \n Release mitigation systems include (1) fire suppression and extinguishing, (2) coordination with emergency response personnel, and (3) personal protective equipment (e.g., fire retardant clothing).\n \n  FIVE-YEAR ACCIDENT HISTORY\n \n The Larose Gas Processing Plant has an excellent record of accident prevention over the past 5 years. The following table is a summary showing that the LGPP has not experienced an RMP event with onsite or offsite effects during the past 5 years. \n \n                                                                            1994  1995  1996  1997  1998  1999\nNumber of RMP Events with Onsite Effects         0        0        0        0        0        0\nNumber of RMP Ev"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 9242,
      "SummaryText": "ents with Offsite Effects         0        0        0        0        0        0\n \n EMERGENCY RESPONSE PROGRAM INFORMATION\n \n The Larose Gas Processing Plant maintains a written emergency action plan, which is in place to help protect worker and public safety as well as the environment.  The plan identifies steps to be taken in case of an accidental release including first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, and notification of local emergency response agencies. Employees receive training in these procedures as necessary based on their specific emergency duties.  The emergency action plan is updated when necessary based on modifications made to the process or other Larose Gas Processing Plant facilities.  \n \n The overall emergency action program for the facility has been coordinated with the Larose Fire Department.  This coordination includes meetings with Fire Department personnel.  The Larose Gas Processing Plant is manned 24 hours a day and has around-the-clock communications capability with the Fire Department.  This interface provides the means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident. \n \n PLANNED CHANGES TO IMPROVE SAFETY\n \nThe Larose Gas Processing Plant anticipates making the following safety-related enhancements concerning prevention of accidental releases. \n\n7 Installation of a computerized maintenance management system.\n7 Rerouting of scrubber dump lines into a separator to eliminate potential hydrocarbon vapor releases. \n7 Installation of camera surveillance from the control room."
    }
  ]
}