{
  "FacilityID": 9267,
  "FacilityName": "Ambar Chemical - Manistee",
  "FacilityStr1": "1501 Main St.",
  "FacilityStr2": null,
  "FacilityCity": "Manistee",
  "FacilityState": "MI",
  "FacilityZipCode": "49660",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26101",
  "LEPC": "Manistee County LEPC",
  "FacilityLatDecDegs": "44.231944",
  "FacilityLongDecDegs": "-86.302778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 39174818,
  "ParentCompanyName": "Ambar, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 39174817,
  "Company2DUNS": 0,
  "OperatorName": "Ambar, Inc.",
  "OperatorStr1": "16825 Northchase",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77060",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bill Ellison",
  "RMPTitle": "Plant Manager",
  "FTE": 98,
  "OtherEPAFacilityID": "MIR000026187",
  "EPAFacilityID": "100000114627",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "499-96",
  "SafetyInspectionDate": "1999-04-06 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-08-05 00:00:00",
  "DeRegistrationEffectiveDate": "2001-07-15 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 44.23227,
  "FRS_Long": -86.30562,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility 'closed'.",
  "_processes": [
    {
      "ProcessID": 11354,
      "AltID": "Chemical Manufacturing",
      "FacilityID": 9267,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 11626,
          "ProcessID": 11354,
          "NAICSCode": "32519",
          "_desc": {
            "NAICS_CODE": "32519",
            "NAICS_DESCRIPTION": "Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 12676,
          "ProcessID": 11354,
          "ChemicalID": 60,
          "Quantity": 205000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 60,
            "ChemicalName": "Bromine",
            "CASNumber": "7726-95-6",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 12677,
          "ProcessID": 11354,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 512676,
          "ProcessID": 11354,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 512677,
          "ProcessID": 11354,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9267,
      "SummaryText": "1.0    EXECUTIVE SUMMARY\n\n\n1.1    Accidental Release and Emergency Response Policies\n\n    The Bromine Plant facility at Ambar Chemical located at 1501 Main St. Manistee, MI is stand-alone facility with numerous passive and active mitigation systems to prevent and respond to chemical emergencies.  Systems in-place to prevent accidents of this nature include, but are not limited to:\n\n7 Stand-by emergency storage vessels dedicated for the emergency transfer of regulated chemicals.  These vessels are capable of holding the maximum quantities of regulated chemicals stored in the primary storage vessels.\n7 Secondary concrete containment for the storage vessels.  In addition, storage vessels, and processes which involve these chemicals, are inside enclosed buildings.\n7 Storage vessels, process equipment, and associated piping are lined with corrosion- proof liners constructed of materials compatible with the regulated chemicals.\n7 Halogen (Bromine/Chlorine) detectors located throughout the Bromine Plant building complex will signal the presence of any spilled or released regulated chemicals.\n7 Automatic valves to isolate/limit releases.\n7 Relief valve systems to guard against storage and process vessel overpressure.\n7 Regular equipment inspections, calibrations and maintenance through the site's Preventive Maintenance and Mechanical Integrity programs.\n7 Excess flow/check valves on Chlorine transfer lines to limit and prevent releases.\n7 Computer controlled air-pad system to regulate Bromine storage vessel pressure.\n7 Remote and local valve operations to prevent overfill of storage vessels.\n7 Safety interlock systems to shut down critical processes.\n\nSystems and operational procedures in place to respond appropriately to emergencies involving regulated chemicals include, but are not limited to:\n\n7 Halogen (Bromine/Chlorine) detectors located on the fence-line that surrounds the Bromine Plant building complex.\n7 Halogen detectors within the Bromine Plant building complex, to warn op"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9267,
      "SummaryText": "erations personnel at the presence of 1.0 ppm of halogen material.\n7 Halogen detectors within the Bromine Plant building complex, and/or the external fence-line, are interlocked to shutdown loading/unloading and critical process operations and to activate the emergency ventilation and scrubber system at the presence of 5.0 ppm of halogen material.\n7 Emergency ventilation and scrubber system to contain and treat (neutralize) any released regulated chemical inside the loading/unloading, storage, or process buildings.\n7 Emergency scrubber system has the capabilities of containing and treating the maximum quantity of regulated material stored on-site.\n7 On-site team of operations personnel trained and certified by the USEPA in Emergency Response to Hazardous Material Incidents. \n7 Full supplement of HAZMAT emergency response gear and equipment, including: Level A & B personal protective equipment, self-contained and supplied-air breathing capabilities, portable regulated material detection capabilities, and fully-equipped Chlorine Institute Emergency Kit \"C\".\n7 Communication capabilities with public emergency response agencies.\n7 Direct dial communication to local Fire Department via fence-line halogen detection.\n7 Bromine Plant building complex is fully fenced and includes video camera monitoring system for security purposes.\n7 Plant-wide emergency warning system.\n7 On-site weather station to determine temperature, wind speed and direction.\n7 Emergency Response Plan for site operations.\n7 Emergency generator, and uninterrupted power supplies (UPS) for computer operations, for operation of emergency ventilation/scrubber system and computer processes in the event of a power failure.\n\n\n1.2    Stationary Source and Regulated Substances Handled\n\nPrimary Activities:  Ambar Chemical produces Calcium Chloride and Bromine.  Calcium Chloride is a basic chemical used for ice melt, dust control, water treatment, oil field completion fluids and food preservatives.  Ambar produces vari"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9267,
      "SummaryText": "ous grades of liquid and solid calcium chloride and ships the product in packages or bulk, in trucks or by rail.  Bromine is a building block chemical that is used in the manufacture of fire retardant, pharmaceuticals, perfumes, heavy brine fluids and other specialty chemicals.  Ambar Chemical's Manistee plant started Calcium Chloride production in 1996 and recently completed the addition of a state of the art Bromine plant.  The primary raw material for both products is a brine effluent stream from another Manistee area plant.\n\nUse of Regulated Materials:  \n\n7 Bromine is a finished product manufactured at the site\n7 Chlorine is a raw material used to produce Bromine\n\nQuantities Handled or Stored:  Maximum quantities stored on-site\n7 Bromine: 205,854 lbs. (8,000 gallons)\n7 Chlorine: 180,000 lbs. (90 tons)\n\n\n1.3    Worst-Case Release Scenarios and Alternative-Case Release Scenarios\n\n    Worst-Case Scenarios:\n1. Failure of largest Bromine storage vessel (8,000-gallon capacity).  Resulting in a liquid spill and vaporization of 205,854 lbs. of Bromine into the secondary containment structure.  Failure of all active mitigation systems.  Worst possible weather conditions (low wind speed, low humidity).  Mitigation measures that limit the distance to endpoint for the reported scenario include:\n7 secondary concrete containment (10,185-gallon capacity);\n7 storage vessels are inside an enclosed building (1911 square feet floor area);\n\nDistance to Endpoint:  1.2 miles*\n\n2. Failure of largest Chlorine storage vessel (90-ton capacity).  Resulting in a gas release of 180,000 lbs. of Chlorine in the duration of 10 minutes.  Failure of all active mitigation systems.  Worst possible weather conditions (low wind speed, low humidity).  Mitigation measures that limit the distance to endpoint for the reported scenario include:\n7 secondary concrete containment;\n7 storage vessels are inside an enclosed building (1911 square feet floor area);\n\nDistance to Endpoint:  9.9 miles*\n\n*Under worst-case"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9267,
      "SummaryText": " weather conditions, the regulated material could travel this distance before dispersing enough to no longer pose a hazard to the public.  These distances are based on an EPA-designated endpoint (the chemical concentration in air to which a person can be exposed for an hour without irreversible or serious health effects; the concentration levels that could impact health vary significantly by chemical).  Computer models developed by the EPA were used to simulate these conditions.\n\n\nAlternative-Case Scenarios:\n\n1. Failure of liner in 1\" discharge piping for finished product pump from Bromine purification column, resulting in a =\" hole in the carbon steel pipe and loss of the complete contents of the purification column sump (~30 gallons).  Subsequent release is 390 lbs/min of Bromine for the duration of 2 minutes.  Passive and active mitigation systems to contain release are functional, including:\n7 process operations occur inside an enclosed building;\n7 operational procedure that limits quantity of Bromine in the purification sump to ~30 gallons (780 lbs.);\n7 halogen (Bromine) detectors in the process building alarm operations personnel of the presence of 1.0 ppm of a halogen;\n7 halogen (Bromine) detectors are interlocked to shut down critical process operations and activate the emergency ventilation/scrubber system at the presence of 5.0 ppm of a halogen;\n7 emergency ventilation/scrubber system to neutralize any released Bromine vapors in the process building;\n7 emergency ventilation/scrubber system has redundant ventilation blowers and scrubber pumps;\n7 emergency generator for operation of emergency ventilation/scrubber system and computer processes (which has in addition, an uninterruptible power supply) in the event of a power failure;\n7 emergency response procedures to initiate the shut down of Bromine feed (1.0 gallons/minute) to the purification column by closing an isolation valve;\n7 site-specific Emergency Response Plan including the activation of an on-site"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 9267,
      "SummaryText": " Hazardous Material Response Team (EPA trained and certified at the Technician Level);\n\nDistance to Endpoint: No offsite consequence\n \n2. Failure of the 1\" liquid Chlorine transfer line from the Chlorine rail car during unloading operations, resulting in a Chlorine release of 1000 lbs. over a duration of 10 minutes.  Passive and active mitigation systems to contain release are functional, including:\n7 rail car transfer operations occur inside an enclosed building;\n7 excess flow valve on Chlorine rail car will stop flow of Chlorine transferring from car when flow reaches specified rate;\n7 closing of manual angle valve on rail car will isolate/limit release;\n7 halogen (Chlorine) detectors in the loading/unloading building alarm operations personnel of the presence of 1.0 ppm of a halogen;\n7 halogen (Chlorine) detectors are interlocked to activate the emergency ventilation/scrubber system at the presence of 5.0 ppm of a halogen;\n7 emergency ventilation/scrubber system to neutralize any released Chlorine vapors in the loading/unloading building;\n7 emergency ventilation/scrubber system has redundant ventilation blowers and scrubber pumps;\n7 emergency generator for operation of emergency ventilation/scrubber system and computer processes (which has in addition, an uninterruptible power supply) in the event of a power failure;\n7 site-specific Emergency Response Plan including the activation of an on-site Hazardous Material Response Team (EPA trained and certified at the Technician Level);\n\nDistance to Endpoint: No offsite consequence\n\n\n \n1.4    Accidental Release Prevention Program\nThe Bromine Plant operations that use and process regulated materials is in compliance with the applicable 29 CFR 1910.119 Process Safety Management Standard of OSHA.  Compliance with this standard includes Process Hazard Analysis, Pre-Startup Safety Reviews, Management of Change, Operational and Maintenance Procedures, Employee Training and Participation, Mechanical Integrity and Contractor progra"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 9267,
      "SummaryText": "ms.  In addition, the Bromine Plant operates in a state of the art facility.  Releases are prevented by the various passive and active mitigation systems in use at this site.\n\n1.5    Five-Year Accident History\nThe Ambar Chemical site has had no releases involving a regulated substance that qualifies under the Part 68 regulations.  According to Part 68 requirements the regulated substance release must have caused at least one of the following: \n7 on-site deaths, injuries, or significant property damage; or\n7 known off-site deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\n\n1.6    Emergency Response Program\nThe Ambar Chemical facility has a site-specific Emergency Response Plan to prevent or minimize injuries, reduce the impact on the general public, provide guidance to personnel who will have to deal with emergencies, and minimize equipment damage.  This document focuses on the planning and preparation needed to extend the responsibilities normally exercised by key plant personnel to respond to incidents which may expose people on-site or off-site to injury. \nThe scope of the Emergency Response Plan includes:\n7 A chemical release contained within the plant facilities and controllable by Ambar Chemical personnel and equipment;\n7 A chemical release affecting, or with the potential to affect, the area surrounding the facility; such a release would require coordinated efforts between Ambar Chemical personnel and local emergency response personnel;\n The Emergency Response Plan (ERP) is activated upon identification of a chemical release/spill, fire or explosion, natural occurrence, or civil disorder at, or adjacent to, Ambar Chemical property.  The personnel, equipment, and procedures identified in the ERP shall be used to respond to emergencies outlined, including the following:\n7 Facility information including a description of current operations and site maps.\n7 Identification of personnel assigned specific responsibilities to emerg"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 9267,
      "SummaryText": "ency functions.\n7 Listing of telephone numbers of Ambar Chemical and local response agency emergency contacts, HAZMAT Team 24-hour numbers, and internal phone extensions.\n7 Descriptions of the internal facility emergency alarm system and the external automatic direct dial system that contact the local Fire Department in the event of a halogen detection at the Bromine Plant fence-line.\n7 Facility evacuation procedures and evacuation plan map, accountability procedures for personnel and visitors, identification of facility evacuation assembly areas and chemical release \"safe havens\".\n7 Specific personnel emergency responsibilities during a chemical release.  Includes site-specific procedures and checklists for the proper coordination of response personnel and delegation of duties required to be completed in the event of an emergency.\n7 Directions on the proper handling of outside inquiries.\n7 HAZMAT Team responsibilities/duties and procedures for: emergency response operations, spill response/dike management, identification of proper chemical protective clothing, post-incident response techniques, emergency response team personnel training, facility drills/exercises, and emergency response equipment.\n7 Directions for emergency treatment for specific first aid/medical services required as a result of exposure to hazardous materials on site.\n7 Notification procedures and phone number listings of external agencies (i.e., OSHA, CHEMTREC, MIDEQ, Coast Guard).\n7 Instructions for the use of portable detection instruments and the Emergency Kit \"C\" (Chlorine rail car releases).\n \n1.7    Planned Changes to Improve Safety\nThe prevention of accidents and proper emergency response measures to events involving the release of regulated chemicals will be evaluated through the facility's continuous improvement process.  The site's Process Safety Management Program will continually review operation hazards and required safety systems.  The Management of Change system will thoroughly revie"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 9267,
      "SummaryText": "w the effects of changes or additions of chemicals, equipment or procedures.  In addition, this system will initiate the proper Process Hazard Analysis to be performed on any applicable changes or additions.  Prior to the use of any changed or added material or equipment Ambar Chemical personnel will perform system evaluations and completeness of all Hazard Analysis recommendations through the Pre-Startup Safety Review process.  These systems provide the management structure for continuous evaluation of safe processes.\n"
    }
  ]
}