{
  "FacilityID": 9319,
  "FacilityName": "AES Alamitos, L.L.C.",
  "FacilityStr1": "690 North Studebaker Road",
  "FacilityStr2": null,
  "FacilityCity": "Long Beach",
  "FacilityState": "CA",
  "FacilityZipCode": "90803",
  "Facility4DigitZipExt": "2221",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.770833",
  "FacilityLongDecDegs": "-118.102778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "AES Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "AES Alamitos, L.L.C.",
  "OperatorStr1": "690 North Studebaker Road",
  "OperatorStr2": null,
  "OperatorCity": "Long Beach",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90803",
  "OperatorZipCodeExt": "2221",
  "RMPContact": "Mark Woodruff",
  "RMPTitle": "Station Manager",
  "FTE": 92,
  "OtherEPAFacilityID": "CAR000038265",
  "EPAFacilityID": "100000115083",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "115394",
  "SafetyInspectionDate": "1999-06-10 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.76889,
  "FRS_Long": -118.09972,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 11449,
      "AltID": "NOx Reduction by NH3",
      "FacilityID": 9319,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 11723,
          "ProcessID": 11449,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 12810,
          "ProcessID": 11449,
          "ChemicalID": 57,
          "Quantity": 157100.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 512810,
          "ProcessID": 11449,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9319,
      "SummaryText": "General Facility Overview and Process Description\n\nFor many decades, the Southern California Edison Company (SCE) has supplied electricity to much of California.  To generate this electricity, SCE operated many power plants which use a variety of resources, including fuel oil, natural gas, coal, nuclear, and hydroelectric.  SCE's Alamitos Generating Station, located in the at the southeastern edge of Long Beach at the seal beach border in the City of Long Beach, California, has operated in this community serving southern California for over 25 years.  The Alamitos Generating Station was purchased by AES Corporation as part of California's deregulation of the electric utility industry (and is now known as AES Alamitos, L.L.C.).  SCE retained the electrical transmission facilities (e.g. the switchyards, power distribution lines), and (through Edison O&M Services) provides generating station operation and maintenance services under contract to the new owners of the generating stations. \n\nThe AES Alamitos, L.L.C. power generating facility burns natural gas in boilers to produce steam.  The facility has the ability to burn fuel oil, but does so only exceptionally rarely due to air quality concerns.  The steam is used in turbine generators to produce electricity.  Currently, the station actively operates six boiler/steam turbine generating units, designated Units 1 through 6.  Units 5 & 6 are operated from a common control room and are rated at 480 MW each with each producing 3,481,000 lbs/hr. steam.\n\nThe basic flow path of each boiler is as follows:  (1) combustion air is supplied by fans to the air preheater where it is heated, (2) the heated air is mixed with fuel in burners to produce a flame and hot flue gases (combustion products), (3) the hot flue gases flow through the radiant and then the convective passes of the boiler, (4) heat is removed from the flue gas as it flows over the outside of tubes (pipes) in the boiler, (5) water flowing in the inside of the tubes "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9319,
      "SummaryText": "is converted to steam as this heat is absorbed, (6) the flue gas flows through the air preheater where a final increment of heat is removed in preheating the incoming combustion air, and (8) the flue gas exists the boiler stack.\n\nAs part of any fossil fuel combustion process, a small amount of nitrogen oxides (NOx) are produced and is exhausted to atmosphere with the other flue gas constituents (mostly nitrogen, carbon dioxide, and water vapor).  The amount of NOx which the station is allowed to emit is regulated by the South Coast Air Quality Management District (SCAQMD).  In 1991 - 1992, the SCAQMD revised its Rule 1135 which reduced the allowed NOx emissions and specifically required that SCE (the previous owner and current operator (for AES) of the generating station) install a NOx emission reduction system on the two largest Units - # 7&8. In 1993, SCE installed a Selective Catalytic Reduction (SCR) NOx Control System on Units 7 & 8,  which are operated from a common control room.  Identical SCR systems were designed and installed by the same firm, Noell, Inc., at several southern California SCE generating stations.\n\nThe SCR process involves injecting aqueous ammonia into the boiler flue gas in the boiler's convective pass.  The ammonia/flue gas mixture flows through a catalyst installed between the convective pass and the air preheater.  In the presence of the catalyst, the ammonia and NOx react to form nitrogen and water vapor, which exits out the boiler stack.  About 87% of the NOx is removed in this manner.  The SCR system uses a 29.4% aqueous ammonia solution in the SCR system.  The aqueous ammonia is stored in a 20,000 gallon double walled underground storage tank.  The aqueous ammonia is one of several hazardous materials used at the facility which are critical to the safe and continued generation of electricity for the community.  As AES Redondo beach utilizes aqueous ammonia over the federal 10,000 pound RMP threshold, the facility and the SCR process "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9319,
      "SummaryText": "are covered under the federal and state Risk Management Prevention program. \n\nAccidental Release Prevention and Emergency Response Policies \n\nAES Alamitos has had an active hazardous materials management and accident prevention program for many years, and emphasizes safety and good management practices in all its activities - conducting all activities in accordance with a detailed, well established Accident Prevention Manual and active participation by management, line and contractor employees.  The AES Alamitos facility has an exceptionally strong safety team and committee program.  This program is actively and visibly supported by facility management.  The facility has in place several long-established procedures and policies governing hazardous materials and waste handling, spill prevention, environmental compliance and inspections, and several other safety related policies. \n\nAdditionally, for the past fifteen years, AES Alamitos has maintained a hazardous materials emergency preparedness and response program to reduce the likelihood of a hazardous materials release, and minimize the impacts should any spill or release occur.  Since the installation of the SCR system in 1993, the facility has not had any releases of aqueous ammonia from the SCR system or aqueous ammonia storage systems. \n\nThe AES Alamitos hazardous materials emergency response program supports and provides for the trained response by designated facility emergency response personnel to incidents involving a wide range of materials.  The facility conduct frequent drills and training for such responses.  Specifically as it relates to the aqueous ammonia and SCR system, AES Alamitos personnel are trained to only respond to an aqueous ammonia release if it can be done so safely and without possible risk to safety or health (e.g. minor, incidental spills of low volume).  AES Alamitos will immediately contact and rely upon outside response agencies, as well as pre-contracted, qualified emergency respon"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9319,
      "SummaryText": "se contractor for all other aqueous ammonia releases.\n\nWorst Case and Alternate Release Scenarios\n\nSeveral potential worst case scenarios were evaluated as part of the RMP Offsite Consequence Analysis, with the scenario resulting in the largest calculated off-site impact being selected for inclusion in the final RMP Plan.  EPA has defined the worst-case scenario as the release of the largest quantity of a regulated substance from a single vessel or process line failure that results in the greatest distance to an endpoint without regard to any active control, prevention or mitigation measures in place.\n\nSeveral potential worst case scenarios were evaluated as part of the AES Alamitos RMP program, with the scenario resulting in the largest calculated off-site impact being selected for inclusion in the final RMP plan.  The worst case release scenario was performed on the largest (aboveground) vessel and the alternative case scenario was developed as a result of the process hazard review studies for the SCR system and the above ground 7,500 gallon capacity aqueous ammonia storage 'day' tank utilized by the water treatment system.  \n\nBased on EPA's Offsite Consequence Guidance and the RMP*Comp(tm) (v 1.06) dispersion modeling program (developed by USEPA and the National Oceanic and Atmospheric Administration (NOAA)) it was determined that the worst case scenario would be the 7,500 gallon capacity day tank (which stores a maximum of 1,000 gallons) catastrophically failing and releasing its contents in 10 minutes onto an asphalt surface forming a puddle 1 cm (.033 feet).  The facility strictly limits (via procedures and level indicators) the volume of aqueous ammonia held in this tank to a maximum of 1,000 gallons (typically less than 500 - 700 gallons).  EPA allows the incorporation of administrative limits on the volume of material involved in a process in performing the worst case release scenario analysis.  This scenario (1,000 gallons being released within a 10 minute"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 9319,
      "SummaryText": " time period) was calculated to result in a minor off-site impact.\n\nThe largest vessel in the system, the 20,000 gallon aqueous ammonia storage tank, was not selected as it is located 100% underground.  No off site toxic impact would occur - even in the event of a catastrophic release of 20,000 gallons.  The chemical vendor's 6,000 gallon aqueous ammonia delivery tanker truck was not included in this analysis as transportation units (tanker truck) are specifically excluded from the regulatory boundaries of a facility's Risk Management Program.\n\nThe results of the facility's Process Hazard Review was used to determine the most likely (e.g. credible) alternative case release scenario based on operations and system design and maintenance.  It was determined by consensus that the most significant, adverse yet credible release scenario was the catastrophic rupture of the 25 foot long, 2-inch diameter tanker truck offloading hose during loading operations at the 20,000 gallon underground tank.  The maximum delivery rate of the aqueous ammonia from the delivery truck 140 gallons per minute (gpm). The 6,000 gallon capacity truck is equipped with remotely activated emergency shut off controls, and unloading personnel are standing by with splash guards and respirators.  The hazard review team determined that the flow of aqueous ammonia from the truck could be stopped within one minute by the stand by personnel. \n\nThis scenario resulted in the highest volume of material released of any other credible release scenario considered - a spill on the open asphalt surface outside of the loading area, outside of any containment curbs, where the spill forms a pool 1 cm (.033 feet) deep covering an area of 566.4 square feet.  Based on this scenario - 140 gallons of aqueous ammonia released at the underground tank filling location, the 200 ppm toxic endpoint (impact zone) does not extend offsite and therefore does not have any off-site impacts.  Other possible alternative case scenarios "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 9319,
      "SummaryText": "were evaluated to determine if any would cause an offsite impact but all other alternate release scenarios (toxic endpoints) remained onsite as well.\n\nGeneral Accidental Release Prevention and Chemical-Specific Steps\n\nAs noted previously, AES Alamitos has had an active hazardous materials management and accident prevention program for many years, and emphasizes safety and good management practices in all its activities - conducting all activities in accordance with a detailed, well established Accident Prevention Manual and active participation by management, line and contractor employees.  Specific to the SCR system and underground storage tank, a multitude of release prevention design, procedural and operational elements and controls are in place and effective.  As part of this 1999 RMP development, AES Redondo had performed a Seismic Hazards Analysis which evaluated the stability and integrity of the SCR mechanical systems and related equipment relative to earthquake and related hazards.  Any recommendations to be made upon completion of the report (July 1999) will be evaluated and implemented as appropriate by the facility.  As detailed in the Maintenance section of the RMP, AES Alamitos has in place a multi-faceted inspection and maintenance program  - which includes daily visual inspections and annual maintenance overhauls.\n\nThe SCR system was designed by Noell, Inc.  The ammonia storage system was designed by Southern California Edison.  All equipment was installed by Powerplant Specialists, Inc., under contract to Noell, Inc.  The design of the SCR and ammonia storage system is governed by Occupational, Safety and Health Administration (OSHA), American Society of Mechanical Engineers (ASME), American National Standards Institute (ANSI), Uniform Building Code (UBC), National Fire Protection Association (NFPA), and California codes.  Installation was governed by the same codes.  The underground piping and tank design and installation were permitted and approve"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 9319,
      "SummaryText": "d by the Los Angeles County Department of Public Works and the Alamitos Fire Department.\n\nThe storage facility includes a single 20,000 gallon, double wall underground tank system with three aqueous ammonia supply pumps, piping, valves, instrumentation, controls, and electrical.  The aqueous ammonia storage tank system consists of a 50 psig primary horizontal pressure vessel (designed and manufactured in accordance with ASME Boiler and Pressure Vessel Code Section VIII) enclosed within a secondary containment tank (designed and manufactured in accordance with UL Standard 58) which is externally clad with fiberglass reinforced polyester resin (in accordance with UL Standard 1746).  The fiberglass resin was Holiday tested after delivery to ensure its integrity and corrosion inhibiting capability.\n\nThe primary vessel is equipped with a vacuum breaker with flame arrester and a large capacity relief valve set at 50 psig and vented to the atmosphere 12 ft. above grade.  The flame arrester eliminates any potential for an open flame to be drawn into the main tank.  The secondary containment tank is also vented to the atmosphere 12 ft. above grade through a dryer canister in parallel with a conservation pressure vent.  This arrangement prevents breathing in moisture while allowing a bypass path to prevent pressure build up in the secondary containment.\n\nA two inch fill line and a two inch vapor return line are routed from the primary vessel through block valves to quick connect type couplings for truck unloading.  The fill line allows the transfer of aqueous ammonia from the delivery truck to the tank, while the vapor return line allows the displaced ammonia vapors from the tank to be returned to the truck. The fill and vapor return piping are securely anchored at the truck unloading station.  The unloading station is within the spill containment barrier that runs along the perimeter of the tank.  The tank has a visual level gauge in the vicinity of the loading station to as"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 9319,
      "SummaryText": "sist the unloading truck operator and to prevent overfilling.  A ground cable is provided for connection to the unloading truck.  HAWS safety eyewash/shower combinations are provided at the storage tank and adjacent to the metering pump skid for each unit.\n\nThe piping system for aqueous ammonia is Schedule 80 Grade 316 stainless Steel with welded fittings in all areas by the metering pump, liquid injector area, and ammonia storage area.  The underground containment pipe is compression fitting 4\" PVC schedule 80.\n\nPower Piping Code ANSI B31.1 recommends piping hanger spans of 8 1/2 feet for 1 1/2\" diameter pipe size (water service) at 1g-loads.  The corresponding maximum weight stress level from table 121.5 of the ANSI B31.1 Code, 1989 edition, is 2300 psi.  Since the seismic g-load for the subject area is .3g in any horizontal direction, the combined load is only .42g in the horizontal direction.  Therefore, the allowable seismic span is estimated to be 20 feet (using (1.0g/0.42g) x 8.5 feet = 20 feet).  The seismic span for the aqueous ammonia piping is less than 10 feet in every case.  In addition, the pressure stress is negligible since the maximum aqueous ammonia pressure is only 90 psi.  Consequently, the seismic design of the aqueous ammonia piping is well within ANSI B31.1 limits.\n\nA liquid leak detection system is provided for the storage tank with leak detector elements installed in the secondary containment compartment (two elements), supply pump columns (one element each), safety relief valve discharge (one element), and underground piping secondary containment (one element).  The elements are wired to a local leak monitor and alarm panel which will also annunciate to control room operators via the plant distributed control system (DCS).  Detection of liquid in the underground piping secondary containment will trip the supply pumps.\n\nAn ammonia vapor detector system is provided with four ammonia detectors installed above grade on the perimeter of the stor"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 9319,
      "SummaryText": "age tank facility with additional detectors located around the metering pumps.\n\nThe detectors are wired to a local ammonia monitor and alarm panel which will also annunciate to control room operators via the plant DCS.  A safety shower is available in the tank area, and at the metering pump skid.\n\nThe control system has been upgraded using a Rosemount 9000 DCS.  Interlocks have been incorporated to shut off aqueous ammonia flow to the SCR system in case of low boiler load below 130 MW, low gas temperature in the boiler below 3500F, low SCR fan flue gas flow less than 4000 scfm, boiler fuel trip, aqueous ammonia tank pump failure.\n\nEquipment design, fabrication, procurement, and installation has been managed by PSI and Noell with SCE exercising management through application of its quality assurance procedures.  SCE intends to ensure ongoing mechanical and process integrity of equipment by incorporating manufacturers' maintenance, inspection, and testing procedures in the applicable station orders.\n\nThe existing station chemical feed system is an original Unit installation designed by Bechtel Inc.  The existing Polisher Demineralizer system was designed by the Cochren Division of the Crane Company.  The design of the existing chemical feed system is governed by the following codes:  ASME Section IX - Boilers, ANSI B33.1 - Power Piping, NFPA, OSHA, and the UBC.\n\nThe 7,500 gallon capacity aboveground vertical 'day' tank is used to stoire a maximum of 1,000 gallons of 29.4% aqueous ammonia as part the water treatment polisher/regeneration system.  The tank typically holds less than 700 gallons.  The tank is equipped with a 1 psig positive pressure and 1 ounce vacuum relief valve to prevent over pressurizing or implosion of the tank.  All related piping and valves on the tank are carbon steel and rated for 150 psig pressure.  Pressure gauges have also been installed on the tank in order to give operations proper indication.  The bulk ammonia supply pump is a centrifugal "
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 9319,
      "SummaryText": "pump and discharge pressure cannot exceed pipe rates and seals are checked on a routine basis to assure to leaks occur.  Written operating procedures and high level alarms/gauges prevent more than 1,000 gallons from being present in the 7,500 gallon tank.\n\nFive Year Accident History\n\nAES Alamitos has had zero (0) accidents involving the release or threatened release of aqueous ammonia from the SCR system since the system was first installed in 1993.\n\nEmergency Response Program\n\nAES Alamitos maintains a strong Hazardous Materials Emergency Response and Prevention Program.  AES Alamitos is member of the Long Beach Community Awareness and Emergency Response (CAER) program.  As detailed Section 9 'Training', all employees are trained in Hazardous Waste Operations and Emergency Response (HAZWOPER) Awareness Level 1, with all Team Leaders trained as HAZWOPER Level 5 Incident Commanders.  The curriculum meets federal and state OSHA HAZWOPER regulations. Employees who, in the course of their job duties, are involved in the operation, maintenance, sampling, engineering or supervision of the hazardous material or waste storage facilities receive training in hazardous waste and materials management, as do all facility hazardous waste generators.  This training includes the facility's Emergency Response Business Plan - which includes the required elements of a hazardous waste contingency plan as required by 22 CCR. \n\nThe AES Alamitos Emergency Response Business Plan is updated on an annual basis with the new revisions coordinated and reviewed with the Log Beach Fire Department upon issuance.  Emergency response and emergency planning issues are also reviewed with the Long Beach CAER group on a periodic ongoing basis.   \n\nThe AES Alamitos hazardous materials emergency response program supports and provides for the trained response by designated facility emergency response personnel to incidents involving a wide range of materials.  The facility conduct frequent drills and traini"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 9319,
      "SummaryText": "ng for such responses.  Specifically as it relates to the aqueous ammonia and SCR system, AES Alamitos personnel are trained to only respond to an aqueous ammonia release if it can be done so safely and without possible risk to safety or health (e.g. minor, incidental spills of low volume).  AES Alamitos will immediately contact and rely upon outside response agencies, as well as pre-contracted, qualified emergency response contractor for all other aqueous ammonia releases.\n\nPlanned Changes to Improve Safety\n\nAES Redondo is in the process of developing and conducting a series of RMP management compliance training classes to increase the understanding and reaffirm the commitment of AES corporate and facility management to the RMP program.  Additionally, the facility will review and implement as appropriate the recommendations contained in the impending Seismic Hazards Analysis.  Additional improvements include the remarking of all ammonia lines and pipes, increased inspection of pressure relief valve and the installation of additional vehicle crash prevention structures."
    }
  ]
}