{
  "FacilityID": 9510,
  "FacilityName": "Fred Meyer Clackamas Bakery",
  "FacilityStr1": "16253 SE 122nd Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Clackamas",
  "FacilityState": "OR",
  "FacilityZipCode": "97015",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41005",
  "LEPC": null,
  "FacilityLatDecDegs": "45.405806",
  "FacilityLongDecDegs": "-122.538639",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Fred Meyers, Inc.",
  "Company2Name": "Kroger Corporation",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Kroger Corporation",
  "OperatorStr1": "1014 Vine Street",
  "OperatorStr2": null,
  "OperatorCity": "Cincinnati",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45202",
  "OperatorZipCodeExt": "1100",
  "FTE": 170,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000116215",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-15 00:00:00",
  "SafetyInspectionBy": "OEM",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2006-01-27 00:00:00",
  "DeRegistrationEffectiveDate": "2000-08-05 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 45.405893,
  "FRS_Long": -122.542282,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 11735,
      "AltID": "Fuel for Ovens & Boilers",
      "FacilityID": 9510,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 13237,
          "ProcessID": 11735,
          "ChemicalID": 98,
          "Quantity": 110000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 12014,
          "ProcessID": 11735,
          "NAICSCode": "31181",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 5598,
              "Process_NAICS_ID": 12014,
              "SafetyReviewDate": "1999-06-15 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "API Standards; OSHA (29 CFR 1910.110 / 29 CFR 1910.119)",
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-15 00:00:00",
              "ChangeCompletionDate": "2000-06-15 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-15 00:00:00",
              "TrainingReviewDate": "1999-06-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-15 00:00:00",
              "EquipmentInspectionDate": "1999-03-15 00:00:00",
              "EquipmentTested": "Boilers, ovens",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 5798,
                  "PreventionProgram2ID": 5598,
                  "ProcessChemicalID": 13237
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 9510,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-15 00:00:00",
    "ERTrainingDate": "1997-06-01 00:00:00",
    "CoordinatingAgencyName": "Clackamas County Fire Department",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9510,
      "SummaryText": "1.0 EXECUTIVE SUMMARY\n\n1.10 Accidental Release Prevention and Emergency Response Policies\n\nProduction at the Fred Meyer, Clackamas Bakery requires the use of propane, or liquefied petroleum gas (LP-Gas), as a fuel for our gas-fired equipment.  Equipment utilizing this fuel includes two boilers, various ovens, and two clothes dryers.   Given the quantity handled, propane is considered a hazardous substance by EPA.  Many of the properties that make propane valuable as a fuel also requires that precautions and procedures be in place to protect employee and public health and safety during an emergency.  It is the policy of Fred Meyer, Clackamas Bakery to be in compliance with all applicable federal and state rules and regulations.  The design, installation, and maintenance of the propane system is in accordance with NFPA 58, state law, and industry accepted guidelines.\n\nSafety at our facility is inherent on the manner in which propane is handled.  While the design of the facility incorporates a multitude of safety devices, safe handling procedures combined with appropriate training of our personnel are key aspects to maintaining safety at our facility.\n\nIn the event of an emergency, it is our policy to notify the Clackamas Couty Fire Department and request that they respond to the emergency.   We have a written Emergency Response Plan, developed in compliance with the Emergency Response provisions of OAR 1910.120.  The plan includes pre-emergency planning and coordinating with outside parties.  This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events.\n\n 1.20 Facility Description And Substances Handled\n\n7 Fred Meyer, Clackamas Bakery uses natural gas to fuel the boilers and ovens, but \"peak demand periods\" for natural gas require the Bakery to switch to propane for fuel. Access to the facility is restricted to authorized employees, management personnel, and contractors.\n7 The regulated substance handled at this fa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9510,
      "SummaryText": "cility is propane.\n7 The propane system consists of a 30,000-gallon propane storage tank on the east side of the bakery within a fenced enclosure.\n\n1.30 The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nRelease scenarios were modeled using RMP*Comp (Version 1.06), a software program developed by the National Oceanic and Atmospheric Administration (NOAA) and EPA.  Offsite receptors were defined using the LandView III (Version 1.0) system.  This system estimates residential population within the circle defined by the endpoint of the worst-case and alternative release scenarios.  In addition, it lists whether certain types of public receptors and environmental receptors are within the circles.\n\n7 Worst-Case Scenario. Catastrophic failure of the 30,000-gallon propane storage tank when filled to the greatest amount allowed would release a maximum of 110,000 pounds of liquid propane, resulting in a vapor cloud explosion.  The storage tank is located outdoors.\n\nThe distance to the 1 psi overpressure endpoint for this worst-case scenario is 0.4 miles from the point of release.  This distance extends beyond the facility fence line, and would encompass a population of 820 with the closest residence approximately 0.1 mile from the site, inside of this release zone.  Two schools are about two and three miles away, a hospital is about eight  miles away, and a day care center about two miles away, outside of this release zone.  No other public or environmental receptors are located within this zone.  A release map corresponding to this scenario is located in Section 3.30. \n\nThis worst-case scenario would not likely occur unless an act of nature (e.g., earthquake) physically compromised the tank.   The structural integrity of the tank is safeguarded by periodic inspection for mechanical integrity to prevent a rupture due to tank degradation and is"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9510,
      "SummaryText": "protected from vehicular traffic. The tank is also safeguarded from rupture from over-pressurization.   It is a rated pressure vessel hydro-tested to 250 psi and equipped with 250psi pressure relief valves.  The design specification of the tank only allows a maximum capacity of 80% at 1250F, limiting the total amount of propane in the tank.  \n\n7 Alternative Scenario. The alternative release scenario is a break in a 1-inch pipe, leading to a 10-minute release and subsequent vapor cloud explosion.  This scenario was selected because a release of this type would occur outdoors and result in the highest potential exposure to offsite receptors.\n  \nThe distance to the 1 psi overpressure endpoint for the alternative release scenario is 0.09 miles from the point of release.  This distance extends beyond the facility fence line, and would encompass a population of 42 with the closest residence approximately 0.1 mile from the site, outside of this release zone.  Two schools are about two and three miles away, a hospital is about eight  miles away, and a day care center about two miles away, outside of this release zone.  No other public or environmental receptors are located within this zone.  A release map corresponding to this scenario is located in Section 3.30.\n \nThe likelihood of this type of release is minimized through the installation of multiple safety systems, such as vacuum regulators that only allow gas to flow when a vacuum is pulling it.  Combustion chambers are equipped with flame detectors that will alarm and stop the gas supply if a flame goes out.  The propane tank has a spring-loaded valve that is held open by a fusible link, which will close in case of a fire.  Other automatic safety systems include purge timers, high temperature shut-offs, and low combustion air pressure shut-offs that help minimize the chance of an accident with the propane system.\n\n1.40 General Accidental Release Prevention Program And Chemical-Specific Prevention Steps\n\nFred Meyer, Cla"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9510,
      "SummaryText": "ckamas Bakery complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  The propane system qualifies as a Program 2 Prevention Program under the risk management program requirements.  It is a single process, with no other processes that are regulated by this standard.  The design and construction of this facility was in accordance with published standards, tests or recommended methods of trade, industry or governmental organizations.  \n\nFred Meyer, Clackamas Bakery's prevention program elements will incorporate many policies and procedures to ensure safe operation and maintenance of this facility.  Program elements essential to safe operation of the propane system include safety information, hazard review, operating procedures, training, maintenance, compliance audits, and incident investigation.  This program will be reviewed annually and updated as necessary by the Fred Meyer, Clackamas Bakery Safety Supervisor. \n\nTraining is provided to ensure that each employee involved in operating a process has been trained in an overview of the process, the operating procedures, and safety considerations.  Only qualified maintenance personnel operate and interact with the propane system.  This minimizes the chances of inadvertent error in operation that could lead to a release of propane.  Startup, shutdown, and any onstream adjustments are handled by these qualified persons.  \n\n 1.50 Five-Year Accident History\n\nThere has been no significant release of propane at the Fred Meyer, Clackamas Bakery in the past five years.\n\n1.60 Emergency Response Program\n\nFred Meyer, Clackamas Bakery has a written Emergency Response Plan developed to ensure that precautions and procedures are in place to protect employee and public health and safety during a chemical emergency.  It complies with the provisions of OR-OSHA Emergency Response regulations, 1910.120.  The Emergency Response Plan includes pre-emergency planning and coordinating with o"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 9510,
      "SummaryText": "utside parties. This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events.  This plan has been reviewed with the Clackamas County Fire Department.\n\nThe approach in the development of this plan has been to identify the propane emergencies most likely to occur at Fred Meyer, Clackamas Bakery and establish precautions and procedures to protect life safety and health during an emergency. If an emergency does occur, the following response personnel, facilities, and equipment are in place:\n\n7 Incident Command Center\n7 Emergency Alarm and Communication System\n7 Emergency Response Team\n7 Safe Rooms, Evacuation Plans, and Assembly Points\n\nThe role and procedures for obtaining external emergency assistance have been formally established with the South Metro Fire Department.  The Emergency Response Plan also includes procedures for notification of any potentially affected neighbors.  \n\nAll Fred Meyer, Clackamas Bakery personnel will be trained to fulfill their designated responsibilities in an emergency.  Mock emergency drills will be held periodically to maintain familiarity with response actions and identify plan elements requiring improvement.\n\nThis plan will be reviewed annually and updated as necessary by the Fred Meyer, Clackamas Bakery Safety Supervisor.\n\n1.70 Planned Changes To Improve Safety\n\nThis propane system was installed in February, 1986.  Construction of the propane system is in accordance with applicable codes, which include:\n\n- NFPA 58 (ANSI Z106.1), Standard for the Storage and Handling of Liquefied Petroleum Gases.\n- ASME, Boiler and Pressure Vessel Code.\n- ASTM D 1835-1982, Specification for Liquefied Petroleum (LP) Gases.\n- API 620, Design and Construction of Large, Welded, Low Pressure Storage Tanks.\n- API 2510, Design and Construction of LP-Gas Installations.\n- OAR 1910.119, Process Safety Management of Highly Hazardous Chemicals.\n- OAR 1910.110, Storage and Handling of Liquefied Petroleum Gases."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 9510,
      "SummaryText": "Any upgrades or extensive maintenance work performed in the future will be in compliance with those standards applicable at that time."
    }
  ]
}