{
  "FacilityID": 9525,
  "FacilityName": "San Jose/Santa Clara Water Pollution Control Plant",
  "FacilityStr1": "700 Los Esteros",
  "FacilityStr2": null,
  "FacilityCity": "San Jose",
  "FacilityState": "CA",
  "FacilityZipCode": "95134",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06085",
  "LEPC": "County of Santa Clara",
  "FacilityLatDecDegs": "37.435028",
  "FacilityLongDecDegs": "121.944778",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 852871,
  "ParentCompanyName": "City of San Jose",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of San Jose",
  "OperatorStr1": "700 Los Esteros",
  "OperatorStr2": null,
  "OperatorCity": "San Jose",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95134",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ronald L. Garner",
  "RMPTitle": "Plant Manager",
  "FTE": 345,
  "OtherEPAFacilityID": "CAD000852871",
  "EPAFacilityID": "100000117312",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-01 00:00:00",
  "SafetyInspectionBy": "San Jose Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-05-24 00:00:00",
  "DeRegistrationEffectiveDate": "2012-05-17 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.43111,
  "FRS_Long": -121.945,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 11772,
      "AltID": "chlorination/dechlorinati",
      "FacilityID": 9525,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 12052,
          "ProcessID": 11772,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 13343,
          "ProcessID": 11772,
          "ChemicalID": 62,
          "Quantity": 720000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 13344,
          "ProcessID": 11772,
          "ChemicalID": 49,
          "Quantity": 540000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 513343,
          "ProcessID": 11772,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 513344,
          "ProcessID": 11772,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 11773,
      "AltID": "Ammonia addition",
      "FacilityID": 9525,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 12053,
          "ProcessID": 11773,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 13345,
          "ProcessID": 11773,
          "ChemicalID": 57,
          "Quantity": 35000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 513345,
          "ProcessID": 11773,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9525,
      "SummaryText": "Introduction\n\nChemicals are widely used in industry, in the home, and in the environment. They are transported on roads, water, and railways. The San Jose/Santa Clara Water Pollution Control Plant (WPC) uses chemicals, too. We use chlorine and sulfur dioxide to disinfect treated wastewater to provide safe water for discharge to the environment and for reclaimed water uses such as landscaping and irrigation. We also use ammonia in combination with chlorine to create chloramines, which is a more stable disinfectant. Storing large qualities of these chemicals can be a hazard. We take our safety obligations in storing and using hazardous chemicals as seriously as we take providing reliable wastewater treatment. The following document describes what could happen if there were to be an accidental chemical release, the steps we take every day to ensure a safely operated plant, and how we respond to an emergency. To date, we have had an excellent record in preventing accidents from occurring. Please feel free to contact Ronald L. Garner at (408) 945-5300 if you have any questions.\n\nAccidental Release Prevention and Response Policies\n\nIt is the policy of the City of San Jose and the WPC to develop, maintain, and implement this RMP/PSM Plan. This RMP/PSM plan complies with the U.S. Environmental Protection Agency's (EPA's) Risk Management Program (RMP), under Section 112 (r) of the Clean Air Act (CAA) Amendments of 1990, 40 Code of Federal Regulations (CFR) Part 68, the California Accidental Release Prevention (CalARP) Program under California Code of Regulations (CCR) Title 19, Division 2, Chapter 4.5, and the Process Safety Management Program under CCR Title 8, Division 1, Chapter 4, Section 5189.\n\nGeneral Facility and Regulated Substances Information\n\nThe WPC is located in north San Jose near the southern tip of the San Francisco Bay. It treats wastewater from the cities of San Jose, Santa Clara, Milpitas, Monte Sereno, Saratoga, Cupertino, Los Gatos, and a number of count"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9525,
      "SummaryText": "y sanitation districts. The plant has a capacity of 167 million gallons per day. Plant processes include pretreatment to remove large solids and grit, primary treatment to remove settleable solids, biological treatment to remove dissolved organic waste and to convert ammonia to nitrates, filtration to remove suspended solids, and disinfection to kill and inactivate disease-causing organisms.\nThe facility currently stores chlorine, sulfur dioxide, digester gas, and 29 percent aqueous ammonia; all regulated toxic substances under RMP and CalARP. Chlorine and sulfur dioxide are stored in 90-ton rail cars and exceed the RMP and CalARP rule threshold quantities. Aqueous ammonia at a concentration of 29 percent by weight is stored in two 8,000-gallon double-walled tanks located in a bermed containment area. The amount of ammonia stored exceeds the RMP and CalARP rule threshold. Digester gas is stored in digester domes, a gas holding tank, and process piping. Calculations maintained at the WPC demonstrate that the amount of gas stored does not exceed the RMP and CalARP rule threshold.\n\nChlorine and sulfur dioxide are both used in the disinfection process but are stored, transported, and applied in physically separate but similar systems. Chlorine and sulfur dioxide are brought to the site in railcars, which are also used as storage. Up to four chlorine railcars and three sulfur dioxide railcars can be onsite at any one time. The railcars are hooked up to the separate chlorine and sulfur dioxide delivery systems by flexible connectors. Chlorine and sulfur dioxide are conveyed in piping as liquids to buildings housing evaporators that convert the liquid chemicals to gases under controlled conditions. Gas is drawn from the evaporators through flow control devices called chlorinators or sulfonators, which regulate the amount of gas that is dissolved into the wastewater. Chlorine is added to the wastewater to kill disease-causing organisms and is also used to control odors. Sul"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9525,
      "SummaryText": "fur dioxide is used to remove any remaining chlorine after disinfection is completed to protect flora and fauna in the receiving water.\n\nThe chlorine and sulfur dioxide systems have a number of safety systems and are in full compliance with Santa Clara County's stringent Toxic Gas Ordinance (TGO). Safety provisions include:\n7 Secondary containment of flexible hose, valve tree cabinet, and outdoor piping with containment space vented to a scrubber system.\n7 Indoor piping is contained by the buildings themselves. Doors automatically close upon detection of a leak and the room space is vented to the scrubber system.\n7 Sulfur dioxide and chlorine leak detectors are provided to detect leaks within the railcar dome, flexible hose secondary containment, valve tree cabinets, outdoor piping secondary containment, at the base of the railcars, and inside the rooms where chlorine or sulfur dioxide is processed. The leak detectors are connected to a PLC system that automatically starts the scrubber system and activates audible and visual alarms. Automated dampers are used to direct air flow to the scrubber from the appropriate containment area.\n7 Automatic shutoff valves are provided immediately downstream of the railcar connection and at the entry to each processing room. These valves are activated upon detection of leaks or through manual initiation.\n7 Manual pushbutton switches are provided at several locations to close the automatic shutoff valves and activate the scrubber system.\n7 The entire area is enclosed by a fence with controlled access into the area.\n7 System alarms are monitored at the computer control center, and the disinfection area itself is staffed with operators 24 hours per day. In addition, the railcar area is video monitored by the computer control room.\n7 An emergency generator is provided for backup power to the leak detection, alarm, and scrubber system in the event of a power failure.\n7 The railcars include internal excess flow valves that are designed "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9525,
      "SummaryText": "to close in the event of a catastrophic failure of the flexible hose or piping.\n7 A seismic detection switch is provided that is designed to automatically close the automatic shutoff valves in the event of a major earthquake.\n\nAmmonia at a strength of 29 percent by weight, is brought to the facility in tanker trucks. The ammonia is stored in two double-walled, storage tanks. A concrete berm around the tanks provides triple containment of the ammonia. Ammonia is metered into the wastewater to later combine with chlorine to create chloramines, a more stable and efficient disinfection agent than free chlorine.\n\nOffsite Consequence Analysis Results\n\nThe WPC has had an excellent safety record. However, we have evaluated scenarios that would result in offsite consequences as a way to communicate process risks to the public, to communicate response issues to the City of San Jose emergency response organization, and as a tool in evaluating plant safety systems.\n\nThe offsite consequence analysis for chlorine and sulfur dioxide included a worst case release scenario as defined by the RMP and CalARP regulations, and an alternative release scenario that, although unlikely to occur, is less unrealistic than the worst-case scenario. The worst-case scenario assumes rupture of a railcar of chlorine or sulfur dioxide, and complete release of the railcar contents in 10 minutes. This scenario would only result from a catastrophic occurrence such as an airplane crash. The modeling results for this scenario show that chlorine gas could travel up to 5.5 miles from the plant before its concentration would become diluted to a level that no longer would be considered hazardous to the public. Similarly, sulfur dioxide could travel up to 5.7 miles from the plant before its concentration would become diluted to a level that no longer would be considered hazardous to the public.\n\nBased on knowledge of the plant safety systems, an alternative release scenario was proposed consisting of a 1/16-in"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 9525,
      "SummaryText": "ch leak in the 12-inch long steel pipe nipple (pigtail) that connects to the railcar angle valve. This is the only part of the chlorine and sulfur dioxide systems that is not double contained, monitored for leaks, and vented to an emergency scrubber system. Leaks of the chlorine and sulfur dioxide systems as described here could travel up to 0.2 miles before becoming diluted to a concentration no longer be considered hazardous to the public. WPC policy requires replacing the pigtail every six months.\n\nA worst case release analysis was also performed for the 29 percent aqueous ammonia system. Because the aqueous ammonia is stored in a double-walled tank, rupture of the inner tank and release to the outer tank in 10 minutes would not result in an offsite release. Even if the outer tank were to rupture and the material were released to the bermed containment area, the EPA guidance predicts that ammonia at a concentration above a level harmful to the public would not travel offsite. The RMP and CalARP regulations do not require an alternative release scenario for the WPC ammonia system, because ammonia does not travel offsite in the worst case release scenario.\n\nFive-Year Accident History\n\nThere have been no releases of chlorine, sulfur dioxide, or ammonia in the last five years that have resulted in deaths, injuries, or significant property damage onsite or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage. In the 27 years that these chemicals have been used onsite, the WPC has had no accidental release that has required offsite response. In the interest of full disclosure, however, three employees received first aid following minor exposure while working on the chlorine system.\n\nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe WPC chlorine and sulfur dioxide systems are required to have a stringent release prevention and emergency response program by both the Proce"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 9525,
      "SummaryText": "ss Safety Management (PSM) Program regulations and the RMP/CalARP regulations because of the quantities stored and potential for offsite impacts. The WPC RMP/PSM Plan described herein addresses the chlorine and sulfur dioxide processes.\n\nAqueous ammonia storage is not regulated under PSM. Because there have been no accidents in the last five years and because it does not have the potential for an offsite impact, the aqueous ammonia process is not required to have formal accidental release prevention and emergency response programs. However, ammonia is a hazardous material and its safe storage and use is governed by other regulations. WPC maintains appropriate measures and safeguards on handling and storage of aqueous ammonia to protect its employees and the public.\n\nOur RMP/PSM Plan  is based on the following key elements:\n7 Detailed management system and clear levels of responsibilities and team member roles.\n7 Comprehensive safety process information that is readily available to staff, emergency responders, and contractors.\n7 Comprehensive preventive maintenance program.\n7 A completed process hazard analysis of equipment and procedures with operation and maintenance staff participation and review.\n7 Use of state-of-the-art process and safety equipment.\n7 Use of accurate and effective operating procedures, written with operations and maintenance staff participation.\n7 High level of training of operators and maintenance staff.\n7 Implementation of an incident investigation, inspection, and auditing program using qualified staff.\n\nProcess and Chemical Safety Information\n\nComprehensive chemical data have been assembled to include regulatory reporting and action thresholds, health hazards, and chemical exposure limitations, as well as detailed physical properties of each regulated substance. This information was compiled from numerous sources and includes chlorine and sulfur dioxide background information, MSDS sheets, and chlorine and sulfur dioxide reaction chemistry."
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 9525,
      "SummaryText": "\nEquipment safety information has been compiled on the chlorine and sulfur dioxide processes, including maximum intended inventory, safe upper and lower temperatures, safe upper and lower pressures, and codes and standards used to design, build, and operate the processes.\n\nWe also have procedures in place to update safety information if there is a major change that makes existing information inaccurate.\n\nProcess Hazard Analysis\n\nIn 1993, a detailed process hazard analysis  (PHA) was conducted with plant staff, engineering, and administrative staff for the chlorine and sulfur dioxide processes. The team consisted of process operating and maintenance experts and process design engineers. The PHA technique used was the \"Hazard and Operability\" (HAZOP) study, per acceptable approach guidance from EPA. The PHA was led by a knowledgeable person on the type of process being reviewed. The process hazard analysis was revalidated on April 12, 1999 and will be updated again within a five-year period or whenever there is major change in the process. A list of actions to resolve significant hazard review findings was prepared and staff is currently working to resolve this action item list. Staff will document completion of each action item.\n\nA seismic walkthrough was recently completed based on the 1997 UBC, and recommendations were reviewed by the WPC.\n\nOperating Procedures\n\nThe WPC maintains up-to-date, accurate, written operating procedures that give clear instructions for the chlorine and sulfur dioxide processes. Operating procedures are incorporated into operation and maintenance training programs. Step-by-step operating procedures have been developed for the chlorine and sulfur dioxide systems. Procedures include startup, shutdown, and normal, alternate, and emergency operation. The WPC updates procedures whenever a change occurs that alters the steps needed to operate safely. Operating procedures will be developed and put in place prior to any new process equipment comin"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 9525,
      "SummaryText": "g on line or a changed process starting back up.\n\nOperations and Maintenance Training Program\n\nEach WPC employee presently involved in operating or maintaining the chlorine and sulfur dioxide processes is trained in an overview of the process and detailed, applicable operating and maintenance procedures. The WPC training program helps employees understand the nature and cause of problems arising from operations involving chlorine and sulfur dioxide on site, and to increase employees' awareness with respect to process hazards. The WPC training program includes both initial and refresher training that covers (1) a general overview of the processes, (2) the properties and hazards of the substances in the processes, and (3) a detailed review of process operating procedures and safe work practices. Demonstrations and field observations are used to verify that employees understand the training material.\n\nTraining documentation includes: date of most recent review or revision to the training program, type of training required, and the type of competency testing used to ensure that staff understand the training.\n\nContractors\n\nThe WPC has procedures and policies in place that ensure that only contractors with good safety programs are selected to perform work on and around the chlorine and sulfur dioxide processes. Contractors are informed of process hazards, process area access limitations, and emergency response procedures so that they may safely complete their work. The WPC sets minimum contractor safety performance requirements to do work on the chlorine and sulfur dioxide process area and equipment, holds contractor safety briefings before allowing contractors near or in the process area, controls access to process areas, and evaluates contractor performance.\n\nPre-Startup Safety Review and Mechanical Integrity Program\n\nThe WPC ensures that a pre-startup safety review is completed for any new covered-by-the-rules process at the plant, or for significant modifications to a"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 9525,
      "SummaryText": "n existing covered process that requires a change in the process safety information.\n\nThe WPC maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment. We believe that this program is the primary line of defense against a release and addresses equipment testing and inspection, preventative maintenance schedules, and personnel training. The WPC mechanical integrity program includes the following:\n7 Written procedures for maintaining mechanical integrity through inspection and testing of process equipment, based on instructions of equipment vendors, industry codes, and prior operating experience.\n7 Implementation of the written procedures in performing inspections and tests on process equipment at specified intervals.\n7 Training of maintenance personnel in procedures for safe work practices such as lockout/tagout, line or equipment opening, and avoidance and correction of unsafe conditions.\n7 Procedures specifying training requirements for contract maintenance employees, as well as requiring contractors to use plant developed maintenance procedures for process areas.\n\nHot Work Permits and Management of Change\n\nThe WPC requires employees and contractors to employ safe work practices when performing \"hot work\" in, on, or around the covered processes.\n\nThe WPC provides a system and approach to maintain and implement any management of changes or modifications to equipment, procedures, chemicals, and processing conditions. This system allows employees to identify and review safety hazards, provide additional safety, process, or chemical information to existing data, evaluate the proposed change to confirm that it would not compromise system safety, and establish training requirements before implementation.\n\nInternal Compliance Audits\n\nInternal compliance audits are conducted at least every 3 years to verify compliance with RMP/PSM program data, systems, and procedures. The WPC ass"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 9525,
      "SummaryText": "embles an audit team that includes personnel knowledgeable about the RMP/PSM Plan and about the process. This team evaluates whether the RMP/PSM Plan and its implementation satisfies the requirements of the RMP/CalARP and PSM requirements and whether the RMP/PSM Plan is sufficient to help ensure safe operation of the chlorine and sulfur dioxide processes. The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the RMP/PSM Plan are implemented.\n\nIncident Investigation\n\nThe WPC investigates all incidents that caused or could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented. The WPC trains employees to identify and report any incident that requires investigation. An investigation team is assembled and the investigation is initiated within 48 hours of the incident. The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented. Incident investigation report findings are reviewed by affected staff, added or used to revise operating and maintenance procedures, and passed on to Training Resources for their inclusion in existing training programs, if warranted, to prevent a future event.\n\nEmergency Response Program Summary\n\nThe WPC has established a written emergency response program that is followed by the employees to help safely respond to accidental releases of hazardous substances. This program has been coordinated with the City of San Jose Fire Department, which is the local emergency response agency. The program includes an Emergency Response and Evacuation Plan specific to the chlorine and sulfur dioxide processes. Chlorine area operators are trained as first responders. Emergency response drills and drill evaluations are conducted every 12 months. Emergency operation and response procedures are also reviewed at that time.\n\nPlanned Changes to Improve Safety\n\nSeveral rec"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 9525,
      "SummaryText": "ommendations to improve safety (recommended actions) were previously identified for the chlorine and sulfur dioxide processes in the 1993 Process Hazard Analyses performed pursuant to the State of California Risk Management and Prevention Program (RMPP). These recommended actions have been evaluated and implemented as appropriate. Several additional safety improvements were identified in the April 12, 1999 Process Hazard Analysis Revalidation. These included: \n7 Modifications and training to prevent chlorine release from the cabinet crossover pipe \n7 Covering the railcars to prevent introduction of moisture into the process\n7 Rebuilding a pressure regulating valve in the CSD building to reconnect a permanent vent line\n7 Implementing measures to protect vacuum piping\n7 Routing CTPS leak detector tubing to exhaust ducting and restricting access to CTPS and CSD buildings\n7 Investigating and improving check valves\n7 Implementing violence management training\n7 Evaluating the potential for a mixture of chlorine and sulfur dioxide to occur in the FRP scrubber ducts that would cause duct failure\n\nA schedule has been established for evaluating these items with completion dates ranging from June 21, 1999 to December 31, 1999. An implementation schedule will then be developed based on the results of the evaluations."
    }
  ]
}