{
  "FacilityID": 9533,
  "FacilityName": "COLGATE-PALMOLIVE CAMBRIDGE, OHIO PLANT",
  "FacilityStr1": "8800 GUERNSEY INDUSTRIAL BOULEVARD",
  "FacilityStr2": null,
  "FacilityCity": "CAMBRIDGE",
  "FacilityState": "OH",
  "FacilityZipCode": "43725",
  "Facility4DigitZipExt": "8913",
  "FacilityCountyFIPS": "39059",
  "LEPC": "Guernsey County LEPC",
  "FacilityLatDecDegs": "39.973944",
  "FacilityLongDecDegs": "-81.573833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 183113091,
  "ParentCompanyName": "COLGATE-PALMOLIVE COMPANY",
  "Company2Name": null,
  "CompanyDUNS": 1344381,
  "Company2DUNS": 0,
  "OperatorName": "COLGATE-PALMOLIVE COMPANY",
  "OperatorStr1": "8800 GUERNSEY INDUSTRIAL BOULEVARD",
  "OperatorStr2": null,
  "OperatorCity": "CAMBRIDGE",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43725",
  "OperatorZipCodeExt": "8913",
  "RMPContact": "RIC LYONS",
  "RMPTitle": "EOHS COORDINATOR",
  "FTE": 350,
  "OtherEPAFacilityID": "43725CLGTP8800G",
  "EPAFacilityID": "100000118099",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-28 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.97394,
  "FRS_Long": -81.57383,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 11786,
      "AltID": "ANHYDROUS AMMONIA SYSTEM",
      "FacilityID": 9533,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 12067,
          "ProcessID": 11786,
          "NAICSCode": "325611",
          "_desc": {
            "NAICS_CODE": "325611",
            "NAICS_DESCRIPTION": "Soap and Other Detergent Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 13362,
          "ProcessID": 11786,
          "ChemicalID": 56,
          "Quantity": 74000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 513362,
          "ProcessID": 11786,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9533,
      "SummaryText": "EXECUTIVE SUMMARY FOR\nCOLGATE-PALMOLIVE COMPANY'S\nCAMBRIDGE, OHIO, PLANT\n\nThe Colgate-Palmolive Company's (C-P's) Cambridge plant is committed to the health and safety of our employees and contractors, and the community in which we operate, as well as the protection of the environment.  In order to meet this commitment, we have established systems to help ensure the safe operation of the covered process at this facility. Where applicable, we have also implemented programs that ensure compliance with applicable health, safety and environmental laws and regulations and further improve our overall performance.  One of these programs is the Risk Management Program (RMP), which helps the facility manage the risks involved in the use of anhydrous ammonia at the site and complies with the Accident Release Prevention Requirements: Risk Management Programs, 40 CFR Part 68 (the RMP rule), which the U.S. Environmental Protection Agency (EPA) promulgated in accordance with Section 112(r) of the Clean Air Act.\nThis Executive Summary is a component of the Risk Management Plan (RMPlan) that is intended to satisfy one of the requirements of the RMP rule. This provides the public with a general description of our RMP, which applies to the process that uses anhydrous ammonia, the only substance currently used in sufficient quantity to be regulated by the RMP rule.\nThe Executive Summary describes the following elements:\n1. Regulated Substance Used By C-P Cambridge Plant\n2. Accidental Release Prevention And Emergency Response Policies\n3. Accidental Release Prevention Program And Chemical-Specific Prevention Steps\n4. Emergency Response Programs\n5. Five-Year Accident History\n6. Off Site Consequence Analysis\n7. Planned Changes To Improve Safety\nSections 3-6 of this Executive Summary describe the specific elements of the RMP.  The remaining sections are designed to provide other important informationrelated to the program.\nAlthough our RMPlan helps ensure that our plant is maintained and o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9533,
      "SummaryText": "perated in a safe manner, it is only one component of our comprehensive safety program.  This safety program establishes many levels of safeguards against accidental releases and against the injuries and damage that could occur from accidental releases.  These safeguards include:\n7 Limited use of substances regulated by the RMP rule.  Before using a substance regulated by the RMP rule (\"regulated substance\"), we consider less hazardous alternatives.  In the rare instance when we must use a regulated substance, we consider the potential for this substance to adversely affect our workers, contractors, the public, and the environment and take steps to prevent any such effects.\n7 Preventing releases of the regulated substance used at the plant.  When a regulated substance is used, the equipment used to contain it is carefully designed, built, and operated to reduce the likelihood of an accidental release.  Government and corporate standards are closely adhered to in the design, construction, and operation of the equipment.\n7 Limiting damage from a release, if such a release occurs.  We work to prevent accidental releases from occurring.  However, we also train our workforce to recognize accidental releases, quickly assess the severity of a release, and respond to mitigate and stop the release, including contacting the local agency responsible for responding to accidental releases (Guernsey County Local Emergency Planning Committee [LEPC]) if emergency response actions are necessary. We work closely with the Guernsey County LEPC to ensure appropriate plans are in place to minimize the impact on our workers and the community from any release that may occur.\nOur safety program consists of a number of elements, only some of which are required by the RMP rule.  This RMPlan is primarily intended to describe those parts of the safety program required by the RMP rule.\n1.  REGULATED SUBSTANCE USED BY THE C-P CAMBRIDGE PLANT\nThe C-P Cambridge plant is a manufacturer of light and "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9533,
      "SummaryText": "heavy-duty cleaning products.  As part of these processes, we handle one substance (anhydrous ammonia) in sufficient quantities to be regulated by the RMP rule. The anhydrous ammonia used at the plant is within the definition of a \"toxic material\" under the RMP rule.\n2.  ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nWe are committed to the health and safety of our employees and contractors, and the community in which we operate, as well as the protection of the environment.  We take appropriate steps to prevent foreseeable releases of regulated substances.  These steps include (1) training programs for personnel, (2) programs to help ensure safety in the design, installation, operation, and maintenance of our process, and (3) programs to evaluate the hazards of our process.\nIn the event of an accidental release, we will strive to control and contain the release in a manner that will be safe for workers and will help prevent injury to the public or damage to the environment.  We provide response training to our personnel, including working with the Guernsey County LEPC when executing emergency response actions, so that they are well prepared to respond in the event of an emergency situation.\n3.    ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\nWe have developed a comprehensive prevention program that complies with the Occupational Safety and Health Administration's (OSHA's) process safety management (PSM) regulation.  For the Cambridge plant, the prevention program requirements of EPA's RMP rule are also satisfied by this PSM program. The following sections briefly describe the elements of our prevention program that address the RMP rule requirements. \n3.1  Prevention Program\nOur accident prevention program for anhydrous ammonia consists of the following 12 elements:\n1. Process safety information.  We maintain a variety of technical documents, including an emergency preparedness plan, to help ensure that our employees and lo"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9533,
      "SummaryText": "cal emergency responders know about the hazards associated with our plant.  These documents address (a) physical properties of anhydrous ammonia, (b) operating parameters for our equipment, and (c) design basis and configuration for our equipment.  We ensure that this process safety information is available to our employees.\n2. Process hazard analysis.  We perform and periodically update a process hazard analysis of our anhydrous ammonia process to help identify process hazards and make recommendations that will improve the safe operation of the process.  A multidisciplinary team is assembled to analyze the hazards of the anhydrous ammonia process.  This team includes personnel with engineering and process operating experience and a leader with process hazard analysis experience. The team systematically addresses the hazards associated with operation of the equipment in the anhydrous ammonia process area. The team then prepares a written report describing the results of the analysis, including a list of recommendations.  Responsibility for resolving the recommendations is assigned to area personnel, and, when appropriate, changes to enhance the safety of the process are implemented.  This analysis is revisited at least every 5 years to ensure it is current.\n3. Operating procedures.  Our process engineers, operators, and managers work together to develop and maintain operating procedures to define how tasks related to process operations should be safely performed.  The operating procedures are used to train employees and serve as reference guides for appropriate actions to take during both normal operations and process upsets.  Operating procedures include:\n7 Steps for safely conducting activities\n7 Applicable process safety information, such as safe operating limits and consequences of process deviations\n7 Safety and health considerations, such as chemical hazards, personal protective equipment requirements, and actions to take if exposure to a hazardous substance o"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 9533,
      "SummaryText": "ccurs\n4. Training.  We train employees to safely and effectively perform their assigned tasks.  Our training program includes both initial and refresher training that covers (a) a general overview of the process, (b) the properties and hazards of anhydrous ammonia, and (c) a detailed review of the process operating procedures and safe work practices.  Classroom training (by the ammonia supplier) and demonstrations are used to help train employees.  Oral reviews and demonstrations are used to verify that an employee understands the training material before the employee can begin or resume work in the process.\n5. Mechanical integrity.  We maintain our process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  Our mechanical integrity (preventive maintenance) program includes (a) an inspection and testing program to help identify equipment deterioration and damage before the equipment fails and (b) a quality assurance function to help ensure that new and replacement equipment meet the strict design standards required for service in our process.\n6. Management of change.  We have a written procedure to review and approve all proposed changes to the process, including chemicals, equipment, technology, and procedures to help ensure that the change does not negatively affect safe operations. All changes other than replacement-in-kind (e.g., replacing a valve with an identical valve) must be approved through the full management of change program.  This helps ensure that inadvertent consequences of process changes are prevented, safety consequences of changes are addressed, affected process safety information and procedures are updated, and affected employees are notified of the changes.\n7. Pre-startup safety review.  We perform safety reviews of new or modified processes before placing them into service to help ensure their safe operation.  This review confirms that:\n7 Construction and equipment are in accordance with d"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 9533,
      "SummaryText": "esign specifications\n7 Adequate safety, operating, maintenance, and emergency procedures are in place\n7 Employee training has been completed\n7 For a covered process, a process hazard analysis has been performed if the process is new, or management of change requirements have been completed if an existing process has been modified.\n8. Compliance audit.  One of the cornerstones of an effective prevention program is a regular, thorough assessment.  We have a program to perform compliance audits of our covered process every 3 years to be certain our prevention program is effectively addressing the safety issues of the process.  This audit is performed by an audit team that includes personnel knowledgeable in the PSM and RMP regulations and in our process designs, and this team evaluates whether the prevention program satisfies the requirements of these two regulations and whether it is sufficient to help ensure safe operation of the process.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n9. Incident investigation.  We have a program to investigate any incidents or near misses that could reasonably result in serious injury to personnel, the public, or the environment so that similar accidents can be prevented in the future.  We communicate to our employees the requirement to identify and report any incident requiring investigation.  In the event of an incident, an investigation team would be assembled, and the investigation would be initiated as soon as possible, but always within 48 hours of the incident. The results of the investigation are documented, recommendations are resolved, and appropriate process improvements are implemented.\n10. Employee participation.  We have a written employee participation program for our covered process to help ensure that the safety concerns of our employees are addressed.  We encourage active participation of personnel in the prevention pro"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 9533,
      "SummaryText": "gram activities of all processes at the plant.  Employees are consulted on and informed about all aspects of our accidental release prevention program.\n11. Hot work permits.  We have a hot work permit program to control spark- or flame-producing activities that could result in fires or explosions in our plant.  We reviewed OSHA's fire prevention and protection requirements and created a hot work permit form to comply with these requirements.  Personnel who are to perform hot work are required to fill out the form, and the appropriate supervisor reviews the completed form before work can begin.  Training on hot work activities and on the requirements of the hot work permit program is included in our safe work practices orientation.\n12. Contractors.  We have a program in place to help ensure that contractor activities related to the process are performed in a safe manner.  We explain to the contract supervisors the hazards of the processes on which they and their employees will work, our safe work practices, and our emergency response procedures.  Contractors are required to ensure that training has been performed for each of their employees who will work at the plant before that worker begins work at our plant.  We routinely verify that this training has been provided. \n3.2  Chemical-specific Prevention Steps\nIn addition to the required prevention program elements, we have implemented safety features specific to anhydrous ammonia. \nThe anhydrous ammonia is delivered in tank trucks that must be approved by the Department of Transportation. The anhydrous ammonia storage tank and equipment are designed and maintained to standards established by the federal government and by industry.  Remote isolation valves that can be closed quickly if a release occurs, manual shutoff valves, excess flow devices in the storage tank, and ammonia detectors with alarms are also provided as process controls that are in place to help prevent or mitigate releases of anhydrous ammonia from t"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 9533,
      "SummaryText": "he system.\n\n4.  EMERGENCY RESPONSE PROGRAMS\nWe have established a written emergency response program to help ensure the safety of personnel who could be called on to respond to any accidental releases of hazardous substances.  The emergency response plan includes procedures for:\n7 Informing the Guernsey County LEPC about accidental releases that could reasonably result in offsite consequences\n7 Providing proper first aid and emergency medical treatment for accidental human exposure to hazardous substances\n7 Obtaining outside assistance to control and contain accidental releases of hazardous substances, including the use of emergency response equipment\n7 Inspecting and maintaining emergency response equipment\n7 Reviewing and updating the emergency response plan\n We have trained our employees to recognize and report emergency situations.  All of our personnel and contractors are trained in evacuation procedures.  The Guernsey County LEPC is responsible for notifying the public of the emergency situation, if necessary.\n The written emergency response plan complies with other federal contingency plan regulations [e.g., the OSHA regulation 29 CFR 1910.38(a)], and a copy of the plan has been provided to the local fire department. Also, a hazardous material inventory has been provided to the Guernsey County LEPC and local fire department, as required by the Emergency Planning and Community Right-To-Know Act. C-P personnel from the Cambridge plant maintain a regular dialogue with local emergency planners.\n\n5.  FIVE-YEAR ACCIDENT HISTORY\nOur accident history demonstrates the continuous safe operation of our anhydrous ammonia process over the last 5 years.  There have been no accidental releases of anhydrous ammonia from the system that resulted in exposure to employees, contractors, the public, or the environment.\n6.  OFFSITE CONSEQUENCE ANALYSIS\nThe RMP rule requires that we perform an offsite consequence analysis using methods and assumptions prescribed by EPA.  The regula"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 9533,
      "SummaryText": "tions require that each RMPlan provide a \"worst-case release scenario\" and an \"alternative case release scenario\" prepared according to EPA's methodology.  These scenarios are intended to estimate the potential for an accidental release to affect the public or the environment.  The usefulness of these scenarios is limited, however, because they do not reflect the lesser impacts of a more likely accidental release scenario.  In addition, they detract from the effectiveness of the accident prevention plan that we have implemented for the specific purpose of avoiding such an accident.\nEven in the unlikely event that there were a release, we do not expect that worst-case release scenario would ever occur.   Although the worst-case release scenario was developed to estimate the maximum possible area that could be affected by an accidental release, it is not a realistic scenario.  The conclusions of this scenario are based on unreasonable assumptions about the rate and duration of the release and overly conservative estimates of the conditions associated with the release.  It also completely disregards the active mitigation measures that the facility would take to stop the release in the event of an accident.\nAlthough the alternative case release scenario is more likely to occur, it still tends to overestimate the impact of the release.  This scenario accounts for active mitigation measures, but the measures that we would reasonably expect the facility to take are more effective than those that have been used in the assumptions.  In addition, the scenario does not account for site specific topographic features that would tend to reduce the impact of any explosion that may occur.  Still, the alternative case release scenario represents a more realistic release situation.  On that basis, the alternative case release scenario was analyzed to assist in emergency preparedness and improve the community emergency response plan.\nAs required under the RMP rule, we have used the of"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 9533,
      "SummaryText": "fsite consequence analysis to estimate the distance at which certain effects on the public or the environment might occur because of an accidental release (called the \"endpoint distance\").  Because it is based on the offsite consequence analysis, the endpoint distance is subject to all the same qualifications and limitations of that analysis.  For a release of a toxic material, EPA defines the endpoint distance (also known as \"toxic endpoint\") as the maximum airborne concentration below which it is believed that nearly all individuals can be exposed for up to 1 hour without experiencing or developing irreversible or other serious health effects or symptoms that could impair an individual's ability to take protective action.\nThe following information summarizes the offsite consequence analysis. \n6.1  Worst-case Release Scenario \nThe worst-case release scenario is based on a hypothetical failure of the anhydrous ammonia storage tank that results in the release of the entire contents of the tank.  For the purposes of the worst-case release scenario, the maximum possible inventory of ammonia (i.e., 13,000 gallons/74,255 pounds) is assumed to be released over a ten minute time period.  Using the EPA methodology and prescribed assumptions, the worst-case release scenario would conclude that the predicted endpoint distance (at 200 ppm) would reach some offsite public receptors.\n6.2  Alternative Release Scenario\nThe alternative release scenario for the anhydrous ammonia process is based on the hypothetical rupture of a 1.25-inch liquid line from the anhydrous ammonia storage tank.  In the unlikely event that this scenario were to occur, our operators are trained and equipped to quickly isolate the flow from the storage tank.  To evaluate this scenario, we assumed that it would take 10 minutes to stop the release by closing remotely operated isolation valves.  This estimated time should be longer than the actual response time and thus, will result in a larger release than sh"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 9533,
      "SummaryText": "ould actually occur.  In evaluating this scenario, we took account of mechanical mitigation measures provided by the excess flow valves that are part of the system design. Using the EPA methodology and the highly conservative assumptions regarding active mitigation, the alternative release scenario would conclude that the predicted endpoint distance (at 200 ppm) would not reach offsite public receptors.\n 7.  PLANNED CHANGES TO IMPROVE SAFETY\n We constantly strive to improve the safety of our covered process using recommendations developed through the prevention program and a program soliciting safety suggestions from our employees. Recommendations received by plant management are evaluated and are implemented where appropriate.  Standard operating and safety procedures for the covered process are reviewed periodically to ensure that they are correct, and we provide training to our employees on a wide variety of safety and operating topics."
    }
  ]
}