{
  "FacilityID": 9537,
  "FacilityName": "East Aurora Wastewater Treatment Plant",
  "FacilityStr1": "201 Mill Street",
  "FacilityStr2": null,
  "FacilityCity": "East Aurora",
  "FacilityState": "NY",
  "FacilityZipCode": "14052",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36029",
  "LEPC": "East Aurora Fire Department",
  "FacilityLatDecDegs": "42.7625",
  "FacilityLongDecDegs": "-78.634444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "WR",
  "FacilityURL": "www.usfilter.com",
  "FacilityEmailAddress": "duryeadj@usfilter.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Village of East Aurora",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Village of East Aurora (Owner)",
  "OperatorStr1": "USFilter Operating Services (Oper.)",
  "OperatorStr2": "921 Saw Mill Run Boulevard",
  "OperatorCity": "Pittsburgh",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "15220",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000118339",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "1999-12-20 00:00:00",
  "DeRegistrationEffectiveDate": "1999-12-13 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.762306,
  "FRS_Long": -78.6335,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 11790,
      "AltID": "Chlorine Disinfection",
      "FacilityID": 9537,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 13366,
          "ProcessID": 11790,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 12071,
          "ProcessID": 11790,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 5596,
              "Process_NAICS_ID": 12071,
              "SafetyReviewDate": "1999-03-16 00:00:00",
              "PHA_Date": "1999-03-16 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-22 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Changes are currently pending.",
              "OpProceduresReviewDate": "1999-04-02 00:00:00",
              "TrainingReviewDate": "1999-01-01 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-02 00:00:00",
              "EquipmentInspectionDate": "1999-06-18 00:00:00",
              "EquipmentTested": "Chlorine cylinders, pumps, valves, and piping systems.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-04-02 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-05-28 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-02 00:00:00",
              "HotWorkPermitReviewDate": "1999-04-02 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-04-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 6661,
                  "PreventionProgram3ID": 5596,
                  "ProcessChemicalID": 13366
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 9537,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-28 00:00:00",
    "ERTrainingDate": "1999-06-01 00:00:00",
    "CoordinatingAgencyName": "East Aurora Fire Department",
    "CoordinatingAgencyPhone": "7166522222",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 9537,
      "SummaryText": "Treatment Plant.  The Emergency Response Plan has been coordinated with local emergency response personnel.  On site personnel receive required training and drills are conducted annually at the wastewater treatment facility.  The plan also consists of procedures to notify emergency responders of a release, as well as,  public notification procedures.\n\n\nPlanned Changes to Improve Safety\n\nThe Process Safety Management Plan, Spill Prevention Plan and this Risk Management Plan are to be incorporated into everyday activities and will be updated as necessary.  USFilter will continue to improve safety at the East Aurora Wastewater Treatment Plant with continual training for all operating personnel, including monthly meetings which address safety, safety inspections and safety reviews.  \n\nAs previously mentioned USFilter Operating Services has worked hard to develop and maintain an attitude of safety awareness.  As a result, we have achieved an outstanding safety record.  We will continue to strive forward in our effort to improve the safety of our employees, as well as public safety."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 9537,
      "SummaryText": "EXECUTIVE SUMMARY\nEAST AURORA WASTEWATER TREATMENT FACILITY\nEAST AURORA, NEW YORK\n\n\n\n\nAccidental Release Prevention and Emergency Response\n\nSince the founding of USFilter in 1972, we have emphasized the importance of safety in all of our work practices.  The water and wastewater industry has many hazards, including the use of toxic chemicals.  We have learned to recognize the hazards associated with toxic chemicals, and have developed safe work methods to ensure the safety of our employees, as well as public safety.\n\nOur constant commitment to safety is reflected by the training, meetings, inspections, and reviews that are a part of USFOS operation at the East Aurora Wastewater Treatment Plant.  Management commitment to process safety is a critical element of the risk management program at the East Aurora Wastewater Treatment Plant.  This commitment did not end when the last word of this risk management plan was composed.  Process safety is a constant priority, that is the reason we have implemented each element on an ongoing, daily basis and made it a part of the way we operate at the East Aurora WWTP.  \n\nWe have worked hard to develop and maintain an attitude of safety awareness.  As a result, USFOS has achieved an outstanding safety record.\n\n\nDescription of the Facility and the Regulated Substances Handled\n\nThe East Aurora Wastewater Treatment Plant provides treatment to approximately 3.5 million gallon per day (design) of wastewater from residences and businesses in and around the Village of East Aurora.  This wastewater enters the facility as raw sewage and exits the plant as treated wastewater with pollutant levels below the discharge limits established by the New York State Department of Environmental Conservation.\n\nIn order to achieve appropriate disinfection, comply with all limits established by regulatory agencies and discharge to Cazenovia Creek chlorine is added to the process.  When chlorine is added to wastewater it reacts with many compounds present"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9537,
      "SummaryText": "in the wastewater.  For our purposes, we have divided these into nitrogen and non-nitrogen compounds.  Nitrogen and (ammonia) compounds react with chlorine to produce chloramines.  These chloramines carry out the disinfection process in the wastewater. Non-nitrogen compounds also react with chlorine, however little or no disinfection results.\n\nChlorine reacts with the non-nitrogen compounds before it reacts with nitrogen compounds.  Therefore, sufficient chlorine must be added to satisfy the chlorine demand of the non-nitrogen compounds so that enough chlorine is still available for the formation of chloramines.\n\nA maximum of two (2) one-ton cylinders of chlorine are kept on site at the East Aurora Wastewater Treatment Plant.  These cylinders are aboveground and non-stationary, so that when they are nearly empty due to process activities two (2) replacement cylinders are brought on-site for exchange.  This volume of chlorine is stored on-site so that replacement of cylinders is reduced to two (2) times per year.  USFilter Operating Services believes that chlorine cylinder exchange/replacement poses the greatest potential for a release, so by minimizing the replacement activities, potential risk of release in minimized.  James Hammond, Chief Operator at the East Aurora Wastewater Treatment Plant has over 20 years of experience handling and replacing chlorine cylinders and has become very proficient in these activities.\n  \n\nWorst-Case Release Scenario and Alternative Release Scenario\n\nUSFilter Operating Services conducted an off-site consequence analysis (OCA) in order to provide information to the government and the public about potential consequences of an accidental release from the East Aurora WWTP.  The off-site consequence analysis consisted of two elements:\n\n7 Worst-Case Scenario\n7 Alternative Release Scenario\n\nThe worst-case scenario is defined by the Environmental Protection Agency (EPA) as the release of the largest quantity of a regulated substance from a s"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9537,
      "SummaryText": "ingle vessel or process line failure that results in the greatest distance to an endpoint.  In broad terms, the distance to the endpoint is the distance a toxic vapor cloud, heat from a fire, or blast waves from an explosion will travel before dissipating to the point that serious injuries from short-term exposures will no longer occur.\n\nThe reference tables of distances supplied in the USEPA Technical Guidance were used to determine the endpoint distance of a worst-case and alternative release of chlorine at the East Aurora Wastewater Treatment Plant.  \n\nThe chlorine present at the East Aurora WWTP is present in one-ton (2,000 lb.) cylinders.  The worst-case scenario assumes that this entire quantity is completely released over a period of 10 minutes (e.g. 200 lb./min. rate of release).  According to Exhibit 4-3 of the EPA Risk Management Program Guidance under these specific conditions, as well as additional conditions established by USEPA the distance to Toxic Endpoint is 1.3 miles.  This distance is calculated as a release outdoors.  Both chlorine cylinders at the East Aurora WWTP are maintained indoors, however, the intention of this analysis is to provide information on the worst-case scenario.\n\nMany potential alternative scenarios could involve the release of liquid chlorine from a small hole.  The particular alternative scenario we approached was one in which a vapor release of chlorine occurred through a 1-inch diameter hole.\n\nFor a choked release of vapor (i.e. emerging at the speed of sound from the hole, which will invariably be the case for chlorine at atmospheric temperatures), the release rate for chlorine is given by:\n\n\nQR = 190 x Ah\n\nwhere:\n\nAh = the area of the hole ( 1 inch hole; area = 0.785 in2 )\n\n190 = factor applicable to chlorine at a tank pressure of 113 psia and temperature 250C (see Appendix 4A of the USEPA Guidance Document)\n\nThe Release Rate is determined by this equation to be approximately 150 lbs/min.  This alternative release scenari"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9537,
      "SummaryText": "o at the East Aurora WWTP would result in a Toxic Endpoint of  0.2 miles. \n\nThis hazard review and hazard assessment / consequence analysis will be updated at least every five years, or when a major change occurs.\n\n\nGeneral Accident Release Prevention Program and Chemical Specific Steps\n\nUSFilter Operating Services developed a Process Safety Management (PSM) Plan that complies with the Occupational Safety and Health Administration (OSHA) 29 CFR 1910.119 Process Safety Management of Highly Hazardous Chemicals.  The PSM Plan is an in depth management program with the main objective of preventing unwanted releases of chlorine  especially into locations which could expose employees and others to potential hazards.  The PSM Plan was developed to achieve proactive identification, evaluation and mitigation or prevention of chemical releases that could occur as a result of failures in process, procedures or equipment.\n\nIn addition to federal compliance with the OSHA PSM standard, the East Aurora Wastewater Treatment Plant also developed a Spill Prevention Report (SPR).  The Spill Prevention Report was developed in accordance with criteria established by the New York State Department of  Environmental Conservation.  The Spill Prevention Report identifies areas of potential releases, establishes a compliance audit, contains an accidental release protocol, contains a spill response plan, etc.  \n\n\n\n\n\nFive-Year Accident History\n\nThere have been zero (0) release incidents in at least the past five (5) years.  This is based on information ascertained by USFilter Operating Services through examination of existing books, records, and documentation accumulated by the current operator who has been employed at the East Aurora Wastewater Treatment Plant for greater than twelve (12) years.\n\nEmergency Response Program\n\nA comprehensive Emergency Response Program has been developed by USFilter Operating Services addressing an accidental release of a Chlorine from the East Aurora Wastewater"
    }
  ]
}