{
  "FacilityID": 9573,
  "FacilityName": "Northwest Wastewater Treatment Plant",
  "FacilityStr1": "4801 N. Hwy 13",
  "FacilityStr2": null,
  "FacilityCity": "Springfield",
  "FacilityState": "MO",
  "FacilityZipCode": "65803",
  "Facility4DigitZipExt": "8368",
  "FacilityCountyFIPS": "29077",
  "LEPC": null,
  "FacilityLatDecDegs": "37.289722",
  "FacilityLongDecDegs": "-93.3375",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "UN",
  "FacilityURL": "http://springfield.missouri.org/gov/index.html",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Springfield",
  "OperatorStr1": "840 Boonville",
  "OperatorStr2": "P.O. Box 8368",
  "OperatorCity": "Springfield",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "65802",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000118384",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2005-12-29 00:00:00",
  "DeRegistrationEffectiveDate": "2005-10-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.2875,
  "FRS_Long": -93.341389,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "chemicals used for the disinfection of the plant will no longer be used",
  "_processes": [
    {
      "ProcessID": 11841,
      "AltID": "Wastewater Treatment",
      "FacilityID": 9573,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 13423,
          "ProcessID": 11841,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 13424,
          "ProcessID": 11841,
          "ChemicalID": 49,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 12122,
          "ProcessID": 11841,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 5619,
              "Process_NAICS_ID": 12122,
              "SafetyReviewDate": "1999-05-07 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "BOCA Building Code 1996",
              "FR_Comments": "BOCA Fire Code 1996",
              "HazardReviewDate": "1999-05-07 00:00:00",
              "ChangeCompletionDate": "1999-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-07 00:00:00",
              "TrainingReviewDate": "1996-01-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-29 00:00:00",
              "EquipmentInspectionDate": "1999-06-21 00:00:00",
              "EquipmentTested": "pipes, filters, vacuum regulators and pressure regulators, leak detectors, feed equipment, hoist and cable (all inspected weekly)",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 5819,
                  "PreventionProgram2ID": 5619,
                  "ProcessChemicalID": 13423
                },
                {
                  "PrimaryKey": 5820,
                  "PreventionProgram2ID": 5619,
                  "ProcessChemicalID": 13424
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 9573,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-09 00:00:00",
    "ERTrainingDate": "1996-01-01 00:00:00",
    "CoordinatingAgencyName": "Springfield Fire Department",
    "CoordinatingAgencyPhone": "9110000000",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9573,
      "SummaryText": "Introduction\nThe Northwest Wastewater Treatment Plant, operated by the City of Springfield, has a capacity of 6.4 million gallons per day.  This Risk Management Plan (RMP) covers the Section 112r regulated substances maintained at the Northwest Wastewater Treatment Plant, which will be referred to herein as the Plant.\n\nPlant Description\nThe Plant maintains two regulated substances on site: chlorine and sulfur dioxide.  Chlorine storage is 16,000 pounds, which exceeds the RMP threshold quantity of 2,500 pounds. Sulfur dioxide storage is 8,000 pounds, which exceeds the RMP threshold quantity of 5,000 pounds The storage and management of both chlorine and sulfur dioxide is addressed in this RMP.  \n\nThe Plant is located at 4801 N. Highway 13, Springfield, Missouri, which is a rural area.  The surrounding area includes some scattered residences.  The plant is about 2 miles from the main highway that leads into Springfield.    \n\nThe Worst Case Release Scenario\nThe worst case release scenario for chlorine was calculated as the release of a single one-ton cylinder of either substance in accordance with the definition provided in the Environmental Protection Agency guidance for RMP development.  Only passive control systems can be considered for the worst-case release, such as the containment provided by a building.  The conditions of the scenario, such as release time and weather status are those provided in the EPA Off-Site Consequence Analysis Guidance. The area of potential impact was determined using RMP*Comp, modeling software developed by the EPA.\n\nThe results of the Worst Case Off-Site Consequence Analysis indicated that the chlorine would travel approximately 2.2 miles under the specified weather conditions before dispersing in the atmosphere to a harmless concentration.  The sulfur dioxide would travel approximately 2.1 miles before dispersing to a harmless concentration.  Since the toxic endpoint for the chlorine release is farther away, it was used at the worst c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9573,
      "SummaryText": "ase scenario.  Within that radius of the Plant, an estimated 1540 persons could potentially be affected.  Maps of the area and a list of the types of receptors in the potential impact area are provided in the Off-Site Impact Analysis Section.  The list of potential receptors includes:\n\n 7 Head Start, OACAC (School)\n7 Ritter Springs (Park)\n7 SAC River Bike Trail\n7 Fantastic Caverns (Park)\n7 Glidewell Baptist Church\n7 Church (name unknown)\n7 Montgomery Metal\n7 Bolivar Book Store\n7 Crossroads General Store\n7 MoCal Trucking\n7 Carpet Barn\n7 George Carden Circus\n7 Sac River Stables\n7 Fulbright Water Plant, Police Firing Range, Dog Pound, Fire Department Training \n7 Reliable Propane\n \nThis type of release would only occur if the cylinder valve was broken off, or the cylinder was breached.  The likelihood of such an incident occurring is minimal.  \n\nAlternative Release Scenario\nThe alternative release scenario is, by definition, a more likely release scenario than the worst case.  Engineered controls, such as detection systems, alarms, or scrubbers are considered in the analysis.  \n\nThe type of system failure selected for the chlorine alternative release was the loss of chlorine due to a break in the flexible tubing leading from the cylinder to the vacuum regulator.  The chlorine would leak from a 3/8 opening.  The leak would continue until the chlorine detection alarm sounded and the valve on the cylinder could be closed.  Because chlorine would have leaked into the chlorine room, the Springfield Fire Service would respond according to their procedures for a toxic chemical release.  The time for the response was estimated at __ minutes.  Once on site, the fire response personnel would enter the room in protective clothing and close the valve on the leaking cylinder.\n\nThe type of system failure selected for the sulfur dioxide alternative release is very similar to the chlorine release because the two chemicals are stored in identical tanks and are applied with the same fee"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9573,
      "SummaryText": "d equipment.  The scenario was the loss of sulfur dioxide due to a break in the flexible tubing leading from the cylinder to the vacuum regulator.  The chemical would leak from a 3/8 opening.  The leak would continue until the detection alarm sounded and the valve on the cylinder could be closed.  Because sulfur dioxide would have leaked into the room, response would be made by the Springfield Fire Service according to their procedures for a toxic chemical release.  The time for the response was estimated at __ minutes.  Once on site, the fire response personnel would enter the room in protective clothing and close the valve on the leaking cylinder.\n\nThe results of the Alternative Release Off-Site Consequence Analysis using RMP*Comp, indicated that the chlorine would travel approximately 0.7 miles under the specified weather conditions in order to disperse in the atmosphere to a harmless concentration.  The sulfur dioxide would travel approximately 0.7 miles before dispersing to a harmless concentration.  Within the larger of these two distances from the Plant, an estimated 100 persons could potentially be affected. Maps of the area and a list of the types of receptors in the potential impact area are provided in the Off-Site Impact Analysis Section.  The list of potential receptors includes:\n\n 7 Ritter Springs (Park)\n7 SAC River Bike Trail\n7 Carpet Barn\n\nProcess Hazard Assessment\nA process hazard assessment was performed on the chlorine and sulfur dioxide systems beginning with cylinder unloading and ending with the each chemical in solution.  A combination checklist and modified What if type of analysis was used.  General questions regarding the storage and use areas as well as practices and protocols associated with the management of the chlorine and sulfur dioxide systems were answered.  A copy of that checklist is included in this plan.  Following the checklist, each system was methodically evaluated valve by line from the cylinder to point of chlorine injec"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9573,
      "SummaryText": "tion using a system flow diagram.  The valves and other points in each system where the chemical could be released are numbered on the flow diagrams. The assessments are formatted in accordance with those numbers.  Compliance with code requirements, considerations of potential failure, maintenance and inspection concerns, and standard operating procedures were reviewed for each point in each system.  Comments are summarized in the Process Hazard Assessment section.\n\nPrevention System\nThe Plant has an operation, maintenance, and inspection system designed to review each element of the chlorine and sulfur dioxide systems routinely.  There are Operation and Maintenance manuals for each major piece of equipment, and personnel receive significant training before being allowed to work on the systems.\n\nAt the beginning and end of the daily operating period, and as each cylinder is changed, the valves and piping are tested for leaks.  There are standard operating procedures (SOPs) for startup, shutdown, normal operation, and emergency operation.  The SOPs are written and posted in the appropriate areas.  Personnel are trained routinely on safety concerns and general operation procedures as well as emergency procedures.\n\nEach system is equipped with detectors and alarms that indicate leaks.  Ventilation is provided in each chemical storage room only when a worker is present. \n\nEmergency Response Plan\nPlant personnel are allowed and trained to respond to leaks that can be managed by turning off a valve.  Any response requiring entry in a dangerous atmosphere or use of a chlorine repair kit is to be managed by the Springfield Fire Department.  The Plant has an agreement with the Fire Department, which is included in this plan.  A complete copy of the Emergency Response Plan is also included.  \n\nAccident History\nThe Plant has had no chlorine or sulfur dioxide releases in the past five years."
    }
  ]
}