{
  "FacilityID": 9685,
  "FacilityName": "Box-Elmdale Gas Plant",
  "FacilityStr1": "Rt.8 Box 882",
  "FacilityStr2": "4mi E. of Abilene on N. 10th St.",
  "FacilityCity": "Abilene",
  "FacilityState": "TX",
  "FacilityZipCode": "79601",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48059",
  "LEPC": "Callahan County LEPC",
  "FacilityLatDecDegs": "32.460361",
  "FacilityLongDecDegs": "-99.621333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Davis Gas Processing",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Davis Gas Processing",
  "OperatorStr1": "2449 S. Willis, Ste. 204",
  "OperatorStr2": null,
  "OperatorCity": "Abilene",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79605",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bobby Roach",
  "RMPTitle": "Safety Director",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000120371",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-06-28 00:00:00",
  "DeRegistrationEffectiveDate": "2004-05-20 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.60349,
  "FRS_Long": -99.662,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 12025,
      "AltID": "Propane",
      "FacilityID": 9685,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 12313,
          "ProcessID": 12025,
          "NAICSCode": "32411",
          "_desc": {
            "NAICS_CODE": "32411",
            "NAICS_DESCRIPTION": "Petroleum Refineries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 13665,
          "ProcessID": 12025,
          "ChemicalID": 98,
          "Quantity": 142800.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 513665,
          "ProcessID": 12025,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9685,
      "SummaryText": "SAFETY POLICY STATEMENT\nIt is the policy of Davis Gas Processing that accident prevention shall be considered of primary importance in all phases of operation and administration. It is the intention of Davis Gas Processing management to provide safe and healthy working conditions and to establish and insist upon safe practices at all times by all employees. The prevention of accidents is an objective affecting all levels of our company and its operations. It is, therefore, a basic requirement that each supervisor make the safety of all employees an integral part of his or her regular management function. It is equally the duty of each employee to accept and follow established safety regulations and procedures. Every effort will be made to provide adequate training to employees. Employees are expected to assist management in accident prevention activities. Unsafe conditions must be reported immediately. Safety is everyones business.\n\nSITE DESCRIPTION\nThe Box-Elmdale DGP Plant is located about 4 miles east of Abilene, Texas on north 10th Street.\nThere is two Product Propane Storage Tanks, one which is a 95 barrel and the other is a 714 barrel tank. Both are a  painted, welded steel, above ground, horizontal pressure vessel. The  tanks operates up to 200 psig and is protected by a pressure relief valve. Liquid flow into these tanks is determined by the process operations. Liquid flow out of these tanks goes to tank truck loading and is manually controlled. Operating personnel on a daily basis visually inspect these tanks. If a spill occurred at these tanks, the contents are so volatile that they would evaporate before penetrating the ground to any significant degree. The ground would freeze and contain the propane as it evaporated.\n\nPURPOSE AND GOALS FOR THE BOX-ELMDALE DGP PLANT\nEMERGENCY RESPONSE AND ACTION PLAN\nEmergency Response And Action Plans (ERAP) were developed by Davis Gas Processing  for its Box-Elmdale DGP Plant located in Callahan County, Texas.  The ERA"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9685,
      "SummaryText": "P was developed to assist the Box-Elmdale DGP Plant Foreman in his responsibility to provide skilled and compliant emergency leadership in the event of emergency situations.\nThe ultimate goals of the Box-Elmdale DGP Plant ERAP are as follows:\n    1.    To provide Box-Elmdale DGP Plant employees with emergency prevention training that will allow them to avoid process emergencies by predicting and recognizing potentially hazardous situations.\n    2.    To provide Box-Elmdale DGP Plant employees with emergency prevention training that will allow them to recognize and assess the consequences of personal actions when working  with equipment containing pressurized,  very cold, highly volatile,  and flammable substances.\n    3.    To assure that Box-Elmdale DGP Plant  employees will respond in a safe, prompt, and compliant fashion in the event of unintentional releases of hazardous chemicals in and from the Box-Elmdale DGP Plant.\n    4.    To guarantee that all Box-Elmdale DGP Plant visitors  will be effectively warned to recognize, avoid, and to escape hazardous situations and guarantee that they will be accounted for and removed from the Box-Elmdale DGP Plant in the event of a site emergency.\n    5.    To document that Box-Elmdale DGP Plant emergency response efforts were effective,  prompt,  and  professional.\n    6.    To document that Box-Elmdale DGP Plant emergency response training is provided periodically and in a clear and consistent manner, and to ensure  Box-Elmdale DGP Plant  employees have a basic working knowledge of Box-Elmdale DGP Plant emergency response procedures.\n    7.    To document that Box-Elmdale DGP Plant  employees have a clear understanding of the recommended responses for various possible emergency scenarios.\nThe Emergency Response Program that we have in place details emergency escape procedures and route assignments that have been posted in work area, and all employees have been trained by supervisors in the correct procedures to follow. New and change in status employees have been t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9685,
      "SummaryText": "rained when assigned to perform any duties that involve the handling of hazardous chemicals.  This facility has an Emergency Shut-Down Procedure that describes the steps to be taken in order for normal operations to be stopped and utility service to be cut off as personnel evacuate the premises during emergency situations.  The Foreman is responsible for accounting for all employees, personally or through a designee, by having all employees report to predetermined, designated rally point and conducting  a head count. Rescue and medical duties will be performed by EMS personnel from the Abilene, Texas Fire Department. The employees of the facility will be notified by verbal notification if  an evacuation is necessary.  All personnel have been trained in the safe and orderly emergency evacuation of the premises. The training includes, but is not limited to, the Emergency Shut-Down Procedures, escape routes, exits, and rally points. Training was and/or will be provided for employees when:\n1.  The plan was initiated\n2.  Responsibilities change\n3.  Employees are hired or transferred.\n\nWORST-CASE RELEASE SCENARIO \n The worst-case scenario would involve some sort of mechanical object (e.g. plane, vehicle) to hit or rupture the  Propane Storage Tanks.\nThe Propane Storage Tanks contain a total of 142,000 lbs. of flammable substance with a worst-case scenario radius of exposure of  2,112 feet. There are no houses or public facilities in the radius of exposure. In the Attached Executive Summary file I included a drawing of the facility and the houses that are outside the radius of exposure.\n.\nThis facility  has  had no accidents in the last 5 years involving a regulated chemical, that has involved death, injury, or emergency response. Our facility has procedures coordinated with the local response agencies encase of  an accidental release.\n\nThis facility follows the rules and regulations of  Occupational Safety and Health Administration (OSHA), Department of Transportation (DO"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9685,
      "SummaryText": "T), Environmental Protection Agency(EPA),  and the Texas Railroad Commission(TNRCC).This facility has labeled all their storage tanks with identifying signs and NFPA labels which enable the fire department easy identification of the products health, flammability, and reactivity.  By following these rules and regulation we are involved in an extensive training program for our employees. This facility  has an ongoing safety training program for their personnel. This program involves all the regulated training programs plus any on the job situations that our employees might encounter."
    }
  ]
}