{
  "FacilityID": 9974,
  "FacilityName": "John Morrell & Co.",
  "FacilityStr1": "1400 N Weber Ave",
  "FacilityStr2": null,
  "FacilityCity": "Sioux Falls",
  "FacilityState": "SD",
  "FacilityZipCode": "57103",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "46099",
  "LEPC": "Minnehaha County LEPC",
  "FacilityLatDecDegs": "43.563889",
  "FacilityLongDecDegs": "-96.718889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5213772,
  "ParentCompanyName": "Smithfield Foods Inc.",
  "Company2Name": null,
  "CompanyDUNS": 43205053,
  "Company2DUNS": 0,
  "OperatorName": "John Morrell & Co.",
  "OperatorStr1": "1400 N Weber Ave",
  "OperatorStr2": null,
  "OperatorCity": "Sioux Falls",
  "OperatorStateFIPS": "SD",
  "OperatorZipCode": "57103",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Crim",
  "RMPTitle": "VP, General Manager",
  "FTE": 3000,
  "OtherEPAFacilityID": "57117JHNMR1400N",
  "EPAFacilityID": "100000004336",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "28.0201-01",
  "SafetyInspectionDate": "1994-05-06 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-04-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-04-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-04-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-04-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0.5e",
  "FRS_Lat": 43.565,
  "FRS_Long": -96.72,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 12438,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 9974,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 12730,
          "ProcessID": 12438,
          "NAICSCode": "31161",
          "_desc": {
            "NAICS_CODE": "31161",
            "NAICS_DESCRIPTION": "Animal Slaughtering and Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 14163,
          "ProcessID": 12438,
          "ChemicalID": 56,
          "Quantity": 300000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 514163,
          "ProcessID": 12438,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 12439,
      "AltID": "WWTP Chlorination System",
      "FacilityID": 9974,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 12731,
          "ProcessID": 12439,
          "NAICSCode": "31161",
          "_desc": {
            "NAICS_CODE": "31161",
            "NAICS_DESCRIPTION": "Animal Slaughtering and Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 14164,
          "ProcessID": 12439,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 514164,
          "ProcessID": 12439,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 12440,
      "AltID": "WWTP Biogas System",
      "FacilityID": 9974,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 12732,
          "ProcessID": 12440,
          "NAICSCode": "31161",
          "_desc": {
            "NAICS_CODE": "31161",
            "NAICS_DESCRIPTION": "Animal Slaughtering and Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 14165,
          "ProcessID": 12440,
          "ChemicalID": 93,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 93,
            "ChemicalName": "Methane",
            "CASNumber": "74-82-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 514165,
          "ProcessID": 12440,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9974,
      "SummaryText": "\nThis submittal informs all interested parties that John Morrell & Company is participating in the OSHA Process Safety Management (PSM) program defined in 29 CFR 1910.119, and the EPA Risk Management Program (RMP) defined in 40 CFR Part 68.  These programs provide for the implementation of detailed prevention and response procedures when storing and handling hazardous chemicals.  The program objectives are to ensure worker and public safety as well as environmental protection. \n\nOur Accidental Release Prevention and Emergency Response Policies\n\nIt is the policy of John Morrell & Co. to conduct all of its operations in a manner, which is consistent with protecting human health and the environment.  It is our policy to comply with all laws and regulations applicable to our operations including, but not limited to all permitting, recordkeeping, and reporting requirements.  It is our policy that employees and contractors are properly trained and that they have access to information.  It is our policy to audit compliance with applicable laws and regulations and to promptly remedy any noncompliance.  All managers' performance evaluations and compensation decisions take into consideration compliance with these policies.\n\nBecause there is absolutely no envisioned gain worth injury or loss of life, John Morrell & Co. is committed to safety.  This commitment is demonstrated through our monthly safety training sessions conducted for all employees.  In addition, employees working directly with applicable hazardous chemicals receive annual 8-hour hazardous materials refresher training.  Maintenance personnel receive mechanical training and must pass written competency examinations prior to advancement in the department.  Wastewater treatment operators must pass state competency examinations prior to advancement in the department.   \n\nEach year, John Morrell & Co. reviews and/or updates their written release prevention and emergency response plan for the facility.  Each year, the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9974,
      "SummaryText": " company reports the location and quantity of hazardous chemicals stored at their facility to the local fire department, the local emergency planning committee and the state emergency planning committee.  Each year, the company reports the amount of hazardous chemicals used and/or released to the environment to state and/or federal regulatory agencies. \n\nOur Facility and Regulated Substances Handled\n\nJohn Morrell & Co. is a pork processing (meatpacking) plant located in Sioux Falls, South Dakota.  The facility employs about 3,000 people to kill and process about 16,000 pigs per day.  The facility cuts and packages fresh pork as well as manufactures sausage, bologna, bacon, ham and other processed meats.  The facility utilizes various conveyor systems and state-of-the-art processing, cooking and packaging equipment.  Various sanitation chemicals are stored and used for cleaning the facility in strict accordance with USDA food safety regulations.\n\nThe facility has a total of three regulated substances under the PSM and RMP programs.  They are ammonia, chlorine and methane.\n\nAnhydrous ammonia is used as a refrigerant throughout the processing plant to maintain desired meat temperatures in coolers, freezers and working areas.  This type of ammonia is also used as a crop nutrient and is commonly sprayed on fields by farmers.  Expelling heat caused from altering the ammonia between a liquid and a gas state creates refrigeration in the facility.  The refrigeration system consists of a series of compressors, condensers, evaporators, vessels, piping and valves.  Over 300,000 pounds of ammonia is in the refrigeration system throughout the plant.\n\nThe facility also has it's own wastewater treatment plant.  The wastewater facility utilizes screens to recover course material, dissolved air flotation tanks to recover grease, anaerobic lagoons and aeration basins to biologically degrade the sewage, clarifier tanks to settle out suspended solids, and gravity filters to further clar"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9974,
      "SummaryText": "ify the water.  Chlorine is then added to disinfect the water followed by the addition of sulfur dioxide to remove any residual chlorine prior to discharging the treated water to the Big Sioux River in accordance with a permit.\n\nThe facility receives compressed liquid chlorine in 1-ton (2,000 lb) cylinders.  Like anhydrous ammonia, chlorine quickly turns to a gas under atmospheric conditions.  The facility does not store more than a total of 8,000 pounds of chlorine at any given time. \n\nThe anaerobic lagoons are covered with flexible liners to prevent odors and to recover methane gas generated by the decomposing sewage.  Energy is recovered from this biogas by using it to fuel a boiler to make steam for the facility.  Although up to 20,000 pounds of methane could accumulate under the lagoon covers, less than 10,000 pounds of methane are maintained at any given time.\n\nOur Worst-Case and Alternate Release Scenarios\n\nThe distance to the toxic endpoint (0.0087 mg/L) of the worst-case release of chlorine extends 3.3 miles offsite.  This scenario assumes that the largest vessel of 2,000 pounds of chlorine is released over 10 minutes.  The EPA Off-site Consequence Analysis Guidance, 5/96, was followed and a 0.5 mitigation factor was assumed because the vessels are stored indoors.\n\nThe distance to the toxic endpoint (0.0087 mg/L) of the alternate-case release of chlorine extends 0.4 miles offsite.  This scenario assumes a =\" pipe is sheared releasing 18 pounds per minute of chlorine for 60 minutes.  The EPA Off-site Consequence Analysis Guidance, 5/96, was followed and a 0.5 mitigation factor was assumed because the piping is located indoors.\n\nThe distance to the toxic endpoint (0.14 mg/L) of the worst-case release of ammonia extends 2.7 miles offsite.  This scenario assumes that the largest vessel of 55,000 pounds of ammonia is released over 10 minutes.  The EPA Model RMP for Ammonia Refrigeration Guidance, 6/98, was followed and no administrative or passive mitigation fac"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9974,
      "SummaryText": "tors were assumed. \n\nThe distance to the toxic endpoint (0.14 mg/L) of the alternate-case release of ammonia extends 0.27 miles offsite.  This scenario assumes a 1\" diameter hole in a 100 psi vessel releasing 1,200 pounds of ammonia per minute for 10 minutes.  The EPA Model RMP for Ammonia Refrigeration Guidance, 6/98, was followed and no administrative or passive mitigation factors were assumed.\n\nThe distance to a 1 psi overpressure of the worst-case explosion of methane extends 0.23 miles offsite.  Although the facility stores less than 10,000 pounds of methane, this scenario assumes that the largest potential lagoon cover height is inadvertently reached, and 20,000 pounds of biogas (75% methane) is ignited.  The EPA Off-site Consequence Analysis Guidance, 5/96, was followed and no administrative or passive mitigation factors were assumed.\n\nThe distance to the lower flammability limit of the alternate-case flash fire of methane extends 0.06 miles offsite.  This scenario assumes that 20,000 pounds of bigas (75% methane) is flashed.  The EPA Off-site Consequence Analysis Guidance, 5/96, was followed and no administrative or passive mitigation factors were assumed. \n\nOur General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe following lists rules, regulations and standards that the company complies with and believes are important to their prevention program:\n\n7 OSHA Process Safety Management Program 29CFR 1910.119\n7 EPA Risk Management Program 40 CFR 68\n7 EPA Oil Pollution Prevention Program 40 CFR 112\n7 EPA Storm Water Pollution Prevention Program 40 CFR 122.26 \n7 EPA Hazardous Waste Contingency Planning 40 CFR 265.52\n7 OSHA Hazardous Waste Operator Program 29 CFR 1910.120\n7 OSHA Emergency Action Plan Program 29 CFR 1910.38\n7 ANSI/IIAR2 standards for equipment design, installation and operation\n7 NFPA 820 standards for fire protection in wastewater treatment and collection facilities\n\nThe company also implements a Computer Maintena"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 9974,
      "SummaryText": "nce Management System (CMMS).  This computer system is used to track and schedule work orders for preventive, predictive and corrective maintenance as well as track parts inventory.  This system helps provide quality control in making sure the right parts and materials are ordered and that the equipment is serviced in a timely manner.\n\nOur Five Year Accident History\n\nJohn Morrell & Co. has had no accidental releases or near misses of a catastrophic nature over the past five years that involved injury to their employees or surrounding residents.  There have been no accidental releases involving off-site evacuation, significant property damage or environmental impairment.  \n\nOur Emergency Response Program\n\nThe facility implements an integrated contingency plan to address all emergency response scenarios.  These scenarios include response procedures for various types of chemical releases, fires, floods and other system failures and natural disasters.  This plan is reviewed annually and made available to the local fire department and the local emergency planning committee.  Each year, the local fire department visits the facility for refresher orientation and emergency preparedness.\n\nOur Planned Changes to Improve Safety\n\nNo substantial projects are currently planned, however, improvements are continually being identified through inspection, training, auditing and incident investigation.  Our procedures are established to promote continuous improvement in our operations.   In addition, the company utilizes an employee suggestion system that pays significant awards for suggestions that promote safety and minimize waste."
    }
  ]
}